{"id":10072,"name":"KilbShopwareProductDesigner","code":"Kilb647502658205","lastChange":{"date":"2023-07-25 08:07:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpntBI9l","examplePageUrl":"","moduleKey":"KilbShopwareProductDesigner","creationDate":{"date":"2019-10-11 09:33:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-11-06 12:09:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-01-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-11-09 04:41:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":834,"prefix":"Kilb","name":"KILB Software Development","website":"//www.cilb.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod834_kilb_icon_shopware.png"},"infos":[{"id":15641,"name":"KILB Product Designer - Artikeldesigner & Produktkonfigurator für T-Shirts, Tassen, Poster, Karten, Banner [Plugin Version]","description":"<h2><i>Der Nummer 1 Product Designer im Shopware Store</i></h2><p><br></p><p>Der <i>KILB Product Designer </i>ermöglicht es Deinen Kunden, Produkte (T-Shirts, Poster, Banner, Tassen, Kronkorken usw.) vor dem Kauf mit einem eigenen Design zu versehen. Es ist egal, welches Produkt Du verkaufen möchtest - der Product Designer lässt sich mit Sicherheit passend konfigurieren.<br><br></p><p>Bevor das gewünschte Produkt in den Warenkorb gelegt wird, kann der Kunde das Design völlig frei bestimmen. Hierfür hat er die Möglichkeit, <b>eigene Bilder hochzuladen</b>, &nbsp;<b>Texte in diversen Schriftarten </b>hinzuzufügen, <b>QR-Codes&nbsp;zu generieren</b> oder zwischen beliebig vielen <b>vorausgewählten&nbsp;Motiven</b>&nbsp;auszuwählen.</p><p>Das fertige Design wird darauf als <b>Vorschaubild im Warenkorb</b> angezeigt und nach Abschluss der Bestellung im Shopware Backend gespeichert.</p><p><br></p><h2><b>Responsive, durchdachtes Layout</b></h2><p>Bei der Entwicklung des Designers wurde viel Wert darauf gelegt, dass er sich leicht bedienen lässt.</p><p>Sowohl auf dem <b>Notebook</b>, <b>Tablet</b> als auch dem <b>Smartphone</b>.</p><p>Viele Entscheidungen bezüglich des Layouts wurden durch Feedback unserer Test-Personen, die <b>unterschiedliches Alter und Technikversiertheit</b> aufweisen, entschieden.</p><p>So haben wir zum Beispiel herausgefunden, dass zur Bedienung notwendiges Scrollen zu einer hohen Abbruchrate führt. Denn Scrolling verträgt sich oft nicht gut mit der <b>Drag &amp; Drop-Funktion</b> des Designers. Aus diesem Grund wurde der Designer so gestaltet, dass <b>kein Scrolling notwendig</b> ist. Alle Funktionen sind sofort sichtbar und intuitiv sichtbar.</p><p>Zur besseren Bedienbarkeit kann der Kunde zudem das Design <b>zoomen</b> oder Bedienelemente ausblenden.<br></p><p><br></p><h2><b>Unzählige Funktionen</b></h2><p>Der Designer bietet eine sehr große Funktionsvielfalt. Ein Auszug:</p><p>» Die Konfiguration des Designers funktioniert so generisch, dass er für alle Produkte funktioniert. Egal, ob Du T-Shirts, Hoodies, Uhren, Schuhe, Poster, etc. verkaufst.<br></p><p>» Designs können <b>variantenspezifisch</b> festgelegt werden.</p><p>» Für einen einzelnen Artikel/Variante können mehrere Designs festgelegt werden (z.B. bei einem T-Shirt für <b>Vorderseite, Rückseite, linker/rechter Ärmel</b>).</p><p>» Mit Hilfe eines frei konfigurierbaren Vordergrundbilds, welches sich über das Kundendesign legt, kannst Du <b>beliebige (auch runde) Formen</b> realisieren.<br></p><p>» Es kann optional ein <b>Gitter zur vereinfachten Positionierung von Elementen</b> konfiguriert werden, sowohl in Farbe als auch Größe.</p><p>» Neben der vordefinierten Liste an <b>auswählbaren Schriftarten</b> können beliebige weitere TTF-Schriftarten konfiguriert werden.</p><p>» Zur Auswahl der <b>Textfarbe kann zwischen mehreren intuitiven Farbauswahlelemente</b>n gewählt werden.</p><p>» Wenn gewünscht, kann der Kunde zwischen einer <b>Vorauswahl an Motiven</b> wählen.</p><p>» Es kann ein API-Key von <b>Pixabay</b> hinterlegt werden. Dadurch stehen dem Kunden völlig automatisch <b>tausende Motive</b> zur Einbindung in das Design zur Verfügung.</p><p>» Wenn gewünscht, kann der Kunde zwischen verschiedenen <b>Hintergrundmotiven</b> wählen.</p><p>» Wenn gewünscht, kann der Kunde zwischen verschiedenen <b>Hintergrundfarben</b> wählen. Die Auswahl an wählbaren Farben kann optional eingeschränkt werden.</p><p>» Du kannst die <b>Qualitätsstufe der Druckdatei</b>&nbsp; frei wählen. <br></p><p>» Du kannst die Druckdateien in <b>SVG</b>, <b>PNG</b>, <b>JPG</b>, <b>WebP</b> und Vektor-<b>PDF</b> generieren lassen. <br></p><p>» und, und, und...</p><p><br></p><p></p><h2></h2><h2><b>Grenzenlose Erweiterbarkeit</b></h2><p>Dir reicht nicht, was der Product Designer von Haus aus mit sich bringt? Bist Du oder Dein Team fit in JavaScript und CSS? Der Product Designer kann problemlos erweitert werden:<br><br></p><p>- Wenn Du nur begrenzte Ressourcen für die Entwicklung hast, kannst Du schnell und einfach <b>Monkey Patching</b> anwenden.&nbsp;<br><br>- Hast Du ausreichend Ressourcen verfügbar, kannst Du den Product Designer mit eigenen <b>Plugins</b> erweitern. Durch die saubere Code-Architektur des Designers macht die Entwicklung Spaß und ein Einsatz selbst im <b>Enterprise</b>-Umfeld steht nichts im Wege.<br><br>Der Product Designer sowie dessen Erweiterungsmöglichkeiten sind ausführlich dokumentiert:<br><a href=\"https://docs.product-designer.io/customizations/\" target=\"_blank\" rel=\"noreferrer\">https://docs.product-designer.io/customizations/</a><br></p><br><h2>In unserem Schritt-für-Schritt-Tutorial erfährst Du innerhalb von wenigen Minuten, wie Du den Product Designer&nbsp; konfigurierst:</h2><a target=\"_blank\" href=\"https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA\" rel=\"noopener nofollow\">https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA</a><p></p><p><br></p><h2>❓Für weiterführende Informationen, schaue gerne in die Dokumentation des Plugins:<br><a href=\"https://docs.product-designer.io\" target=\"_blank\" rel=\"noreferrer\">https://docs.product-designer.io</a><br></h2>","installationManual":"<h2>⏯ In unserem Schritt-für-Schritt-Tutorial erfährst Du innerhalb von wenigen Minuten, wie Du den Product Designer&nbsp; konfigurierst:</h2><a href=\"https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA\" target=\"_blank\" rel=\"noreferrer\">https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA</a><br><p><br></p><h2>Schritt 1: Plugin installieren</h2><p><br></p><p>Sobald Du das Plugin über den Shopware Store erworben hast, kannst Du es im Administrationsbereich unter <i>Einstellungen</i> &gt; <i>System</i> &gt; <i>Plugins</i> installieren.&nbsp; Bitte stelle sicher, dass das Plugin sowohl <i><b>installiert</b></i> als auch <i><b>aktiviert</b></i> ist.</p><p><br></p><h2>Schritt 2: Konfiguration zuweisen</h2><p><br></p><p>Nach Installation und Aktivierung des Plugins findest Du in Deinem Shopware Backend im Menü einen neuen Navigationseintrag \"Product Designer\" als Unterpunkt in \"Katalog\".</p><p>Wenn Du darauf klickst, wird der Administrationsbereich des Designers geladen. Da bisher noch keine Bestellung mit einem Product Design durchgeführt wurde, ist die Tabelle leer.</p><p><br></p><p>Klicke nun im oberen Menü auf den Tab \"Konfigurationen\". Um Dir den Einstieg in das Plugin zu erleichtern, legt die Installation des Product Designers automatisch initial eine Beispiel-Konfiguration an. Öffne die Einstellungen dieser Konfiguration, indem Du auf das Icon mit den drei Punkten klickst.&nbsp;</p><p>Wähle nun einen beliebigen Artikel in Deinem Online-Shop, den Du in Zukunft von Deinen Kunden designen lassen möchtest. Kopiere dessen Artikelnummer (nicht die Produkt-ID!) und füge sie der Konfiguration hinzu. Klicke darauf auf \"Konfiguration speichern\".</p><p><br></p><p>Durch die Zuweisung der Konfiguration zu dem Artikel wird auf der Produktdetailseite des Artikels der Button \"In den Warenkorb\" nun automatisch deaktiviert und ein neuer Button \"Design gestalten\" erscheint. Der Kunde muss damit zuerst ein Design gestalten, wodurch der Button zum Hinzufügen des Warenkorbs erst aktiviert wird.</p><p><br></p><p>Du solltest nun eine erste Test-Bestellung mit diesem Artikel und einem beliebigen Design durchführen. Sobald die Bestellung abgeschlossen ist, kannst Du in den nächsten Schritt übergehen.</p><p><br></p><h2>Schritt 3: Druckbild generieren</h2><p>Während des Bestellprozesses werden lediglich Metadaten zum konfigurierten Design gespeichert. Zudem wird ein kleines Vorschaubild für den Warenkob generiert. Das eigentliche, hochauflösende Bild, was Du für den Druck auf den Artikel verwenden kannst, muss allerdings erst noch generiert werden. Da die Generierung der Grafik je nach Auflösung und Größe resourcenaufwändig sein kann, erfolgt weder im Browser des Kunden, noch auf Deinem Server. Stattdessen findet Sie in Deinem Browser statt.</p><p><br></p><p>Logge Dich zunächst wieder im Shopware Administrationsbereich auf und öffne die Seite des Product Designers. Du findest Du nun unter \"Bestellte Designs\" einen ersten Eintrag. Mit Klick auf das Icon mit den drei Punkten erhältst Du weitere Informationen zu dem Design. Du hast zudem die Möglichkeit, direkt ein vektorbasiertes SVG des Designs sowie ein serialisiertes JSON-Objekt herunterzuladen. Um eine hochauflösende WebP-Grafik zu generieren, klicke auf \"Generieren\". Das Generieren kann einige Sekunden dauern. Du kannst nach Abschluss eine Vorschau des Bildes sehen. Klickst Du auf diese Vorschau, wird das Bild heruntergeladen.</p><p><br></p><p>⚠️ Solltest Du&nbsp; Probleme beim Generieren der Grafik haben, nutze bitte <i>Google Chrome</i>.</p><p><br></p><h2>Schritt 4: Motive &amp; Hintergrundbilder hinzufügen</h2><p><br></p><p>Der Kunde hat im Product Designer die Möglichkeit, eigene Bilder hochzuladen. Zusätzlich kannst Du ihm die Option anbieten, aus einem vordefinierten Set zwischen verschiedenen Motivenund Hintergrundbildern zu wählen.&nbsp;</p><p>Logge Dich hierfür in das Shopware Backend ein und klicke im Menü auf <i>Inhalte</i> &gt; <i>Medien</i>.</p><p>Der Product Designer hat hier automatisch vier Verzeichnisse angelegt:</p><p>- <i>Product Designer - Uploads</i>: Hier landen Grafiken, die Benutzer des Product Designers hochgeladen haben. Die Grafiken werden erneut benötigt, wenn ein Benutzer im Nachhinein sein Design abändern möchte oder du die Rendering Applikation ausführst. Lösche deshalb keine Grafiken von Hand in diesem Verzeichnis.</p><p>-&nbsp;<i>Product Designer - Basket Images: </i>Hier werden die Vorschaugrafiken für den Warenkorb gespeichert. Auch hier solltest Du von Hand keine Grafiken entfernen.</p><p>- <i>Product Designer - Images</i>: Lade in dieses Verzeichnis die gewünschten Motive, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Motive in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Motiv einen <i>Titel</i>&nbsp; festlegen, der im Frontend erscheinen wird.<br>- <i>Product Designer</i> - <i>Background Images:</i><i>&nbsp;</i>Lade in dieses Verzeichnis die gewünschten Hintergrundbilder, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Hintergrundbilder in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Hintergrundbild einen&nbsp;<i style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Titel</i>&nbsp;festlegen, der im Frontend erscheinen wird.</p><p><br></p><p><br></p><h2>Schritt 5: Dokumentation lesen</h2><p><br>Nimm Dir ausreichend Zeit, um die einzelnen Konfigurationsoptionen im Designer-Backend durchzugehen. Jedes Eingabefeld besitzt eine ausführliche Beschreibung, die dessen Funktion erklärt.<br><br></p><p>Für weiterführende Informationen und häufig gestellte Fragen kannst Du einen Blick in unsere Dokumentation werfen:&nbsp;<br><a href=\"http://docs.product-designer.io\" target=\"_blank\" rel=\"noreferrer\">http://docs.product-designer.io</a><br></p>https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaAhttps://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA","shortDescription":"Der KILB Product Designer erlaubt es Kunden, Produkte beliebiger Art (Poster, CD, T-Shirts, Flyer etc.) vor dem Kauf mit einem eigenem Design zu versehen.","highlights":"Umfangreiche Konfigurierbarkeit ||| Nahezu alles (Auflösung, Bildgröße, Druckgröße, Schriftgröße usw. usf.) lässt sich konfigurieren. Es lassen sich beliebig viele Konfigurationen für beliebig viele Artikel festlegen. Sogar ein einzelner Artikel kann mehrere Konfigurationen aufweisen, die sich beliebig unterscheiden können. Der bedruckbare Artikel hat eine Vorder- und Rückseite - die Rückseite hat aber eine kleinere Fläche - kein Problem!\nHohe Performance ||| Der Product Designer basiert auf dem performanten JavaScript-Framework Vue.JS in Verbindung mit dem bewährten Canvas-Framework fabric.JS. Das aufwändige Rendering, das heißt der Umwandlung des vom Kunden festgelegten Designs in eine Bildgrafik, findet im Browser des Shopbesitzers statt. Weder das Gerät des Kunden, noch der Shop-Server, werden hierfür beansprucht.\nResponsive Design ||| Egal, ob der Product Designer über das Smartphone, das Tablet oder den Desktop verwendet wird: Er funktioniert immer auf die gleiche Weise und passt sich der verfügbaren Größe automatisch an.\nDSGVO-konform ||| Der KILB Product Designer keine externen Ressourcen bzw. Tracking Scripts, sodass die Privatsphäre Deiner Shopkunden nicht beeinträchtigt wird. Wenn Du Schriftarten aus anderen Quellen - zum Beispiel Google Fonts - installieren möchtest, so kopierst Du diese einfach in das entsprechende Verzeichnis auf Deinem Server.\nResponsive Design ||| Egal, ob der Product Designer über das Smartphone, das Tablet oder den Desktop verwendet wird: Er funktioniert immer auf die gleiche Weise und passt sich der verfügbaren Größe automatisch an.","features":"Alle Konfigurationsoptionen sind direkt im Designer ausführlich dokumentiert\nAusführliche Dokumentation inkl. FAQ für Shopbetreiber & Developer\nGrenzenlose Erweiterbarkeit dank moderner Architektur und hoher Code-Qualität\nAusgezeichneter, lösungsorientierter Support"},{"id":15848,"name":"KILB Product Designer - Article designer & product configurator for shirts, cups, posters, cards... [Plugin Version]","description":"<p>The KILB Product Designer gives your customers the opportunity, to create their own design for prodcuts like shirts, posters, banners, cups etc.</p><p><br /></p><p>Before the product is added to cart, the customer can create a unique design. He is able to upload own images, create texts with several fonts, add QR codes or choose between a set of images you have predefined.</p><p><br /></p><p>After the customer has added the product into the cart he already can see a preview image of the final product. </p><p><br /></p><p>When we developed this plugin we had focus on:</p><p><br /></p><p><b>Customizability</b>: Nearly everything (image solution, image size, print size, font size and much much more) can be configured by you. You can create as much configurations as you like - even  a single article can have several configurations if you like. Your product has a front and back side - but the back side has a smaller area and the maximum font size should not exceed 30? No problem! If you are able to code, this plugin can be the perfect fundament for your own, unique product designer. You can manipulate nearly everything via CSS, JS and PHP!</p><p><br /></p><p><b>Performance</b>: The Product Designer is based on a very fast JavaScript Framework \"Vue.JS\". Expensive algorithms like image generation or manipulation will only be done on the server side. So your customer's browser - even if he uses an old Android phone - will be fast and responsive.</p><p><br /></p><p><b>Compatibility</b>: The plugin is integrated into Shopware as much as needed. But it touches not a single line more of Shopware code than necessary. This will dramatically decrease conflicts with other plugins. </p><p><br /></p><p><b>Responsiveness</b>: No matter if you use the plugin on your phone, tablet or desktop. It will work always the same way. It's completely responsive.</p><p><b><br /></b></p><p><b>GDPR compliant: </b>The designer doesn't embed external resourced like Google Fonts nor any tracking scripts. You customer's privacy will be kept.</p><p><br /></p><p><b>Extendable via JavaScript &amp; CSS: </b>You can extend &amp; modify the functionality of the product designer if you know how to use CSS and JavaScript. See fabricJS documentation here: http://fabricjs.com/docs/</p><p><br /></p><p><b>More features</b>:</p><p>- Product designs for each article and variant possible</p><p>- SVG support for image uploads and design exports</p><p>- Predefined product designs possible</p><p>- Super high performance, super low file size of CSS and JavaScript files</p><p>- Simple and clear backend part</p><p><br /></p><h2><br />❓For further information please have a look into the documentation:</h2><h2><a href=\"https://github.com/ckdot/kilb-product-designer-doc/blob/master/documentation.md\" target=\"_blank\" rel=\"noreferrer noopener\">https://github.com/ckdot/kilb-product-designer-doc/blob/master/documentation.md</a>.</h2>","installationManual":"<h2>Step 1 - Install plugin</h2><p>Install the plugin:&nbsp;<a href=\"https://scribehow.com/shared/Install_Product_Designer_or_Shopware_6__Eeh0Hm8KQ_6fKNhI085VuQ\" target=\"_blank\" rel=\"noreferrer\">https://scribehow.com/shared/Install_Product_Designer_or_Shopware_6__Eeh0Hm8KQ_6fKNhI085VuQ</a><br>Configurate a product:&nbsp;<a href=\"https://scribehow.com/shared/Set_up_a_new_product_in_the_Product_Designer__mVik9fwSTIuM38-wP33_iA\" target=\"_blank\" rel=\"noreferrer\">https://scribehow.com/shared/Set_up_a_new_product_in_the_Product_Designer__mVik9fwSTIuM38-wP33_iA</a><br></p><p><br></p><h2>Step 2 - Generate image</h2><p><br></p><p>During the order process the product designer plugin will only store meta information for the customized designs. Also some small preview image for the basket will be generated. As the rendering of the high resolution graphic can be slow and expensive it will not be done in the browser of your customers nor your shop server. Instead you will need to do that on your locale machine, in your browser.</p><p><br></p><p>Log in to the product designer backend again. Under \"Ordered Designs\" you will now find a new entry. Click the icon with the three dots to get more information about the design. You will be able to download an SVG or a serialized JSON export here. To generate a high resolution WebP you need to click the \"Generate\" button.</p><p><br></p><p>The rendering duration will take some seconds. After it has been finished you will see a small preview image. If you click it, it will automatically be downloaded.</p><p>If you have issues generating the image please use <i>Google Chrome </i>browser.</p><p><br></p><h2>Step 3 - Add clip arts</h2><p><br></p><p>Your customers will be able to upload their own graphics to add them into their product design. Also you can provide them a set of predefined clip arts to choose from. For this please log in into the Shopware backend and go to <i>Content</i> &gt; <i>Media</i>.</p><p><br></p><p>You will find three directories added by the product designer plugin here:</p><p>- <i>Product Designer - Uploads</i>: These are images your customers uploaded from their local machine. The images are stored here so users will be able to change their created designs later on. Also they are needed to execute the rendering process. Don't delete or touch the files in here.</p><p>- <i>Product Designer - Basket Images</i>: This folder will contain the thumbnail images customers can see in their basket after they have added an article with a product design. You should not touch nor deleted files in here, too.</p><p>- <i>Product Designer - Clip Arts</i>: You can upload into this folder the clip arts you like your customers to choose from. If you like to group multiple clip arts into several categories you can create sub directories here. For each clip art you can define a <i>title</i> that will be presented near the image in the frontend.</p><p><br></p><h2>Step 4 - Read documentation</h2><p><br></p><p>For further help please have a look into the documentation:</p><p><a href=\"https://github.com/ckdot/kilb-product-designer-doc/blob/master/documentation.md\" target=\"_blank\" rel=\"noreferrer noopener\">https://github.com/ckdot/kilb-product-designer-doc/blob/master/documentation.md</a></p>","shortDescription":"Our plugin KILB product designer enables your customers to create personal, unique designs for the products you sell, e.g. posters, flyers, T-Shirts, CDs.","highlights":"","features":""}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157699,"bookingKey":"Kilb647502658205","bookingText":"KILB Product Designer - Product designer for shirts, cups, posters, cards...","price":499,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":157698,"bookingKey":"Kilb647502658205_M","bookingText":"KILB Product Designer - Product designer for shirts, cups, posters, cards...","price":39.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php59JT0K","preview":true,"priority":0,"id":36683},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6jYCVW","preview":false,"priority":1,"id":65732},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKjM78s","preview":false,"priority":1,"id":65733},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOH4fDR","preview":false,"priority":0,"id":36771},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwMIazI","preview":false,"priority":0,"id":108672},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJw1Po4","preview":false,"priority":0,"id":112926},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprdcGQB","preview":false,"priority":0,"id":112927},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAa0bEM","preview":false,"priority":0,"id":112928},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSYwpeM","preview":false,"priority":0,"id":112929},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpt8oQLD","preview":false,"priority":0,"id":112930},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvtXyKJ","preview":false,"priority":0,"id":112931}],"comments":[{"authorName":"Daniel Hendrich","text":"Wir sind sehr zufrieden!\nSehr freundlicher und schneller Support!","headline":"Großartiges Tool","creationDate":{"date":"2023-06-02 15:58:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Henning","text":"","headline":"Super Tool - top Kundenservice","creationDate":{"date":"2023-04-17 14:08:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Heiko Schmalfuß","text":"Funktioniert alles Super und der Support und die Reaktionsgeschwindigkeit ist absolut super. DANKE","headline":"Produktdesigner","creationDate":{"date":"2022-11-30 09:55:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sebastian Sticklun","text":"Ich habe lange nach einer App gesucht mit der man Produkte durch den Kunde individuell gestallten lassen kann. Alle anderen Apps waren nicht meine Lösung.\nEntweder waren diese zu aufgebauscht und nicht anpassbar oder bieteten zu wenige features.\nDiese App bringt jetzt schon alles was für eine schöne und schnelle Gestaltung der Produkte notwendig ist, ich hoffe es wird weiter fleißig updates geben.\nMan braucht allerdings ein bis zwei Stunden um zu verstehen wie die App funktioniert.\nDanke für die Tolle Arbeit!","headline":"TOP Erweiterung absolut zu Empfehlen","creationDate":{"date":"2021-05-21 13:35:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"KILB Product Designer - Artikeldesigner & Produktkonfigurator für T-Shirts, Tassen, Poster, Karten, Banner [Plugin Version]","description":"<h2><i>Der Nummer 1 Product Designer im Shopware Store</i></h2><p><br /></p><p>Der <i>KILB Product Designer </i>ermöglicht es Deinen Kunden, Produkte (T-Shirts, Poster, Banner, Tassen, Kronkorken usw.) vor dem Kauf mit einem eigenen Design zu versehen. Es ist egal, welches Produkt Du verkaufen möchtest - der Product Designer lässt sich mit Sicherheit passend konfigurieren.<br /><br /></p><p>Bevor das gewünschte Produkt in den Warenkorb gelegt wird, kann der Kunde das Design völlig frei bestimmen. Hierfür hat er die Möglichkeit, <b>eigene Bilder hochzuladen</b>,  <b>Texte in diversen Schriftarten </b>hinzuzufügen, <b>QR-Codes zu generieren</b> oder zwischen beliebig vielen <b>vorausgewählten Motiven</b> auszuwählen.</p><p>Das fertige Design wird darauf als <b>Vorschaubild im Warenkorb</b> angezeigt und nach Abschluss der Bestellung im Shopware Backend gespeichert.</p><p><br /></p><h2><b>Responsive, durchdachtes Layout</b></h2><p>Bei der Entwicklung des Designers wurde viel Wert darauf gelegt, dass er sich leicht bedienen lässt.</p><p>Sowohl auf dem <b>Notebook</b>, <b>Tablet</b> als auch dem <b>Smartphone</b>.</p><p>Viele Entscheidungen bezüglich des Layouts wurden durch Feedback unserer Test-Personen, die <b>unterschiedliches Alter und Technikversiertheit</b> aufweisen, entschieden.</p><p>So haben wir zum Beispiel herausgefunden, dass zur Bedienung notwendiges Scrollen zu einer hohen Abbruchrate führt. Denn Scrolling verträgt sich oft nicht gut mit der <b>Drag &amp; Drop-Funktion</b> des Designers. Aus diesem Grund wurde der Designer so gestaltet, dass <b>kein Scrolling notwendig</b> ist. Alle Funktionen sind sofort sichtbar und intuitiv sichtbar.</p><p>Zur besseren Bedienbarkeit kann der Kunde zudem das Design <b>zoomen</b> oder Bedienelemente ausblenden.<br /></p><p><br /></p><h2><b>Unzählige Funktionen</b></h2><p>Der Designer bietet eine sehr große Funktionsvielfalt. Ein Auszug:</p><p>» Die Konfiguration des Designers funktioniert so generisch, dass er für alle Produkte funktioniert. Egal, ob Du T-Shirts, Hoodies, Uhren, Schuhe, Poster, etc. verkaufst.<br /></p><p>» Designs können <b>variantenspezifisch</b> festgelegt werden.</p><p>» Für einen einzelnen Artikel/Variante können mehrere Designs festgelegt werden (z.B. bei einem T-Shirt für <b>Vorderseite, Rückseite, linker/rechter Ärmel</b>).</p><p>» Mit Hilfe eines frei konfigurierbaren Vordergrundbilds, welches sich über das Kundendesign legt, kannst Du <b>beliebige (auch runde) Formen</b> realisieren.<br /></p><p>» Es kann optional ein <b>Gitter zur vereinfachten Positionierung von Elementen</b> konfiguriert werden, sowohl in Farbe als auch Größe.</p><p>» Neben der vordefinierten Liste an <b>auswählbaren Schriftarten</b> können beliebige weitere TTF-Schriftarten konfiguriert werden.</p><p>» Zur Auswahl der <b>Textfarbe kann zwischen mehreren intuitiven Farbauswahlelemente</b>n gewählt werden.</p><p>» Wenn gewünscht, kann der Kunde zwischen einer <b>Vorauswahl an Motiven</b> wählen.</p><p>» Es kann ein API-Key von <b>Pixabay</b> hinterlegt werden. Dadurch stehen dem Kunden völlig automatisch <b>tausende Motive</b> zur Einbindung in das Design zur Verfügung.</p><p>» Wenn gewünscht, kann der Kunde zwischen verschiedenen <b>Hintergrundmotiven</b> wählen.</p><p>» Wenn gewünscht, kann der Kunde zwischen verschiedenen <b>Hintergrundfarben</b> wählen. Die Auswahl an wählbaren Farben kann optional eingeschränkt werden.</p><p>» Du kannst die <b>Qualitätsstufe der Druckdatei</b>  frei wählen. <br /></p><p>» Du kannst die Druckdateien in <b>SVG</b>, <b>PNG</b>, <b>JPG</b>, <b>WebP</b> und Vektor-<b>PDF</b> generieren lassen. <br /></p><p>» und, und, und...</p><p><br /></p><p></p><h2></h2><h2><b>Grenzenlose Erweiterbarkeit</b></h2><p>Dir reicht nicht, was der Product Designer von Haus aus mit sich bringt? Bist Du oder Dein Team fit in JavaScript und CSS? Der Product Designer kann problemlos erweitert werden:<br /><br /></p><p>- Wenn Du nur begrenzte Ressourcen für die Entwicklung hast, kannst Du schnell und einfach <b>Monkey Patching</b> anwenden. <br /><br />- Hast Du ausreichend Ressourcen verfügbar, kannst Du den Product Designer mit eigenen <b>Plugins</b> erweitern. Durch die saubere Code-Architektur des Designers macht die Entwicklung Spaß und ein Einsatz selbst im <b>Enterprise</b>-Umfeld steht nichts im Wege.<br /><br />Der Product Designer sowie dessen Erweiterungsmöglichkeiten sind ausführlich dokumentiert:<br /><a href=\"https://docs.product-designer.io/customizations/\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.product-designer.io/customizations/</a><br /></p><br /><h2>In unserem Schritt-für-Schritt-Tutorial erfährst Du innerhalb von wenigen Minuten, wie Du den Product Designer  konfigurierst:</h2><a target=\"_blank\" href=\"https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA\" rel=\"noreferrer noopener\">https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA</a><p></p><p><br /></p><h2>❓Für weiterführende Informationen, schaue gerne in die Dokumentation des Plugins:<br /><a href=\"https://docs.product-designer.io\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.product-designer.io</a><br /></h2>","installationManual":"<h2>⏯ In unserem Schritt-für-Schritt-Tutorial erfährst Du innerhalb von wenigen Minuten, wie Du den Product Designer  konfigurierst:</h2><a href=\"https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA\" target=\"_blank\" rel=\"noreferrer noopener\">https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA</a><br /><p><br /></p><h2>Schritt 1: Plugin installieren</h2><p><br /></p><p>Sobald Du das Plugin über den Shopware Store erworben hast, kannst Du es im Administrationsbereich unter <i>Einstellungen</i> &gt; <i>System</i> &gt; <i>Plugins</i> installieren.  Bitte stelle sicher, dass das Plugin sowohl <i><b>installiert</b></i> als auch <i><b>aktiviert</b></i> ist.</p><p><br /></p><h2>Schritt 2: Konfiguration zuweisen</h2><p><br /></p><p>Nach Installation und Aktivierung des Plugins findest Du in Deinem Shopware Backend im Menü einen neuen Navigationseintrag \"Product Designer\" als Unterpunkt in \"Katalog\".</p><p>Wenn Du darauf klickst, wird der Administrationsbereich des Designers geladen. Da bisher noch keine Bestellung mit einem Product Design durchgeführt wurde, ist die Tabelle leer.</p><p><br /></p><p>Klicke nun im oberen Menü auf den Tab \"Konfigurationen\". Um Dir den Einstieg in das Plugin zu erleichtern, legt die Installation des Product Designers automatisch initial eine Beispiel-Konfiguration an. Öffne die Einstellungen dieser Konfiguration, indem Du auf das Icon mit den drei Punkten klickst. </p><p>Wähle nun einen beliebigen Artikel in Deinem Online-Shop, den Du in Zukunft von Deinen Kunden designen lassen möchtest. Kopiere dessen Artikelnummer (nicht die Produkt-ID!) und füge sie der Konfiguration hinzu. Klicke darauf auf \"Konfiguration speichern\".</p><p><br /></p><p>Durch die Zuweisung der Konfiguration zu dem Artikel wird auf der Produktdetailseite des Artikels der Button \"In den Warenkorb\" nun automatisch deaktiviert und ein neuer Button \"Design gestalten\" erscheint. Der Kunde muss damit zuerst ein Design gestalten, wodurch der Button zum Hinzufügen des Warenkorbs erst aktiviert wird.</p><p><br /></p><p>Du solltest nun eine erste Test-Bestellung mit diesem Artikel und einem beliebigen Design durchführen. Sobald die Bestellung abgeschlossen ist, kannst Du in den nächsten Schritt übergehen.</p><p><br /></p><h2>Schritt 3: Druckbild generieren</h2><p>Während des Bestellprozesses werden lediglich Metadaten zum konfigurierten Design gespeichert. Zudem wird ein kleines Vorschaubild für den Warenkob generiert. Das eigentliche, hochauflösende Bild, was Du für den Druck auf den Artikel verwenden kannst, muss allerdings erst noch generiert werden. Da die Generierung der Grafik je nach Auflösung und Größe resourcenaufwändig sein kann, erfolgt weder im Browser des Kunden, noch auf Deinem Server. Stattdessen findet Sie in Deinem Browser statt.</p><p><br /></p><p>Logge Dich zunächst wieder im Shopware Administrationsbereich auf und öffne die Seite des Product Designers. Du findest Du nun unter \"Bestellte Designs\" einen ersten Eintrag. Mit Klick auf das Icon mit den drei Punkten erhältst Du weitere Informationen zu dem Design. Du hast zudem die Möglichkeit, direkt ein vektorbasiertes SVG des Designs sowie ein serialisiertes JSON-Objekt herunterzuladen. Um eine hochauflösende WebP-Grafik zu generieren, klicke auf \"Generieren\". Das Generieren kann einige Sekunden dauern. Du kannst nach Abschluss eine Vorschau des Bildes sehen. Klickst Du auf diese Vorschau, wird das Bild heruntergeladen.</p><p><br /></p><p>⚠️ Solltest Du  Probleme beim Generieren der Grafik haben, nutze bitte <i>Google Chrome</i>.</p><p><br /></p><h2>Schritt 4: Motive &amp; Hintergrundbilder hinzufügen</h2><p><br /></p><p>Der Kunde hat im Product Designer die Möglichkeit, eigene Bilder hochzuladen. Zusätzlich kannst Du ihm die Option anbieten, aus einem vordefinierten Set zwischen verschiedenen Motivenund Hintergrundbildern zu wählen. </p><p>Logge Dich hierfür in das Shopware Backend ein und klicke im Menü auf <i>Inhalte</i> &gt; <i>Medien</i>.</p><p>Der Product Designer hat hier automatisch vier Verzeichnisse angelegt:</p><p>- <i>Product Designer - Uploads</i>: Hier landen Grafiken, die Benutzer des Product Designers hochgeladen haben. Die Grafiken werden erneut benötigt, wenn ein Benutzer im Nachhinein sein Design abändern möchte oder du die Rendering Applikation ausführst. Lösche deshalb keine Grafiken von Hand in diesem Verzeichnis.</p><p>- <i>Product Designer - Basket Images: </i>Hier werden die Vorschaugrafiken für den Warenkorb gespeichert. Auch hier solltest Du von Hand keine Grafiken entfernen.</p><p>- <i>Product Designer - Images</i>: Lade in dieses Verzeichnis die gewünschten Motive, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Motive in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Motiv einen <i>Titel</i>  festlegen, der im Frontend erscheinen wird.<br />- <i>Product Designer</i> - <i>Background Images:</i><i> </i>Lade in dieses Verzeichnis die gewünschten Hintergrundbilder, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Hintergrundbilder in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Hintergrundbild einen <i>Titel</i> festlegen, der im Frontend erscheinen wird.</p><p><br /></p><p><br /></p><h2>Schritt 5: Dokumentation lesen</h2><p><br />Nimm Dir ausreichend Zeit, um die einzelnen Konfigurationsoptionen im Designer-Backend durchzugehen. Jedes Eingabefeld besitzt eine ausführliche Beschreibung, die dessen Funktion erklärt.<br /><br /></p><p>Für weiterführende Informationen und häufig gestellte Fragen kannst Du einen Blick in unsere Dokumentation werfen: <br /><a href=\"http://docs.product-designer.io\" target=\"_blank\" rel=\"noreferrer noopener\">http://docs.product-designer.io</a><br /></p>https://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaAhttps://scribehow.com/shared/Ein_neues_Produkt_im_Product_Designer_konfigurieren__jdjLCGNWQAmyhlsmMhiHaA","version":"2.7.12","changelog":[{"version":"2.7.12","text":"<p>- Improved compatibility for PHP 8.2</p>","creationDate":{"date":"2023-07-25 08:06:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.11","text":"<p>- Bug fix: In some cases configuration could not be saved</p>","creationDate":{"date":"2023-07-07 11:32:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.8","text":"<p>- Bug fix: URLs in Shopware Admin</p>","creationDate":{"date":"2023-07-03 13:08:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.7","text":"<p>- Bug fixes: In some cases products without design could not be added to the cart.</p>","creationDate":{"date":"2023-06-28 14:41:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.6","text":"<p>- QR codes, text objects and image uploads can now be disabled in each admin configuration</p><p>- Cleaner structure of admin configuration options </p><p>- Preview functionality in admin configuration</p>","creationDate":{"date":"2023-06-21 15:42:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.5","text":"<p>- It's now possible to copy elements.</p>","creationDate":{"date":"2023-06-14 17:10:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.4","text":"<p>- Bug fix: Media folder for preview images will be created if not existing.</p>","creationDate":{"date":"2023-06-13 16:56:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.3","text":"<p>- Bug fix: The designer now works with different product layouts, too.</p>","creationDate":{"date":"2023-06-13 13:36:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.2","text":"<p>- New, horizontal layout. You can now choose between a vertical, horizontal or automatic layout based upon screen ratio.</p>","creationDate":{"date":"2023-06-12 16:45:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.5","text":"<p>- Improvements for the functionality to re-apply a previous design<br /></p>","creationDate":{"date":"2023-05-24 12:52:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.3","text":"<p>- Preview images will now be generated for every assigned configuration</p><p>- Small layout improvements<br /></p>","creationDate":{"date":"2023-05-13 20:31:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.26","text":"<p>- Slightly improved style to save more space</p><p>- Improve mobile style</p><p>- The UI can now be hidden by the customer</p><p>- Configuration labels are now translateable</p><p>- Bug fix: If background colors are disabled, in some cases an empty modal has been shown</p><p>- Bug fix: Focusing the text area for QR codes will now not zoom in automatically in iOS<br /></p>","creationDate":{"date":"2023-05-08 17:48:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.19","text":"<p>- Objects can now be mirrored</p><p>- New ways for text scaling</p><p>- Small improvements in mobile view<br /></p><p>- Bug fix: Translations for some language were not be loaded.<br /></p><p>- Improved embedding of the modal that loads the designer<br /></p>","creationDate":{"date":"2023-05-04 13:51:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.12","text":"<p>- Elements can now be deleted by pressing the delete key on the keyboard</p><p>- Bug fix: In some cases emojis weren't correctly replaced with images</p>","creationDate":{"date":"2023-04-11 15:58:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.11","text":"<p>- Compatibility to Shopware 6.5</p><p>- Compatibility to Rendering Service, v2</p><p>- Better compatibility to alternative themes</p>","creationDate":{"date":"2023-04-02 20:26:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.7","text":"<p>- Exported design files will now be saved on the shop server.</p><p>- Pixabay images will now be downloaded to the shop server. In case Pixabay deletes a file from their servers, it's still possible to export the design.</p><p><br /></p><p>FOR CUSTOMERS OF THE RENDERING SERVICE</p><p>With the next version of the rendering service there will be fundamental changes to it. Please mind, that with the next version the Rendering Service is able to export the same file formats like you can choose from for manual rendering. If you have questions, don't hesitate to contact the plugin support.</p>","creationDate":{"date":"2023-03-08 19:22:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.12","text":"<p>- Improvements and bug fixes for PDF generation</p>","creationDate":{"date":"2023-02-24 19:14:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.8","text":"<p>- Bug fix: Focusing a text field will now not focus the input field automatically on iOS devices.</p><p>- If there were no results searching for Pixabay images, the customer will now be informed about that.</p>","creationDate":{"date":"2023-02-20 11:47:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.7","text":"<p>- New feature: Now you can image search via pixabay.com to the designer. Simply register for a free API key on pixabay.com and paste it into your product designer configurations. </p><p><br /></p><p>- Bug fix: If multiple configurations were assigned to a single article there might be performance issues.</p>","creationDate":{"date":"2023-02-17 15:00:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.8","text":"<p>- Bug fix: In some cases designs with QR codes could not be finished.</p>","creationDate":{"date":"2022-12-15 11:21:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.7","text":"<p>- Bug fix: Surcharges were not displayed correctly under special circumstances.</p>","creationDate":{"date":"2022-11-17 13:18:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.6","text":"<p>- Bug fix: The foreground image for printing was not embedded.</p>","creationDate":{"date":"2022-11-04 14:00:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.4","text":"<p>- Bug fix: For SVG files no surcharges were added.</p>","creationDate":{"date":"2022-10-31 13:32:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.3","text":"<p>- Bug fix: In some cases the designer did not load if an initial design was configured.</p><p>- Bug fix: Price calculation for images was incorrect in some cases.<br /></p>","creationDate":{"date":"2022-10-18 16:45:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.1","text":"- Improved error handling: Failing image uploads will now show a better error message.<br />- Cleaner display of unexpecteds error messages that can easily be closed<br />- Improved SVG support","creationDate":{"date":"2022-10-12 14:18:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.13","text":"<p>- Bug fix: Deleting a configuration in backend may not remove that configuration from the list.</p><p><br /></p><p>- Bug fix: If no CSS was specified for a configuration an invalid URL was loaded.</p>","creationDate":{"date":"2022-09-20 16:10:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.12","text":"<p>- Performance improvements when loading designs in admin area</p><p>- Bug fix: Currently selected text in text box was not properly shown.</p>","creationDate":{"date":"2022-09-14 01:27:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.10","text":"<p>-  Improve performance when saving temporary design<br /></p>","creationDate":{"date":"2022-09-05 16:14:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.9","text":"<p>- Performance improvements for canvas renderings</p><p>- Bug fix: Some SVG prevented the design to be finished.<br /></p>","creationDate":{"date":"2022-09-05 15:55:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.8","text":"<p>- Bug fix: Some image file types could not be uploaded anymore.<br /></p>","creationDate":{"date":"2022-08-15 19:48:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.7","text":"<p>- Bug fix: When using an unknown language English wasn't used as a fallback.</p>","creationDate":{"date":"2022-08-06 22:14:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.6","text":"<p>- You are now able to export designs as PDF</p>","creationDate":{"date":"2022-06-29 23:31:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.7","text":"<p>- Bug fix:  Curved texts could not be changed to bold nor italic</p><p>- Bug fix: Texts of rendered designs were incorrectly sized in a few cases.</p>","creationDate":{"date":"2022-06-07 05:50:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"<p>- Implementation of snap lines: Using snap lines your customers are able to easily align the elements placed on the canvas. Color and strength of snap lines can be configured in the Shopware backend.</p><p>- It's now possible to enter relative URLs for the article image as long as it starts with a dot or a slash.</p><p>- Performance improvements when storing temporary designs.</p><p>- Bug fix: Designs in backend could not be deleted.</p><p>- Bug fix: Issue with selecting transparency when using backend color picker.</p>","creationDate":{"date":"2022-06-04 00:08:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p>- Bug fix: Custom CSS was not loaded in some cases.</p>","creationDate":{"date":"2022-05-17 23:02:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p>- Bug fix: Some translations in backend were missing.</p><p>- Bug fix: In some cases the loading icon was always visible in the backend configuration list.</p><p>- Performance fix: Loading of designs in backend is faster now.</p>","creationDate":{"date":"2022-05-11 01:39:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p>- Bug fix: Some texts on designs which were created with version 1 hat a RTL directon.</p>","creationDate":{"date":"2022-05-10 18:16:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>- Bug fix: When uploading an image the loading animation was not shown.</p><p>- Bug fix: Initial designs could not be loaded.</p><p>- Bug fix: Designs with SVGs could not be generated in backend in some cases.</p>","creationDate":{"date":"2022-05-10 11:57:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>- Bug fix: In some cases background images and predefined images could not be loaded.</p><p>- Bug fix: Designs with some SVGs were not able to get finished or loaded in the backend.</p>","creationDate":{"date":"2022-05-10 02:03:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>- Bug fix: Some SVG files were not accepted.</p>","creationDate":{"date":"2022-05-06 11:18:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Update to version 2 of the product designer.</p><p><br /></p><p>Version 2 comes with a lot of changes!</p><p>You can find a list of changes in our new documentation:</p><p>https://docs.product-designer.io/v2/<br /></p><p><br /></p><p><b>Please test the new version carefully on your system.</b></p><p><b><br /></b></p><p>If you use custom JS or CSS you have to adjust it to the new version. Find out more about it here: https://docs.product-designer.io/v2/migration.html</p><p><br /></p><p>You now also have access to the source code of the designer - so you can customize it however you like:</p><p>https://docs.product-designer.io/customizations/<br /></p><p><br /></p><p>Thanks for using the product designer!</p>","creationDate":{"date":"2022-04-27 21:42:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.14.1","text":"<p>- A bug was fixed which prevented the navigation entry to be shown</p><p>- Added a note for version 2</p>","creationDate":{"date":"2022-04-13 00:17:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.14.0","text":"<p>- When rendering a design you now can choose between different image formats and quality options.</p>","creationDate":{"date":"2021-12-28 14:58:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.13.4","text":"<p>- Fixed an issue together with Custom Products plugin</p>","creationDate":{"date":"2021-12-03 16:24:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.13.3","text":"<p>- You're now able to choose fonts for each configuration individually</p>","creationDate":{"date":"2021-12-01 21:13:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.12.1","text":"<p>- Even more improved compatibility to other plugins</p>","creationDate":{"date":"2021-11-24 20:44:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.12.0","text":"<p>- Improved compatibility to other plugins that also change the default behavior of cart logic.</p>","creationDate":{"date":"2021-11-24 20:16:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.5","text":"<p>- Added compatibility to Shopware 6.4.5.1</p><p>- Set background image url o required as there could be issues when leaving it empty</p>","creationDate":{"date":"2021-10-08 12:50:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.0","text":"<p>- The designer is now compatible to Shopware's Custom Product Extension: https://docs.shopware.com/en/shopware-6-de/erweiterungen/customproducts</p><p>- In rare cases the designer could not be loaded in Firefox. This has been fixed.</p><p>- On the order detail page in the backend you can see now the ID and URL to basket preview image for each position.</p>","creationDate":{"date":"2021-06-04 13:00:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.6","text":"<p>- Improvement of font support in SVG files</p><p>- Foreground images will now also be supported by SVG</p><p>- Bug fix: Clip arts and background clip arts may not be loaded in frontend</p><p>- Bug fix: Switching between text elements may not updated the options correctly</p>","creationDate":{"date":"2021-05-20 16:55:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.3","text":"<p>- Foreground image can be configured. </p><p>- Color of drawing area border color can be changed.</p>","creationDate":{"date":"2021-05-10 15:17:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.6","text":"<p>- Emoji Support</p><p>- Minor bug fixes</p>","creationDate":{"date":"2021-05-07 17:08:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.2","text":"<p>- Let your customers decide between background images now. For this add the images to choose from in media manager directory \"Product Designer - Background Clip Arts\"</p><p>- Adjustments for Shopware 6.4</p>","creationDate":{"date":"2021-04-19 19:48:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.10","text":"<p>- Configurations can now be exported and imported as CSV</p>","creationDate":{"date":"2021-03-25 17:22:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.6","text":"<p>- After applying a design the text of the button \"Create design\" will be changed to \"Update design\"</p>","creationDate":{"date":"2021-02-06 13:22:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.5","text":"<p>- Added some more translations</p>","creationDate":{"date":"2021-01-26 13:48:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.4","text":"<p>- Integration of KILB Rendering Service: This soon to be available plugin will automatically generate designs. You can choose between 6 different file formats. </p><p>- If an image can not be loaded from a different domain (i.e. because of missing CORS headers) the plugin will now try to load the file from the current domain.</p>","creationDate":{"date":"2021-01-26 13:27:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.39","text":"<p>- Add a link to documentation in backend</p><p>- Temporary designs that were not applied yet will also be saved.</p><p>- Paypal express checkout button will be disabled, too, if no design applied yet.</p><p>- Bug fix: Multi language shops with language flag in URL will be supported, too</p><p><br /></p>","creationDate":{"date":"2021-01-06 12:55:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.37","text":"<p>- New feature: With a \"sort index\" configurations can be sorted in the backend and - if you assign multiple configurations to a single article - in the frontend, too.</p><p>- Performance optimizations in backend if you have a huge list of configurations</p><p>- Bug fix: Sometimes basket preview image has not been rendered correctly on mobile apple devices.</p>","creationDate":{"date":"2020-12-08 21:53:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.29","text":"<p>- Uploading an SVG will make the quality indicator disappear.</p><p>- When a clip art will be placed on the design it will be scaled to \"good image quality\".</p>","creationDate":{"date":"2020-12-04 15:30:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.28","text":"<p>- New feature: An image quality indicator shows the customer what quality the image he placed has.</p><p>- The maximum length of QR code text was reduced to 100. More text would generate bigger QR codes that are hard to scan.</p><p>- Stored designs are limited to 9 now. Additionally they will be compressed before saving. This will fix some issues with browsers which limit the locale storage a lot (like Safari or mobile devices)</p><p>- The text size of some input fields got slightly increased so there will happen no unwanted zooming on iOS devices.</p>","creationDate":{"date":"2020-12-04 15:13:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.24","text":"<p>- The size of the basket preview image can now be adjusted for each configuration.</p><p>- If you edit a color field of a backend configuration you can now use a color picker.</p><p>- The transparency which is hiding the background image and elements outside of the canvas can now be adjusted.</p><p>- On the product detail page not all configurations will be loaded from backend anymore. Only those who are really needed for that article. This will improve performance if you have a lot of configurations in your system.</p><p><br /></p>","creationDate":{"date":"2020-11-27 16:47:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.21","text":"<p>- Previously created designs can now be applied &amp; reused again.</p><p>- The navigation entry \"Product Designer\" is now a sub entry of \"Catalog\"</p><p>- A lot of small bug fixes</p>","creationDate":{"date":"2020-11-19 17:07:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.3","text":"<p>An issue with resolving wild card article numbers was fixed.</p>","creationDate":{"date":"2020-11-10 17:06:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.2","text":"<p>- New feature: Upload your own fonts. Please read the FAQ section regarding fonts before using this feature.</p><p>- Bug fix: Clicking outside of the canvas did not unselect the currently active element all the time.</p><p>- Bug fix: Article numbers containing only digits will work now.</p>","creationDate":{"date":"2020-10-28 18:11:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"<p><b>- New feature:</b> The zoom functionality - your customers are now able to zoom the canvas. So they are able to place their elements more easily.</p><p><b>- New feature: </b>You are now able to use wildcards (*) for configuration articles numbers. </p><p><b>- Breaking change: </b>Scaling is reimplemented. Background image and canvas will now be sized as big as possible to fit in the browser window. It's important the background image is placed on the same domain like the shop (or: CORS headers correctly set).</p>","creationDate":{"date":"2020-10-26 17:03:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.6","text":"<p>- Bug fix: Safari bottom bar will not hide parts of designer content anymore.</p><p>- Performance fix: Canvas will only be rendered now if it's really necessary.</p>","creationDate":{"date":"2020-10-12 17:47:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.5","text":"<p>- Improved support of SVG graphics</p><p>- You are now able to define a \"price per design\" that will be added to the base product price if the customer placed at least 1 element.</p>","creationDate":{"date":"2020-10-08 23:47:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.4","text":"<p>- Performance improvements when switching between configurations in Frontend</p><p>- Improvements of design of elements placed outside of drawing area</p><p>- Bug fix: Drawing area will now be calculated correctly again when switching between configurations</p>","creationDate":{"date":"2020-09-23 23:25:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"<p>Backend icons will show up again now</p>","creationDate":{"date":"2020-09-16 14:48:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<p>- If you click on a blank area the focus of current canvas element will be removed</p><p>- Additional pricing now also works for curved text</p>","creationDate":{"date":"2020-09-11 16:02:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<p>- <b>Breaking Change</b>: Elements are now visible, movable and changeable even if they are not inside the canvas. This will increase user experience</p><p>- <b>Breaking Change:</b> Customers can't set text bold or italic if the font doesn't support it anymore.</p><p>- New fonts added.<br /></p><p>- Bug fix: Placement of initial elements for multiple configurations per article fixed.</p>","creationDate":{"date":"2020-09-03 17:32:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Our biggest update so far!</p><p><br /></p><p>- Optimization of the file size of the javascript file </p><p>- Performance optimizations for product listings if you've created a lot of product designer configurations</p><p>- Improvement of usability on mobile devices</p><p>- Letter spacing can now be changed on text elements</p><p>- Text elements can now be curved</p><p>- Bug fix: Drag &amp; Drop inside the image upload layer will work now</p>","creationDate":{"date":"2020-08-28 17:48:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.10","text":"<p>- Bug fix: If you've deleted an order in the Shopware backend product designs could not be loaded anymore. This has been fixed.</p>","creationDate":{"date":"2020-06-23 11:08:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.9","text":"<p>- Critical Bug fix: Products could not be loaded in the backend. Fixed.</p>","creationDate":{"date":"2020-06-19 15:03:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.8","text":"<p>- For even more product tiles in your shop the button \"Add to basket\" will be replaced with \"Create design now\".</p><p>- You are now able to change the color picker. You can choose between different layouts here.</p><p>- You are now able to define the colors users can choose for their text elements.</p>","creationDate":{"date":"2020-06-18 19:26:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.5","text":"<p>- Improving layout of clip art layer</p><p>- Improving size and rotation handles of elements placed on the canvas</p>","creationDate":{"date":"2020-06-13 21:31:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<p>- Bug fix: You can place PNG images on the canvas now again</p>","creationDate":{"date":"2020-06-11 11:39:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>- Exif metadata of uploaded images will be parsed now. This will support rotated and mirrored images.</p><p>- You can define your own fonts now. For this create a folder \"product-designer-fonts\" in Shopwares public directory &amp; place your TTF fonts in there.</p>","creationDate":{"date":"2020-06-09 18:23:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.8","text":"<p>- Price information on product detail page will now contain * char to inform about including VAT</p><p>- Bug fix: A issue was solved that in rare cases large graphics were not rendered completely in the backend.</p>","creationDate":{"date":"2020-05-27 17:58:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"<p>- There's a plugin icon in the admin plugin manager now</p><p>- Custom JS &amp; CSS files won't be cached anymore</p><p>- Bug fix: If no background image URL was defined for a configuration in some cases it was not possible to open that configuration in the backend anymore.</p>","creationDate":{"date":"2020-05-20 12:58:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"<p>- Bug fix: Fixed showing the grid on top of all placed elements when opening product designer modal again.</p><p>- Bug fix: Using the category dropdown in clip art layer was zooming the page on iOS. </p>","creationDate":{"date":"2020-05-06 06:09:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"<p>- In each configuration you can now define a grid which will help your customers to arrange the design elements.</p><p>- Uploaded images and added clip arts will be initially set to a size where the customer can see it completely in the canvas.</p>","creationDate":{"date":"2020-04-23 18:09:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>- Dynamic Price Calculation: For each product design configuration you can specify an additional price amount for each clip art, image and text element that will be added to the product price.</p><p><br /></p><p>Please mind: In some cases it's necessary to disable and enable the plugin after the version upgrade again. No data will be lost.</p>","creationDate":{"date":"2020-04-22 13:57:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.7","text":"<p>- The CSS style für the button design is now available for own customizations via \".btn\"</p>","creationDate":{"date":"2020-04-06 11:53:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"<p>- You can filter for several clip art categories in product designer configurations now.</p><p>- Layers for clip arts, QR codes etc. improved by design.</p><p>- Bug fix: HTML of frontend and backend page of product designer will not anymore cached in browser cache.</p><p><br /></p>","creationDate":{"date":"2020-03-30 18:32:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p>- Bugfix:Ordered product designs will still be listed now, even when a related product has been deleted.</p><p>- Bugfix: Clip arts placed in sub directories will now be grouped into categories.</p><p>- Feature: You can now add your custom JavaScript file into a product design configuration which will give you the opportunity to modify the behaviour of the product designer.</p>","creationDate":{"date":"2020-03-21 12:40:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.10","text":"<p>- fixed an issue related to storing a custom css url</p>","creationDate":{"date":"2020-03-10 17:58:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<p>- Bugfix: The backend of the product designer now works if shop system is set to maintenance mode.</p>","creationDate":{"date":"2020-03-06 21:39:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<p>- Fixed styling issue for very large font names in the dropdown.</p><p>- Rendering a WebP image in the backend doesn't require to have the fonts used in the design installed on the local machine anymore.</p><p>- Using multiple configurations for several articles could break the designer. This issue has been fixed as well.</p><p>- Two more fonts added.</p>","creationDate":{"date":"2020-02-09 01:26:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<p>- Rotation snapping is now supported and can be configured in the backend</p>","creationDate":{"date":"2020-02-06 19:12:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>- Added option in configurations to enable add to basket button before a design has been created.</p><p>- Added option in configuration to force aspect ratio of text placed on canvas.</p><p>- Added option in configuration to force aspect ratio of clip arts placed on canvas.<br /></p>","creationDate":{"date":"2020-02-04 11:03:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>- More fonts added</p><p>- Fonts will be shown as preview in dropdown</p>","creationDate":{"date":"2020-01-28 23:21:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>- Rendering can now be done in the browser without the need of the rendering software.</p><p>- The rendering output file type is webp now. This will reduce file size dramatically.</p>","creationDate":{"date":"2020-01-19 15:27:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>When saving a configuration a entered article number will be added automatically.</p>","creationDate":{"date":"2020-01-16 00:19:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Adjustments to support Shopware 6.1</p>","creationDate":{"date":"2020-01-14 23:55:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- Initial Plugin version</p>","creationDate":{"date":"2019-11-05 16:46:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Kilb647502658205","redirectToStore":false,"lowestPriceValue":39.99}