{"id":10087,"name":"ZeobvReciprocity","code":"zeobv77633577288","lastChange":{"date":"2023-07-19 14:15:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpk46SD5","examplePageUrl":"","moduleKey":"ZeobvReciprocity","creationDate":{"date":"2019-10-13 15:18:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-10-28 11:29:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-02-02 23:07:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":15664,"name":"Newsletter Popups - Bieten Sie Ihren Kunden Werbeaktionen an","description":"<p>Mit Hilfe dieses Plugins können Sie ansprechende Popups erstellen, die auf bestimmten Seiten Ihres Shops angezeigt werden. Es ist vollständig anpassbar und kann verwendet werden, um verschiedene Ziele zu erreichen, wie z. B. das Sammeln von E-Mails oder die Aufforderung an Besucher, etwas herunterzuladen. Mit Hilfe des Rich-Context-Editors können Sie sogar Promo- oder Rabattcodes einblenden, die nach einer bestimmten Zeitspanne deaktiviert werden können. Das gesamte Popup kann an Ihre eigenen Vorlieben angepasst werden. Wir haben es zwar ermöglicht, aber Sie sind derjenige, der es tatsächlich macht!</p><h2>Vorteile</h2><p><b>Erleichtert die Kundensegmentierung</b></p><p>Die Kunden, die freiwillig ihre E-Mail eingeben oder etwas aus dem Popup herunterladen, sind genau diejenigen, die ein größeres Interesse an Ihren Marken zeigen. Nutzen Sie diese Lead-Generierung, um Ihre Kunden in solche zu segmentieren, die eher bereit sind, Ihr Produkt zu kaufen, und solche, die eine geringere Kaufabsicht haben.</p><p><b>Möglichkeiten für Remarketing und E-Mail-Marketing</b></p><p>Es gibt eine optionale Einstellung, mit der Sie das E-Mail-Feld obligatorisch machen können. Wir empfehlen Ihnen, davon Gebrauch zu machen, da Sie so Ihre E-Mail-Marketingliste erweitern können und die Möglichkeit haben, diese Kunden für Remarketingzwecke leichter anzusprechen.</p><p><b>Anpassbar an Ihre eigenen Präferenzen</b></p><p>Wir haben das Plugin so konfiguriert, dass Sie die volle Kontrolle darüber haben, was auf dem Bildschirm des Besuchers angezeigt wird. Aspekte wie Inhalt, Zeitpunkt und Ort können nach Ihren Wünschen angepasst werden. Sie können es für verschiedene Zwecke einsetzen, z. B. um E-Mails zu sammeln, Kunden zu informieren, Ihre Alleinstellungsmerkmale zu verdeutlichen oder einen Rabattcode zu bewerben. Kein generisches Popup, sondern eines, das wirklich zu Ihrer Website passt!</p><h3>Immer noch nicht überzeugt?</h3><p>70+ Webshops sammeln bereits E-Mails oder bieten Downloads über unser Popup-Plugin an. Um eine Vorstellung davon zu bekommen, wie man es einsetzt, sehen Sie sich an, wie der folgende Shop es verwendet hat:&nbsp;<a href=\"https://hardenbergspirits-shop.de/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://hardenbergspirits-shop.de/&nbsp;</a></p><h2><a href=\"https://shopware6.zeopreview.nl/\" target=\"_blank\" rel=\"noreferrer\">Oder probieren Sie es hier selbst aus!</a></h2><h2>Kontakt</h2><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Kaufabwicklung geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin auswählen oder eine Nachricht an&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a>&nbsp;senden. Geben Sie unbedingt Ihre aktuelle Shopware-Version und die Version des Plugins an, das Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h2>Über uns</h2><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p><p></p>","installationManual":"<p>Extrahieren Sie die zip-Datei im Ordner {project_root}/custom/plugins oder verwenden Sie den Shopware-Plugin-Manager, installieren und aktivieren Sie das Plugin über die terminal oder über die Plugin-Übersicht in der Administration. Einmal installiert und korrekt aktiviert, sollte ein zusätzlicher Menüpunkt im Hauptmenü der Administration unter dem Reiter \"Inhalte\" erscheinen. Bewegen Sie den Mauszeiger oder klicken Sie im Hauptmenü der Administration auf \"Inhalte\", um zum Eintrag \"Reciprocity popups\" zu navigieren.</p><p><br /></p><p>Über die Übersicht der Reziprozitäts-Popups können Sie mit der Schaltfläche \"Neues Popup erstellen\" in der oberen rechten Ecke neue Popups erstellen. Sie können die Felder hier nach Belieben ausfüllen. Beachten Sie einfach Folgendes:</p><p><br /></p><p></p><ul><li>Stellen Sie sicher, dass das Popup \"Aktiv\" ist. Dadurch kann das Popup in der Storefront angezeigt werden.</li><li>Verwenden Sie die Mehrfachauswahl \"Auf ausgewählten Seiten anzeigen\", um auszuwählen, wo Ihr Popup angezeigt werden soll. W<b>enn dieses Feld leer gelassen wird, wird das Popup nicht in der Storefront angezeigt!</b></li><li>Konfigurieren Sie mithilfe der Felder \"Anzeigen nach\" und \"Nicht mehr anzeigen nach\", wie viele Sekunden das Popup angezeigt werden soll und wie oft es angezeigt werden soll, bis es entfernt wird.</li></ul><p><br /></p><p>Viel Spaß beim Schaffen von Gegenseitigkeit bei Ihren Kunden!</p>","shortDescription":"Verwenden Sie Popups, um Gegenseitigkeit bei den Besuchern Ihrer Shops zu erzeugen. Bieten Sie Downloads an oder verwenden Sie die Popups, um Engagements zu erstellen.","highlights":"Vollständig anpassbare Popups.\nSchaffen Sie Gegenseitigkeit in Ihren Besuchern.\nEinfach zu verwenden.\nSteigern Sie Ihre Konversion.\nBieten Sie Downloads oder Aktionen gleichermaßen an.","features":"Erstellen Sie mehrere Popups zur Verwendung in Ihrem gesamten Geschäft.\nFügen Sie Bedingungen hinzu, wo und wann ein Popup angezeigt werden soll.\nDeaktivieren Sie ein Popup und reaktivieren Sie es erneut, wenn es soweit ist.\nBieten Sie Ihren Besuchern kostenlose Downloads an.\nSammeln Sie im Gegenzug E-Mails mit einem Download.\nPassen Sie jedes Popup nach Ihren Wünschen an."},{"id":15665,"name":"Newsletter Popups - Offer promotions to your shoppers","description":"<p>With the help of this plugin, you can create engaging popups that show up on specific pages of your store. It is fully customizable and can be used to fulfill various different objectives, such as collecting emails or making visitors download something. With the help of the rich context editor, you can even display promo or discount codes, which can subsequently be turned off when a certain amount of time has passed. The whole popup can be customized to your own preferences. We may have facilitated it, but you are the one actually making it!</p><h2>Advantages</h2><p><b>Make customer segmentation easier</b></p><p>Those customers that voluntarily enter their email into or download something from the popup are exactly those that show a bigger interest in your brands. Make use of this lead generation to segment your customers into those that are more likely to buy your product and those that have a lower intention to do so.</p><p><b>Opportunities for remarketing &amp; email marketing</b></p><p>There is an optional setting available for you to make the email field mandatory. We highly recommend making use of this as this can help you in expanding your email marketing list, as well as give you opportunities to make it easier to approach these customers for remarketing purposes.</p><b>Customizable to your own preferences</b><p>We have configured the plugin in such a way that you have full control over what is shown on the visitor's screen. Aspects such as the content, timing, and location can all be adjusted to your own liking. You can use it for various objectives, such as collecting emails, informing customers, making your USPs clear, or promoting a discount code. No generic popup, but one that really fits your website instead!</p><h3>Still not convinced?</h3><p>70+ webshops are already collecting emails or providing downloads through our popup plugin. To get an idea of how to use it, check out how the following store applied it:&nbsp;<a href=\"https://hardenbergspirits-shop.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://hardenbergspirits-shop.de/&nbsp;</a></p><h2><a href=\"https://shopware6.zeopreview.nl/\">Or try it out for yourself here!</a></h2><h2>Contact</h2><p>If something unexpected has happened or like to see an aspect of the checkout changed or improved, contact us via the Shopware support portal by selecting the Newsletter Popups plugin or by sending a message to&nbsp;<a href=\"mailto:\" target=\"_blank\" rel=\"noreferrer noopener\">plugins@zeo.nl</a>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process it's best to provide as much information as possible or provide us with access to your test environment. This way we can reproduce the issue for ourselves and come up with a solution quicker.</p><h2>About us</h2><p>The team of professionals at Zeo has over 15 years of experience in both online marketing and web development. With this experience, we have helped over 80 clients in 11 different countries, both B2C and B2B. Several new e-commerce shops have been built from the ground up using the Shopware platform and Zeo’s plugins. Notable customers of ours include Simon Lévelt, 24Kae, ABN AMRO Bank, and Allianz Global Assistance. For more information about us, visit&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.zeo.nl/</a>.</p><p></p>","installationManual":"<p>Extract the zip file in the {project_root}/custom/plugins folder or use the Shopware plugin manager, install and activate the plugin using the command line or via the plugin overview in the administration. Once installed and activated correctly an extra menu-item should appear in the Administration main menu under the \"Content\" tab. Hover or click on \"Content\" in the Administration main menu whereafter you can navigate to the \"Reciprocity Popups\" item.</p><p><br /></p><p>Via the Reciprocity Popups overview you can create new popups using the \"Create new Popup\" button in the top right corner. You are completely free to fill the fields here as you please. Just note the following:</p><p></p><ul><li>Make sure the popup is \"<b>Active</b>\". This will allow the popup to show on the storefront.</li><li>Use the \"Display on selected pages\" multiselect to select where you would like your popup to show up. <b>If this is left empty, the popup won't appear in the storefront!</b> </li><li>Configure using the \"Show after\" and \"Stop showing after\" fields to configure the number of seconds the popup should wait to appear and the amount of times it should appear until clicked away.</li></ul><br /><p>That's it, enjoy creating reciprocity in your customers!</p><p><br /></p>","shortDescription":"Use engaging popups to create a sense of reciprocity in your shops' visitors. Offer downloads no-strings-attached or use the simple customizable popups to engage visitors in your shop.","highlights":"Fully customizable popups.\nExpand your email list and increase future conversions.\nIncreased lead generation by collecting emails and downloads\nChoose your own popup content, such as discount codes, promo codes, or active giveaways.\nOpportunities for remarketing through the collected emails.","features":"Create multiple popups for use throughout your store.\nAdd conditions to when and where a popup should show up.\nDeactivate a popup and reactivate it again when the time comes.\nOffer free downloads to your visitors.\nCollect emails with a download in return.\nCustomize each popup to your liking."}],"addons":["enterpriseCertified","ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":157597,"bookingKey":"zeobv77633577288","bookingText":"Newsletter Popups - Offer promotions to your shoppers","price":149.99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":157596,"bookingKey":"zeobv77633577288_M","bookingText":"Newsletter Popups - Offer promotions to your shoppers","price":15,"duration":1,"trialPhaseIncluded":true,"discount":5,"discountAppliesForMonths":6,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6pGOGm","preview":true,"priority":0,"id":36361},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOTgdFi","preview":false,"priority":0,"id":36357},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeyVobm","preview":false,"priority":0,"id":36358},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHnZlZa","preview":false,"priority":0,"id":36359},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzyFfkm","preview":false,"priority":0,"id":36360},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppWr3mm","preview":false,"priority":0,"id":36362},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3TkCCm","preview":false,"priority":0,"id":36363},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfQ3WQh","preview":false,"priority":0,"id":36364},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphZm9Im","preview":false,"priority":0,"id":36365},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpl1IFWs","preview":false,"priority":0,"id":36366},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphro8Qt","preview":false,"priority":0,"id":36367}],"comments":[{"authorName":"John","text":"Easy to-use plugin with great &amp; friendly support.","headline":"Easy to use","creationDate":{"date":"2020-12-03 14:57:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Newsletter Popups - Bieten Sie Ihren Kunden Werbeaktionen an","description":"<p>Mit Hilfe dieses Plugins können Sie ansprechende Popups erstellen, die auf bestimmten Seiten Ihres Shops angezeigt werden. Es ist vollständig anpassbar und kann verwendet werden, um verschiedene Ziele zu erreichen, wie z. B. das Sammeln von E-Mails oder die Aufforderung an Besucher, etwas herunterzuladen. Mit Hilfe des Rich-Context-Editors können Sie sogar Promo- oder Rabattcodes einblenden, die nach einer bestimmten Zeitspanne deaktiviert werden können. Das gesamte Popup kann an Ihre eigenen Vorlieben angepasst werden. Wir haben es zwar ermöglicht, aber Sie sind derjenige, der es tatsächlich macht!</p><h2>Vorteile</h2><p><b>Erleichtert die Kundensegmentierung</b></p><p>Die Kunden, die freiwillig ihre E-Mail eingeben oder etwas aus dem Popup herunterladen, sind genau diejenigen, die ein größeres Interesse an Ihren Marken zeigen. Nutzen Sie diese Lead-Generierung, um Ihre Kunden in solche zu segmentieren, die eher bereit sind, Ihr Produkt zu kaufen, und solche, die eine geringere Kaufabsicht haben.</p><p><b>Möglichkeiten für Remarketing und E-Mail-Marketing</b></p><p>Es gibt eine optionale Einstellung, mit der Sie das E-Mail-Feld obligatorisch machen können. Wir empfehlen Ihnen, davon Gebrauch zu machen, da Sie so Ihre E-Mail-Marketingliste erweitern können und die Möglichkeit haben, diese Kunden für Remarketingzwecke leichter anzusprechen.</p><p><b>Anpassbar an Ihre eigenen Präferenzen</b></p><p>Wir haben das Plugin so konfiguriert, dass Sie die volle Kontrolle darüber haben, was auf dem Bildschirm des Besuchers angezeigt wird. Aspekte wie Inhalt, Zeitpunkt und Ort können nach Ihren Wünschen angepasst werden. Sie können es für verschiedene Zwecke einsetzen, z. B. um E-Mails zu sammeln, Kunden zu informieren, Ihre Alleinstellungsmerkmale zu verdeutlichen oder einen Rabattcode zu bewerben. Kein generisches Popup, sondern eines, das wirklich zu Ihrer Website passt!</p><h3>Immer noch nicht überzeugt?</h3><p>70+ Webshops sammeln bereits E-Mails oder bieten Downloads über unser Popup-Plugin an. Um eine Vorstellung davon zu bekommen, wie man es einsetzt, sehen Sie sich an, wie der folgende Shop es verwendet hat: <a href=\"https://hardenbergspirits-shop.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://hardenbergspirits-shop.de/ </a></p><h2><a href=\"https://shopware6.zeopreview.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">Oder probieren Sie es hier selbst aus!</a></h2><h2>Kontakt</h2><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Kaufabwicklung geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin auswählen oder eine Nachricht an <a href=\"mailto:\" target=\"_blank\" rel=\"noreferrer noopener\">plugins@zeo.nl</a> senden. Geben Sie unbedingt Ihre aktuelle Shopware-Version und die Version des Plugins an, das Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h2>Über uns</h2><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter <a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.zeo.nl/</a>.</p><p></p>","installationManual":"<p>Extrahieren Sie die zip-Datei im Ordner {project_root}/custom/plugins oder verwenden Sie den Shopware-Plugin-Manager, installieren und aktivieren Sie das Plugin über die terminal oder über die Plugin-Übersicht in der Administration. Einmal installiert und korrekt aktiviert, sollte ein zusätzlicher Menüpunkt im Hauptmenü der Administration unter dem Reiter \"Inhalte\" erscheinen. Bewegen Sie den Mauszeiger oder klicken Sie im Hauptmenü der Administration auf \"Inhalte\", um zum Eintrag \"Reciprocity popups\" zu navigieren.</p><p><br /></p><p>Über die Übersicht der Reziprozitäts-Popups können Sie mit der Schaltfläche \"Neues Popup erstellen\" in der oberen rechten Ecke neue Popups erstellen. Sie können die Felder hier nach Belieben ausfüllen. Beachten Sie einfach Folgendes:</p><p><br /></p><p></p><ul><li>Stellen Sie sicher, dass das Popup \"Aktiv\" ist. Dadurch kann das Popup in der Storefront angezeigt werden.</li><li>Verwenden Sie die Mehrfachauswahl \"Auf ausgewählten Seiten anzeigen\", um auszuwählen, wo Ihr Popup angezeigt werden soll. W<b>enn dieses Feld leer gelassen wird, wird das Popup nicht in der Storefront angezeigt!</b></li><li>Konfigurieren Sie mithilfe der Felder \"Anzeigen nach\" und \"Nicht mehr anzeigen nach\", wie viele Sekunden das Popup angezeigt werden soll und wie oft es angezeigt werden soll, bis es entfernt wird.</li></ul><p><br /></p><p>Viel Spaß beim Schaffen von Gegenseitigkeit bei Ihren Kunden!</p>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<p>-   Introduced compatibility for Shopware 6.5.0</p><p><br /></p>","creationDate":{"date":"2023-04-12 10:25:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"- v6.4.10.0 compatibility patch","creationDate":{"date":"2022-04-15 09:50:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>- Fixed bug in double opt-in redirect</p><p>- Added more solid way of redirecting back to previous route by passing the current uri as form parameter</p>","creationDate":{"date":"2021-08-29 10:20:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"- Improved UX of popup by adjusting redirect on confirmation and tweaking hiding behavior.","creationDate":{"date":"2021-08-25 19:54:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"- Kompatibilität für v6.4 hinzugefügt","creationDate":{"date":"2021-05-07 10:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"- Improved downloadable upload input <p>- Added improvement to file path generation to avoid errors when project path is a-typical\n</p>","creationDate":{"date":"2021-01-06 16:30:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"- Improved UX of popup creation","creationDate":{"date":"2020-11-26 11:25:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"- Structural improvements\n- Added option to just ask for the customer email without having to provide a download.","creationDate":{"date":"2020-11-24 16:04:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"- Bessere Sprachvererbung in beiden Administrationen als Storefront <p>- Angewendetes neues HTML-Flag zulassen</p>","creationDate":{"date":"2020-10-16 14:21:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"# 1.1.3 <p>- v6.3.2.0 compatibility patch</p>","creationDate":{"date":"2020-10-08 17:11:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"# 1.1.2 <p>- v6.3.0.0 compatibility patch\n</p>","creationDate":{"date":"2020-08-05 13:36:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"# 1.1.1<p>- Updated readme</p>","creationDate":{"date":"2020-03-28 15:25:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p># 1.1.0</p><p>- Compatibility patches for Shopware 6.1.0-rc3</p><p>- Improved default close button style for confirmation popup</p><p>- Added \"no results\"-placeholder in Administration</p>","creationDate":{"date":"2020-01-05 17:32:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p># 1.0.0</p><p>- First version of the Zeo Reciprocity for Shopware 6</p>","creationDate":{"date":"2019-10-13 15:24:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv77633577288","redirectToStore":false,"lowestPriceValue":15}