{"id":10144,"name":"CrswCleverReachOfficial","code":"Crsw653619533432","lastChange":{"date":"2023-07-25 11:48:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoNs8jM","examplePageUrl":"","moduleKey":"CrswCleverReachOfficial","creationDate":{"date":"2019-10-23 15:37:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2019-12-03 09:26:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":true,"lastBusinessModelChangeDate":{"date":"2019-11-21 13:27:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":264,"prefix":"Crsw","name":"CleverReach®","website":"//www.cleverreach.com/de/?rk=shopw","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod264_192.png"},"infos":[{"id":15764,"name":"CleverReach® - Newsletter App für Shopware 6-Onlineshop","description":"<h2>Steigern Sie schnell und einfach Ihre Umsätze mit CleverReach - Ihrer E-Mail Marketing Lösung</h2><p>Bringen Sie Ihr Online-Business auf das nächste Level und verbinden Sie Ihren Shopware 5 Shop mit CleverReach.</p><p></p><p>Erstellen Sie mit nur wenigen Klicks professionelle Newsletter, um Ihre Kunden über die neuesten Angebote zu informieren und Ihre Umsätze zu steigern.</p><p></p><p>Legen Sie E-Mail Marketing Automationen an, um sie automatisch z. B. an ihren noch gefüllten Warenkorb zu erinnern.</p><p></p><p>CleverReach ist Ihre All-in-one E-Mail Marketing Lösung. Wir helfen Ihnen dabei, Ihr Unternehmen auszubauen und Ihre Kundenbeziehungen zu stärken.</p><p></p><p></p><p><i>Exklusiv für Shopware-Kunden: Sichern Sie sich&nbsp;<b>3 Monate lang einen 20% Neukunden-Preisvorteil</b>&nbsp;auf Ihren CleverReach-Tarif! Der Rabatt wird bei der Neu-Account-Erstellung automatisch für Sie hinterlegt.</i></p><p><i></i></p><h2>Das kostenlose Plugin überträgt automatisch Ihre Shopware Kunden zu unserem E-Mail Marketing Tool</h2><p>Ob Newsletter Empfänger, Kaufkunde oder sonstiger Kontakt – Sie entscheiden, wer übertragen wird. Legen Sie zudem fest, in welche Empfängerliste Ihre Kunden übertragen werden. Sie können auch eine neue Liste für Ihre Shopware Kunden automatisch anlegen.</p><p></p><p>Die Nutzung des Plugins ist kostenlos, genauso wie die Anmeldung bei unserem E-Mail Marketing Tool. Im kostenfreien Tarif können Sie bis zu 250 Empfänger importieren und 1.000 Newsletter im Monat versenden. Wir bieten für jeden den passenden Tarif an ohne Mindestlaufzeit - monatlich künd- und wechselbar.</p><p></p><h2>Kundeninformationen und Bestelldaten live synchronisieren und bestmöglich nutzen</h2><p>Wählen Sie aus, welche Kundendaten Sie für Ihr E-Mail Marketing nutzen möchten. Synchronisieren Sie zum Beispiel</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; das Geburtsdatum – gratulieren Sie Ihren Kunden persönlich mit einem Rabattcode per Newsletter</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kaufinformationen – machen Sie Ihre Empfänger auf Ihre passendsten und heißesten Angebote aufmerksam</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Letztes Bestelldatum – reaktivieren Sie Ihre Kunden, die länger nichts mehr bei Ihnen im Shop gekauft haben</p><p></p><p>Nutzen Sie Tags und Segmente, um Ihre Kunden gezielt und persönlich per Newsletter anzusprechen. Voraussetzung ist, dass Sie die korrekte Einwilligung Ihrer Empfänger gemäß der DSGVO für den Newsletter Versand haben. CleverReach hilft Ihnen dabei, die rechtskonforme Einwilligung zu erhalten.</p><p></p><p>Unser Plugin arbeitet bidirektional - das bedeutet, es findet ein automatischer Datenabgleich und -austausch zwischen beiden Systemen statt.</p><p></p><h2>Erstellen Sie schnell und einfach professionelle Mailings mit unserem intuitiven Drag &amp; Drop Newsletter Editor</h2><p>Verwenden Sie eine unserer kostenlosen Newsletter Vorlagen und erstellen Sie mit nur wenigen Klicks ein Mailing in Ihrem Design. Dank unseres E-Mail-Template Generators können Sie noch schneller ein Mailing mit Ihrem Logo, Ihren Farben etc. erstellen. Durch diverse vorgefertigte Layout-Elemente können Sie per Drag &amp; Drop Ihre Artikel schnell und einfach in Ihren Newsletter einfügen.</p><p></p><p>Sie benötigen weder Programmierkenntnisse, noch müssen Sie eine extra Software herunterladen.</p><p></p><h2>Nutzen Sie Double Opt-In Anmeldeformulare für eine sichere Adressgewinnung gemäß der DSGVO</h2><p>Automatisch wird ein DSGVO konformes Newsletter Anmeldeformular für Ihre ausgewählte Empfängerliste erstellt, welches Sie auf Ihren Shopseiten einbinden können. So gewinnen Sie noch mehr Kunden für Ihren Newsletter Versand und können Ihr Business weiter ausbauen.</p><p></p><h2>E-Mail Marketing Automation: automatischer Versand von Newslettern, Warenkorb-Erinnerungen, Transaktionsmails u.v.m.</h2><p>Egal ob zum Geburtstag, nach dem Verlassen eines noch gefüllten Warenkorbs oder wenn eine Bestellung bei Ihnen im Shop eingegangen ist – die Möglichkeiten für E-Mail Marketing Automationen sind unendlich.</p><p></p><p>Erstellen Sie mit nur wenigen Klicks Newsletter Strecken für Ihre Kunden mit Inhalten, die sie interessieren und brauchen. Sie sparen durch E-Mail Automationen wertvolle Zeit - gleichzeitig steigern Sie Ihren Umsatz und stärken Ihre Kundenbindungen.</p><p></p><h2>Reports &amp; Tracking in Echtzeit: Analysieren und optimieren Sie Ihren Newsletter Versand</h2><p>Sobald Ihr Mailing versendet wird, startet automatisch das Reporting und Tracking. Analysieren Sie Ihren Newsletter Versand anhand der wichtigsten Kennzahlen (z. B. Öffnungen, Klicks) und testen Sie z. B. verschiedene Zeitpunkte für den Versand. Durch die Auswertung lernen Sie Ihre Kunden noch besser kennen und können Ihr E-Mail Marketing auf das nächste Level bringen.</p><p></p><h2>Höchste Zustellbarkeit &amp; Datensicherheit gemäß der DSGVO</h2><p>Mit unserer E-Mail Marketing Software sind Sie auf der sicheren Seite, sowohl bei der Arbeit in unserem Tool als auch beim Newsletter Versand. Wir erfüllen höchste Sicherheitsstandards gemäß der DSGVO - E-Mail Marketing made in Germany! Darüber hinaus ist die Zustellbarkeit Ihrer Newsletter durch unser E-Mail Marketing Tool enorm hoch. Uns ist es wichtig, dass Sie Ihre Kunden (rechts-)sicher erreichen - ohne viel Aufwand.</p><p></p><h2>Sie brauchen Hilfe? Wir sind für Sie da!</h2><p>Egal ob schriftlich, telefonisch, per (Live-)Webinar, Video oder Helpcenter Artikel – wir helfen Ihnen weiter und sind für Sie da. Kontaktieren Sie z. B. gerne jederzeit unser Service Team, wenn Sie eine Frage haben oder nicht weiterwissen.</p><p></p><p>Wir freuen uns auf Sie! :-)</p><p></p><h2>Funktionen</h2><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; E-Mails erstellen mit unseren intuitiven Newsletter Editoren</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; E-Mail Template Generator: sekundenschnell Newsletter Vorlagen im eigenen Branding erstellen</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Auswahl an weiteren responsiven kostenfreien Newsletter Templates</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Segmente &amp; Tags für einen persönlichen und kundenorientierten Mailing Versand</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A/B Split-Tests für einen optimalen Newsletter Versand</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; dynamische Inhalte: mit nur einem Klick Produkte, Artikel, RSS-Feeds etc. im Newsletter einfügen</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; E-Mail Automationen mit THEA: Autoresponder, Follow-Up E-Mails, Warenkorbabbrecher E-Mails, Transaktionalmails u.v.m.</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Rechtssichere Double Opt-In Anmelde- und Abmeldeformulare</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Umfangreiches und aussagekräftiges Reporting- und Tracking in Echtzeit</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; DSGVO-konform, höchsteSicherheitsstandards, E-Mail Marketing Made in Germany</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Maximale und sichere Zustellbarkeit</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kostenfreier telefonischer &amp; schriftlicher Support, Helpcenter und (Live) Online-Seminare</p><p></p><p>Wenn Sie Fragen haben oder Hilfe benötigen, können Sie gerne eines unserer Online-Seminare besuchen oder unser Service-Team kontaktieren. Dies hilft Ihnen jederzeit gerne weiter und ist für Sie da.</p><p></p><h2>Was sind Ihre Vorteile?</h2><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Sie wählen aus, welcher Kunde in welche Empfängerliste übertragen wird</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ihre Empfängerdaten werden immer automatisch aktualisiert und können für Newsletter genutzt werden</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All Ihre Produkte mit Beschreibungen, Preisen und Bildern können mit wenigen Klicks in Ihre E-Mails eingefügt werden</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Einfaches Einfügen von rechtssicheren Newsletter Anmeldeformularen auf Ihren Shopseiten</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; E-Mail Marketing Automationen: Warenkorbabbrecher automatisch per Newsletter anschreiben u. v. m.</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All-in-one Tool: Versand von Transactional E-Mails</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Profitieren Sie von einer maximalen Zustellbarkeit, höheren Öffnungsraten, mehr Klicks und mehr Conversions!</p><p></p><h2>Was Ihre Kunden schätzen werden</h2><p>Ihre Kunden</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Freuen sich über Ihre Fashion Trends und heißesten Deals</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Warten auf Ihre neuesten Rezepte und Food Angebote</p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Kaufen das neue Sofa beim Jubiläums-Verkauf</p><p></p><p></p><p>•&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Werden rechtzeitig daran erinnert, dass z. B. der Black Friday mit tollen Rabatten und Aktionen vor der Tür steht</p><p></p><h2>Über CleverReach:</h2><p><i></i></p><p>CleverReach ist eine der führenden Lösungen für E-Mail Marketing. Kommunikation ist unsere Leidenschaft: Wir wollen Menschen erreichen und dasselbe auch unseren Kunden ermöglichen. Deshalb stellen wir unsere einfache und intuitive E-Mail Marketing Software bereit.</p><p></p><p></p>","installationManual":"<h2></h2><h2>So installieren Sie das CleverReach\nNewsletter-Plugin für Ihren Shopware Store:</h2><p>1. Klicken Sie auf den grünen \"In den\nWarenkorb\" Button und gehen Sie weiter \"zur Kasse\". Loggen Sie\nsich bitte in Ihren Shopware Account ein, falls Sie es noch nicht sind.</p><p></p><p>2. Klicken Sie jetzt auf\n\"Zahlungspflichtig bestellen\" – keine Sorge, die Erweiterung ist und\nbleibt kostenlos.</p><p></p><p>3. Nach dem Download finden Sie das Plugin in\nIhrer Shopware-Menüleiste unter \"Marketing\".</p><p></p><p>4. Klicken Sie auf \"CleverReach\" und\nes öffnet sich ein neues Fenster mit der Erweiterung.</p><p></p><p>5. Erstellen Sie sich jetzt gerne einen neuen\nCleverReach-Account oder loggen Sie sich in Ihren bestehenden Account ein.\nDanach startet die Installation.</p><p></p><p>Mehr Informationen finden Sie auf <a href=\"https://www.cleverreach.com/de-de/newsletter-integrationen/e-commerce/shopware/\" target=\"_blank\" rel=\"noreferrer noopener\">cleverreach.com/integrationen/shopware/</a>.</p><p></p><p>\n\n\n\n\n\n\n\n\n\n\n\n</p><p>Wir wünschen Ihnen viel Spaß und viel Erfolg\nmit unserem Plugin.</p><p></p>","shortDescription":"Erstellen und versenden Sie schnell & einfach Newsletter an Ihre Kunden mit unserer E-Mail Marketing Lösung. Stärken Sie Ihre Beziehung und steigern Sie Ihre Verkäufe.","highlights":"Auswahl einer bestehenden Empfängerliste oder Erstellung einer neuen Liste in CleverReach\nEmpfängerauswahl: Newsletter Empfänger, Kaufkunden oder sonstige Kontakte – Sie entscheiden, wer übertragen wird\nÜbertragung der Bestelldaten und persönlichen Daten Ihrer Kunden\nNutzung von rechtssicheren Anmeldeformularen für eine Newsletter Anmeldung gemäß der DSGVO\nE-Mail Marketing Automationen (Autoresponder, Warenkorbabbrecher-Mails, Transaktionsmails u.v.m.)","features":"Übertragung Ihrer Kunden und -daten: Sie entscheiden, welche Kunden in welche Empfängerliste und mit welchen Daten synchronisiert werden\nE-Mails erstellen mit unseren intuitiven Newsletter Editoren\nE-Mail Template Generator\nResponsive, kostenfreie Newsletter Vorlagen\nDouble-Opt-In An- und abmeldeformulare\nVollautomatische E-Mail Automationen - Autoresponder, Warenkorbabbrecher-E-Mails, Transactional Mails, Follow-Ups uvm.\nSegment Erstellung: Filtern Sie Ihre Empfänger nach Informationen oder Tags\nDynamische Inhalte: Fügen Sie mit nur einem Klick Ihre Shop Produkte in den Newsletter ein\nHöchste Zustellbarkeit\nUmfassendes Reporting & Tracking\nAutomatisches Bounce- und Abmeldemangement\nBlacklist-Funktion\nDSGVO-konform, höchste Sicherheitsstandards, E-Mail Marketing Made in Germany\nKostenfreier Support & Online-Seminare\nFür jeden immer den richtigen Tarif: jederzeit wechselbar, ohne Vertragslaufzeit"},{"id":15966,"name":"CleverReach® - Email Marketing for your Shopware 6 Shop","description":"<h2></h2><h2>Simply Boost Your Sales with CleverReach – Your Email Marketing Solution</h2><p>Take your online business\nto the next level and connect your Shopware 6 shop with CleverReach.</p><p></p><p>Create professional newsletters with just\na few clicks to keep your customers informed about your latest offers and to\nboost your sales.&nbsp;</p><p></p><p>Create email marketing\nautomation workflows, e.g. to remind customers of their abandoned shopping cart\nin your online store. &nbsp;</p><p></p><p>CleverReach is your all-in-one email\nmarketing solution. We help you grow your business and strengthen your customer\nrelations.&nbsp;</p><p></p><p><i>Exclusively for\nShopware customers:<b>&nbsp;Get 20% off your CleverReach plan for 3 months!</b>&nbsp;The\ndiscount is automatically added to your shopping cart when creating a new\naccount.</i></p><p></p><h2>The Free Plugin Automatically Transfers\nYour Shopware Customers to Our Email Marketing Tool&nbsp;</h2><p></p><p></p><p>Newsletter subscribers, buyers or other\ncontacts – you decide who you want to transfer. Also define the recipient list\nyou want to shift your customers to. You can also automatically create a new\nlist for Shopware customers.&nbsp;&nbsp;&nbsp;</p><p></p><p>Using our plugin and signing up for our\nemail marketing tool is free of charge. Import up to 250 recipients and send up\nto 1,000 newsletters per month in our free plan. We offer the right price plan\nwithout a contract term for everyone – our plans can be changed or cancelled on\na monthly basis.&nbsp;</p><p></p><h2>Synchronize and Use Order Data in\nReal-Time</h2><p></p><p></p><p>Select the customer data&nbsp; you want to\nuse for your email marketing. &nbsp;Synchronize for example:</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\ndate of birth\n– congratulate your customers personally with a discount code via email</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\npurchase\ndetails – draw your recipients‘ attention to your latest and greatest offers</p><p></p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nlast order\ndate – reengage your customers who haven’t bought anything in your shop for a\nwhile</p><p></p><p>Use tags and segments to send targeted and\npersonalized newsletters to your customers. It’s required that your recipients\nhave explicitly consented to receive your emails in accordance with the GDPR.\n&nbsp;CleverReach helps you get the legally compliant consent.</p><p></p><p>Our plugin works bi-directionally – i.e.\nthe transfer of data takes place in both directions between the two\nsystems.&nbsp;</p><p></p><h2>Quickly and Easily Create Professional\nEmails with Our Intuitive Drag &amp; Drop Newsletter Editor</h2><p></p><p></p><p>Use one of our free email templates and\ncreate a newsletter with your design with just a few clicks. Our Email Template\nGenerator allows you to create an email with your logo, colors etc. in a flash.\nInsert your products in your newsletter with various predesigned layout\nelements via drag &amp; drop.&nbsp;&nbsp;&nbsp;</p><p></p><p>You neither need any programming skills\nnor download any extra software.&nbsp;&nbsp;&nbsp;</p><p></p><h2>Use Double Opt-In Signup Forms to Collect\nNew Subscribers in Compliance with the GDPR</h2><p></p><p></p><p>A GDPR-compliant newsletter signup form is\nautomatically created for your selected recipient list – you can integrate it\non your shop pages. This way you win more subscribers for your newsletter and\ngrow your business even faster.&nbsp; &nbsp;</p><p></p><h2>Email Marketing Automation: Send Automated\nNewsletters, Abandoned Cart Reminders, Transactional Emails and Much More</h2><p></p><p></p><p>On your customer’s birthday, after they\nabandoned their shopping cart or placed an order in your shop – there are\nendless possibilities for using email marketing automation.&nbsp;&nbsp;&nbsp;</p><p></p><p>Create newsletter\nseries with content your customers really need and care about. Email automation\nhelps you save valuable time and, at the same time, boost your sales and\nstrengthen customer relations.</p><p></p><h2>Reports &amp; Tracking in Real-time:\nAnalyze and Optimize Your Newsletter Delivery</h2><p></p><p></p><p>As soon as you send out your email,\nreporting and tracking starts automatically. Analyze your newsletter in terms\nof the most important key figures (e.g. open, clicks) and test e.g. different\nsending times. The evaluation helps you get to know your customers even better\nand take your email marketing to the next level.&nbsp;</p><p></p><h2>Highest Deliverability &amp; Data Security\nAccording to GDPR</h2><p></p><p></p><p>You’re always on the safe side with our\nemail marketing software – both when working with our tool and when sending out\nnewsletters. We fulfill the highest security standards in accordance with the\nGDPR - Email Marketing made in Germany! Additionally, the deliverability of\nemails you send via our email marketing tool is enormously high. We care about\nyour emails reaching your customers in a safe way – without much effort.&nbsp;</p><p></p><h2>Need Help? We’re There for You!</h2><p></p><p></p><p>Via email, phone, video or help center\npost – we are there to help and support you. Contact our service team at any\ntime if you have a question or need further assistance.&nbsp;</p><p></p><p>We’re looking forward\nto welcoming you! :-)</p><p></p><h2>Features&nbsp;</h2><p></p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nCreate emails\nwith our intuitive newsletter editors</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nEmail Template\nGenerator: create custom branded newsletter templates within seconds</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nSelection of\nfree and responsive newsletter templates</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nSegments &amp;\nTags for personalized and customer-oriented emails</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nA/B Split\nTests for sending perfect emails</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nDynamic\ncontent: insert products, posts, RSS feeds etc. in your newsletter with just\none click</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nEmail\nAutomation with THEA:&nbsp; Autoresponders, follow-up emails, abandoned cart\nemails, transactional emails and much more</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nLegal\nDouble-Opt-in signup and unsubscribe forms</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nExtensive and\ninformative reporting and tracking in real-time</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nGDPR-compliant,\nhighest security standards, Email Marketing Made in Germany</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nmaximum and\nsafe deliverability</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nFree phone\n&amp; email support, help center</p><h2>What are Your Advantages?</h2><p></p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nYou select the\ncustomers you want to transfer to your recipient lists</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nYour recipient\ndata are automatically updated and ready to use for your emails</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nInsert all\nyour products with description, prices &amp; images with just a few clicks in\nyour newsletter</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nSimple\nintegration of legal newsletter signup forms on your shop pages</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nEmail\nMarketing Automation: Send abandoned cart reminders and much more</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nAll-in-one\nTool: sending transactional emails</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nBenefit from\nmaximum deliverability, higher open rates, more clicks &amp; more conversions!</p><p></p><h2>What Your Customers Will Love</h2><p></p><p></p><p>Your customers</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nare excited to\nget your fashion trends and hottest deals</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nare waiting\nfor your latest recipes and food offers</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nwant to buy\ntheir new couch on your special sale&nbsp;</p><p></p><p>·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\nare reminded\non time that amazing Black Friday’s just around the corner with amazing\ndiscounts and offers waiting for them&nbsp;</p><p></p><p><b></b></p><h2></h2><h2>About CleverReach:</h2><p></p><p></p><p>CleverReach is one of the leading email marketing\nsolutions. Communication is our passion: We want to reach people and help our\ncustomers do the same. That’s why we provide our simple and intuitive email\nmarketing software.&nbsp;</p><p></p><p></p><p></p>","installationManual":"<h2><b>How to install the\nCleverReach Newsletter Plugin for your Shopware 6 Store:</b></h2><p></p><p></p><p>1. Click on the green\n“Add to Cart“ button and proceed to the “Checkout“. Please log into your\nShopware account if you haven’t already done so.</p><p></p><p>2. Click on “Buy“ –\ndon’t worry, the plugin is and remains free of charge. </p><p></p><p>3. After the download,\nyou can find the plugin in the Shopware menu bar in the \"Marketing\"\ntab.</p><p></p><p>4. Click\non “CleverReach” and a new plugin screen pops up.</p><p></p><p>5. Create a new\nCleverReach account or log into the one you already have. Danach startet die Installation.</p><p></p><p>For more information\nvisit <a href=\"https://www.cleverreach.com/en-de/newsletter-integrations/ecommerce/shopware/\" target=\"_blank\" rel=\"noreferrer noopener\">cleverreach.com/integrations/shopware/</a></p><p></p><p>Enjoy working with our\nplugin! </p><p></p><p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</p><p></p><p> </p><p></p>","shortDescription":"Create and send newsletters to your customers with our email marketing solution. Reach out to your customers, strengthen your relation and boost your sales.","highlights":"Select an existing recipient list or create a new one in CleverReach \nSelect recipients you want to transfer – newsletter subscribers, buyers or other contacts \nTransfer order details and personal customer data \nUse legal signup forms in accordance with the GDPR \nEmail Marketing Automation (Autoresponder, Abandoned Cart Emails, Transactional Emails and more)","features":"Transfer customer data: you decide who of your customers and data you want to synchronize\nCreate emails with our intuitive newsletter editors\nEmail Template Generator\nResponsive and free email templates\nDouble-Opt-In signup and unsubscribe forms\nEmail Automation - Autoresponder, Abandoned Cart Emails, Transactional Emails and more\nCreate segments: Filter your recipients by details or tags\nDynamic content: Insert your shop products in your newsletter with just one click  \nHighest deliverability\nExtensive Reporting & Tracking\nAutomated Bounce and Unsubscribe Management\nBlacklisting\nGDPR-compliant, highest security standards, Email Marketing made in Germany\nFree support\nThe right price plan for everyone: switch your plan at any time, no contract term"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157845,"bookingKey":"Crsw653619533432","bookingText":"CleverReach® - Newsletter Marketing for your Shopware 6 shop","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHSzE2i","preview":true,"priority":0,"id":93234},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpn8EqwL","preview":false,"priority":0,"id":93235},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phps1dsTy","preview":false,"priority":0,"id":93236},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnQ76sG","preview":false,"priority":0,"id":93237},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSpUElv","preview":false,"priority":0,"id":93238},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqHqtxF","preview":false,"priority":0,"id":93239},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOImbqk","preview":false,"priority":0,"id":93240},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3zGLpL","preview":false,"priority":0,"id":93241},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEIlGBQ","preview":false,"priority":0,"id":93242}],"comments":[{"authorName":"VI-ARISE Communication","text":"Unser Datenbankserver lief die ganze Zeit unter hoher Last. Kunden konnten sich teilweise nichtmal einloggen, da das 2-Minuten Timeout gegriffen hat.\n\nBei der Investigation ist uns aufgefallen, dass auf die Datenbank durchgängig Abfragen folgender Art liefen:\n\nSELECT * FROM `cleverreach_entity` WHERE `shopware_id`= ...\n\nUPDATE `cleverreach_entity` SET `type` = 'QueueItem', `index_1` = 'completed', `index_2` ...\n\nDeaktivieren des CleverReach-Plugins war die Lösung.","headline":"Plugin lastet DBMS komplett aus","creationDate":{"date":"2022-12-21 12:16:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Hendrik Schmidtpott","text":"Von Anfang an hatten wir (bei ca. 52 k. NL-Empfängern) Synchronisationsprobleme, trotz einer leistungsstarken Serverstruktur.  In der neuesten Version läuft das zwar \"etwas\" besser, aber jetzt verschwinden plötzlich in CR selbst angelegte Segmente.  Was hier an Aufwand unsererseits aufgekommen ist, ist eigentlich nicht mehr tragbar. Die ganze Plugin-Umsetzung ist eine Blackbox, die Serviceangebote und Servicezeiten erinnern an eine Verwaltung. Der Support über Shopware-Tickets ist leider auch wenig hilfreich und lösungsorientiert. Für Premium-Kunden, die seit fast zehn Jahren bei CR sind und viele tausend EUR Umsatz generiert haben, reicht das nicht .","headline":"Katastrophe","creationDate":{"date":"2022-12-08 17:59:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Christoph Röttele","text":"I likecleverreach a lot. I used it before and the basic sync works. \nWhat I did not get to work is the abandonned cart function .\nHowever, the biggest issue is that I had to turn the extension off in order to upgrade to latest shopware version. The developers need to be quicker to upgrade their plugin to kepp up with shopware realeses.","headline":"Some issues and slow with new releases","creationDate":{"date":"2022-11-21 11:50:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Lukas Völler","text":"Bis zu der Version 2.2.13 war in der FormRepository.php eine Sicherheitslücke in der Größe des Grand Canyons vorhanden, die von außen via SQL-Injection kompletten Zugriff auf die interne Shopware Datenbank erlaubte (Zugriff auf Kunden, Bestellungen etc.).\nMit dem Update auf 2.2.13 und der \"Optimierung\": Mehr Sicherheitsprüfungen eingebaut (z.B. Vermeidung von SQL-Injection), wurde die Lücke der Öffentlichkeit bekannt, was dazu geführt hat, dass erfolgreich Angriffe auf Webshops mit der vorherigen CleverReach-Version durchgeführt werden konnten.\nSchlecht kommuniziert und noch schlechter umgesetzt.\nDer Support und das Handling des Kundenbereichs sind ebenfalls dürftig.","headline":"Die Vermeidung von SQL-Injections ist eine \"Optimierung\"","creationDate":{"date":"2022-10-24 14:24:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Robert Wiegand","text":"","headline":"Version 2.2.0 funktioniert stabil","creationDate":{"date":"2021-10-26 08:04:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Christoph Nivelnkötter","text":"Als Newsletter Tool Super.\nDie Plugin Entwickler sollten eventuell ausgetauscht werden. Es kann nicht sein,  dass die Updates immer den Shopware Versionen hinterherhinken. Andere Plugins Hersteller schaffen es auch ihre Plugins aktuell zu halten und die sind oft komplexer.","headline":"Updates?","creationDate":{"date":"2021-08-25 12:16:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Simon Wohler","text":"Die Erweiterung lässt sich nicht installieren, weil sie nicht aktuell ist. Bei der Nachfrage nach einem Termin wird mann vertröstet mit «das kann ich schwer sagen». \nFunktionalität, Benutzbarkeit und Dokumentation kann ich nicht bewerten, da die Erweiterung nicht installierbar ist. Deshalb gebe ich mit 3 Sternen neutral ab.","headline":"Support kann «schwer sagen» wann die Entwickler Zeit haben","creationDate":{"date":"2021-08-25 10:53:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Marvin Lindemann","text":"Installation und Einrichtung funktionierte ohne Probleme. Die Schnittstelle zum abgleichen der Newsletterempfängerkontakte funktioniert ohne Probleme, was andere Newsletteranbieter leider noch nicht geschafft haben. Das Angebot für Dokumentation und Schulungsvideos für die Handhabung des Tools finde ich super.","headline":"Für mich eines der besten Newsletterplugins für Shopware 6 aktuell","creationDate":{"date":"2021-04-12 19:06:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Gavriil Foulidis","text":"Nachdem wir mit version 2.0.1 schwere Probleme hatten, läuft es ab Version 2.1.1 wie erwartet. Für die alte Version hatten wir eine schlechte Bewertung abgegeben, woraufhin sich der Support proaktiv an uns wendete um uns zu helfen und das Problem zu beheben. Ein Lob dafür! Kleine Einschränkungen sehe ich in der Bedienbarkeit. Einen Stern Abzug gibt es allerdings, weil sich das Plugin derzeit nicht in den Consent-Manager einbindet, was meiner Meinung angesichts des Datenflusses an Cleverreach notwendig wäre.","headline":"Ab Version 2.1.1 funktioniert es wie erwartet","creationDate":{"date":"2021-03-19 13:12:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"pluginuser","text":"Das Plugin hat meinen kompletten Checkout lahmgelegt. Außerdem ist die Einrichtung immer bei 13% stehen geblieben, sodass meine Kontakte nicht zu Cleverreach übertragen werden konnten.\n\nSupport antwortet nicht auf meine Mail.","headline":"Lieber erstmal Finger davon lassen!","creationDate":{"date":"2021-02-26 21:50:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2}],"ratingAverage":5,"label":"CleverReach® - Newsletter App für Shopware 6-Onlineshop","description":"<h2>Steigern Sie schnell und einfach Ihre Umsätze mit CleverReach - Ihrer E-Mail Marketing Lösung</h2><p>Bringen Sie Ihr Online-Business auf das nächste Level und verbinden Sie Ihren Shopware 5 Shop mit CleverReach.</p><p></p><p>Erstellen Sie mit nur wenigen Klicks professionelle Newsletter, um Ihre Kunden über die neuesten Angebote zu informieren und Ihre Umsätze zu steigern.</p><p></p><p>Legen Sie E-Mail Marketing Automationen an, um sie automatisch z. B. an ihren noch gefüllten Warenkorb zu erinnern.</p><p></p><p>CleverReach ist Ihre All-in-one E-Mail Marketing Lösung. Wir helfen Ihnen dabei, Ihr Unternehmen auszubauen und Ihre Kundenbeziehungen zu stärken.</p><p></p><p></p><p><i>Exklusiv für Shopware-Kunden: Sichern Sie sich <b>3 Monate lang einen 20% Neukunden-Preisvorteil</b> auf Ihren CleverReach-Tarif! Der Rabatt wird bei der Neu-Account-Erstellung automatisch für Sie hinterlegt.</i></p><p><i></i></p><h2>Das kostenlose Plugin überträgt automatisch Ihre Shopware Kunden zu unserem E-Mail Marketing Tool</h2><p>Ob Newsletter Empfänger, Kaufkunde oder sonstiger Kontakt – Sie entscheiden, wer übertragen wird. Legen Sie zudem fest, in welche Empfängerliste Ihre Kunden übertragen werden. Sie können auch eine neue Liste für Ihre Shopware Kunden automatisch anlegen.</p><p></p><p>Die Nutzung des Plugins ist kostenlos, genauso wie die Anmeldung bei unserem E-Mail Marketing Tool. Im kostenfreien Tarif können Sie bis zu 250 Empfänger importieren und 1.000 Newsletter im Monat versenden. Wir bieten für jeden den passenden Tarif an ohne Mindestlaufzeit - monatlich künd- und wechselbar.</p><p></p><h2>Kundeninformationen und Bestelldaten live synchronisieren und bestmöglich nutzen</h2><p>Wählen Sie aus, welche Kundendaten Sie für Ihr E-Mail Marketing nutzen möchten. Synchronisieren Sie zum Beispiel</p><p></p><p>•         das Geburtsdatum – gratulieren Sie Ihren Kunden persönlich mit einem Rabattcode per Newsletter</p><p></p><p>•         Kaufinformationen – machen Sie Ihre Empfänger auf Ihre passendsten und heißesten Angebote aufmerksam</p><p></p><p>•         Letztes Bestelldatum – reaktivieren Sie Ihre Kunden, die länger nichts mehr bei Ihnen im Shop gekauft haben</p><p></p><p>Nutzen Sie Tags und Segmente, um Ihre Kunden gezielt und persönlich per Newsletter anzusprechen. Voraussetzung ist, dass Sie die korrekte Einwilligung Ihrer Empfänger gemäß der DSGVO für den Newsletter Versand haben. CleverReach hilft Ihnen dabei, die rechtskonforme Einwilligung zu erhalten.</p><p></p><p>Unser Plugin arbeitet bidirektional - das bedeutet, es findet ein automatischer Datenabgleich und -austausch zwischen beiden Systemen statt.</p><p></p><h2>Erstellen Sie schnell und einfach professionelle Mailings mit unserem intuitiven Drag &amp; Drop Newsletter Editor</h2><p>Verwenden Sie eine unserer kostenlosen Newsletter Vorlagen und erstellen Sie mit nur wenigen Klicks ein Mailing in Ihrem Design. Dank unseres E-Mail-Template Generators können Sie noch schneller ein Mailing mit Ihrem Logo, Ihren Farben etc. erstellen. Durch diverse vorgefertigte Layout-Elemente können Sie per Drag &amp; Drop Ihre Artikel schnell und einfach in Ihren Newsletter einfügen.</p><p></p><p>Sie benötigen weder Programmierkenntnisse, noch müssen Sie eine extra Software herunterladen.</p><p></p><h2>Nutzen Sie Double Opt-In Anmeldeformulare für eine sichere Adressgewinnung gemäß der DSGVO</h2><p>Automatisch wird ein DSGVO konformes Newsletter Anmeldeformular für Ihre ausgewählte Empfängerliste erstellt, welches Sie auf Ihren Shopseiten einbinden können. So gewinnen Sie noch mehr Kunden für Ihren Newsletter Versand und können Ihr Business weiter ausbauen.</p><p></p><h2>E-Mail Marketing Automation: automatischer Versand von Newslettern, Warenkorb-Erinnerungen, Transaktionsmails u.v.m.</h2><p>Egal ob zum Geburtstag, nach dem Verlassen eines noch gefüllten Warenkorbs oder wenn eine Bestellung bei Ihnen im Shop eingegangen ist – die Möglichkeiten für E-Mail Marketing Automationen sind unendlich.</p><p></p><p>Erstellen Sie mit nur wenigen Klicks Newsletter Strecken für Ihre Kunden mit Inhalten, die sie interessieren und brauchen. Sie sparen durch E-Mail Automationen wertvolle Zeit - gleichzeitig steigern Sie Ihren Umsatz und stärken Ihre Kundenbindungen.</p><p></p><h2>Reports &amp; Tracking in Echtzeit: Analysieren und optimieren Sie Ihren Newsletter Versand</h2><p>Sobald Ihr Mailing versendet wird, startet automatisch das Reporting und Tracking. Analysieren Sie Ihren Newsletter Versand anhand der wichtigsten Kennzahlen (z. B. Öffnungen, Klicks) und testen Sie z. B. verschiedene Zeitpunkte für den Versand. Durch die Auswertung lernen Sie Ihre Kunden noch besser kennen und können Ihr E-Mail Marketing auf das nächste Level bringen.</p><p></p><h2>Höchste Zustellbarkeit &amp; Datensicherheit gemäß der DSGVO</h2><p>Mit unserer E-Mail Marketing Software sind Sie auf der sicheren Seite, sowohl bei der Arbeit in unserem Tool als auch beim Newsletter Versand. Wir erfüllen höchste Sicherheitsstandards gemäß der DSGVO - E-Mail Marketing made in Germany! Darüber hinaus ist die Zustellbarkeit Ihrer Newsletter durch unser E-Mail Marketing Tool enorm hoch. Uns ist es wichtig, dass Sie Ihre Kunden (rechts-)sicher erreichen - ohne viel Aufwand.</p><p></p><h2>Sie brauchen Hilfe? Wir sind für Sie da!</h2><p>Egal ob schriftlich, telefonisch, per (Live-)Webinar, Video oder Helpcenter Artikel – wir helfen Ihnen weiter und sind für Sie da. Kontaktieren Sie z. B. gerne jederzeit unser Service Team, wenn Sie eine Frage haben oder nicht weiterwissen.</p><p></p><p>Wir freuen uns auf Sie! :-)</p><p></p><h2>Funktionen</h2><p>•         E-Mails erstellen mit unseren intuitiven Newsletter Editoren</p><p></p><p>•         E-Mail Template Generator: sekundenschnell Newsletter Vorlagen im eigenen Branding erstellen</p><p></p><p>•         Auswahl an weiteren responsiven kostenfreien Newsletter Templates</p><p></p><p>•         Segmente &amp; Tags für einen persönlichen und kundenorientierten Mailing Versand</p><p></p><p>•         A/B Split-Tests für einen optimalen Newsletter Versand</p><p></p><p>•         dynamische Inhalte: mit nur einem Klick Produkte, Artikel, RSS-Feeds etc. im Newsletter einfügen</p><p></p><p>•         E-Mail Automationen mit THEA: Autoresponder, Follow-Up E-Mails, Warenkorbabbrecher E-Mails, Transaktionalmails u.v.m.</p><p></p><p>•         Rechtssichere Double Opt-In Anmelde- und Abmeldeformulare</p><p></p><p>•         Umfangreiches und aussagekräftiges Reporting- und Tracking in Echtzeit</p><p></p><p>•         DSGVO-konform, höchsteSicherheitsstandards, E-Mail Marketing Made in Germany</p><p></p><p>•         Maximale und sichere Zustellbarkeit</p><p></p><p>•         Kostenfreier telefonischer &amp; schriftlicher Support, Helpcenter und (Live) Online-Seminare</p><p></p><p>Wenn Sie Fragen haben oder Hilfe benötigen, können Sie gerne eines unserer Online-Seminare besuchen oder unser Service-Team kontaktieren. Dies hilft Ihnen jederzeit gerne weiter und ist für Sie da.</p><p></p><h2>Was sind Ihre Vorteile?</h2><p>•         Sie wählen aus, welcher Kunde in welche Empfängerliste übertragen wird</p><p></p><p>•         Ihre Empfängerdaten werden immer automatisch aktualisiert und können für Newsletter genutzt werden</p><p></p><p>•         All Ihre Produkte mit Beschreibungen, Preisen und Bildern können mit wenigen Klicks in Ihre E-Mails eingefügt werden</p><p></p><p>•         Einfaches Einfügen von rechtssicheren Newsletter Anmeldeformularen auf Ihren Shopseiten</p><p></p><p>•         E-Mail Marketing Automationen: Warenkorbabbrecher automatisch per Newsletter anschreiben u. v. m.</p><p></p><p>•         All-in-one Tool: Versand von Transactional E-Mails</p><p></p><p>•         Profitieren Sie von einer maximalen Zustellbarkeit, höheren Öffnungsraten, mehr Klicks und mehr Conversions!</p><p></p><h2>Was Ihre Kunden schätzen werden</h2><p>Ihre Kunden</p><p></p><p>•         Freuen sich über Ihre Fashion Trends und heißesten Deals</p><p></p><p>•         Warten auf Ihre neuesten Rezepte und Food Angebote</p><p></p><p>•         Kaufen das neue Sofa beim Jubiläums-Verkauf</p><p></p><p></p><p>•         Werden rechtzeitig daran erinnert, dass z. B. der Black Friday mit tollen Rabatten und Aktionen vor der Tür steht</p><p></p><h2>Über CleverReach:</h2><p><i></i></p><p>CleverReach ist eine der führenden Lösungen für E-Mail Marketing. Kommunikation ist unsere Leidenschaft: Wir wollen Menschen erreichen und dasselbe auch unseren Kunden ermöglichen. Deshalb stellen wir unsere einfache und intuitive E-Mail Marketing Software bereit.</p><p></p><p></p>","installationManual":"<h2></h2><h2>So installieren Sie das CleverReach\nNewsletter-Plugin für Ihren Shopware Store:</h2><p>1. Klicken Sie auf den grünen \"In den\nWarenkorb\" Button und gehen Sie weiter \"zur Kasse\". Loggen Sie\nsich bitte in Ihren Shopware Account ein, falls Sie es noch nicht sind.</p><p></p><p>2. Klicken Sie jetzt auf\n\"Zahlungspflichtig bestellen\" – keine Sorge, die Erweiterung ist und\nbleibt kostenlos.</p><p></p><p>3. Nach dem Download finden Sie das Plugin in\nIhrer Shopware-Menüleiste unter \"Marketing\".</p><p></p><p>4. Klicken Sie auf \"CleverReach\" und\nes öffnet sich ein neues Fenster mit der Erweiterung.</p><p></p><p>5. Erstellen Sie sich jetzt gerne einen neuen\nCleverReach-Account oder loggen Sie sich in Ihren bestehenden Account ein.\nDanach startet die Installation.</p><p></p><p>Mehr Informationen finden Sie auf <a href=\"https://www.cleverreach.com/de-de/newsletter-integrationen/e-commerce/shopware/\" target=\"_blank\" rel=\"noreferrer noopener\">cleverreach.com/integrationen/shopware/</a>.</p><p></p><p>\n\n\n\n\n\n\n\n\n\n\n\n</p><p>Wir wünschen Ihnen viel Spaß und viel Erfolg\nmit unserem Plugin.</p><p></p>","version":"2.3.0","changelog":[{"version":"2.3.0","text":"<p></p><ul><li>Add compatibility with Shopware 6.5</li></ul><p></p>","creationDate":{"date":"2023-05-08 10:22:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.23","text":"<ul><li>Fix issue with assigning wrong tags to contacts on customer signup.</li><li>Fix issue with assigning wrong tags when contacts subscribe to the newsletter.</li></ul>","creationDate":{"date":"2023-05-10 09:53:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.22","text":"<p></p><ul><li>Fix: During the compatibility check for Shopware 6.4.20.1 it was found that an incorrect purchase customer tag was assigned - This has been corrected.</li></ul>","creationDate":{"date":"2023-04-25 11:43:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.21","text":"<p></p><ul><li>Fix: The method \"CustomerSubscriber\" now checks if the ID from the payload is available before it is executed.</li></ul>","creationDate":{"date":"2023-04-24 10:07:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.20","text":"<ul><li></li><li>Fix: When a new tag for newsletter recipients was created in Shopware 6, no segment was created in CleverReach. In addition, the affected newsletter recipients were not assigned to the segment. This has been fixed.</li><li>Fix: When a new tag was added to a customer in Shopware 6, it was not visible in CleverReach. This has been fixed.</li><li>Fix: When a tag was deleted from a newsletter recipient in Shopware, the segment was not deleted in CleverReach with the respective tag - This has been fixed.</li></ul>","creationDate":{"date":"2023-03-29 10:25:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.19","text":"<ul><li>Fix: Due to incorrect validation of invalid email addresses, the \"Number of orders\" field was set to 0 - This has been corrected.</li><li>Fix: When the email address was changed in the store, the previous email address was still active - This was corrected</li></ul>","creationDate":{"date":"2023-03-14 12:49:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.18","text":"<ul><li>Fix: When triggering the shopping cart abandonment mail, there were incorrect entries in the logging \"Value is not a valid UUID\" in certain constellations. In this case it was about a coupon code. The problem has been solved so that the non-product related shopping cart items are ignored.</li></ul>","creationDate":{"date":"2022-11-22 10:43:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.17","text":"<ul><li>Optimization: The selection of newsletter recipient data for synchronization has been optimized</li></ul>","creationDate":{"date":"2022-11-07 10:46:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.16","text":"<ul><li></li><li>Several security optimizations</li><li>Optimization: The triggering of the shopping cart abandonment mail in certain constellations was fixed</li></ul>","creationDate":{"date":"2022-10-25 10:17:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.15","text":"<p></p><ul><li>Optimization: The images in the product search are now transferred to the email editor in 600 px instead of 290 px - In addition, the new editor automatically adjusts the image size based on the layout<br /></li></ul><p></p>","creationDate":{"date":"2022-09-27 13:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.14","text":"<ul><li>Fix: Removed unnecessary quotes for database actions.<br /></li></ul>","creationDate":{"date":"2022-08-22 16:34:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.13","text":"<ul><li>Fix: The transfer of order data has been improved</li><li>Optimization: More security checks implemented</li></ul>","creationDate":{"date":"2022-08-16 17:52:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.12","text":"<ul><li>Bugfix: An error while sending the abandoned cart mails was fixed<br /></li></ul>","creationDate":{"date":"2022-07-27 12:26:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.11","text":"<ul><li>Optimization in product search: Dynamic products of Shopware variant products with inherited images are now supported<br /></li></ul>","creationDate":{"date":"2022-07-18 11:06:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.10","text":"<ul><li>Rebranding: Adding new CleverReach logo and plugin icon.<br /></li></ul>","creationDate":{"date":"2022-07-13 16:31:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.9","text":"<ul><li></li><li>Optimization: Change the session handling for a canceled shopping cart.</li><li>Fix: Due to a previous update the data field \"Last order date\" was set with the wrong date, now the last order date is stored correctly again</li></ul>","creationDate":{"date":"2022-05-10 14:24:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.8","text":"<ul><li>Optimization: Change storefront routes to API routes<br /></li></ul>","creationDate":{"date":"2022-03-21 20:09:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.7","text":"<ul><li>Optimization: email addresses are checked for the correct format, and invalid email addresses are filtered out during import</li></ul>","creationDate":{"date":"2022-02-02 18:13:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.6","text":"<ul><li>Optimization: Removing non-valid email from initial synchronization.<br /></li><li>Optimization: Added translation support for German Switzerland and Austria.</li></ul>","creationDate":{"date":"2022-01-26 11:08:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.5","text":"<ul><li>Optimization: Fix deleting cart record</li></ul>","creationDate":{"date":"2021-12-22 20:21:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.4","text":"<ul><li>Optimization: Check if the session has started before accessing it in order save event</li></ul>","creationDate":{"date":"2021-12-21 17:20:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.3","text":"<ul><li>Optimization: Increased product search image size from 190px to 290px in the new CleverReach email editor<br /></li><li>Optimization: Return empty array if no customer id provided on address changed event</li></ul>","creationDate":{"date":"2021-12-16 01:15:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"<ul><li>Optimization: Added async request option through support console.</li></ul>","creationDate":{"date":"2021-11-30 18:09:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<ul><li>Optimization: Updating the plugin via the command line (CLI) works now</li><li>Optimization: Product categories are created as tags in CleverReach when a product purchase is made. There was an error here that did not read the main category and transfer it to CleverReach. The problem was solved</li><li>Optimization: Changed cURL HTTP/2 to HTTP1/1 to transfer data from Shopware 6 to CleverReach</li><li>Optimization: The event \"Newsletter subscription\" is skipped if the ID is not provided</li></ul>","creationDate":{"date":"2021-11-16 12:06:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<ul><li>New feature: The plugin includes from this version an overview of abandoned carts (If the abandoned cart feature is enabled in the CleverReach plugin). In the backend, the overview can be found via \"Orders -&gt; Abandoned Carts\". Here you can view all open or completed shopping carts and the status of CleverReach \"Abandoned cart emails\" sent via our THEA Marketing Automation. The overview includes scheduled time, sender time, amount, email address, store, recovery status, and other features. In addition, the direct and immediate sending of an abandoned cart email can be started, or the sending can be canceled. A search &amp; filter function can also be used to filter directly by email addresses or time periods.</li><li>Plugin compatibility with Shopware 6.4.3.1</li><li>Optimization: Improved the performances by cleaning up the plugin tables.</li></ul>","creationDate":{"date":"2021-08-25 13:17:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.6","text":"<ul><li>Fix: Fixed birthday for the buyer.<br /></li><li>Fix: Fixed issue with the empty recipient address.</li></ul>","creationDate":{"date":"2021-07-28 19:54:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"<ul><li>Optimization: Added compatibility with Shopware 6.4.0.</li></ul>","creationDate":{"date":"2021-05-10 14:29:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"<ul><li>Optimization: Added compatibility with Shopware 6.4.0 RC1.<br /></li><li>Fix: Fixed issue with adding duplicated segments.</li></ul>","creationDate":{"date":"2021-04-26 14:36:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"<ul><li>New feature: Added mailing id tracking when using the abandoned cart recovery button.<br /></li><li>Fix: Fixed issue with cart error.<br /></li><li>Optimization: Switched logic to first activate the recipient and then set tags.</li></ul>","creationDate":{"date":"2021-04-13 12:33:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<ul><li>Optimization: Add support for CleverReach forms responsive design.<br /></li><li>Fix: Adjusted sending order item id for purchase data.<br /></li><li>Fix: Register services on plugin install and update.</li></ul>","creationDate":{"date":"2021-04-05 13:23:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<ul><li>Optimization: Send only assigned customer tags as tags on CleverReach.</li><li>Fix: Adjusted order editing using Shopware API.</li><li>Optimization: Added compatibility with Shopware DEV version.</li></ul>","creationDate":{"date":"2021-03-22 15:42:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<ul><li>New feature: Send abandoned cart emails automatically with our Marketing Automation. The new plugin tab “Abandoned Cart” is available for you. You can create your own automations per store and increase your sales with this reminder email. You can find instructions on how to do this here: https://support.cleverreach.de/hc/en-us/articles/360020020140 - <i>Note: The prerequisite for receiving abandoned cart emails is a double opt-in - This ensures complete DSGVO compliance.</i><br /></li></ul>","creationDate":{"date":"2021-03-09 16:18:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul><li>New feature: The user can decide who is actively transmitted: Before the initial import of the data you can choose whether only newsletter recipients, buyers or other contacts should be transferred. You can also select all of them, please note the DSGVO guidelines. The data are created in CleverReach as active recipients in the group “Shopware”. For detailed instructions on the new procedure, please visit https://support.cleverreach.de/hc/en-us/articles/360013571280 - The initial synchronization can be changed later in the plugin via the plugin settings</li><li>Optimization: Complete bidirectional interface (Shopware &lt;-&gt; CleverReach)\nThe data is synchronized in both directions. If the address in the CleverReach data set changes, this is also transferred to Shopware. Unsubscriptions in the CleverReach system are also transferred to Shopware, as before, and set the customer in Shopware to “email status = inactive”. Example: If the recipient has added, updated, subscribed or unsubscribed in CleverReach, these changes are forwarded to Shopware. The other way round, from Shopware to CleverReach in the same way.</li><li>New feature: Use of CleverReach forms within the plugin, which can be easily added to any page by shortcode. A manual for this can be found here: https://support.cleverreach.de/hc/en-us/articles/360018716619</li><li>New feature: The new data fields “Count of orders &amp; total spent” are automatically created and filled with data. Example: With the data field “Count of orders” I can filter how many orders a recipient has placed in order to specifically address recipients who have placed more than 50 orders. With the field “total spent” I can write e.g. all recipients, who spent more than 1000 euro in my Shop.</li><li>New feature: Use product categories, product attributes &amp; product manufacturers as tags\nExample: A customer bought a black Adidas shoe from the category “Shoes” - In CleverReach, this results in the following tags for this recipient: Shopware_6-Category.Shoes // Shopware_6-Color.Black // Shopware_6-Manufacturer.Adidas - These tags can be used for a more targeted segmentation.</li><li>New feature: In addition to the existing product search, blog articles can now be easily dragged &amp; dropped from my shopware store into my CleverReach newsletter.\nNew user interface in the plugin: The plugin interface has been completely revised and is now displayed in the look &amp; feel of the Shopware UI. Additionally, the current CleverReach tariff is displayed and synchronization information is shown.</li><li>New feature within CleverReach, the tag-based email creation process. The so-called special tags (newsletter recipients, buyers and other contacts) can be selected easily and quickly for email delivery, e.g. to send a mailing to all buyers or newsletter recipients. Find out more: https://support.cleverreach.de/hc/en-us/articles/360013571280</li><li>Migration assistant from plugin version 1.x.x to 2.0.0</li><li>Existing CleverReach users using the shopware integration will be migrated to the new version without any need to log in again. Within the migration process, all shopware customers who have activated the newsletter will automatically be transferred to CleverReach as active recipients. Other recipient groups (purchase customers or contacts) are neither synchronized nor deleted in CleverReach. The user can activate the synchronization of contacts or purchasing customers under the tab “Plugin Settings” at any time after the migration.</li></ul>","creationDate":{"date":"2021-02-01 11:47:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.7","text":"<ul><li>Optimization: Support for Shopware version 6.3.4</li></ul>","creationDate":{"date":"2020-12-28 11:55:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"<ul><li>Optimization: Fix bug with setting Shopware context for events</li></ul>","creationDate":{"date":"2020-11-28 15:12:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"<ul><li>Optimization: Fix issue when the sales channel is not set on the customer entity.</li></ul>","creationDate":{"date":"2020-10-01 16:57:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"<ul><li>Optimization: Fixed issue with tags synchronization (only customer tags are sent).</li></ul>","creationDate":{"date":"2020-09-25 17:48:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<ul><li>Optimization: Fixed endless redirecting to the plugin page for shops with query parameters in their base URL.</li></ul>","creationDate":{"date":"2020-09-18 13:03:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p></p><ul><li>Optimization: Security updates</li></ul><p></p>","creationDate":{"date":"2020-09-03 13:30:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>Optimization: Fixed warnings of the static code analysis.</li></ul>","creationDate":{"date":"2020-08-12 15:20:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Optimization: Support for Shopware version 6.3</li></ul>","creationDate":{"date":"2020-08-11 17:32:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>Optimization: Security updates</li></ul>","creationDate":{"date":"2020-09-03 13:36:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p></p><ul><li>Add guest recipient tag for accountless customers</li></ul>","creationDate":{"date":"2020-06-28 00:35:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p></p><ul><li>Add support for version 6.1</li></ul>","creationDate":{"date":"2020-01-17 13:46:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>The initial version of the integration</li></ul>","creationDate":{"date":"2019-11-21 13:44:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Crsw653619533432","redirectToStore":false,"lowestPriceValue":0}