{"id":10162,"name":"ZeobvAbandonedCart","code":"zeobv63525113392","lastChange":{"date":"2023-07-19 14:15:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpX9tEpW","examplePageUrl":"","moduleKey":"ZeobvAbandonedCart","creationDate":{"date":"2019-10-26 09:23:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-10-28 11:29:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-01 13:58:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":15797,"name":"Verlassene Warenkorb (Abandoned Carts)","description":"<p>Im Durchschnitt brechen 70 % der Verbraucher ihre Online-Einkaufswagen ab.*&nbsp;</p><p>Sie legen häufig einen Artikel in ihren Einkaufswagen, verlassen das Geschäft aber, bevor sie den Kauf abgeschlossen haben. Untersuchungen haben gezeigt, dass drei E-Mails zum Verlassen des Warenkorbs den Umsatz um 69 % steigern, im Vergleich zu einer einzigen E-Mail.* Verhindern Sie also, dass Sie potenzielle Kunden verlieren, indem Sie ihnen mit unserem Abandoned Carts Plugin eine Erinnerungs-E-Mail schicken.</p><p><i>* Baymard Institut &amp; Oberlo (2022)</i></p><h2>Vorteile</h2><p><b>Kunden zur Rückkehr bewegen</b></p><p>Wie bereits erwähnt, bricht ein großer Prozentsatz der Kunden seinen Einkaufswagen ab. Online-Shops kämpfen oft damit, Wege zu finden, diese Kunden dazu zu bringen, ihre Einkäufe zu beenden. Unser Plugin für verlassene Warenkörbe erleichtert diesen Prozess und macht es für E-Commerce-Shops einfacher, Erinnerungs-E-Mails an Kunden zu senden, die ihren Einkaufswagen verlassen haben. Auf diese Weise können Sie sicherstellen, dass sie zurückkehren, um den Kauf ihrer gewünschten Artikel abzuschließen.</p><p><b>Erhalten Sie zusätzliche Kundeneinblicke</b></p><p>Das Plugin sorgt nicht nur dafür, dass verlorene Kunden zurückkehren, sondern bietet auch Vorteile für Sie und Ihr Unternehmen. Wir haben auch dafür gesorgt, dass Sie einen Einblick erhalten, welche und wie viele Artikel häufig in abgebrochenen Warenkörben enthalten sind. Außerdem können Sie mit der anpassbaren Vorlage sogar Rückmeldungen darüber erhalten, warum der Kunde seinen Einkaufswagen verlassen hat, was Ihnen noch mehr Möglichkeiten zur Verbesserung gibt!</p><p><b>Keine manuelle Arbeit mehr!</b></p><p>Niemand mag es, einen Großteil der Arbeit manuell zu erledigen. Aus diesem Grund haben wir so viel Automatisierung wie möglich implementiert. Die E-Mails werden automatisch nach einer bestimmten Zeit verschickt, wobei Ihre eigene konfigurierbare E-Mail-Vorlage verwendet wird. Das Einzige, was Sie tun müssen, ist, die E-Mail an Ihre Präferenzen anzupassen, einen Zeitplan einzurichten und anzugeben, wann die Warenkörbe automatisch gelöscht werden sollen.&nbsp;</p><h2>Immer noch nicht überzeugt?</h2><p>Mehr als 100 Shops haben das Abandoned Carts Plugin heruntergeladen oder verwenden es bereits, also verpassen Sie es nicht! Schauen Sie sich unten an, wie bestimmte Geschäfte es angewendet haben:</p><p><ul><li><a href=\"https://www.buiskoppelingshop.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.buiskoppelingshop.nl/</a></li><li><a href=\"https://www.celsisbv.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.celsisbv.nl/</a></li><li><a href=\"https://meine-uhr.de/\" target=\"_blank\" rel=\"noreferrer\">https://meine-uhr.de/</a></li><li><a href=\"https://www.juwelier-sandkuehler.de/\" target=\"_blank\" rel=\"noreferrer\">https://www.juwelier-sandkuehler.de/</a></li><li><a href=\"https://www.urban-pieces.com/\" target=\"_blank\" rel=\"noreferrer\">https://www.urban-pieces.com/</a></li></ul></p><h2>Kontakt</h2><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Kaufabwicklung geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin auswählen oder eine Nachricht an&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a>&nbsp;senden. Geben Sie unbedingt Ihre aktuelle Shopware-Version und die Version des Plugins an, das Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h2>Über uns</h2><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p>","installationManual":"<p></p><ul><li>Entpacken Sie die Zip-Datei in den Ordner custom/plugins oder verwenden Sie den Shopware-Plugin-Manager, installieren und aktivieren Sie das Plugin über die Kommandozeile oder über den Erweiterungsmanager in der Administration.&nbsp;</li><li>Nach der Installation und korrekten Aktivierung greifen Sie über die drei Punkte hinter dem Plugin-Namen in der Administration auf die Plugin-Konfiguration zu.</li><li>Wir stellen Ihnen eine Standard-E-Mail-Vorlage zur Verfügung, die als Basis für Ihre Abbruchmails dient. Diese finden Sie zwischen den anderen Mailvorlagen im Shopware Mailvorlagenmanager unter dem Namen \"Enter abandoned cart state: Reminded\". Sie können diese Vorlage nach Belieben bearbeiten, aber achten Sie darauf, dass Sie kein fehlerhaftes HTML erzeugen oder unzulässige Variablen verwenden. Die Abbruchmail verwendet die folgenden Template-Variablen: zeoAbandonedCart, salesChannel, customer. Beachten Sie, dass die Variable customer nicht garantiert mit Kundendaten gefüllt ist, da wir die E-Mail des Kunden so schnell wie möglich erhalten wollen. Dinge wie customer.firstName zu verwenden, ohne zu prüfen, ob der Kunde tatsächlich definiert ist, kann riskant sein und dazu führen, dass die Mail nicht gesendet wird.</li><li>Erstellen Sie zusätzliche Mail-Vorlagen mit dem Typ \"Enter abandoned cart state: Reminded\" für die Verwendung im Zeitplan für die Abbruchmails.</li><li>Konfigurieren Sie den Zeitplan anhand der Anleitung in der Plugin-Konfiguration.&nbsp;</li><li>Navigieren Sie zu Marketing &gt; Abgebrochene Warenkörbe, um einen Einblick in die Warenkorbkonversionen in Ihrem Shop zu erhalten und die ausgelösten Erinnerungen zu verfolgen.</li></ul><p></p>","shortDescription":"Holen Sie sich Conversions zurück, die Sie sonst mit diesem vollständig aufgegebenen Cart-Plugin verloren hätten. Es war noch nie so einfach, Erinnerungen an Ihre Kunden zu senden, um d","highlights":"Automatisch geplante Erinnerungs-E-Mails an abgebrochene Warenkörbe.\nEinblicke in die abgebrochenen Warenkörbe eines Webshops über eine Übersicht in der Administration.\nSteigern Sie Ihre Konversionen mit nur wenigen Klicks.\nBringen Sie Kunden zurück in Ihren Shop, um einen Kauf abzuschließen.\nWissen Sie, welche Artikel abgebrochen werden - mit Einblicken in die Warenkorbdetails.","features":"Automatische Erinnerungs-E-Mails an abgebrochene Warenkörbe.\nEinblicke in verlassene Warenkörbe über die Administration.\nVollständig anpassbare und konfigurierbare E-Mail-Vorlage.\nVollständige Kontrolle über den Zeitpunkt, ab dem ein Warenkorb als verlassen gilt und Benachrichtigungen geplant werden.\nKonfigurieren Sie eine Abklingzeit, um verlorene, verlassene Warenkörbe automatisch zu bereinigen.\nEinsicht in die Artikel eines jeden verlassenen Warenkorbs.\nKonversionsstatistiken direkt auf Ihrem Dashboard, basierend auf den gesendeten Mails und den Bestellungen aus abgebrochenen Warenkörben\nUnterstützung für mehrere Erinnerungen mit unserer einfachen, aber leistungsstarken Benachrichtigungsplanung."},{"id":15798,"name":"Abandoned Carts","description":"<p>On average, 70% of consumers abandon their online shopping carts.*&nbsp;</p><p>They frequently place an item in their shopping carts but leave the store before completing their purchase. Research showed that three cart abandonment emails increase revenue by 69% compare to a single one.* So prevent losing potential customers by sending them a reminder email using our Abandoned Carts plugin.</p><p><i>* Baymard Institute &amp; Oberlo (2022)</i></p><h2>Advantages</h2><p><b>Make customers return</b></p><p>As was mentioned above, a large percentage of consumers abandon their shopping carts. Online stores often struggle to find ways to make these people return to complete their respective purchases. Our Abandoned Carts plugin facilitates this process and makes it easier for e-commerce stores to send reminder emails to cart abandoners. By doing so, you can ensure that they will return to still complete the purchase of their desired items.</p><p><b>Get additional customer insights</b></p><p>Not only does the plugin make lost consumers return, but it also benefits you and your business. We have also made it so you get insight into which and how many items are often included in abandoned carts. Additionally, the customizable template enables you to even get feedback on why the consumer abandoned their carts, giving you even more opportunities for improvement!</p><p><b>No more manual labor!</b></p><p>No one likes to do the bulk of work manually. Because of this, we have implemented as much automation as possible. The emails will be sent out automatically after a certain amount of time has passed, using your own configurable email template. The only thing you have to do is customize your email to your preferences, set up a timing schedule, and indicate when the carts should automatically be cleared.&nbsp;</p><h2>Still not convinced?</h2><p>Over 100 unique stores have downloaded or are currently using the Abandoned Carts plugin, so make sure not to miss out! Check out below how particular stores have applied it:</p><p><ul><li><a href=\"https://www.buiskoppelingshop.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.buiskoppelingshop.nl/</a><br></li><li><a href=\"https://www.celsisbv.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.celsisbv.nl/</a>&nbsp;</li><li><a href=\"https://meine-uhr.de/\" target=\"_blank\" rel=\"noreferrer\">https://meine-uhr.de/</a>&nbsp;</li><li><a href=\"https://www.juwelier-sandkuehler.de/\" target=\"_blank\" rel=\"noreferrer\">https://www.juwelier-sandkuehler.de/</a>&nbsp;</li><li><a href=\"https://www.urban-pieces.com/\" target=\"_blank\" rel=\"noreferrer\">https://www.urban-pieces.com/</a>&nbsp;</li></ul></p><h2>Contact</h2><p>If something unexpected has happened or like to see an aspect of the checkout changed or improved, contact us via the Shopware support portal by selecting the Abandoned cart plugin or by sending a message to&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process it's best to provide as much information as possible or provide us with access to your test environment. This way we can reproduce the issue for ourselves and come up with a solution quicker.</p><h2>About us</h2><p>The team of professionals at Zeo has over 15 years of experience in both online marketing and web development. With this experience, we have helped over 80 clients in 11 different countries, both B2C and B2B. Several new e-commerce shops have been built from the ground up using the Shopware platform and Zeo’s plugins. Notable customers of ours include Simon Lévelt, 24Kae, ABN AMRO Bank, and Allianz Global Assistance. For more information about us, visit&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p>","installationManual":"<p><ul><li>Extract the zip file in the custom/plugins folder or use the Shopware plugin manager, install and activate the plugin using the command line or via the extension manager in the administration.&nbsp;</li><li>Once installed and activated correctly access the plugin configuration via the three dots behind the plugin name in the administration.</li><li>We provide a default email template functioning as a basis for your abandoned cart mail communication. This can be found between the other mail templates in the Shopware mail template manager under the name \"Enter abandoned cart state: Reminded\". Feel free to edit this template as you like, but be wary for creating corrupt HTML or using illegal variables. The abandoned cart mail makes use of the following template variables: zeoAbandonedCart, salesChannel, customer. Note that the customer variable is not guaranteed to be filled with customer data since we aim to get the customer's email as quickly as possible. Using things like customer.firstName without checking if the customer is actually defined can be risky and cause the mail to not be sent.</li><li>Create extra mail templates using the \"Enter abandoned cart state: Reminded\" type for use in the abandoned cart mail scheduling.</li><li>Configure the time schedule using the instruction found in the plugin configuration.&nbsp;</li><li>Navigate to Marketing &gt; Abandoned Carts to gain insight into cart conversions within your store and keep track of reminders being triggered.</li></ul></p><p><br></p>","shortDescription":"Get back conversions that you would otherwise have lost with this complete abandoned cart plugin. Sending reminders to your customers to finish their checkout has never been easier.","highlights":"Automatic scheduled abandoned cart reminder emails.\nInsights in a webshop's abandoned carts via an overview in the Administration.\nBoost your conversions with just a few clicks.\nGet customers back to your shop to finish a purchase.\nKnow which items get abandoned with cart detail insights.","features":"Automatic abandoned cart reminder emails.\nAbandoned cart insights via the Administration.\nFully customizable and configurable mail template.\nComplete control over the timing for a cart to be considered abandoned and notifications to be scheduled.\nConfigure a decay time to automatically clear up lost abandoned carts.\nInsights into the items of each abandoned cart.\nConversion statistics straight on your dashboard based on the mails sent and orders placed from abandoned carts\nMulti reminder support with our simple but powerful notification scheduling."}],"addons":["enterpriseCertified","ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":157641,"bookingKey":"zeobv63525113392","bookingText":"Abandoned Carts - Regain lost conversions with email notifications","price":299,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":157640,"bookingKey":"zeobv63525113392_M","bookingText":"Abandoned Carts - Regain lost conversions with email notifications","price":14.9,"duration":1,"trialPhaseIncluded":true,"discount":5,"discountAppliesForMonths":6,"discr":"priceModelRent"},{"id":168689,"bookingKey":"zeobv63525113392_M12","bookingText":"Abandoned Carts - Regain lost conversions with email notifications","price":149.9,"duration":12,"trialPhaseIncluded":true,"discount":5,"discountAppliesForMonths":6,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTlONSa","preview":true,"priority":10,"id":92762},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZBjxOp","preview":false,"priority":10,"id":68976},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUyFFeU","preview":false,"priority":0,"id":36483},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFHQLWW","preview":false,"priority":0,"id":36484},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnIisRX","preview":false,"priority":0,"id":36486},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcyC7SX","preview":false,"priority":0,"id":36487},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuGU59M","preview":false,"priority":0,"id":36488},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDIvYuO","preview":false,"priority":0,"id":36496},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIOJjoX","preview":false,"priority":0,"id":49534}],"comments":[{"authorName":"Bauke Boelm","text":"Must have for our shop and works as it should. Quick response from the developer on an inital problem so also happy about that.","headline":"Top plugin for your shop","creationDate":{"date":"2023-01-27 21:16:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"M. de Ruiter","text":"We first tried the other two abandoned cart plugins, but this one suits us the best. Ultra-fast support in answering our questions and quick to follow up to new updates. Recommended!","headline":"Best on the market","creationDate":{"date":"2021-05-08 11:42:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Verlassene Warenkorb (Abandoned Carts)","description":"<p>Im Durchschnitt brechen 70 % der Verbraucher ihre Online-Einkaufswagen ab.* </p><p>Sie legen häufig einen Artikel in ihren Einkaufswagen, verlassen das Geschäft aber, bevor sie den Kauf abgeschlossen haben. Untersuchungen haben gezeigt, dass drei E-Mails zum Verlassen des Warenkorbs den Umsatz um 69 % steigern, im Vergleich zu einer einzigen E-Mail.* Verhindern Sie also, dass Sie potenzielle Kunden verlieren, indem Sie ihnen mit unserem Abandoned Carts Plugin eine Erinnerungs-E-Mail schicken.</p><p><i>* Baymard Institut &amp; Oberlo (2022)</i></p><h2>Vorteile</h2><p><b>Kunden zur Rückkehr bewegen</b></p><p>Wie bereits erwähnt, bricht ein großer Prozentsatz der Kunden seinen Einkaufswagen ab. Online-Shops kämpfen oft damit, Wege zu finden, diese Kunden dazu zu bringen, ihre Einkäufe zu beenden. Unser Plugin für verlassene Warenkörbe erleichtert diesen Prozess und macht es für E-Commerce-Shops einfacher, Erinnerungs-E-Mails an Kunden zu senden, die ihren Einkaufswagen verlassen haben. Auf diese Weise können Sie sicherstellen, dass sie zurückkehren, um den Kauf ihrer gewünschten Artikel abzuschließen.</p><p><b>Erhalten Sie zusätzliche Kundeneinblicke</b></p><p>Das Plugin sorgt nicht nur dafür, dass verlorene Kunden zurückkehren, sondern bietet auch Vorteile für Sie und Ihr Unternehmen. Wir haben auch dafür gesorgt, dass Sie einen Einblick erhalten, welche und wie viele Artikel häufig in abgebrochenen Warenkörben enthalten sind. Außerdem können Sie mit der anpassbaren Vorlage sogar Rückmeldungen darüber erhalten, warum der Kunde seinen Einkaufswagen verlassen hat, was Ihnen noch mehr Möglichkeiten zur Verbesserung gibt!</p><p><b>Keine manuelle Arbeit mehr!</b></p><p>Niemand mag es, einen Großteil der Arbeit manuell zu erledigen. Aus diesem Grund haben wir so viel Automatisierung wie möglich implementiert. Die E-Mails werden automatisch nach einer bestimmten Zeit verschickt, wobei Ihre eigene konfigurierbare E-Mail-Vorlage verwendet wird. Das Einzige, was Sie tun müssen, ist, die E-Mail an Ihre Präferenzen anzupassen, einen Zeitplan einzurichten und anzugeben, wann die Warenkörbe automatisch gelöscht werden sollen. </p><h2>Immer noch nicht überzeugt?</h2><p>Mehr als 100 Shops haben das Abandoned Carts Plugin heruntergeladen oder verwenden es bereits, also verpassen Sie es nicht! Schauen Sie sich unten an, wie bestimmte Geschäfte es angewendet haben:</p><p></p><ul><li><a href=\"https://www.buiskoppelingshop.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.buiskoppelingshop.nl/</a></li><li><a href=\"https://www.celsisbv.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.celsisbv.nl/</a></li><li><a href=\"https://meine-uhr.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://meine-uhr.de/</a></li><li><a href=\"https://www.juwelier-sandkuehler.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.juwelier-sandkuehler.de/</a></li><li><a href=\"https://www.urban-pieces.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.urban-pieces.com/</a></li></ul><h2>Kontakt</h2><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Kaufabwicklung geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin auswählen oder eine Nachricht an <a href=\"mailto:\" target=\"_blank\" rel=\"noreferrer noopener\">plugins@zeo.nl</a> senden. Geben Sie unbedingt Ihre aktuelle Shopware-Version und die Version des Plugins an, das Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h2>Über uns</h2><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter <a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.zeo.nl/</a>.</p>","installationManual":"<p></p><ul><li>Entpacken Sie die Zip-Datei in den Ordner custom/plugins oder verwenden Sie den Shopware-Plugin-Manager, installieren und aktivieren Sie das Plugin über die Kommandozeile oder über den Erweiterungsmanager in der Administration. </li><li>Nach der Installation und korrekten Aktivierung greifen Sie über die drei Punkte hinter dem Plugin-Namen in der Administration auf die Plugin-Konfiguration zu.</li><li>Wir stellen Ihnen eine Standard-E-Mail-Vorlage zur Verfügung, die als Basis für Ihre Abbruchmails dient. Diese finden Sie zwischen den anderen Mailvorlagen im Shopware Mailvorlagenmanager unter dem Namen \"Enter abandoned cart state: Reminded\". Sie können diese Vorlage nach Belieben bearbeiten, aber achten Sie darauf, dass Sie kein fehlerhaftes HTML erzeugen oder unzulässige Variablen verwenden. Die Abbruchmail verwendet die folgenden Template-Variablen: zeoAbandonedCart, salesChannel, customer. Beachten Sie, dass die Variable customer nicht garantiert mit Kundendaten gefüllt ist, da wir die E-Mail des Kunden so schnell wie möglich erhalten wollen. Dinge wie customer.firstName zu verwenden, ohne zu prüfen, ob der Kunde tatsächlich definiert ist, kann riskant sein und dazu führen, dass die Mail nicht gesendet wird.</li><li>Erstellen Sie zusätzliche Mail-Vorlagen mit dem Typ \"Enter abandoned cart state: Reminded\" für die Verwendung im Zeitplan für die Abbruchmails.</li><li>Konfigurieren Sie den Zeitplan anhand der Anleitung in der Plugin-Konfiguration. </li><li>Navigieren Sie zu Marketing &gt; Abgebrochene Warenkörbe, um einen Einblick in die Warenkorbkonversionen in Ihrem Shop zu erhalten und die ausgelösten Erinnerungen zu verfolgen.</li></ul><p></p>","version":"1.5.2","changelog":[{"version":"1.5.2","text":"<p>Added cart data and total price in the email template.</p>","creationDate":{"date":"2023-06-22 15:45:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Resolved bug of getEmail null.</p>","creationDate":{"date":"2023-06-22 15:53:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<p>-   Introduced compatibility for Shopware 6.5.0</p><p><br /></p>","creationDate":{"date":"2023-03-13 15:28:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<p>Added cart data and total price in the email template.</p>","creationDate":{"date":"2023-06-22 15:42:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>Resolved bug of getEmail null.</p>","creationDate":{"date":"2023-06-19 09:13:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>-   Removed !important statement</p><p><br /></p>","creationDate":{"date":"2023-01-27 11:41:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>-   Minor patch in cart recovery service</p><p><br /></p>","creationDate":{"date":"2022-10-26 11:56:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>- Refactor of CartService to support Redis cart persister</p><p><br /></p>","creationDate":{"date":"2022-10-20 09:59:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.13","text":"<p>- Added a notification batch size configuration to avoid spamming the mailserver resulting in failed deliveries.</p><p><br /></p>","creationDate":{"date":"2022-07-25 11:30:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.12","text":"<p>- Resolved bug occurring at rare occasions when loading the admin dashboard.</p><p><br /></p>","creationDate":{"date":"2022-07-05 20:30:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.11","text":"<p>- Added abandoned cart conversion metrics to Administration dashboard</p><p><br /></p>","creationDate":{"date":"2022-07-01 12:02:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.10","text":"- Rebuild administration JS files under v6.4.5.0 to fix issue https://github.com/shopware/platform/issues/2420 <p>- Added customer preview data</p>","creationDate":{"date":"2022-05-09 12:56:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.9","text":"- Added compatibility with v6.4.10.0","creationDate":{"date":"2022-04-15 10:35:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.8","text":"- Übersetzung der Kopf- und Fußzeilen von E-Mail-Vorlagen korrigiert","creationDate":{"date":"2022-04-04 14:36:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"- Added compatibility patch for plugins that rely on extensions being set in the cart.","creationDate":{"date":"2022-01-24 14:50:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"- Hotfix for error on order creation via API without providing an order customer.","creationDate":{"date":"2021-11-12 15:24:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"- We now clear the abandoned cart when all line items have been deleted from the original cart.","creationDate":{"date":"2021-09-15 09:20:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<p>- Made abandoned cart more persistent. It only gets deleted when a cart gets converted to an order or when the thrash delay has been reached.</p><p>- Added option to unsubscribe from abandoned cart mails from the user account in the Storefront.</p><p>- Added extra field to config to make it easier to debug if the abandoned cart processor is actually running.</p><p>- Moved abandoned cart resolving to OrderSubscriber to avoid sending abandoned cart emails to people who already performed an order but never reach the order finish page </p><p>- Added template data to mail template to allow previewing the email and browsing the available variables. </p>","creationDate":{"date":"2021-09-12 15:07:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<p>- Added support for custom products</p><p>- Added extra touch points for abandoned carts to be updated</p><p>- Improved UX in abandoned cart listing in the administration</p>","creationDate":{"date":"2021-08-11 13:57:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"- Added scheduling capabilities with custom mail templates to abandoned cart mailing","creationDate":{"date":"2021-06-30 09:58:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"- Fixed decoration issue in AbandonedCartService","creationDate":{"date":"2021-05-28 09:59:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"- Made plugin compatible to 6.4.0","creationDate":{"date":"2021-05-07 15:24:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.11","text":"- Fixed error in user account overview when trying to subscribe from notifications. <p>- Backward compatibility fix that brings bug fixes and improvements for Shopware 6.3</p>","creationDate":{"date":"2021-10-26 17:10:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.9","text":"- Backwards compatibility fix, bringing scheduling capabilities to Shopware 6.3","creationDate":{"date":"2021-06-30 09:37:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.8","text":"- Fixed bug in timing function causing abandoned carts to never be trashed or reminders to never be sent","creationDate":{"date":"2021-04-29 14:15:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.7","text":"- Übersetzungsfehler in Mail-Vorlagen behoben","creationDate":{"date":"2021-04-16 10:45:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"- Added error prevention to scheduled task to ensure the continuation of abandoned cart mails","creationDate":{"date":"2021-02-20 15:53:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"- Improved entity definition","creationDate":{"date":"2020-12-17 16:25:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"- Fixed issue where mail header and footer would not always be attached to the email","creationDate":{"date":"2020-12-03 14:29:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"- Fixed bug in abandoned cart details modal which hindered navigating to the referenced product","creationDate":{"date":"2020-11-05 10:36:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"- Improved extendability","creationDate":{"date":"2020-11-02 08:54:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>- Compatibility patch with ZeobvReorder plugin</p>","creationDate":{"date":"2020-10-16 16:55:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"# 1.2.0<p>- Backend order compatibility added </p><p>- Added function to view items in abandoned cart </p>","creationDate":{"date":"2020-09-21 12:05:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"# 1.1.1 <p>- v6.3.0.0 compatibility update\n</p>","creationDate":{"date":"2020-08-05 09:59:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"# 1.1.0 <p>- Added anonymous cart option. Via the configuration it's now possible to allow the abandoned cart mail to also recover the customer data for checkout or to make the cart recovery only restore the cart contents. </p><p>- Fixed issue where abandoned cart would not always be removed correctly on recovery or deprecation.\n</p>","creationDate":{"date":"2020-05-25 16:43:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"# 1.0.4 <p>- Recovered cart items are now removable.</p>","creationDate":{"date":"2020-04-10 15:38:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p># 1.0.3</p><p>- Patched issue where not all abandoned carts would be processed if a sales channel didn't have any abandoned carts.</p><p><br /></p>","creationDate":{"date":"2020-04-03 14:23:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"# 1.0.2 <p>- Patched issue where no new cart would be created using the link in the abandoned cart email </p><p>- Added logo\n</p>","creationDate":{"date":"2020-03-28 15:06:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"# 1.0.1 <p>- Compatibility fixes for Shopware 6.1.0-rc3</p>","creationDate":{"date":"2020-01-05 13:41:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"# 1.0.0 <p>- First version of the Zeo Abandoned Cart for Shopware 6\n</p>","creationDate":{"date":"2019-10-26 10:36:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv63525113392","redirectToStore":true,"lowestPriceValue":14.9}