{"id":10173,"name":"RedMagnalisterSW6","code":"Red4363948025224","lastChange":{"date":"2023-07-21 16:35:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpV7SRpN","examplePageUrl":"","moduleKey":"RedMagnalisterSW6","creationDate":{"date":"2019-10-29 16:43:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-06-24 12:15:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-06-30 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-01-08 17:23:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":271,"prefix":"Red","name":"magnalister","website":"//www.magnalister.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpEkQvbu"},"infos":[{"id":15819,"name":"magnalister: eBay, Amazon, OTTO & Co - Schnittstelle. Upload - Import - Lagersync","description":"<h2>magnalister : Der fortschrittlichste Weg, Ihre Produkte auf Amazon, eBay, Etsy und Co. zu verkaufen!</h2><p>Mit der magnalister Schnittstelle verbinden Sie alle großen Online-Marktplätze wie Amazon, eBay, Etsy, Kaufland.de), METRO Marktplatz, OTTO.de und viele mehr mit Shopware. Mithilfe der zahlreichen Automatisierungsfunktionen des Shopware Plugins verwalten Sie Produkte, Bestellungen, Rechnungen und Ihr Inventar zentral aus Shopware heraus.</p><p>So können Sie mit wenigen Klicks einen Multichannel-Vertrieb aufbauen oder erweitern, die Reichweite Ihrer Produkte vergrößern, zusätzliche Kunden gewinnen und Ihren Umsatz nachhaltig steigern. </p><h3>Die wichtigsten Funktionen der magnalister Shopware Schnittstelle im Überblick:</h3><ul><li><b>Zentraler Produkt-Upload</b>: Artikel zeitsparend und effizient direkt aus Shopware heraus auf alle angebundenen Marktplätze hochladen</li><li><b>Attributs-Matching</b>: Produkt-Varianten und -merkmale mit den Marktplatz-Attributen matchen*</li><li><b>Rechnungsupload</b>: Aus dem Webshop oder von magnalister erstellte Rechnungen an Amazon, METRO und Co. übermitteln</li><li><b>Preis- und Lagerabgleich</b>: Preise vollautomatisiert oder individuell (pro Marktplatz) übermitteln, aktuelle Lagerbestände synchronisieren und somit selbstverschuldete Stornierungen vermeiden</li><li><b>Automatischer Bestellimport</b>: Marktplatz-Bestellungen in den eigenen Shopware Online Shop importieren und verwalten</li><li><b>Bestellstatusabgleich</b>: Bestellstatus (z.B. „versendet“ oder „storniert“) automatisch an Marktplätze übermitteln</li><li><b>Schnittstellenindividualisierung</b>: Das Plugin per Hook-Points nach eigenen Wünschen anpassen**</li></ul><h3>Persönliche Beratung und Betreuung bei der Einrichtung von magnalister</h3><p>Sie benötigen Unterstützung bei der Einrichtung Ihrer magnalister Marktplatz-Schnittstelle? Kontaktieren Sie unseren Experten-Support! Wir helfen Ihnen dabei Amazon, eBay, Etsy, Kaufland.de), METRO Marktplatz, OTTO.de und Co. an Shopware anzubinden.</p><p> Aus Erfahrung wissen wir, dass Marktplatz-Schnittstellen für viele Händler ein herausforderndes Thema sind. Jeder Marktplatz hat seine eigenen Regeln - das macht die Anbindung komplex. Nehmen Sie uns also beim Wort und nutzen Sie unsere Support-Möglichkeiten per Hotline, E-Mail und Live-Chat.</p><h3>magnalister Shopware Plugin downloaden und 30 Tage kostenfrei mit allen Funktionen testen! </h3><p>magnalister ist eines der führenden Systeme für die Anbindung und Steuerung von Marktplätzen mit einzigartigem Funktionsumfang - entwickelt und kontinuierlich verbessert von einem Spezialisten-Team mit über 10 Jahren Erfahrung. Überzeugen Sie sich selbst: Testen Sie jetzt die magnalister Shopware Schnittstelle 30 Tage lang kostenfrei - mit allen Features!</p><h2>Die magnalister Kern-Features im Detail: So funktioniert die Anbindung von Shopware an Amazon, eBay, Etsy und viele weitere Marktplätze</h2><h3>Produkt-Upload direkt aus Shopware an den jeweiligen Marktplatz</h3><p>Die magnalister Shopware Schnittstelle gibt Ihnen die volle Kontrolle darüber, welche Artikel Sie auf welchem Marktplatz aus Shopware heraus verkaufen möchten. Sie haben die Wahl: Laden Sie alle Produkte auf einmal zu Amazon, eBay, Etsy und Co. hoch oder limitieren Sie den Produktupload direkt aus dem Shopware-Backend auf einzelne Produkte und bestimmte Marktplätze.</p><h3>Attribute und Varianten mit Marktplätzen aus Shopware heraus matchen</h3><p>Mit dem Attributs Matching Feature nimmt magnalister Ihnen als Händler viel Arbeit in der Produktmerkmal- und Variantenpflege ab, denn: Die Bezeichnung von Merkmalen und Varianten kann von Marktplatz zu Marktplatz variieren. Daher können Sie ein Matching zwischen Ihren Shopware Produkten und dem Marktplatz direkt im magnalister Shopware Plugin vornehmen*. So werden Ihre Produkte korrekt gelistet und auf den Marktplätzen besser gefunden.</p><h3>Rechnungsupload aus Shopware zu Marktplätzen wie Amazon oder METRO</h3><p>Stellen Sie von Shopware generierte Rechnungen automatisch Amazon oder METRO Käufern bereit. Alternativ können Sie den magnalister Rechnungsassistenten nutzen, mit dem Sie Rechnungen nach Ihren Wünschen erstellen und an Amazon übermitteln können. Voraussetzung hierfür ist die Teilnahme am Amazon VCS Programm.</p><h3>Synchronisation von Preisen über unser Shopware Marktplatz Plugin</h3><p>Preismanagement direkt aus Shopware heraus: Mit magnalister können Sie neben Ihren Standard-Preisen für jede Shopping-Plattform eigene Preise vergeben und diese mit einem Klick auf den jeweiligen Marktplatz hochladen und vollautomatisch synchronisieren lassen*. Das Shopware Plugin greift dazu auf die native Shopware Funktion “Kundengruppen” zurück.</p><p> Interessant für grenzübergreifenden Handel: Möchten Sie Ihre Waren über Shopware auf Etsy, Amazon oder eBay USA &amp; UK und vielen weiteren internationalen Marktplätzen wie Cdiscount oder ricardo.ch verkaufen, können Sie die Produkte in der jeweiligen Landeswährung übermitteln.</p><h3>Lagerbestand-Abgleich zwischen Shopware und dem Marktplatz</h3><p>Mit der magnalister Schnittstelle müssen Sie sich nie wieder Gedanken um Ihre Lagerbestände machen. Das Shopware Marktplatz Plugin hält den Lagerbestand Ihrer Produkte immer aktuell, egal auf wie vielen nationalen und internationalen Shopping-Plattformen Sie Ihre Produkte vertreiben.</p><h3>Automatischer Bestellimport vom Marktplatz nach Shopware</h3><p>Bestellungen, die über Ihre mit magnalister verbundenen Marktplätze eingehen, werden direkt in Ihren Shopware-Shop importiert. Sie finden sie im Shopware Backend unter Kunden / Bestellungen. Bei einigen Marktplätzen, z.B. wenn Sie Shopware mit eBay verbinden, können Sie auch individuelle Import-Kriterien (Import erst nach Bezahlung des Artikels, etc.) festlegen. </p><h3>Marktplatz Bestellungen mit Pickware oder eigener Warenwirtschaft synchronisieren</h3><p>Nutzen Sie Pickware oder eine andere Warenwirtschaft, können die importierten Bestellungen nahtlos an die WAWI weitergegeben werden, da die Daten im Shopware-Format vorliegen. </p><p> In der Shopware Bestellübersicht können sie die Marktplatz-Bestellungen filtern, da sie beim Import mit einer Notiz (Name des Marktplatzes) versehen werden. magnalister ist dadurch nicht nur die fortschrittlichste Shopware-Marktplatz-Lösung, sondern auch eine praktische (indirekte) Schnittstelle zwischen den verbundenen Marktplätzen und Ihrer Warenwirtschaft.</p><h3>Bestellstatusabgleich zwischen Shopware und Amazon, eBay, Etsy und Co.</h3><p>Informieren Sie den angebundenen Marktplatz und Ihre Marktplatz-Kunden über den aktuellen Bestellstatus. Markieren Sie im magnalister Shopware Plugin ein Produkt als „versendet“ oder „storniert“, so wird dieser Status an Amazon, eBay, OTTO.de und Co. übertragen - inkl. Tracking-Code.</p><h3>Inventar-Übersicht für jeden Marktplatz in Shopware</h3><p>Verlieren Sie nie mehr den Überblick über Ihr Inventar - auch wenn Sie zahlreiche Marktplätze wie Amazon, eBay, Etsy, METRO Marktplatz oder Kaufland.de) an Shopware angebunden haben. Über das magnalister Shopware Plugin können Sie eine Inventar-Übersicht aufrufen und auf einen Blick sehen, welche Produkte in welcher Stückzahl und zu welchen Preisen auf dem jeweiligen Marktplatz angeboten werden. So lassen sich auch Produkttitel aus Shopware heraus mit den Marktplatz-Titeln vergleichen.</p><h3>Mit magnalister international verkaufen auf eBay, Amazon, Etsy und Co.</h3><p>Mit magnalister sind Ihrem Multichannel-Vertrieb keine Grenzen mehr gesetzt. Verkaufen Sie Ihre Produkte auf den größten internationalen Marktplätzen wie Amazon (USA, UK, Schweden, Kanada, Polen, Mexiko, Türkei), eBay (USA, UK, Kanada) oder Etsy (weltweit) direkt aus Shopware heraus. Die Anbindung ausländischer Marktplätze ist genauso einfach wie einen deutschen Marktplatz mit Shopware zu verbinden. </p><p> Mit wenigen Klicks richten Sie das Plugin ein und können dabei spezielle Funktionen für den länderübergreifenden Handel nutzen: Definieren Sie pro Verkaufsland eigene Inhalte, Preise und Versandkosten. Ihre Produkte werden außerdem direkt in der richtigen Landeswährung an die Marktplätze übermittelt. Um Sprachbarrieren von Anfang an so niedrig wie möglich zu halten, greift das magnalister Shopware Marktplatz Plugin auf die in Shopware hinterlegten Sprachen zurück.</p><h3>Fehler-Reports direkt in Shopware ausgeben lassen</h3><p>Die meisten Marktplätze prüfen sehr genau, ob importierte Produkte, Varianten und Merkmale mit bestehenden Marktplatz-Angeboten in Konflikt stehen. Im magnalister Shopware Plugin können Sie mithilfe von Fehler-Reports prüfen, an welchen Stellen Verbesserungsbedarf besteht, damit Ihre Produkte korrekt gelistet werden. Über diesen Weg lassen sich auch Produkt-Dubletten innerhalb von Shopware identifizieren.</p><h3>magnalister Shopware Schnittstelle über Hook-Point-System anpassen</h3><p>Die Funktionen des magnalister Shopware Plugins sind flexibel erweiterbar**. Hierzu können Sie auf unser updatessicheres Hook-Point-System zurückgreifen und die Schnittstelle für Ihren Bedarf anpassen. Unser Experten-Team hilft bei der Einrichtung der Hook Points und der Individualisierung.</p><h3>magnalister ist die sichere Universal-Lösung für Ihren Multichannel Shopware-Shop</h3><p>Unser Versprechen: magnalister ist die komfortabelste Möglichkeit, einen Multichannel-Vertrieb über Shopware auf- und auszubauen. Das Plugin integriert sich ganzheitlich in Ihre Shopware-Installation, ersetzt externe Produktinformationsmanagement (PIM) Lösungen vollständig und kann in Ergänzung zu Ihrer Warenwirtschaft - wie z. B. Pickware - und vielen weiteren eCommerce Tools (z.B. Versand-Plugins) eingesetzt werden. </p><p> Ihre Produkt-, Kunden-, Bestell- und Rechnungsdaten bleiben jederzeit in Ihrem Shopware-Shop und werden nur zwischen Shopware, magnalister und den angebundenen Marktplätzen synchronisiert. So behalten Sie mit unserer Shopware Schnittstelle die volle Kontrolle über Ihre Multichannel-Absatzkanäle.</p><h3>Von Amazon bis Etsy - diese Marktplätze lassen sich mit dem magnalister Shopware Plugin verknüpfen</h3><p>Die magnalister Shopware Schnittstelle ist für eine Vielzahl von nationalen und internationalen Marktplätzen verfügbar und berücksichtigt dabei die speziellen technischen Herausforderungen sowie den jeweiligen Listing-Prozess der Plattformen:</p><ul><li>Amazon (Europa, USA, Kanada, UK)</li><li>eBay (Europa, USA, Kanada, UK)</li><li>Etsy</li><li>Kaufland.de</li><li>OTTO.de</li><li>METRO Marktplatz</li><li>idealo</li><li>Check24</li><li>ricardo.ch</li><li>Rakuten Frankreich (ehemals Priceminister)</li><li>Cdiscount </li></ul><h3>magnalister gehört zu den weltweit führenden Marktplatz Schnittstellen</h3><p>Das magnalister Plugin gehört shopübergreifend zu den fortschrittlichsten Schnittstellen-Technologien und wird seit mehr als 10 Jahren in Berlin entwickelt &amp; verbessert. Die Zahlen sprechen für sich:</p><p>2017 knackt magnalister die 2,2 Milliarden Euro Bestellimport-Marke. Seit der ersten magnalister Version im Jahr 2006 wurden über 291 Millionen Produktuploads und Artikelaktualisierungen mit der Schnittstelle durchgeführt. Durch die per magnalister angebundenen Marktplätze lassen sich international über 110 Millionen Kunden erreichen.</p><h3>magnalister arbeitet eng mit Shopware und den größten Marktplätzen zusammen</h3><p>Warum ist magnalister eines der führenden Shopware Marktplatz Plugins? Weil wir eng mit den Machern von Shopware zusammenarbeiten, in direktem Austausch stehen und die Schnittstelle ständig optimieren. Eine ebenso enge Partnerschaft pflegen wir mit den größten Online-Marktplätzen wie z.B. Amazon, eBay, Etsy oder real.de (zukünftig: Kaufland). Wir binden kontinuierlich neue und wachstumsstarke Marktplätze wie OTTO.de, METRO Marktplatz oder Etsy an und legen viel Wert darauf, die technischen Eigenheiten des jeweiligen Marktplatzes in unserem Shopware Plugin zu berücksichtigen. Damit bieten wir Händlern die optimale Ausgangslage für einen erfolgreichen Multichannel-Vertrieb im Web.</p><h3>Die Vorteile des magnalister Shopware Plugins im Überblick</h3><ul><li>Abgleich von Produkten, Bestellungen, Rechnungen und Lager mit den weltweit größten Marktplätzen</li><li>Bye Bye manuelle Marktplatzpflege: Enorme Zeitersparnis für Multichannel-Händler</li><li>Alles an einem Platz: zentrale Produkt- &amp; Bestellverwaltung für alle Marktplätze in Shopware</li><li>Effizient in der Einrichtung: Anbindung von Marktplätzen wie Amazon, eBay oder Etsy in Shopware mit wenigen Klicks</li><li>Ein Auge auf Details: Übermittlung der richtigen Produktvarianten und -attribute pro Marktplatz</li><li>Anpassungsfähig: magnalister lässt sich per Hook-Point-System individualisieren</li><li>Global handeln: Spezielle Funktionen für die Anbindung internationaler Marktplätze</li><li>Unterstützung durch Experten: Sie haben Zugriff auf den Einrichtungsservice und Expertensupport von magnalister</li><li>Das ist für Sie als Händler drin: Produktreichweite vergrößern, neue Kunden über neue Kanäle gewinnen und Umsatz steigern</li></ul><p>* Die Funktionsbeschreibung kann für einige Marktplätze leicht variieren. So unterstützt beispielsweise nicht jeder Marktplatz über seine API alle beschriebenen Funktionen in vollem Umfang.</p><p>** Setzt Programmierkenntnisse voraus. Nicht für Cloud (SaaS) Systeme verfügbar, da herstellerseitig kein Eingriff erlaubt.</p>","installationManual":"<h3>Plugin Manager</h3>Öffnen Sie den Plug-In Manager unter Einstellungen und installieren Sie das magnalister Plug-In. Nach der Installation ist der magnalister im Menüpunkt Marketing erreichbar. Hinterlegen Sie dort die Passphrase.<h3>Shopware Installation Wizzard</h3>Bei der Erstinstallation von Shopware finden Sie magnalister direkt im Shopware Installations Wizzard und können das Plugin dort direkt installieren. Nach der Installation ist der magnalister im Menüpunkt Marketing erreichbar. Hinterlegen Sie dort die Passphrase.<p></p>","shortDescription":"​magnalister ist die ultimative Schnittstelle zwischen Shopware und eBay, Amazon, OTTO & Co. Kernfeatures: Produktupload, Bestellimport, Bestellstatus-Sync, Preis- & Lagerabgleich","highlights":"","features":""},{"id":21434,"name":"magnalister: Amazon, eBay, OTTO & more - Interface. Upload - Import - Inventory Sync","description":"<h2>magnalister: The most advanced way to sell your products on Amazon, eBay, OTTO, Etsy and more!</h2><p>With the magnalister interface, you can connect all major online marketplaces such as Amazon, eBay, Etsy, Kaufland, METRO Marktplatz, OTTO.de and many more with Shopware. With the help of the numerous automation features of the Shopware plugin, you can manage products, orders, invoices and your inventory centrally from Shopware.</p><p>By doing this, you can set up or expand multichannel sales with just a few clicks, increase the reach of your products, acquire additional customers and increase your sales sustainably.</p><h3>The most important features of the magnalister Shopware interface at a glance:</h3><p></p><ul><li><b>Central Product Upload</b>: Time-saving and efficient upload of products from your own Shopware store to all connected marketplaces</li><li><b>Attribute Matching</b>: Match product variations and features with marketplace attributes*</li><li><b>Invoice Upload</b>: Send invoices created in your web store or by magnalister to Amazon and other marketplaces<br></li><li><b>Price and Inventory Synchronization</b>: prices are matched fully automatically or individually (per marketplace), current stock levels are synchronized and thus unwanted cancellations are avoided</li><li><b>Automatic Order Import</b>: Import and manage marketplace orders in your own Shopware online store</li><li><b>Order Status Matching</b>: automatically match order status (e.g. \"shipped\" or \"cancelled\") with other marketplaces</li><li><b>Interface Customization</b>: Customize the plugin via so-called hook points as you desire**</li></ul><p></p><h3>Personal consultation and assistance during the setup of magnalister</h3><p>Need support setting up your magnalister marketplace interface? Contact our expert support! We help you connect Amazon, eBay, Etsy, Kaufland, METRO Marktplatz, OTTO.de and many more to Shopware.</p><p>We know from experience that marketplace interfaces are a challenging topic for many retailers. Each marketplace has its own rules - which makes the connection complex. So take us at our word and take advantage of our support options via phone, email and live chat.</p><h3>Download magnalister Shopware Plugin and test in a 30 day free trial with all features!</h3><p>magnalister is one of the leading software providers for connecting and controlling marketplaces with a unique range of features - developed and continuously improved by a team of specialists with over 10 years of experience. Test it yourself: Try the magnalister Shopware interface now in a 30 day free trial - with all features!</p><h2>The magnalister core features in detail: This is how you connect Shopware to Amazon, eBay, Etsy, OTTO and many other marketplaces</h2><h3>Upload products directly from Shopware to the respective marketplace</h3><p>The magnalister Shopware interface gives you full control over which items you want to sell on which marketplace from Shopware. The choice is yours: upload all products at once to Amazon, eBay, Etsy, OTTO and many more or limit the product upload directly from the Shopware backend to individual products and specific marketplaces.</p><h3>Match attributes and variations with marketplaces from within Shopware</h3><p>With the attributes matching feature, magnalister takes a lot of work off your shoulders as a merchant. This becomes particularly noticeable when it comes to product attribute and variation management, because: attribute and variation names can vary from marketplace to marketplace. Therefore, you can perform a matching between your Shopware products and the marketplace directly in the magnalister Shopware plugin*. This way your products will be listed correctly and it is also easier to find them on the respective marketplaces.</p><h3>Invoice upload from Shopware to Amazon Marketplace</h3><p>Send Shopware generated invoices to Amazon buyers automatically. Alternatively, you can use the magnalister invoice wizard to create invoices according to your needs and send them to Amazon. This however requires you to be signed up with the Amazon VCS program.</p><h3>Synchronization of prices via our Shopware Marketplace Plugin</h3><p>Price management directly from Shopware: With magnalister, you can assign your own prices for each shopping platform in addition to your standard prices and upload them to the respective marketplace within just one click which means you can have them synchronized fully automatically*. For this purpose, the Shopware plugin uses the native Shopware feature \"customer groups\".</p><p>Particularly interesting for cross-border trade: If you want to sell your goods via Shopware on Etsy, Amazon or eBay USA &amp; UK and many other international marketplaces such as Cdiscount or ricardo.ch, you can price the products in the respective local currency.</p><h3>Inventory synchronization between Shopware and the marketplace</h3><p>With the magnalister interface, you will never have to worry about your stock levels again. The Shopware marketplace plugin always keeps the inventory of your products up to date, no matter how many national and international shopping platforms you sell your products on.</p><h3>Automatic order import from the marketplace to Shopware</h3><p>Orders received through your marketplaces connected to magnalister are imported directly into your Shopware store. You can find them in the Shopware backend under Customers / Orders. For some marketplaces, e.g. if you connect Shopware with eBay, you can also set individual import criteria (import only after item payment, etc.).</p><h3>Synchronize marketplace orders with Pickware or your own merchandise management system&nbsp;</h3><p>If you use Pickware or another merchandise management system, the imported orders can be seamlessly passed on to the Shopware merchandise management, as the data is in Shopware format.</p><p>In the Shopware order overview you can filter the marketplace orders, because they all receive a note (name of the marketplace) during the import. magnalister is therefore not only the most advanced Shopware marketplace solution, but also a practical (passive) interface between the connected marketplaces and your enterprise resource planning.</p><h3>Order status matching between Shopware and Amazon, eBay, Etsy, OTTO and more</h3><p>Inform the connected marketplace and your marketplace customers about the current order status. If you mark an order as \"shipped\" or \"canceled\" in the magnalister Shopware plugin, this status will be transmitted to Amazon, eBay, OTTO.de and more - including the tracking code.</p><h3>Inventory overview for every marketplace in Shopware</h3><p>Never lose track of your inventory again - even if you have connected numerous marketplaces like Amazon, eBay, Etsy, METRO Marktplatz or Kaufland to Shopware. Using the magnalister Shopware plugin, you can call up an inventory overview and see at a glance which products are offered in which quantities and at which prices on the respective marketplace. This also allows you to compare product names from within Shopware with the names provided on the respective marketplace.</p><h3>Use magnalister to sell internationally on eBay, Amazon, Etsy and many more<br></h3><p>With magnalister, there are no more limits to multichannel sales. Sell your products on the biggest international marketplaces like Amazon (USA, UK, Sweden, Canada, Poland, Mexico, Turkey), eBay (USA, UK, Canada) or Etsy (worldwide) directly from Shopware. Connecting foreign marketplaces is just as easy as connecting a German marketplace with Shopware.</p><p>With just a few clicks, you set up the plugin and can use special features for cross-country trade: Define your own content, prices and shipping rates per country of sale. Your products are also priced in the correct local currency of the marketplaces. To keep language barriers as low as possible from the get go, the magnalister Shopware marketplace plugin uses the languages stored in Shopware.</p><h3>Output error reports directly in Shopware</h3><p>Most marketplaces check very carefully whether imported products, product variations and features conflict with existing marketplace offers. In the magnalister Shopware plugin you can use error reports to check where there is room for improvement so that your products are listed correctly. This way you can also identify product duplicates within Shopware.</p><h3>Adjust magnalister Shopware interface via so-called hook points</h3><p>The features of the magnalister Shopware Plugin are flexibly expandable**. For this you can use our update proof hook-point system and adapt the interface to your needs. Our team of experts will help you to set up the hook points and customize them.</p><h3>magnalister is the secure universal solution for your multichannel Shopware store</h3><p>Our promise: magnalister is the most convenient way to establish and expand a multichannel distribution via Shopware. The plugin integrates holistically into your Shopware installation, completely replaces external product information management (PIM) solutions and can be used in addition to your inventory management - such as Pickware - and many other eCommerce tools (e.g. shipping plugins).</p><p>Your product, customer, order and invoice data remain in your Shopware store at all times and are only synchronized between Shopware, magnalister and the connected marketplaces. By using our Shopware interface, you retain full control over your multichannel sales channels.</p><h3>From Amazon to Etsy - these marketplaces can be linked with the magnalister Shopware plugin</h3><p>The magnalister Shopware interface is available for a wide range of national and international marketplaces, taking into account the specific technical challenges and listing process of each platform:</p><p></p><ul><li>Amazon (Europe, USA, Canada, UK)</li><li>eBay (Europe, USA, Canada, UK)</li><li>Etsy</li><li>Kaufland</li><li>OTTO.de</li><li>METRO Marketplace</li><li>idealo</li><li>check24</li><li>ricardo.ch</li><li>Rakuten France (formerly Priceminister)</li><li>Cdiscount</li></ul><p></p><h3>magnalister is one of the world's leading marketplace interfaces</h3><p>The magnalister plugin is one of the most advanced interface technologies across stores and has been developed &amp; improved in Berlin for more than 10 years. The numbers speak for themselves:</p><p>In 2023 magnalister cracked the 4.1 billion Euro order import mark. Since the first magnalister version in 2006, over 291 million product uploads and item updates have been performed using the interface. Through the marketplaces connected via magnalister, over 110 million customers can be reached internationally.</p><h3>magnalister works closely with Shopware and the largest marketplaces</h3><p>Why is magnalister one of the leading Shopware marketplace plugins? Because we work closely with the creators of Shopware, are in direct contact with their team and constantly optimize the interface. We maintain an equally close partnership with the largest online marketplaces such as Amazon, eBay, Etsy or Kaufland. We continuously connect new and fast-growing marketplaces such as OTTO.de, METRO Marktplatz or Etsy and attach great importance to taking the technical specifications of the respective marketplace into account when working on our Shopware plugin. Thanks to this, we offer retailers the optimal starting point for successful multichannel sales on the web.</p><h3>The advantages of the magnalister Shopware plugin at a glance</h3><p></p><ul><li>Match products, orders, invoices and inventory with the world's largest marketplaces</li><li>Say GoodBye to manual marketplace maintenance: enormous time savings for multichannel retailers</li><li>Everything in one place: central product &amp; order management for all marketplaces in Shopware</li><li>Efficient setup: connect marketplaces like Amazon, eBay or Etsy in Shopware with just a few clicks</li><li>An eye for detail: Submission of the right product variations and attributes per marketplace</li><li>Adaptable: magnalister can be customized via so-called hook points</li><li>Trade globally: special features for connecting international marketplaces</li><li>Expert support: You have access to magnalister's setup service and expert support</li><li>This is what's in it for you as a merchant: Increase product reach, acquire new customers via new channels and increase sales</li></ul><p></p><p>* The feature description may vary slightly for some marketplaces. For example, not every marketplace fully supports all described features via its API.</p><p>** Requires programming knowledge. Not available for cloud (SaaS) systems, as no intervention is allowed by the manufacturer.</p><p><br></p>","installationManual":"<h3>Plugin Manager</h3>Open the Plugin Manager under Settings and install the magnalister plugin. Once installation is complete, magnalister will be available in the Marketing menu. Open it and enter your Passphrase which will be received by e-mail after registration on magnalister.com.<h3>Shopware Installation Wizzard</h3>magnalister can also be installed through the Shopware Installation wizzard. Once installation is complete, magnalister will be available in the Marketing menu. Open it and enter your Passphrase which will be received by e-mail after registration on magnalister.com.","shortDescription":"magnalister is the ultimate interface between Shopware and Amazon, eBay, OTTO & more. Core features: product upload, order import, order status sync, price & inventory synchronization.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":162324,"bookingKey":"Red4363948025224","bookingText":"magnalister","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGv3PfF","preview":true,"priority":0,"id":62100},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOIiAYS","preview":false,"priority":0,"id":62098},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyst6bK","preview":false,"priority":0,"id":62101},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8Q65Q4","preview":false,"priority":0,"id":62102},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUxIgEL","preview":false,"priority":0,"id":62103},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAfuLLl","preview":false,"priority":0,"id":62104},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFf3QOM","preview":false,"priority":0,"id":62105}],"comments":[{"authorName":"Patricia","text":"Das Plugin ist einfach einzurichten, der Support ist schnell und immer sehr hilfreich.  Günstig ist es auch noch dazu.","headline":"Einfache Handhabung","creationDate":{"date":"2023-05-02 11:04:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"More2Home","text":"Wir verwenden magnalister nun schon seit ein paar Jahren erfolgreich in unserem Online-Shop. Die Funktionalität efüllt alle unserer Anforderungen und die Bedienbarkeit ist - wenn man sich erst einmal eingearbeitet hat - auch überschaubar. Über die Dokumentation kann sich jeder selbst (auch schon in der Planungsphase) ein Urteil bilden. Wir empfinden sie als sehr umfang- und hilfreich. Und der Support ist einfach nur Spitze!\nFazit: wir können magnalister nur jedem empfehlen, der seinen Shop an einen der großen Internet-Marktplätze anbinden möchte.","headline":"Läuft bei uns schon mit 3 Marktplätzen","creationDate":{"date":"2023-03-31 10:45:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Henning Vielitz","text":"Die Erweiterung Magnalister funktioniert einwandfrei. Die ersten Schritte empfinde ich als etwas holprig, da die Bedienung teilweise etwas \"zäh\" und wenig intuitiv ist. Das wird aber mit jedem Artikel besser.\n\nWas mir persönlich fehlt: Variantenartikel von Shopware zu Einzelartikeln bei eBay oder alternativ jeder Variante eigene Versandkosten zuordnen. \n\nAnsonsten einwandfrei, Support ebenfalls gut.","headline":"Funktioniert, tut was es soll","creationDate":{"date":"2023-03-13 15:58:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"AKUSTIK-PROJEKT","text":"","headline":"Tolles Plugin, schneller Support","creationDate":{"date":"2022-10-27 13:48:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Alex Wolf","text":"Sehr gute Erweiterung.\nSehr schneller und kompetenter Support","headline":"Sehr gute Erweiterung","creationDate":{"date":"2022-10-20 11:34:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Markus Käsbeck","text":"Magnalister works perfectly with shopware 6. No complaints and fast supprt. A recommendation for every one using multichannel via shopware 6.","headline":"Works perfectly without issues","creationDate":{"date":"2022-08-04 08:44:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marcel Möder","text":"Ich kann magnalister sehr empfehlen. Angefangen von der kostenfreien Schulung, bis hin zum technischen Support. Es ist immer jemand zur Stelle, damit auftauchende Probleme gelöst werden. Sollten sich alles Mitarbeiter in deer Beratung befinden, wird später zurückgerufen. Die Kompetenz und Beratung, der Service, und das sehr freundliche Team, sind der eigene Anspruch von magnalister.","headline":"Top in Service, Schulung und technischer Support","creationDate":{"date":"2022-07-22 09:37:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"M Kobras","text":"","headline":"vielfälltige Anbindung an Marktplätze; faire Preise; TOP SUPPORT!","creationDate":{"date":"2022-07-20 15:16:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"magnalister: eBay, Amazon, OTTO & Co - Schnittstelle. Upload - Import - Lagersync","description":"<h2>magnalister : Der fortschrittlichste Weg, Ihre Produkte auf Amazon, eBay, Etsy und Co. zu verkaufen!</h2><p>Mit der magnalister Schnittstelle verbinden Sie alle großen Online-Marktplätze wie Amazon, eBay, Etsy, Kaufland.de), METRO Marktplatz, OTTO.de und viele mehr mit Shopware. Mithilfe der zahlreichen Automatisierungsfunktionen des Shopware Plugins verwalten Sie Produkte, Bestellungen, Rechnungen und Ihr Inventar zentral aus Shopware heraus.</p><p>So können Sie mit wenigen Klicks einen Multichannel-Vertrieb aufbauen oder erweitern, die Reichweite Ihrer Produkte vergrößern, zusätzliche Kunden gewinnen und Ihren Umsatz nachhaltig steigern. </p><h3>Die wichtigsten Funktionen der magnalister Shopware Schnittstelle im Überblick:</h3><ul><li><b>Zentraler Produkt-Upload</b>: Artikel zeitsparend und effizient direkt aus Shopware heraus auf alle angebundenen Marktplätze hochladen</li><li><b>Attributs-Matching</b>: Produkt-Varianten und -merkmale mit den Marktplatz-Attributen matchen*</li><li><b>Rechnungsupload</b>: Aus dem Webshop oder von magnalister erstellte Rechnungen an Amazon, METRO und Co. übermitteln</li><li><b>Preis- und Lagerabgleich</b>: Preise vollautomatisiert oder individuell (pro Marktplatz) übermitteln, aktuelle Lagerbestände synchronisieren und somit selbstverschuldete Stornierungen vermeiden</li><li><b>Automatischer Bestellimport</b>: Marktplatz-Bestellungen in den eigenen Shopware Online Shop importieren und verwalten</li><li><b>Bestellstatusabgleich</b>: Bestellstatus (z.B. „versendet“ oder „storniert“) automatisch an Marktplätze übermitteln</li><li><b>Schnittstellenindividualisierung</b>: Das Plugin per Hook-Points nach eigenen Wünschen anpassen**</li></ul><h3>Persönliche Beratung und Betreuung bei der Einrichtung von magnalister</h3><p>Sie benötigen Unterstützung bei der Einrichtung Ihrer magnalister Marktplatz-Schnittstelle? Kontaktieren Sie unseren Experten-Support! Wir helfen Ihnen dabei Amazon, eBay, Etsy, Kaufland.de), METRO Marktplatz, OTTO.de und Co. an Shopware anzubinden.</p><p> Aus Erfahrung wissen wir, dass Marktplatz-Schnittstellen für viele Händler ein herausforderndes Thema sind. Jeder Marktplatz hat seine eigenen Regeln - das macht die Anbindung komplex. Nehmen Sie uns also beim Wort und nutzen Sie unsere Support-Möglichkeiten per Hotline, E-Mail und Live-Chat.</p><h3>magnalister Shopware Plugin downloaden und 30 Tage kostenfrei mit allen Funktionen testen! </h3><p>magnalister ist eines der führenden Systeme für die Anbindung und Steuerung von Marktplätzen mit einzigartigem Funktionsumfang - entwickelt und kontinuierlich verbessert von einem Spezialisten-Team mit über 10 Jahren Erfahrung. Überzeugen Sie sich selbst: Testen Sie jetzt die magnalister Shopware Schnittstelle 30 Tage lang kostenfrei - mit allen Features!</p><h2>Die magnalister Kern-Features im Detail: So funktioniert die Anbindung von Shopware an Amazon, eBay, Etsy und viele weitere Marktplätze</h2><h3>Produkt-Upload direkt aus Shopware an den jeweiligen Marktplatz</h3><p>Die magnalister Shopware Schnittstelle gibt Ihnen die volle Kontrolle darüber, welche Artikel Sie auf welchem Marktplatz aus Shopware heraus verkaufen möchten. Sie haben die Wahl: Laden Sie alle Produkte auf einmal zu Amazon, eBay, Etsy und Co. hoch oder limitieren Sie den Produktupload direkt aus dem Shopware-Backend auf einzelne Produkte und bestimmte Marktplätze.</p><h3>Attribute und Varianten mit Marktplätzen aus Shopware heraus matchen</h3><p>Mit dem Attributs Matching Feature nimmt magnalister Ihnen als Händler viel Arbeit in der Produktmerkmal- und Variantenpflege ab, denn: Die Bezeichnung von Merkmalen und Varianten kann von Marktplatz zu Marktplatz variieren. Daher können Sie ein Matching zwischen Ihren Shopware Produkten und dem Marktplatz direkt im magnalister Shopware Plugin vornehmen*. So werden Ihre Produkte korrekt gelistet und auf den Marktplätzen besser gefunden.</p><h3>Rechnungsupload aus Shopware zu Marktplätzen wie Amazon oder METRO</h3><p>Stellen Sie von Shopware generierte Rechnungen automatisch Amazon oder METRO Käufern bereit. Alternativ können Sie den magnalister Rechnungsassistenten nutzen, mit dem Sie Rechnungen nach Ihren Wünschen erstellen und an Amazon übermitteln können. Voraussetzung hierfür ist die Teilnahme am Amazon VCS Programm.</p><h3>Synchronisation von Preisen über unser Shopware Marktplatz Plugin</h3><p>Preismanagement direkt aus Shopware heraus: Mit magnalister können Sie neben Ihren Standard-Preisen für jede Shopping-Plattform eigene Preise vergeben und diese mit einem Klick auf den jeweiligen Marktplatz hochladen und vollautomatisch synchronisieren lassen*. Das Shopware Plugin greift dazu auf die native Shopware Funktion “Kundengruppen” zurück.</p><p> Interessant für grenzübergreifenden Handel: Möchten Sie Ihre Waren über Shopware auf Etsy, Amazon oder eBay USA &amp; UK und vielen weiteren internationalen Marktplätzen wie Cdiscount oder ricardo.ch verkaufen, können Sie die Produkte in der jeweiligen Landeswährung übermitteln.</p><h3>Lagerbestand-Abgleich zwischen Shopware und dem Marktplatz</h3><p>Mit der magnalister Schnittstelle müssen Sie sich nie wieder Gedanken um Ihre Lagerbestände machen. Das Shopware Marktplatz Plugin hält den Lagerbestand Ihrer Produkte immer aktuell, egal auf wie vielen nationalen und internationalen Shopping-Plattformen Sie Ihre Produkte vertreiben.</p><h3>Automatischer Bestellimport vom Marktplatz nach Shopware</h3><p>Bestellungen, die über Ihre mit magnalister verbundenen Marktplätze eingehen, werden direkt in Ihren Shopware-Shop importiert. Sie finden sie im Shopware Backend unter Kunden / Bestellungen. Bei einigen Marktplätzen, z.B. wenn Sie Shopware mit eBay verbinden, können Sie auch individuelle Import-Kriterien (Import erst nach Bezahlung des Artikels, etc.) festlegen. </p><h3>Marktplatz Bestellungen mit Pickware oder eigener Warenwirtschaft synchronisieren</h3><p>Nutzen Sie Pickware oder eine andere Warenwirtschaft, können die importierten Bestellungen nahtlos an die WAWI weitergegeben werden, da die Daten im Shopware-Format vorliegen. </p><p> In der Shopware Bestellübersicht können sie die Marktplatz-Bestellungen filtern, da sie beim Import mit einer Notiz (Name des Marktplatzes) versehen werden. magnalister ist dadurch nicht nur die fortschrittlichste Shopware-Marktplatz-Lösung, sondern auch eine praktische (indirekte) Schnittstelle zwischen den verbundenen Marktplätzen und Ihrer Warenwirtschaft.</p><h3>Bestellstatusabgleich zwischen Shopware und Amazon, eBay, Etsy und Co.</h3><p>Informieren Sie den angebundenen Marktplatz und Ihre Marktplatz-Kunden über den aktuellen Bestellstatus. Markieren Sie im magnalister Shopware Plugin ein Produkt als „versendet“ oder „storniert“, so wird dieser Status an Amazon, eBay, OTTO.de und Co. übertragen - inkl. Tracking-Code.</p><h3>Inventar-Übersicht für jeden Marktplatz in Shopware</h3><p>Verlieren Sie nie mehr den Überblick über Ihr Inventar - auch wenn Sie zahlreiche Marktplätze wie Amazon, eBay, Etsy, METRO Marktplatz oder Kaufland.de) an Shopware angebunden haben. Über das magnalister Shopware Plugin können Sie eine Inventar-Übersicht aufrufen und auf einen Blick sehen, welche Produkte in welcher Stückzahl und zu welchen Preisen auf dem jeweiligen Marktplatz angeboten werden. So lassen sich auch Produkttitel aus Shopware heraus mit den Marktplatz-Titeln vergleichen.</p><h3>Mit magnalister international verkaufen auf eBay, Amazon, Etsy und Co.</h3><p>Mit magnalister sind Ihrem Multichannel-Vertrieb keine Grenzen mehr gesetzt. Verkaufen Sie Ihre Produkte auf den größten internationalen Marktplätzen wie Amazon (USA, UK, Schweden, Kanada, Polen, Mexiko, Türkei), eBay (USA, UK, Kanada) oder Etsy (weltweit) direkt aus Shopware heraus. Die Anbindung ausländischer Marktplätze ist genauso einfach wie einen deutschen Marktplatz mit Shopware zu verbinden. </p><p> Mit wenigen Klicks richten Sie das Plugin ein und können dabei spezielle Funktionen für den länderübergreifenden Handel nutzen: Definieren Sie pro Verkaufsland eigene Inhalte, Preise und Versandkosten. Ihre Produkte werden außerdem direkt in der richtigen Landeswährung an die Marktplätze übermittelt. Um Sprachbarrieren von Anfang an so niedrig wie möglich zu halten, greift das magnalister Shopware Marktplatz Plugin auf die in Shopware hinterlegten Sprachen zurück.</p><h3>Fehler-Reports direkt in Shopware ausgeben lassen</h3><p>Die meisten Marktplätze prüfen sehr genau, ob importierte Produkte, Varianten und Merkmale mit bestehenden Marktplatz-Angeboten in Konflikt stehen. Im magnalister Shopware Plugin können Sie mithilfe von Fehler-Reports prüfen, an welchen Stellen Verbesserungsbedarf besteht, damit Ihre Produkte korrekt gelistet werden. Über diesen Weg lassen sich auch Produkt-Dubletten innerhalb von Shopware identifizieren.</p><h3>magnalister Shopware Schnittstelle über Hook-Point-System anpassen</h3><p>Die Funktionen des magnalister Shopware Plugins sind flexibel erweiterbar**. Hierzu können Sie auf unser updatessicheres Hook-Point-System zurückgreifen und die Schnittstelle für Ihren Bedarf anpassen. Unser Experten-Team hilft bei der Einrichtung der Hook Points und der Individualisierung.</p><h3>magnalister ist die sichere Universal-Lösung für Ihren Multichannel Shopware-Shop</h3><p>Unser Versprechen: magnalister ist die komfortabelste Möglichkeit, einen Multichannel-Vertrieb über Shopware auf- und auszubauen. Das Plugin integriert sich ganzheitlich in Ihre Shopware-Installation, ersetzt externe Produktinformationsmanagement (PIM) Lösungen vollständig und kann in Ergänzung zu Ihrer Warenwirtschaft - wie z. B. Pickware - und vielen weiteren eCommerce Tools (z.B. Versand-Plugins) eingesetzt werden. </p><p> Ihre Produkt-, Kunden-, Bestell- und Rechnungsdaten bleiben jederzeit in Ihrem Shopware-Shop und werden nur zwischen Shopware, magnalister und den angebundenen Marktplätzen synchronisiert. So behalten Sie mit unserer Shopware Schnittstelle die volle Kontrolle über Ihre Multichannel-Absatzkanäle.</p><h3>Von Amazon bis Etsy - diese Marktplätze lassen sich mit dem magnalister Shopware Plugin verknüpfen</h3><p>Die magnalister Shopware Schnittstelle ist für eine Vielzahl von nationalen und internationalen Marktplätzen verfügbar und berücksichtigt dabei die speziellen technischen Herausforderungen sowie den jeweiligen Listing-Prozess der Plattformen:</p><ul><li>Amazon (Europa, USA, Kanada, UK)</li><li>eBay (Europa, USA, Kanada, UK)</li><li>Etsy</li><li>Kaufland.de</li><li>OTTO.de</li><li>METRO Marktplatz</li><li>idealo</li><li>Check24</li><li>ricardo.ch</li><li>Rakuten Frankreich (ehemals Priceminister)</li><li>Cdiscount </li></ul><h3>magnalister gehört zu den weltweit führenden Marktplatz Schnittstellen</h3><p>Das magnalister Plugin gehört shopübergreifend zu den fortschrittlichsten Schnittstellen-Technologien und wird seit mehr als 10 Jahren in Berlin entwickelt &amp; verbessert. Die Zahlen sprechen für sich:</p><p>2017 knackt magnalister die 2,2 Milliarden Euro Bestellimport-Marke. Seit der ersten magnalister Version im Jahr 2006 wurden über 291 Millionen Produktuploads und Artikelaktualisierungen mit der Schnittstelle durchgeführt. Durch die per magnalister angebundenen Marktplätze lassen sich international über 110 Millionen Kunden erreichen.</p><h3>magnalister arbeitet eng mit Shopware und den größten Marktplätzen zusammen</h3><p>Warum ist magnalister eines der führenden Shopware Marktplatz Plugins? Weil wir eng mit den Machern von Shopware zusammenarbeiten, in direktem Austausch stehen und die Schnittstelle ständig optimieren. Eine ebenso enge Partnerschaft pflegen wir mit den größten Online-Marktplätzen wie z.B. Amazon, eBay, Etsy oder real.de (zukünftig: Kaufland). Wir binden kontinuierlich neue und wachstumsstarke Marktplätze wie OTTO.de, METRO Marktplatz oder Etsy an und legen viel Wert darauf, die technischen Eigenheiten des jeweiligen Marktplatzes in unserem Shopware Plugin zu berücksichtigen. Damit bieten wir Händlern die optimale Ausgangslage für einen erfolgreichen Multichannel-Vertrieb im Web.</p><h3>Die Vorteile des magnalister Shopware Plugins im Überblick</h3><ul><li>Abgleich von Produkten, Bestellungen, Rechnungen und Lager mit den weltweit größten Marktplätzen</li><li>Bye Bye manuelle Marktplatzpflege: Enorme Zeitersparnis für Multichannel-Händler</li><li>Alles an einem Platz: zentrale Produkt- &amp; Bestellverwaltung für alle Marktplätze in Shopware</li><li>Effizient in der Einrichtung: Anbindung von Marktplätzen wie Amazon, eBay oder Etsy in Shopware mit wenigen Klicks</li><li>Ein Auge auf Details: Übermittlung der richtigen Produktvarianten und -attribute pro Marktplatz</li><li>Anpassungsfähig: magnalister lässt sich per Hook-Point-System individualisieren</li><li>Global handeln: Spezielle Funktionen für die Anbindung internationaler Marktplätze</li><li>Unterstützung durch Experten: Sie haben Zugriff auf den Einrichtungsservice und Expertensupport von magnalister</li><li>Das ist für Sie als Händler drin: Produktreichweite vergrößern, neue Kunden über neue Kanäle gewinnen und Umsatz steigern</li></ul><p>* Die Funktionsbeschreibung kann für einige Marktplätze leicht variieren. So unterstützt beispielsweise nicht jeder Marktplatz über seine API alle beschriebenen Funktionen in vollem Umfang.</p><p>** Setzt Programmierkenntnisse voraus. Nicht für Cloud (SaaS) Systeme verfügbar, da herstellerseitig kein Eingriff erlaubt.</p>","installationManual":"<h3>Plugin Manager</h3>Öffnen Sie den Plug-In Manager unter Einstellungen und installieren Sie das magnalister Plug-In. Nach der Installation ist der magnalister im Menüpunkt Marketing erreichbar. Hinterlegen Sie dort die Passphrase.<h3>Shopware Installation Wizzard</h3>Bei der Erstinstallation von Shopware finden Sie magnalister direkt im Shopware Installations Wizzard und können das Plugin dort direkt installieren. Nach der Installation ist der magnalister im Menüpunkt Marketing erreichbar. Hinterlegen Sie dort die Passphrase.<p></p>","version":"3.1.21","changelog":[{"version":"3.1.21","text":"<p><b>Shopware 6.5 specific changes:</b></p><ul><li>Fix for that some marketplace tabs could not be opened, due to missing required configuration settings</li><li>Amazon - Import Order: Settings for promotions are no longer under expert settings</li><li>METRO: French translations</li></ul>","creationDate":{"date":"2023-07-21 16:33:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.20","text":"<p><b>Shopware 6.4 specific changes:</b></p><ul><li>Fix for that some marketplace tabs could not be opened, due to missing required configuration settings</li><li>Amazon - Import Order: Settings for promotions are no longer under expert settings</li><li>METRO: French translations</li></ul>","creationDate":{"date":"2023-07-21 16:30:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.19","text":"<b>Shopware 6.5 specific changes:</b><br /><ul><li>Fixing a problem caused by partial use of https or http url by magnalister plugin (Docker hosted Shopware 6)</li><li>Amazon - Import Order: Settings for promotions are no longer under expert settings</li></ul>","creationDate":{"date":"2023-07-20 17:05:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.18","text":"<b>Shopware 6.4 specific changes:</b><br /><ul><li>Fixing a problem caused by partial use of https or http url by magnalister plugin (Docker hosted Shopware 6)</li><li>Amazon - Import Order: Settings for promotions are no longer under expert settings</li></ul>","creationDate":{"date":"2023-07-20 17:00:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.17","text":"<p><b>Shopware 6.5 specific changes:</b></p><ul><li>Update, sometimes stuck at 94.76% if the customer has Etsy</li><li>Shopware\n 6 - Base price: Problem solved where only the base price value was \nfilled in, but no unit (base price is then not valid)</li><li>Amazon - Product Matching: Fix issue with \"1 to 2 Workings Days\" could not be saved and uploaded</li><li>Amazon - Product Matching: When opening the old preparation, preselect the corresponding ASIN to a searched product</li><li>METRO - Product Preparation: Fixed error \"Data truncated for column BusinessModel\"</li><li>OTTO - Order Status Synchronization: Inclusion of the time zone in the shipping date when confirming the shipment to OTTO<br /></li></ul>","creationDate":{"date":"2023-07-14 12:27:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.16","text":"<p><b>Shopware 6.4 specific changes:</b></p><ul><li>Update, sometimes stuck at 94.76% if the customer has Etsy</li><li>Shopware\n 6 - Base price: Problem solved where only the base price value was \nfilled in, but no unit (base price is then not valid)</li><li>Amazon - Product Matching: Fix issue with \"1 to 2 Workings Days\" could not be saved and uploaded</li><li>Amazon - Product Matching: When opening the old preparation, preselect the corresponding ASIN to a searched product</li><li>METRO - Product Preparation: Fixed error \"Data truncated for column BusinessModel\"</li><li>OTTO - Order Status Synchronization: Inclusion of the time zone in the shipping date when confirming the shipment to OTTO<br /></li></ul>","creationDate":{"date":"2023-07-14 12:18:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.15","text":"<ul><li>Shopware 6.5 - Amazon - Manual Matching: Fix a problem to display variation detail in manual matching</li><li>Shopware 6.5 - Kaufland - Error: Truncated incorrect INTEGER value: 'a ' fixed<br /></li></ul>","creationDate":{"date":"2023-06-22 14:01:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.14","text":"<ul><li>Shopware 6.4 - Amazon - Manual Matching: Fix a problem to display variation detail in manual matching</li><li>Shopware 6.4 - Kaufland - Error: Truncated incorrect INTEGER value: 'a ' fixed<br /></li></ul>","creationDate":{"date":"2023-06-22 13:38:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.13","text":"<ul><li>Shopware 6.5.X - Fix a problem to load magnalister plugin for shops with sale channels with HTTP- and HTTPS-domain URL for same host</li></ul>","creationDate":{"date":"2023-06-16 12:19:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.12","text":"<ul><li>Amazon - Fix the problem with \"Truncated incorrect INTEGER value: '1 - 2 working days'\"</li><li>eBay - Product Upload - Fix problem to show always tax included for single product</li></ul>","creationDate":{"date":"2023-06-15 17:05:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.11","text":"<ul><li>Compatibility with Shopware 6.5</li></ul>","creationDate":{"date":"2023-06-13 16:48:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.10","text":"<ul><li>METRO - Supporting new shipping and origin countries (ES, IT, PT, NL, FR)</li><li>Hood - Product Preparation - Supporting Item name length up to 85 Characters</li></ul>","creationDate":{"date":"2023-06-07 16:08:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.09","text":"<ul><li>Plugin Update: Fixed a problem where the update was stuck at about 92 percent</li><li>eBay - Configuration - Product Upload: New configuration to always show \"Incl. VAT\"</li><li>Kaufland.de: Shipping Time removed</li><li>OTTO - Product Upload: Sending not variant image of master product at the of variants images<br /></li></ul>","creationDate":{"date":"2023-05-31 17:28:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.08","text":"<ul><li>Fix a problem with loading magnalister plugin when a sales channel of Shopware shop has different similar domain URL</li><li>Etsy - Possibility to cancel preparation partially (e.g. Reset \"When made\")</li></ul>","creationDate":{"date":"2023-05-15 12:56:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.07","text":"<ul><li>All marketplaces - Fix an issue in version 3.1.06 to show the magnalister admin page in the language of the user profile.</li></ul>","creationDate":{"date":"2023-05-09 17:38:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.06","text":"<ul><li>Fix the problem of loading the magnalister admin page if the Shopware admin user doesn't have a language in the user profile.</li><li>Fix the problem of loading the magnalister admin page if some sales channels of Shopware are in maintenance mode</li></ul>","creationDate":{"date":"2023-05-05 16:42:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.05","text":"<ul><li>Fix a problem by loading magnalister plugin if in storefront sales channel of Shopware shop a domain with a virtual URL is used</li><li>All Marketplaces - Attribute matching - Adding scale unit and seller unit as a separate attribute</li><li>OTTO - Price Synchronization - Prevent re-sending price to OTTO if shop price has more than 2 decimals</li></ul>","creationDate":{"date":"2023-05-02 12:44:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.04","text":"<ul><li>Kaufland.de: Handling Time content adjustment</li></ul>","creationDate":{"date":"2023-04-25 12:41:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.03","text":"<ul><li>Database structure: Remove all ZERO DATES database structure options from magnalister</li><li>All Marketplaces - Image processing - Fix problem with http image URLs automatically redirected to https URL</li><li>All Marketplaces - Inventory View and Error-Log - Fix problem using delete button in French language</li><li>Kaufland.de: Shipping Time becomes Handling Time<br /></li></ul>","creationDate":{"date":"2023-04-25 10:17:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.02","text":"<ul><li> All Marketplaces - Image Processing - Fix the problem to show Shopware images in magnalister by wrong server configuration</li></ul><br /><br />","creationDate":{"date":"2023-04-18 14:01:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.1","text":"<ul><li>All Marketplaces - Fix an issue by clicking on marketplace tabs when using PHP 8 - The issue occurs from the previous version of magnalister</li></ul>","creationDate":{"date":"2023-04-13 17:00:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.00","text":"<ul><li>Check24 - Configuration: \"Image size\" option added</li><li>Etsy: Problem with update stuck at about 95 percent is fixed</li><li>OTTO - Product preparation: When preparing multiple products, optional category-independent attributes were not displayed<br /></li></ul>","creationDate":{"date":"2023-04-12 11:15:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.99","text":"<ul><li>Kaufland.de - Product deletion: Problem solved that after deleting a product, a white page appears</li><li>OTTO - Product upload: Support for uploading shop attributes with more than one value (e.g. Shopware properties)</li><li>eBay - Synchronize Order Status - Refund: Fix PHP error if refund status is not configured</li><li>Etsy - Compatibility with the newest Etsy API</li></ul>","creationDate":{"date":"2023-04-06 10:41:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.98","text":"<ul><li>Plugin First Load - fixes a problem with magnalister on certain internet connections</li><li>All Marketplaces - Image processing - Fix a problem by generating images with some special servers' configuration</li><li>OTTO\n - Product preparation + upload: Problem with marketplace value \"true\" \nand \"false\" fixed + Support for \"comma separated\" numbers</li><li>OTTO - Preparation - Prevent to fail by saving preparation because of missing image error</li></ul>","creationDate":{"date":"2023-03-28 14:30:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.97","text":"<ul><li>Fix a security issue by magnalister admin page</li></ul>","creationDate":{"date":"2023-03-10 13:40:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.96","text":"<ul><li>Amazon - First Configuration - Fix the error message \"There is a problem to get the currency of Amazon\"</li></ul>","creationDate":{"date":"2023-03-06 20:48:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.95","text":"<ul><li>Amazon - Prepare Product List - Fix problem with product list being displayed twice</li><li>Image Processing - Supporting WebP images</li></ul>","creationDate":{"date":"2023-03-01 22:35:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.94","text":"<ul><li>- Shopware 6 - CSRF token issue fixed in AJAX mode</li><li>All Marketplaces - Attributes Matching: No display of attributes after selecting the category is fixed</li><li>All Marketplaces - Image Processing - Fix a problem of long loading by resizing images</li><li>Global Configuration - Fix a rare PHP-Fatal error by first configuration</li><li>eBay - Attributes Matching: PHP 8.1+ compatibility</li><li>Etsy - Attribute Matching - Fix several problems to match different attributes</li><li>Etsy - Attribute Matching - Fix a problem to match text field attribute</li><li>METRO - Volume prices: Add markup or markdown setting for \"Webshop\" option<br /></li></ul>","creationDate":{"date":"2023-02-24 15:54:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.93","text":"<ul><li>OTTO and METRO - Product Preparation: Fixed issue that preparation could not be opened<br /></li></ul>","creationDate":{"date":"2023-02-09 12:55:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.92","text":"<ul><li>All Marketplaces - Order Import - Use not specified gender if gender is not provided from the marketplace</li><li>All Marketplaces - Inventory tab: Text \"Price\" to \"Shop Price / Marketplace Price\" corrected</li><li>All Marketplaces - Product preparation and Upload: Error \"Column 'MarketplaceIdentSku' cannot be null (1048)\" fixed</li><li>All Marketplaces - Product images: Resolve an issue by resizing and sending images with names that contain spaces</li><li>Amazon \"Click &amp; Collect in store\": Create and Update store concept improved</li><li>Amazon\n \"Click &amp; Collect in store\": Status of orders could not be changed \nin \"Orders\" tab because the submit button had an error</li><li>eBay: Variation error for foreign languages corrected</li><li>METRO - Support for volume prices</li><li>idealo - Product preparation: Payment method is now a mandatory field<br /></li></ul>","creationDate":{"date":"2023-02-08 18:36:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.91","text":"<ul><li>All Marketplaces - Order Import - Fix a problem by creating a customer in Shopware 6.4.18.1</li></ul>","creationDate":{"date":"2023-01-18 17:51:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.90","text":"<ul><li>All Marketplaces - Product Preparation - Choose Marketplace Category - Fix the problem in the previous version</li><li>eBay, Etsy - Request token button - Fix the problem in the previous version</li></ul>","creationDate":{"date":"2023-01-13 00:17:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.89","text":"<ul><li>Hood - Synchronize order status: Fixed issue where orders are no longer synchronized as of version 3.0.88</li><li>Statistics: Now show up to 14 months back</li><li>Etsy: new values for Item Creation Time</li></ul>","creationDate":{"date":"2022-12-16 15:37:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.88","text":"<ul><li>Amazon BOPIS - Inventory synchronization: Fixed issue with submitting store stock for non BOPIS products</li><li>Amazon BOPIS - Refund order status synchronization: Fixed issue that refund could not be triggered via order status</li></ul>","creationDate":{"date":"2022-12-07 16:37:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.87","text":"<ul><li>Amazon BOPIS - Inventory synchronization: Fixed issue with submitting store stock for unprepared products<br /></li></ul>","creationDate":{"date":"2022-12-06 13:01:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.86","text":"<ul><li>METRO - Product Preparation: Fix issue with showing that manufacturer and mpn field are set as \"always use from webshop\"<br /></li></ul>","creationDate":{"date":"2022-11-23 16:34:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.85","text":"<ul><li>Order Import: Street address field can not be empty - check for and set to \"--\" when empty</li><li>Synchronization\n - PHP 8 Fix: If a SKU has problems and throws an exception, the entire \nsynchronization process must not be interrupted<br /></li></ul>","creationDate":{"date":"2022-11-15 17:36:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.84","text":"<ul><li>Amazon - Configuration - Fix a broken configuration field</li></ul>","creationDate":{"date":"2022-10-27 13:55:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.83","text":"<ul><li>PHP 8+: Fixed some compatibility</li><li> Amazon Inventory Tab: Performance improvement through static Amazon product URLs</li></ul>","creationDate":{"date":"2022-10-25 16:06:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.82","text":"<ul><li>General Performance: Improve session storage and deletion</li><li>OTTO - Preparation - Fix a problem by brand matching<br /></li></ul>","creationDate":{"date":"2022-10-24 14:36:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.81","text":"<ul><li>Hood - Configuration - Order Status Synchronization - Fix problem to configure and synchronization of correct cancel status</li></ul>","creationDate":{"date":"2022-10-11 18:08:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.80","text":"<ul><li>All Marketplaces - Order Import - Use maximum tax of product for shipping cost (Correction in some special cases)</li><li>Amazon - Product Matching: Don't save the matching for a product that is selected to be not matched</li><li>Amazon - Fixed the missing currency code</li><li>eBay - Product Properties: Show product properties just like Shopware front end</li><li>Etsy - Generating Shipping Template - Add required field and correction of messages</li><li>Amazon - Shipping Label - Order List - Correct the problem to select orders from several pages</li></ul>","creationDate":{"date":"2022-09-27 17:28:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.79","text":"<ul><li>Order Import: If the company name is provided by the marketplace, the type of customer account is now business</li><li>Error message \"Invalid character set was provided\" fixed<br /></li></ul>","creationDate":{"date":"2022-09-08 16:59:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.78","text":"<ul><li>Invoice Upload: Fix a problem by getting correct invoice number from the shop</li><li>Product Preparation: Fix broken page due to .mp4 files<br /></li><li>Amazon - Order Import: Not defined shipping group options should not prevent the plugin from importing orders</li><li>Amazon - Product Preparation: Fix a SQL error (Field 'AIdentID' doesn't have a default value (1364))</li><li>Amazon - Product Matching: Only shipping templates are allowed from now on</li><li>Amazon - Product Matching: Fix SQL Error \"Field 'MainCategory' doesn't have a default value (1364)\"</li><li>Amazon - Product Upload: Matched products now show the configured and matched tax code</li><li>eBay - Product Preparation: Fix a problem by preparing products with long eBay category name</li><li>Hood.de - Configuration - Order Cancellation: Allow to not set a status for order cancellation (this option is now optional)</li><li>METRO - Inventory View: Fix if no shipping costs are set in product preparation</li><li>METRO - Product Preparation: Fix a problem by showing prepared shipping profile in product preparation<br /></li></ul>","creationDate":{"date":"2022-09-05 16:34:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.77","text":"<ul><li>eBay - Product Preparation - Product Upload: Use prepared title also for variations</li><li>eBay - Product Preparation: Fix a problem by showing attribute by multi product preparation</li></ul>","creationDate":{"date":"2022-08-05 13:18:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.76","text":"<ul><li>Etsy: Fixing a problem where you got stuck in the configuration</li></ul>","creationDate":{"date":"2022-08-03 10:53:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.75","text":"<ul><li>All Marketplaces - Product List: Remove repetitive time from \"Prepared on\" filter</li><li>Amazon - Quantity - Product Upload / Synchronization: Added expert option \"Limitation for Number of Items\"</li><li>Amazon - Shipping Label: Show list of orders very faster than before</li><li>Hood.de\n - Synchronization - Config \"Transfer variations\" deactivated: Fix that \nit is still possible to synchronize every single variation with single \nproducts on Hood.de</li><li>METRO: Solving GTIN Restriction (Product without GTIN can be uploaded also with Manufacture and MPN)</li></ul>","creationDate":{"date":"2022-07-26 15:10:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.74","text":"<ul><li>Amazon new Authorization Flow (especially for Amazon SP-API Migration) <br /></li></ul>","creationDate":{"date":"2022-07-13 14:41:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.73","text":"<ul><li>All Marketplaces - Order Import: Internal total product price data at order fixed<br /></li></ul>","creationDate":{"date":"2022-07-08 12:09:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.72","text":"<ul><li>All Marketplaces - Images Processing: Fix the error when \"exif_imagetype\"-function doesn't exist</li><li>Amazon - Configuration - Credentials: Field MarketplaceId is removed and will be set by us based on given Amazon Site</li><li>Cdiscount - Order Status Synchronization: Submission of Carrier and Carrier Matching in Configuration added</li><li>eBay Order Import: Buyer's Message</li><li>Hood - Product Preparation: The problem with using \"=GEWICHT\" placeholder as shipping cost for foreign countries is fixed<br /></li></ul>","creationDate":{"date":"2022-06-29 15:27:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.71","text":"<ul><li>All Marketplaces - Price Calculation: Fix a problem with the calculation of the price in a currency other than the default currency</li></ul>","creationDate":{"date":"2022-06-15 17:24:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.70","text":"<ul><li>All Marketplaces - Product Preparation: Only jpg, jpeg, png and gifs supported as product images</li><li>All Marketplaces - Image Processing: Supporting to get product image stored in external media server (e.g. Amazon S3)</li></ul>","creationDate":{"date":"2022-05-12 17:21:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.69","text":"<ul><li>eBay - Configuration: Don't show any error if refund status configuration is same as another status configuration</li><li>eBay - Preparation: Fix white page problem after saving preparation</li><li>Hood.de - Inventory: Product links to hood.de fixed</li><li>All Marketplaces - Show weight and dimensions extra unit attributes</li><li>eBay - Preparation: A rare problem by loading a category attribute is fixed</li><li>OTTO - Configuration: Fix PHP notices by new configuration</li></ul>","creationDate":{"date":"2022-05-05 22:13:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.68","text":"<ul><li>Order Import: Prevent to insert different customer number in customer and order_customer table of Shopware</li><li>eBay - Product - Upload: Transferring weight of product by upload</li><li>eBay \"Synchronize External Items\" checkbox removed</li><li>Import Orders: In rare cases, orders were no longer imported (fixed)</li></ul>","creationDate":{"date":"2022-04-26 17:42:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.67","text":"<ul><li>Idealo - Configuration: Disable forwarding fee fields, if shipping method is not forwarding</li><li>eBay - Configuration / Product Preparation: HitCounter removed</li><li>Attribute Matching: Fixed issue, where not all matched attributes were saved</li><li>Order Import: Fixed a problem with the language of the sales channel that prevented the creation of invoices</li></ul>","creationDate":{"date":"2022-04-08 16:36:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.66","text":"<ul><li>Amazon/eBay - Attribute Matching: Fix a problem to send matched own value</li><li>Marketplace Configuration - Order Custom Field: Translations correction</li></ul>","creationDate":{"date":"2022-04-05 14:45:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.65","text":"<ul><li>Custom fields selection for uploading invoice number to Amazon, METRO and Kaufland.de is now available</li><li>Custom fields selection for sending shipping method, carrier and ... to Amazon and OTTO is now available</li></ul>","creationDate":{"date":"2022-03-31 16:48:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.64","text":"<ul><li>Order Import - Salutation: If default salutations are removed or renamed, we are using now some fallbacks</li><li>Order\n Import - Duplicate Addresses for customer: Fixed bug that multiple \ncustomer addresses have been imported even if the same address details \nwere already in the shop<br /></li></ul>","creationDate":{"date":"2022-03-23 17:04:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.63","text":"<ul><li> PriceMinister - Upload product: Changing the product title \nlength to 200 characters and description to now a maximum of 4000 \ncharacters</li><li>Amazon - Product Upload: Fixed problem where variations were not uploaded correctly</li><li>Idealo - Price Comparison Marketplace (like Idealo) - Product upload: Product URL was wrong for variations</li><li>eBay - Configuration - Refunds: Fixed issue where refund settings could not be saved correctly</li><li>Shopware 6.4 and higher - Product prices: Fixed an issue where the wrong price of a currency was synced or uploaded<br /></li></ul>","creationDate":{"date":"2022-03-22 13:08:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.62","text":"<ul><li>eBay, Hood, Cdiscount: Fixed Bug where shipping costs are not saved</li><li>eBay Product Preparation: Fixed Error: \"Field 'SecondaryCategoryName' doesn't have a default value (1364)\"</li><li>Order Import: New approach and global configuration to skip Shopware 6 \"Flows\" due to performance issues<br /></li></ul>","creationDate":{"date":"2022-03-09 15:37:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.61","text":"<ul><li>eBay - Product Template: Use custom field placeholder instead of free text field</li><li>Amazon - Order Config - Duplicate Fields: Only 2 fields creatable bug fix<br /></li><li>Shopware 6 - Invoice Configuration: Fix a rare problem to load document types</li></ul><p><br /><br /></p>","creationDate":{"date":"2022-03-05 00:20:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.60","text":"<ul><li>eBay - Preparation: The error \"Incorrect integer value: '' for column `magnalister_ebay_prepare`.`ShippingLocalDiscount` at row 1\" is fixed</li><li>Order Import - Fix a problem by inserting magnalister order data in to database with some special settings</li></ul>","creationDate":{"date":"2022-02-28 18:11:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.59","text":"<ul><li>Hood.de - Product Preparation: Fix a problem to uncheck all features in preparation form</li><li>Hood.de - Translations in English: Update missing or wrong translations</li><li>METRO - Product Upload - Max Processing Time: Removed option \"0\" because max processing time should be at least 1</li><li>Idealo - Order Import: Import payment method from Idealo by default</li><li>Kaufland.de - Submit \"Weight\" Shop-Attribute as Unit and Value instead of just the value</li><li>Order\n Import: Second additional address field does not need to be filled with\n the Packstation customer ID if the first field is already filled with \nthe Packstation customer ID<br /></li></ul>","creationDate":{"date":"2022-02-25 10:01:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.58","text":"<ul><li>Cdiscount - Product Upload / Configuration: New Shipping Methods available</li></ul>","creationDate":{"date":"2022-02-14 15:23:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.57","text":"<ul><li>Shopware 6.4 - All Marketplace: Fix the problem of long loading and broken page by \"Error-Log\" and \"Inventory-View\"</li></ul>","creationDate":{"date":"2022-02-10 12:21:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.56","text":"<ul><li>Shopware 6.3 - All Marketplace: Fix the problem of long loading and broken page by \"Error-Log\" and \"Inventory-View\"<br /></li></ul>","creationDate":{"date":"2022-02-10 11:17:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.55","text":"<ul><li>All new changes for Shopware 6.3</li></ul>","creationDate":{"date":"2022-02-04 13:34:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.54","text":"<ul><li>All Marketplace - Order Import: Fix the problem with importing wrong tax amount</li><li>Product-List - Filter: Fix a rare problem by marketplace status filter</li></ul>","creationDate":{"date":"2022-02-04 13:22:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.53","text":"<ul><li>Shopware 6 - Order Import not working fix</li></ul>","creationDate":{"date":"2022-02-02 16:29:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.52","text":"<ul><li>METRO Price Synchronization: Since METRO uses net prices, the \nprice markup or markdown from marketplace configuration was not applied</li><li>OTTO - Product Upload: Fixed an issue where the product upload was stopped because a product has no price in the webshop</li><li>Invoice Upload: Document type selection added in marketplace configuration </li></ul>","creationDate":{"date":"2022-01-31 15:28:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.51","text":"<ul><li>All new changes for Shopware 6.3</li></ul>","creationDate":{"date":"2022-01-27 16:14:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.50","text":"<ul><li>All Marketplaces - Order Import: Fix a problem to import if marketplace order-address-name is longer than allowed</li></ul>","creationDate":{"date":"2022-01-27 13:49:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.49","text":"<ul><li>All Marketplaces - Order Import: Fix a problem to import order-item without SKU from marketplaces</li></ul>","creationDate":{"date":"2022-01-27 08:38:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.48","text":"<ul><li>Order Import: Fix a problem to get product tax by shipping address</li><li>Order Import: Fix a problem if some flow rules are not properly saved in Shopware</li><li>Product-List: Optimizing loading and selection of products</li></ul>","creationDate":{"date":"2022-01-25 17:55:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.47","text":"<ul><li>Invoice Upload: Process 10 orders per Request - sometimes PDF files are so big that server post size exceeds</li><li>Marketplace configuration - Check if the same order status is used multiple times - Example: For import and shipping</li><li>METRO - Product Upload: Add missing required \"max processing time\" to configuration and product preparation<br /></li></ul>","creationDate":{"date":"2022-01-24 16:05:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.46","text":"<ul><li>Product Upload: Fix a problem by sending variant-product description</li></ul>","creationDate":{"date":"2022-01-14 10:43:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.45","text":"<ul><li>Order Import: Fix some problem by executing \"order.placed\" flows</li><li>Order Import: Import marketplace order date as order date in Shopware order</li></ul>","creationDate":{"date":"2022-01-11 17:15:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.44","text":"<ul><li>METRO Offer API v2 - Migration to the new API endpoint</li><li>METRO: Submission of net price instead of gross price for products</li><li>METRO: METRO Spain is now supported</li><li>METRO: Min and max delivery time can now be entered<br /></li></ul>","creationDate":{"date":"2022-01-04 11:47:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.43","text":"<ul><li>Amazon - Import FBA orders: Added option to ignore FBA orders on import</li><li>Kaufland.de - Price Synchronization: Minimum Price Feature - Disable Option \"Use from Marketplace\"</li><li>Kaufland.de - Attributes Matching: Dropdown doesn't contain any values fix<br /></li></ul>","creationDate":{"date":"2021-12-28 18:25:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.42","text":"<ul><li>OTTO - Attributes Matching: CSS fixes</li><li>Kaufland.de - Order Status Synchronization: A problem by sending shipping method as carrier is fixed<br /></li></ul>","creationDate":{"date":"2021-12-21 15:56:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.41","text":"<ul><li>Product Preparation - Attributes Matching: Dropdowns search support</li><li>Amazon - Product Preparation - Browse Nodes: Dropdown search support</li><li>Error log: Sorting now by date descending by default</li><li>PHP 8 Compatibility Fixes</li></ul>","creationDate":{"date":"2021-12-15 15:07:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.40","text":"<br /><ul><li>All Marketplaces - Order Import: Skip \"Placed Order\" event if there are some errors to execute flow of it</li><li>All Marketplaces - Order Status Synchronization: Prevent the problem by getting shop order data</li><li>Check24 - Preparation, Product Upload: Fix the problem with comma separated shipping cost</li><li>Shopware 6.4.7: The compatibility issue is fixed</li></ul>","creationDate":{"date":"2021-12-10 15:52:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.39","text":"<ul><li>Order Import: Trigger \"Order Placed\" event by order import</li><li>Order Import - Products: Some inconsistencies in the database were corrected</li><li>All Marketplaces - Order Cancel Status Configuration: Preselect the best status for cancellation, depends on the shop-system</li><li>Image Processing: Handling image url with spaces and solved a problem by normalizing image url<br /></li></ul>","creationDate":{"date":"2021-12-06 12:22:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.38","text":"<ul><li>Order Import - Products: Set correct \"position\" in database for each ordered product</li><li>Order\n Status Syncronization: Fixed issue when Shopware OrderNumber is \noverwritten by individual programming (Order Number equals Marketplace \nOrder Id)</li><li>Amazon US - Order Status Synchronization: Fix a problem with time zone difference</li><li>Image processing: Fix a problem to find images size in special cases</li></ul>","creationDate":{"date":"2021-11-29 13:31:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.37","text":"<ul><li>OTTO - Order Configuration: Add payment status configuration field<br /></li></ul>","creationDate":{"date":"2021-11-22 17:46:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.36","text":"<ul><li>OTTO - Synchronization of order status: If multiple return keys \n(comma or semicolon separated) are specified, we will only submit the \nfirst one<br /></li></ul>","creationDate":{"date":"2021-11-22 12:05:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.35","text":"<ul><li>Release new fixes for Shopware 6.3</li></ul>","creationDate":{"date":"2021-11-15 12:17:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.34","text":"<ul><li>CDiscount - Product Upload: Prevent to separate variants of a product</li><li>All marketplaces - Order import: Fix a problem if existing product is not related to the sales channel</li><li>Amazon - Preparation: Now it is possible to save \"0\" as EAN for a product</li><li>All marketplaces - Order Synchronization: Correction by submitting the shipping date of orders to marketplaces</li></ul>","creationDate":{"date":"2021-11-15 12:00:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.33","text":"<br /><ul><li>All Marketplace - Product Upload - Price Synchronization: \nSupporting advanced pricing by submitting product price to  marketplaces</li><li>All Marketplace - Product List: Fix the problem of long loading of the product list caused by retrieving HTTP images</li><li>All\n Marketplace - Attribute Matching: Display custom field with technical \nname for better distinction between custom field with same label</li><li>Amazon - Buy Shipping Label - Filters: New Filter Options for Merchant Fulfillment Channel \"SameDay, NextDay, SecondDay\"</li><li>Upload ERP Invoice - Amazon/METRO/Kaufland.de: Additional Support for \".PDF\" instead of only \".pdf\"</li><li>Optimization of magnalister database table performance for orders processes</li></ul>","creationDate":{"date":"2021-10-27 15:03:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.32","text":"<ul><li> Global Configuration: \"Configuration couldn't be open to correct the wrong passphrase\" is fixed, (Problem from  v3.0.22)<br /></li></ul><ul><li>Check24 - Product Preparation: Prevent SQL error by saving multi product preparation</li></ul>","creationDate":{"date":"2021-10-12 13:40:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.31","text":"<ul><li>Shopware 6.3 - Release new fixes for Shopware 6.3</li></ul>","creationDate":{"date":"2021-10-08 16:24:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.30","text":"<ul><li>All Marketplace: Fix the problem by using \"If the product status is inactive, the stock will be set to 0\" in global configuration by synchronizing of variants stock</li></ul>","creationDate":{"date":"2021-10-08 12:58:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.29","text":"<ul><li>All Marketplaces - Product-List - Marketplace Status Filter: Improvement by getting inventory data, resuming the broken process</li><li>OTTO: Prevent to displaying removed categories of OTTO in magnalister plugin</li></ul>","creationDate":{"date":"2021-10-07 18:16:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.28","text":"<ul><li>eBay - Order Import: Added feature to avoid shipping notifications to eBay buyers</li><li>eBay - Item Condition Description: It's now possible to add a text description of the item condition (up to 1000 characters) in the item preparation form</li><li>Shopware 5: PHP 8 warning \"Private function cannot be final\" is solved</li><li>Amazon - FBA Business OrderView: Logo added</li></ul>","creationDate":{"date":"2021-10-01 13:02:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.27","text":"<ul><li>Shopware 6 - Solve a problem with PHP 8</li></ul>","creationDate":{"date":"2021-09-23 17:08:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.26","text":"<ul><li>Improvement by importing orders by solving the conflict of SQL transactions</li></ul>","creationDate":{"date":"2021-09-21 11:00:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.25","text":"<ul><li>Shopware 6.3 - Release new fixes for Shopware 6.3</li></ul>","creationDate":{"date":"2021-09-16 14:05:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.24","text":"<ul><li>eBay - Importing, updating and merging Order - Preventing to import repetitive addresses</li><li>eBay - Importing, updating and merging Order - Preventing to change delivery status by updating order</li><li>eBay - Importing, updating and merging Order - Show shipping cost properly</li><li>eBay - Importing, updating and merging Order - Fix a problem to update order payment status</li></ul>","creationDate":{"date":"2021-09-16 13:08:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.23","text":"<ul><li>Etsy - Inventory View - A problem to show prices in inventory is fixed- <br /></li><li>Shopware 6 - Processing cover images of variants as first images of the variant</li></ul>","creationDate":{"date":"2021-09-14 18:57:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.22","text":"<ul><li>Shopware 6 - Product Preparation : Fixed variations with empty pictures<br /></li><li>Hood.de - JSON Encoding Error PHP 7.4+ Compatibility</li><li>Kaufland.de - Short Description: As alternative, we use now meta keywords if short description is empty in shop</li><li>Rookie Plan Added</li></ul>","creationDate":{"date":"2021-09-03 23:55:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.21","text":"<ul><li>Shopware 6 - Order Import - Payment Status: Always use configured Payment Status from marketplace configuration</li><li>Shopware 6 - Use SessionID from PHP session_id() function because CSRF token could change per request, like during AJAX calls</li><li>Amazon - Order Import: Import of VAT ID if provided from Amazon<br /></li></ul>","creationDate":{"date":"2021-08-16 17:42:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.20","text":"<ul><li>Shopware 6 - Order Import: Fix where PhoneNumber is empty</li><li>Idealo - Product Preparation and Product Upload - Fix Upload of prepared Item Title and add Option \"Use always from Webshop\"</li><li>Check24 - Product Upload: New Feed Fields</li></ul>","creationDate":{"date":"2021-08-09 12:46:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.19","text":"<ul><li>Shopware 6 Attributes: Sort by Position and Name</li><li>Shopware 6: Remove debugging code (regarding MySQL)</li><li>Attributes Matching Tab: Category dropdown now shows the last matched categories</li><li>eBay Product Preparation: Speed up load of product preparation for already used categories</li></ul>","creationDate":{"date":"2021-08-02 13:43:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.18","text":"<ul><li>Shopware 6.4: 3rd Party Plugins Compatibility \"NetSwitcher\"</li><li>Amazon - Fix B2B Configuration and Product Preparation errors when configured incorrectly</li><li>Kaufland.de - Removed price field from product preparation</li><li>OTTO - Configuration: Show at VAT Matching \"Please Choose\" if a value is not matched<br /></li></ul>","creationDate":{"date":"2021-07-21 15:58:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.17","text":"<ul><li>Metro Invoice Upload</li></ul><ul><li>Kaufland.de Invoice Upload</li><li>Amazon ERP Invoice Upload</li><li>Attributes Matching: After clicking + or - it is reloading the page and move to last position in the form</li><li>Etsy: New Tracking Code Matching in Marketplace Configuration</li></ul>","creationDate":{"date":"2021-07-19 16:20:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.16","text":"<ul><li>Rakuten FR / PriceMinister - Configuration - New mandatory field\n to specify \"Shipping from country\" due to VAT changes from July 1.</li><li>AttributesMatching - Problems with special chars like \"&amp;\" in attributes fixed</li><li>Image Generator - Fix for PHP 8</li></ul>","creationDate":{"date":"2021-06-29 17:15:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.15","text":"<p>Compatibility with Shopware 6.4</p>","creationDate":{"date":"2021-06-24 13:00:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.14","text":"<p>- If a user wants to delete all plugin data by uninstalling of the magnalister-plugin, all table of magnalister will be deleted from database.</p><p><br /></p><p>- Use Shopware general log and cache directory to add new magnalister file in file-system<br /></p>","creationDate":{"date":"2021-06-21 20:11:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.11","text":"<p>The first version of the magnalister plugin for Shopware 6 in the community store</p>","creationDate":{"date":"2021-03-11 15:27:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Red4363948025224","redirectToStore":false,"lowestPriceValue":0}