{"id":10185,"name":"ZeobvGetNotified","code":"zeobv82482397379","lastChange":{"date":"2023-07-20 12:09:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvJY7Bc","examplePageUrl":"","moduleKey":"ZeobvGetNotified","creationDate":{"date":"2019-11-01 08:51:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-11-04 09:29:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-21 09:30:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":15843,"name":"Wieder auf Lager-Benachrichtigungen","description":"<p>Kommt es vor, dass ein Produkt nicht mehr vorrätig ist, Sie aber keine effiziente&nbsp;Möglichkeit haben Ihre Kunden über neue Bestände zu benachrichtigen? Das soll&nbsp;der Vergangenheit angehören! Das Get Notified-Plugin gibt Kunden die Möglichkeit,&nbsp;ihre E-Mail zu hinterlassen, damit sie benachrichtigt werden, sobald Ihr Unternehmenihr gewünschtes Produkt wieder vorrätig hat, was sich sowohl für Unternehmen als&nbsp;auch für Kunden positiv auswirkt!ihr gewünschtes Produkt wieder vorrätig hat, was sich sowohl für Unternehmen als&nbsp;auch für Kunden positiv auswirkt! Ihr gewünschtes Produkt wieder vorrätig hat, was sich sowohl für Unternehmen als&nbsp;auch für Kunden positiv auswirkt!</p><h3>Vorteile&nbsp;</h3><p><b>Verhindern Sie verpasste Umsätze&nbsp;</b></p><p>Kein einziger Verbraucher mag es, wenn sein Wunschprodukt nicht vorrätig ist.&nbsp;Wenn Sie ihnen also die Möglichkeit geben, sich benachrichtigen zu lassen, sobald&nbsp;das Produkt wieder vorrätig ist, können Sie sie trotzdem konvertieren und verhindern, dass sie möglicherweise bei einem Ihrer Wettbewerber einkaufen.</p><p><b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\">Binden Sie Besucher an Ihr Geschäft</b><br></p><p>Sobald ein Kunde seine E-Mail hinterlässt, haben Sie als Unternehmen die&nbsp;Möglichkeit, ihnen an Ihr Geschäft zu binden. Mit dem Get Notified-Plugin können&nbsp;Sie die Kunden nach der Aufstockung des Produkts benachrichtigen, so dass sie in&nbsp;Ihr Geschäft zurückkehren und den Kauf des gewünschten Produkts abschließen!</p><p><b>Einblick in die Nachfrage&nbsp;</b></p><p>Mit Hilfe des Get Notified Plugins teilen Sie Ihren Kunden nicht nur mit, dass ein&nbsp;Produkt wieder verfügbar ist, sondern Sie erhalten auch wertvolle Einblicke in die&nbsp;tatsächliche Nachfrage nach dem Produkt. Dies erleichtert die Vorhersage der&nbsp;Nachfrage für nachfolgende Zeiträume und führt zu positiveren&nbsp;Geschäftsergebnissen.</p><p><b>Macht das Marketing einfacher</b></p><p>Anstatt Kunden-E-Mails auf herkömmliche Weise zu sammeln, können Sie mit den&nbsp;Get Notified-Plugins dafür sorgen, dass Kunden ihre E-Mail hinterlassen, die&nbsp;wiederum für mögliches zukünftiges E-Mail-Marketing genutzt werden kann!&nbsp;</p><h3>Immer noch nicht überzeugt?</h3><p>Über 400 Unternehmen haben das Get Notified-Plugin bereits eingesetzt. Zum&nbsp;Beispiel haben die folgenden Geschäfte das Plugin bereits in ihre Shops integriert:</p><p><a href=\"https://www.cgproducten.nl/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://www.cgproducten.nl/</a>&nbsp;<a href=\"https://www.knipidee.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.knipidee.nl/</a>&nbsp;&nbsp;<a href=\"https://www.casada.de/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://www.casada.de/</a>&nbsp;<a href=\"https://eisenbaer.de/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://eisenbaer.de/</a>&nbsp;<a href=\"https://electropapa.com/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://electropapa.com/</a>&nbsp;</p><h3><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>Erste Schritte mit dem Get Notified Plugin:</h3><h4>1. Installation und Konfiguration</h4><p></p><ul><li>Laden Sie das Plugin \"Back in stock notifications\" aus dem Community Store herunter</li><li>Aktivieren Sie das Plugin in Ihrer Shopware 6 Installation über den Plugin Manager und öffnen Sie die Plugin-Konfiguration</li><li>Aktivieren Sie den Schalter \"Aktiv\" für die Verkaufskanäle, auf denen die Benachrichtigungen aktiv sein sollen und das Formular erscheinen soll.</li><li>Konfigurieren Sie die restlichen Optionen nach Ihren Wünschen und lesen Sie die Hilfetexte für detaillierte Informationen zu jeder Option.</li><li>Stellen Sie sicher, dass der Scheduler die Aufgabe \"zeo_get_notified.stock_subscriber_notification_task\" ausführt. Der Standard-Admin-Queue-Worker sollte bereits in der Lage sein, sich darum zu kümmern, aber manchmal ist etwas Hilfe erforderlich. Sie können in der Plugin-Konfiguration überprüfen, ob der Scheduler für jeden Vertriebskanal korrekt läuft.</li><li>Wenn der Scheduler nicht wie erwartet läuft, lesen Sie bitte in der Shopware-Dokumentation nach, wie Sie dieses Problem beheben können:&nbsp;<a href=\"https://developer.shopware.com/docs/guides/hosting/infrastructure/message-queue#message-queue-on-production-systems\" target=\"_blank\" rel=\"noreferrer\">https://developer.shopware.com/docs/guides/hosting/infrastructure/message-queue#message-queue-on-production-systems</a>.&nbsp;</li><li>Leeren Sie den Cache, um sicherzugehen, dass alles Javascript geladen ist.</li></ul><h4>2. Konfigurieren der Mailvorlagen</h4><p></p><ul><li>WICHTIGER HINWEIS: Ein Fehler in der Mailvorlage kann dazu führen, dass der Mailer die eigentlichen Benachrichtigungen nicht an die Abonnenten sendet! Stellen Sie sicher, dass Sie zuerst testen, ob alles wie erwartet funktioniert, bevor Sie die Standardvorlagen bearbeiten. Führen Sie nach der Bearbeitung der Vorlagen einen Funktionstest durch, um sicherzustellen, dass die Mails weiterhin verarbeitet werden können.</li><li>Navigieren Sie zur Übersichtsseite \"Einstellungen &gt; E-Mail-Vorlagen\".</li><li>Hier finden Sie zwei Vorlagen: \"Bestandsabonnentenstatus eingeben: Benachrichtigt\" und \"Neues Aktienabonnement\".</li><li>Die erste ist die eigentliche Vorlage, die der Lagerabonnent erhält, wenn ein Produkt wieder auf Lager ist, die zweite wird verwendet, um die Benachrichtigung für den neuen Abonnenten zu senden, wenn die Konfiguration \"Benachrichtigungs-E-Mail bei neuen Abonnements erhalten\" aktiviert ist und eine E-Mail im Feld \"E-Mail für Benachrichtigungen\" eingegeben wurde.</li><li>Sie können das Feld \"Enter stock subscriber state: Benachrichtigt\" wie jede andere E-Mail-Vorlage über das 3-Punkte-Menü bearbeiten.</li><li>Wenn Sie auf der Detailseite der Vorlage angekommen sind, finden Sie die verfügbaren Variablen in der rechten Seitenleiste (für Shopware 6.4 und höher) und einige minimale Vorlageninhalte.</li><li>Seien Sie sehr vorsichtig bei der Bearbeitung der E-Mail-Vorlagen und prüfen Sie in der Vorschau, ob sie gerendert werden können.</li></ul><h4>3. Verwendung des Flow Builders (erfordert Shopware &gt;6.4.6.0)</h4><p><ul><li>Navigieren Sie zur Übersichtsseite \"Einstellungen &gt; Flow builder\".</li><li>Klicken Sie auf die Schaltfläche \"Flow hinzufügen\".</li><li>Geben Sie einen Namen für den neuen Fluss ein und wechseln Sie zur Registerkarte \"Fluss\".</li><li>Klicken Sie auf das Dropdown-Menü \"Auslöser auswählen\" und wählen Sie unter der Kategorie \"Produkt\" den Auslöser \"Wieder auf Lager\".</li><li>Fügen Sie nun eine Aktion hinzu und wählen Sie die Aktion \"Benachrichtigung senden\".</li><li>Es öffnet sich ein Modal, wählen Sie eine Vorlage aus oder erstellen Sie eine neue. Beachten Sie, dass nur Vorlagen des Typs \"Enter stock subscriber state: Benachrichtigt\" verfügbar sind.</li><li>Klicken Sie auf die Schaltfläche \"Aktion hinzufügen\" und speichern Sie den Ablauf.</li><li>Gehen Sie zur Plugin-Konfiguration und aktivieren Sie das Kontrollkästchen \"Flow Builder verwenden\".&nbsp;</li><li>Dies deaktiviert die Ausführung der Aufgabe \"zeo_get_notified.stock_subscriber_notification_task\" für diesen oder alle Verkaufskanäle und hängt stattdessen von der Verwendung des Flow Builders zur Ausführung des Ablaufs ab.</li><li>WARNHINWEIS: Die Verwendung von mehreren Flows kann dazu führen, dass mehrere E-Mails an denselben Abonnenten gesendet werden. Verwenden Sie diese mit Vorsicht.</li></ul></p><h4>4. Einblicke gewinnen</h4><p></p><ul><li>Wenn Sie sich vergewissert haben, dass die geplante Aufgabe und der Queue Worker reibungslos funktionieren, wechseln Sie auf die Seite \"Marketing &gt; Bestandsabonnenten\". Hier finden Sie eine Übersicht über alle Besucher, die mindestens eines Ihrer Produkte abonniert haben und noch auf eine Benachrichtigung warten.</li><li>Um einen Einblick zu erhalten, welche Produkte ein bestimmter Besucher abonniert hat, klicken Sie einfach auf die drei horizontalen Punkte am Ende jeder Zeile und dann auf \"Details anzeigen\". Ein Modal öffnet sich und listet die Produkte mit der Anzahl auf, auf die der Besucher wartet.</li></ul><h4>5. Fehlersuche bei fehlenden E-Mails</h4><p>Wenn Sie oder Ihre Abonnenten keine E-Mails (mehr) erhalten, führen Sie die folgenden Schritte aus, um die Ursache zu ermitteln:</p><p></p><ul><li>Navigieren Sie zur Plugin-Konfiguration und überprüfen Sie pro Vertriebskanal, ob der Scheduler korrekt läuft. Eine Warnmeldung am Ende des Abschnitts \"Get Notified Settings\" gibt Ihnen eine Rückmeldung. Die Meldung sollte \"Der Scheduler ist aktiv\" mit einem Zeitstempel anzeigen, der nicht älter als 5 Minuten sein sollte.</li><li>Überprüfen Sie, ob der Schalter \"Aktiv\" für den betreffenden Vertriebskanal oder auf der allgemeinen Konfigurationsebene aktiviert ist.&nbsp;</li><li>Vergewissern Sie sich, dass eine Mail-Vorlage mit dem Typ \"Enter stock subscriber state: Notified\" existiert und einen Betreff mit gültigem Plain- und HTML-Inhalt hat.</li><li>(Für Shopware 6.4 und höher) Prüfen Sie die E-Mail-Vorlage in der Vorschau, um sicherzustellen, dass sie wie erwartet gerendert wird.</li><li>Überprüfen Sie die Protokolle auf umfangreiche Fehlermeldungen im Zusammenhang mit Fehlern bei der Darstellung von E-Mails.</li><li>Prüfen Sie, ob noch andere E-Mails versendet werden, z. B. eine Auftragsbestätigung. Wenn dies nicht der Fall ist, liegt der Fehler wahrscheinlich beim Mailer.</li></ul><p></p><p><br></p><p>Wenn Sie sich vergewissert haben, dass alles in Ordnung ist und Sie immer noch keine E-Mails erhalten, senden Sie bitte ein Support-Ticket über das Shopware Plugin-Supportportal.&nbsp;&nbsp;</p><p><br></p>","shortDescription":"Benachrichtigungen, dass ein Artikel wieder vorrätig ist, steigern Ihre Umsätze, da Kunden eine Benachrichtigung erhalten, sobald ein Artikel wieder vorrätig ist. Lesen Sie hier mehr...","highlights":"Automatisierte E-Mails zur Benachrichtigung von Kunden, dass ein Artikel, der sie interessiert, wieder auf Lager ist;\nVollständig anpassbare E-Mail-Vorlagen mit Zugriff auf alle Produktinformationen;\nErhalten Sie zusätzliche Konvertierungen und engagierte Kunden ohne aktives Marketing;\nGewinnen Sie wertvolle Erkenntnisse darüber, welche Produkte eine Bestandsaktualisierung benötigen, in einer übersichtlichen Darstellung; \nGDPR-konform und nutzbar für alle Unternehmen, sowohl B2B als auch B2C.","features":"Flow Builder Unterstützung! (Shopware 6.4.6.0 und höher);\nFormular für die Anmeldung zum Produktbestand auf der \nProduktdetailseite mit Angabe von E-Mail und Menge;\nErkennung der E-Mail-Verfügbarkeit, das E-Mail-Formular wird ausgeblendet, wenn ein Kunde eingeloggt ist;\nAutomatische Benachrichtigung per E-Mail, sobald das vom Kunden gewünschte Produkt wieder auf Lager ist;\nEin konfigurierbarer Schwellenwert für den Bestand, um negative und positive Margen zu ermöglichen;\nVerwenden Sie den verfügbaren Bestand oder den absoluten Bestand als Anzeigeoption;\nMengenfeld, damit die Kunden die gewünschte Produktmenge angeben können;\nOption zum Ausblenden des Mengenfeldes für eine übersichtlichere Darstellung der Aktienabonnements;\nLassen Sie sich als Administrator über neue Produktabonnements benachrichtigen;\nMinimalistische anpassbare E-Mail-Vorlage enthalten, um Ihnen die volle Kontrolle über die E-Mail-Vorlage zu geben, wie Sie es von den Shopware-Einstellungen gewohnt sind;\nEs besteht die Möglichkeit, das Add-to-cart-Formular durch das Benachrichtigungsformular zu ersetzen oder das Add-to-cart-Formular immer sichtbar zu lassen. Es liegt ganz bei Ihnen;\nBenachrichtigungsglocke für nicht verfügbare Varianten, um darauf hinzuweisen, dass die Kunden die Variantenoption anklicken und dort abonnieren können;\nUnd vieles mehr, probieren Sie die Erweiterung selbst aus und schließen Sie sich 400+ zufriedenen Kunden an!"},{"id":15844,"name":"Back in stock notifications","description":"<p>Does it ever occur that a product runs out of stock, yet you have no efficient way of notifying your customers about restocks? Let this be a thing of the past! The Get Notified plugin gives customers the possibility to leave their email behind so that they are notified as soon as your business restocks their desired product, resulting in positive outcomes for both businesses and customers!</p><h3>Advantages</h3><p><b>Prevent missing out on conversions</b></p><p>Not a single consumer likes it when their desired product is out of stock. Therefore, giving them the opportunity to be notified as soon as the product is restocked, allows you to still convert them, and prevent them from possibly shopping at one of your competitors.</p><p><b>Make visitors commit to your store</b></p><p>Once a customer leaves behind their email, it gives you as a business the opportunity to commit them to your store. After restocking the product, the Get Notified plugin enables you to notify the customers, resulting in them returning to your store to complete the purchase of their desired product!</p><p><b>Get insight into demand</b></p><p>With the help of the Get Notified plugin, you not only let customers know that a product is available again, but you also gain valuable insight into the actual demand for the product. This subsequently facilitates easier demand forecasting for subsequent periods, resulting in more positive business results.</p><p><b>Makes marketing easier</b></p><p>Instead of collecting customer emails the normal way, utilize the Get Notified plugins to let customers leave behind their email, which in turn could be used for possible future email marketing!</p><h3>Still not convinced?</h3><p>Over 500 businesses have adopted this extension already. Take a look at some of our customers:</p><p><a href=\"https://www.cgproducten.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.cgproducten.nl/&nbsp;</a><br></p><p><a href=\"https://www.knipidee.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.knipidee.nl/&nbsp;</a><br></p><p><a href=\"https://www.casada.de/\" target=\"_blank\" rel=\"noreferrer\">https://www.casada.de/&nbsp;</a><br></p><p><a href=\"https://eisenbaer.de/\" target=\"_blank\" rel=\"noreferrer\">https://eisenbaer.de/&nbsp;</a><br></p><p><a href=\"https://electropapa.com/\" target=\"_blank\" rel=\"noreferrer\">https://electropapa.com/</a></p><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the extension changed or improved, contact us via the Shopware support portal by selecting the extension or by sending a message to <b>support@diztech.nl</b>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process, it's best to provide as much information as possible or provide us with access to your test environment. This way, we can reproduce the issue for ourselves and come up with a solution quicker.</p><h3>About us</h3><p>At DizTech, we have established our reputation by prioritizing quality and speed. Our focus has been on developing over 50 high-quality Shopware 6 extensions, which you can find below, leading to our recognition as a Shopware Premium Extension Partner. We deeply value the importance of providing personal and fast support whenever you need it, and we draw inspiration from you, our valued customers. This approach enables us to create extensions that are tailored to your needs as well as the needs of your customers. To get to know us better, please visit our website at&nbsp;<a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>Get started with the Get Notified plugin:</h3><h4>1. Installation and configuration</h4><p></p><ul><li>Download the Back in stock notifications plugin from the Community Store</li><li>Activate the plugin in your Shopware 6 installation via the plugin manager and open the plugin configuration</li><li>Enable the \"Active\" switch for the Sales Channels you like the notifications to be active on and the form to appear.</li><li>Configure the rest of the options to your preference and check the help texts for more detailed information about each option.</li><li>Make sure the scheduler is executing the 'zeo_get_notified.stock_subscriber_notification_task'. The default admin queue worker should already be able to take care of this, but sometimes it requires some help. You can verify if the scheduler is running correctly for every Sales Channel under the plugin configuration.</li><li>If the scheduler is not running as expected, please refer to the Shopware documentation on how to address this issue:&nbsp;<a href=\"https://developer.shopware.com/docs/guides/hosting/infrastructure/message-queue#message-queue-on-production-systems.\" target=\"_blank\" rel=\"noreferrer\">https://developer.shopware.com/docs/guides/hosting/infrastructure/message-queue#message-queue-on-production-systems.</a></li><li>Clear the cache to be sure all Javascript is loaded.</li></ul><h4>2. Configuring the mail templates</h4><p></p><ul><li>IMPORTANT NOTE: An error in the mail template can cause the mailer to fail sending the actual notifications to the subscribers! Be sure to first test if everything is working as expected before editing the default templates. After editing the templates perform a functional test to ensure mails can still be processed.</li><li>Navigate to the \"Settings &gt; Email templates\" overview page.</li><li>Here you will find two templates: \"Enter stock subscriber state: Notified\" and \"New stock subscription\"</li><li>The first is the actual template the stock subscriber will receive when a product has arrived back in stock, the second is used to send the new subscriber notification if the \"Receive a notification email on new subscriptions\" configuration is enabled and an email has been entered in the \"Email for notifications\" field.</li><li>You can edit the \"Enter stock subscriber state: Notified\" like you'd edit any other email template, using the 3-dots-menu.</li><li>Once arrived at the template's detail page you'll find the available variables in the right sidebar(For Shopware 6.4 and up) and some minimal template content.</li><li>Be very careful in editing the mail templates and be sure to preview them to check if they can render.</li></ul><h4>3.&nbsp;Using the Flow Builder (Requires Shopware &gt;6.4.6.0)</h4><p><ul><li>Navigate to the \"Settings &gt; Flow builder\" overview page.</li><li>Click on the \"Add flow\" button.</li><li>Enter a name for the new flow and switch to the \"Flow\" tab.</li><li>Click the \"Select A Trigger\" dropdown and select the \"Back In Stock\" trigger under the \"Product\" category.</li><li>Now add an action and select the \"Send notification\" action.</li><li>A modal will open, select or create a new template. Note that only templates of the type \"Enter stock subscriber state: Notified\" are available.</li><li>Click the \"Add action\" button and save the flow.</li><li>Head over to the plugin configuration and enable the checkbox of \"Use Flow Builder\". This will disable the execution of the \"zeo_get_notified.stock_subscriber_notification_task\" task for that specific or all Sales Channels and instead depend on the use of the flow builder to execute the flow.</li><li>NOTE OF WARNING: The use of multiple flows may lead to multiple emails being sent to the same subscriber. Use with caution.</li></ul></p><h4>4. Gaining insights</h4><p></p><ul><li>Once you have confirmed the scheduled task and queue worker are running smoothly navigate to the \"Marketing &gt; Stock subscribers\" page. Here you find an overview of all the visitors that have subscribed to the stock of at least one of your product and are still waiting for at least one notification.</li><li>To gain insights into which products a certain visitor is subscribed to, simply click the three horizontal dots at the end of each row and click \"Show details\". A modal will open and list the products with the quantity the visitor is waiting for.</li></ul><h4>5. Debugging missing emails</h4><p>If you or your subscribers are not receiving any emails (anymore), follow the following steps to determine what might be the cause:</p><p></p><ul><li>Navigate to the plugin configuration and verify per Sales Channel that the scheduler is running correctly. An alert message at the end of the \"Get Notified Settings\" section will provide you with feedback. The message should display \"The scheduler is active\" with a timestamp which shouldn't be older than 5 minutes.</li><li>Check the \"Active\" switch is enabled for the Sales Channel in question or on the general configuration level.&nbsp;</li><li>Ensure a mail template with type \"Enter stock subscriber state: Notified\" exists and has a subject with valid plain and HTML content.</li><li>(For Shopware 6.4 and up) Preview the mail template to ensure it is rendered as expected.</li><li>Check the logs for huge error messages related to failures in mail rendering.</li><li>Check if other mail is still being sent, like an order confirmation. If it isn't the mailer is probably at fault.</li></ul><p>If after confirming all things are in order, after following above checklist, and you are still not receiving any emails, please submit a support ticket via the Shopware plugin support portal.&nbsp;&nbsp;</p><p><br></p>","shortDescription":"Back in stock notifications boost your conversions by allowing customers to get a notification once an article is in stock. Get customers back to your store for their desired products.","highlights":"Automated notification e-mails notifying customers that an article they are interested in is back in stock;\nFully customizable e-mail template with access to all product information;\nGet extra conversions without active marketing;\nGain precious insights into which products require a stock update in one simple overview AND gain insights into which product is in high demand;\nGDPR compliant and B2B ready!","features":"Flow builder support! (Shopware 6.4.6.0 and up);\nProduct stock subscription form on the product detail page with email and quantity;\nEmail availability detection, the email form is hidden when a customer is logged in;\nAutomated notification emails when a, by a customer desired, product is back in stock;\nA configurable stock threshold to allow negative or positive stock margins;\nOption to use available stock or absolute stock;\nQuantity field to allow customers to subscribe to a higher stock amount;\nOption to hide the quantity field for a more clean stock subscription experience;\nOption to get notified on new product stock subscriptions as an admin;\nMinimalistic e-mail template included to give you full control to manage the email template as you are used to in the Shopware settings;\nReplace the add-to-cart with the stock notification form or always keep the add-to-cart visible. It's up to you;\nNotification bell for unavailable variants to give indication that customers can click the variant option and subscribe there;\nAnd much more, try the extension for yourself and join 300+ satisfied customers!"}],"addons":["enterpriseCertified","ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":171591,"bookingKey":"zeobv82482397379","bookingText":"Back in stock notifications","price":299.95,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":171590,"bookingKey":"zeobv82482397379_M","bookingText":"Back in stock notifications","price":19.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNx96wN","preview":true,"priority":100,"id":36629},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpupePwN","preview":false,"priority":110,"id":36628},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpA6YRto","preview":false,"priority":99,"id":68981},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3hRJzN","preview":false,"priority":95,"id":36632},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgw73YB","preview":false,"priority":89,"id":73188},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php07mLGp","preview":false,"priority":88,"id":73187},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphbJ8F5","preview":false,"priority":87,"id":73186},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvAOzow","preview":false,"priority":86,"id":73185},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpU7yX9r","preview":false,"priority":85,"id":73184},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvtL6gp","preview":false,"priority":10,"id":73183},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7Rac8C","preview":false,"priority":9,"id":73182},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT92lfJ","preview":false,"priority":0,"id":96194}],"comments":[{"authorName":"rene reckschwardt","text":"Das Plugin ist sehr nützlich macht was es soll. Bei Fragen an den Support gibt es schnelle und kompetente Antworten.","headline":"sehr gutes und nützliches plug","creationDate":{"date":"2023-05-18 15:21:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Jonas Massa","text":"","headline":"Good Plugin - Fast Support!","creationDate":{"date":"2022-12-02 08:54:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"tita.at","text":"Erhöht die Conversion Rate, super nützlich für den Kunden. Lässiges Plugin. Einzige Schwachstelle: Kontrolle ob das Plugin emails versendet ist nur in den Logs ersichtlich.","headline":"Tolles Plugin und noch besserer Support","creationDate":{"date":"2022-10-11 08:22:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Tobias Mahl","text":"Das Plugin bringt die aus SW5 gewohnt und von vielen schmerzlich vermisste Funktion der \"Back in stock notification\" zurück.\nWenn es Probleme gibt oder Wünsche für weitere Funktionen, reagiert der Plugin-Support rasend schnell und immer hilfsbereit.","headline":"Tolles Plugin und toller Support","creationDate":{"date":"2022-07-07 16:03:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marvin","text":"Das Plugin entspricht genau den Erwartungen.\nSehr schneller Support, der innerhalb von Stunden einen Fehler behoben und umgehend eine neue Version veröffentlicht hatte.","headline":"Super Plugin - sehr schneller Support","creationDate":{"date":"2022-05-25 08:53:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Robert Rernböck","text":"Hat man Produkte mit zum Teil sehr langen Lieferzeiten, bietet diese Erweiterung eine geniale Möglichkeit für Kunden sich über neuen Lagerbestand informieren zu lassen.\nUnd super schneller, freundlicher Support","headline":"Unverzichtbare Erweiterung bei längeren Lieferzeiten","creationDate":{"date":"2021-11-24 11:13:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Randy","text":"We needed this plugin for the shop, based on some suggestions/questions additional features were added. The support and help from zeobv is fast and helpful.","headline":"Handy plugin and perfect support from zeobv","creationDate":{"date":"2021-08-18 13:32:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Luca Tüchter","text":"","headline":"Great Plugin &amp; Great Support","creationDate":{"date":"2021-07-19 10:52:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Michael Schmidt","text":"Gutes Plugin, Support antwortet schnell.","headline":"Nützliches Plugin, das SW sinnvoll erweitert","creationDate":{"date":"2021-06-22 11:27:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marvin Hickel","text":"Das Plugin macht genau das, was erwartet und beschrieben wird. \n\nEs gab kleine Komplikationen mit der neusten SW6 Version, doch der Support hat dasProblem innerhalb weniger Stunden gelöst und ein Patch erstellt.","headline":"Schneller, hervorragender Support und funktioniert wie erwartet","creationDate":{"date":"2021-05-26 13:46:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Hannah","text":"","headline":"Quick and helpfull Support","creationDate":{"date":"2021-03-29 15:57:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Karsten Illig","text":"Das PlugIn macht was es soll und eine Antwort vom Support kam auch sehr schnell.\nDie Funktion sollte in keinem Shop fehlen.","headline":"Macht was soll","creationDate":{"date":"2021-02-27 17:22:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Melvin","text":"We planned to use the plugin in combination with the SwagCmsExtension plugin from Shopware. Unfortunately it didn't work with the plugin so we created a support ticket and 3 days later they made published an update with support for the SwagCmsExtension plugin. Thanks again!","headline":"Quick support, great plugin","creationDate":{"date":"2021-02-20 17:14:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Giacomo Großehagenbrock","text":"Amazing extension and mindblowing fast support, we needed to exclude one of our products from the Email when available function so we asked if they were planing such update, they didn´t but they implemented the requested feature within 24 hours.","headline":"Amazing extension and mindblowing fast support","creationDate":{"date":"2020-12-07 14:41:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Philipp","text":"Toll, dass sich Gydo die Mühe gemacht hat und mit dem Plugin die derzeit leider fehlende Funktion in Shopware 6 ausgleicht!\n\nVielen Dank für den super schnellen und kompetenten Support!","headline":"Super Plugin, super Support!","creationDate":{"date":"2020-10-16 15:12:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marvin sanders","text":"","headline":"Super plugin and a good extension for your shopware 6 platform.","creationDate":{"date":"2020-03-06 12:43:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Wieder auf Lager-Benachrichtigungen","description":"<p>Kommt es vor, dass ein Produkt nicht mehr vorrätig ist, Sie aber keine effiziente Möglichkeit haben Ihre Kunden über neue Bestände zu benachrichtigen? Das soll der Vergangenheit angehören! Das Get Notified-Plugin gibt Kunden die Möglichkeit, ihre E-Mail zu hinterlassen, damit sie benachrichtigt werden, sobald Ihr Unternehmenihr gewünschtes Produkt wieder vorrätig hat, was sich sowohl für Unternehmen als auch für Kunden positiv auswirkt!ihr gewünschtes Produkt wieder vorrätig hat, was sich sowohl für Unternehmen als auch für Kunden positiv auswirkt! Ihr gewünschtes Produkt wieder vorrätig hat, was sich sowohl für Unternehmen als auch für Kunden positiv auswirkt!</p><h3>Vorteile </h3><p><b>Verhindern Sie verpasste Umsätze </b></p><p>Kein einziger Verbraucher mag es, wenn sein Wunschprodukt nicht vorrätig ist. Wenn Sie ihnen also die Möglichkeit geben, sich benachrichtigen zu lassen, sobald das Produkt wieder vorrätig ist, können Sie sie trotzdem konvertieren und verhindern, dass sie möglicherweise bei einem Ihrer Wettbewerber einkaufen.</p><p><b>Binden Sie Besucher an Ihr Geschäft</b><br /></p><p>Sobald ein Kunde seine E-Mail hinterlässt, haben Sie als Unternehmen die Möglichkeit, ihnen an Ihr Geschäft zu binden. Mit dem Get Notified-Plugin können Sie die Kunden nach der Aufstockung des Produkts benachrichtigen, so dass sie in Ihr Geschäft zurückkehren und den Kauf des gewünschten Produkts abschließen!</p><p><b>Einblick in die Nachfrage </b></p><p>Mit Hilfe des Get Notified Plugins teilen Sie Ihren Kunden nicht nur mit, dass ein Produkt wieder verfügbar ist, sondern Sie erhalten auch wertvolle Einblicke in die tatsächliche Nachfrage nach dem Produkt. Dies erleichtert die Vorhersage der Nachfrage für nachfolgende Zeiträume und führt zu positiveren Geschäftsergebnissen.</p><p><b>Macht das Marketing einfacher</b></p><p>Anstatt Kunden-E-Mails auf herkömmliche Weise zu sammeln, können Sie mit den Get Notified-Plugins dafür sorgen, dass Kunden ihre E-Mail hinterlassen, die wiederum für mögliches zukünftiges E-Mail-Marketing genutzt werden kann! </p><h3>Immer noch nicht überzeugt?</h3><p>Über 400 Unternehmen haben das Get Notified-Plugin bereits eingesetzt. Zum Beispiel haben die folgenden Geschäfte das Plugin bereits in ihre Shops integriert:</p><p><a href=\"https://www.cgproducten.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.cgproducten.nl/</a> <a href=\"https://www.knipidee.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.knipidee.nl/</a>  <a href=\"https://www.casada.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.casada.de/</a> <a href=\"https://eisenbaer.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://eisenbaer.de/</a> <a href=\"https://electropapa.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://electropapa.com/</a> </p><h3></h3><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>Erste Schritte mit dem Get Notified Plugin:</h3><h4>1. Installation und Konfiguration</h4><p></p><ul><li>Laden Sie das Plugin \"Back in stock notifications\" aus dem Community Store herunter</li><li>Aktivieren Sie das Plugin in Ihrer Shopware 6 Installation über den Plugin Manager und öffnen Sie die Plugin-Konfiguration</li><li>Aktivieren Sie den Schalter \"Aktiv\" für die Verkaufskanäle, auf denen die Benachrichtigungen aktiv sein sollen und das Formular erscheinen soll.</li><li>Konfigurieren Sie die restlichen Optionen nach Ihren Wünschen und lesen Sie die Hilfetexte für detaillierte Informationen zu jeder Option.</li><li>Stellen Sie sicher, dass der Scheduler die Aufgabe \"zeo_get_notified.stock_subscriber_notification_task\" ausführt. Der Standard-Admin-Queue-Worker sollte bereits in der Lage sein, sich darum zu kümmern, aber manchmal ist etwas Hilfe erforderlich. Sie können in der Plugin-Konfiguration überprüfen, ob der Scheduler für jeden Vertriebskanal korrekt läuft.</li><li>Wenn der Scheduler nicht wie erwartet läuft, lesen Sie bitte in der Shopware-Dokumentation nach, wie Sie dieses Problem beheben können: <a href=\"https://developer.shopware.com/docs/guides/hosting/infrastructure/message-queue#message-queue-on-production-systems\" target=\"_blank\" rel=\"noreferrer noopener\">https://developer.shopware.com/docs/guides/hosting/infrastructure/message-queue#message-queue-on-production-systems</a>. </li><li>Leeren Sie den Cache, um sicherzugehen, dass alles Javascript geladen ist.</li></ul><h4>2. Konfigurieren der Mailvorlagen</h4><p></p><ul><li>WICHTIGER HINWEIS: Ein Fehler in der Mailvorlage kann dazu führen, dass der Mailer die eigentlichen Benachrichtigungen nicht an die Abonnenten sendet! Stellen Sie sicher, dass Sie zuerst testen, ob alles wie erwartet funktioniert, bevor Sie die Standardvorlagen bearbeiten. Führen Sie nach der Bearbeitung der Vorlagen einen Funktionstest durch, um sicherzustellen, dass die Mails weiterhin verarbeitet werden können.</li><li>Navigieren Sie zur Übersichtsseite \"Einstellungen &gt; E-Mail-Vorlagen\".</li><li>Hier finden Sie zwei Vorlagen: \"Bestandsabonnentenstatus eingeben: Benachrichtigt\" und \"Neues Aktienabonnement\".</li><li>Die erste ist die eigentliche Vorlage, die der Lagerabonnent erhält, wenn ein Produkt wieder auf Lager ist, die zweite wird verwendet, um die Benachrichtigung für den neuen Abonnenten zu senden, wenn die Konfiguration \"Benachrichtigungs-E-Mail bei neuen Abonnements erhalten\" aktiviert ist und eine E-Mail im Feld \"E-Mail für Benachrichtigungen\" eingegeben wurde.</li><li>Sie können das Feld \"Enter stock subscriber state: Benachrichtigt\" wie jede andere E-Mail-Vorlage über das 3-Punkte-Menü bearbeiten.</li><li>Wenn Sie auf der Detailseite der Vorlage angekommen sind, finden Sie die verfügbaren Variablen in der rechten Seitenleiste (für Shopware 6.4 und höher) und einige minimale Vorlageninhalte.</li><li>Seien Sie sehr vorsichtig bei der Bearbeitung der E-Mail-Vorlagen und prüfen Sie in der Vorschau, ob sie gerendert werden können.</li></ul><h4>3. Verwendung des Flow Builders (erfordert Shopware &gt;6.4.6.0)</h4><p></p><ul><li>Navigieren Sie zur Übersichtsseite \"Einstellungen &gt; Flow builder\".</li><li>Klicken Sie auf die Schaltfläche \"Flow hinzufügen\".</li><li>Geben Sie einen Namen für den neuen Fluss ein und wechseln Sie zur Registerkarte \"Fluss\".</li><li>Klicken Sie auf das Dropdown-Menü \"Auslöser auswählen\" und wählen Sie unter der Kategorie \"Produkt\" den Auslöser \"Wieder auf Lager\".</li><li>Fügen Sie nun eine Aktion hinzu und wählen Sie die Aktion \"Benachrichtigung senden\".</li><li>Es öffnet sich ein Modal, wählen Sie eine Vorlage aus oder erstellen Sie eine neue. Beachten Sie, dass nur Vorlagen des Typs \"Enter stock subscriber state: Benachrichtigt\" verfügbar sind.</li><li>Klicken Sie auf die Schaltfläche \"Aktion hinzufügen\" und speichern Sie den Ablauf.</li><li>Gehen Sie zur Plugin-Konfiguration und aktivieren Sie das Kontrollkästchen \"Flow Builder verwenden\". </li><li>Dies deaktiviert die Ausführung der Aufgabe \"zeo_get_notified.stock_subscriber_notification_task\" für diesen oder alle Verkaufskanäle und hängt stattdessen von der Verwendung des Flow Builders zur Ausführung des Ablaufs ab.</li><li>WARNHINWEIS: Die Verwendung von mehreren Flows kann dazu führen, dass mehrere E-Mails an denselben Abonnenten gesendet werden. Verwenden Sie diese mit Vorsicht.</li></ul><h4>4. Einblicke gewinnen</h4><p></p><ul><li>Wenn Sie sich vergewissert haben, dass die geplante Aufgabe und der Queue Worker reibungslos funktionieren, wechseln Sie auf die Seite \"Marketing &gt; Bestandsabonnenten\". Hier finden Sie eine Übersicht über alle Besucher, die mindestens eines Ihrer Produkte abonniert haben und noch auf eine Benachrichtigung warten.</li><li>Um einen Einblick zu erhalten, welche Produkte ein bestimmter Besucher abonniert hat, klicken Sie einfach auf die drei horizontalen Punkte am Ende jeder Zeile und dann auf \"Details anzeigen\". Ein Modal öffnet sich und listet die Produkte mit der Anzahl auf, auf die der Besucher wartet.</li></ul><h4>5. Fehlersuche bei fehlenden E-Mails</h4><p>Wenn Sie oder Ihre Abonnenten keine E-Mails (mehr) erhalten, führen Sie die folgenden Schritte aus, um die Ursache zu ermitteln:</p><p></p><ul><li>Navigieren Sie zur Plugin-Konfiguration und überprüfen Sie pro Vertriebskanal, ob der Scheduler korrekt läuft. Eine Warnmeldung am Ende des Abschnitts \"Get Notified Settings\" gibt Ihnen eine Rückmeldung. Die Meldung sollte \"Der Scheduler ist aktiv\" mit einem Zeitstempel anzeigen, der nicht älter als 5 Minuten sein sollte.</li><li>Überprüfen Sie, ob der Schalter \"Aktiv\" für den betreffenden Vertriebskanal oder auf der allgemeinen Konfigurationsebene aktiviert ist. </li><li>Vergewissern Sie sich, dass eine Mail-Vorlage mit dem Typ \"Enter stock subscriber state: Notified\" existiert und einen Betreff mit gültigem Plain- und HTML-Inhalt hat.</li><li>(Für Shopware 6.4 und höher) Prüfen Sie die E-Mail-Vorlage in der Vorschau, um sicherzustellen, dass sie wie erwartet gerendert wird.</li><li>Überprüfen Sie die Protokolle auf umfangreiche Fehlermeldungen im Zusammenhang mit Fehlern bei der Darstellung von E-Mails.</li><li>Prüfen Sie, ob noch andere E-Mails versendet werden, z. B. eine Auftragsbestätigung. Wenn dies nicht der Fall ist, liegt der Fehler wahrscheinlich beim Mailer.</li></ul><p></p><p><br /></p><p>Wenn Sie sich vergewissert haben, dass alles in Ordnung ist und Sie immer noch keine E-Mails erhalten, senden Sie bitte ein Support-Ticket über das Shopware Plugin-Supportportal.  </p><p><br /></p>","version":"1.7.5","changelog":[{"version":"1.7.5","text":"<p>Resolved mail send in respective languages</p>","creationDate":{"date":"2023-07-20 12:04:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.4","text":"<p>Resolved mail send in respective languages  </p>","creationDate":{"date":"2023-07-05 13:04:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.3","text":"<p>Bug fixes:</p><p>-   Resolved snippets are missing on email validation.</p><p>-   Resolved icon display of the Notified.</p><p>-   Resolved missing semicolons.</p><p>-   Resolved logged users aren't able to subscribe to a stock.</p><p>-   Patch of the ${var} in strings is deprecated.</p><p><br /></p>","creationDate":{"date":"2023-06-22 15:36:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.2","text":"<p>Added notification time for the confirmation Message.</p>","creationDate":{"date":"2023-06-12 14:35:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.1","text":"<p>Resolved variant product name display in email.<br />Resolved Stock subscriber and product sorting by default descending order in admin.</p>","creationDate":{"date":"2023-06-12 14:29:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"<p>-   6.5 compatibility update</p><p><br /></p>","creationDate":{"date":"2023-03-09 17:02:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.16","text":"<p>Resolved url language wise in email.</p><p><br /></p>","creationDate":{"date":"2023-07-20 12:09:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.15","text":"<p>Resolved Stock subscriber and product sorting by default descending order in admin.</p>","creationDate":{"date":"2023-05-19 15:11:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.14","text":"<p>Resolved variant product name display in email.</p>","creationDate":{"date":"2023-05-17 16:04:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.13","text":"<p>Fixed Notification counting in product detail page.</p>","creationDate":{"date":"2023-04-12 09:34:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.12","text":"<p>-   Fixed translation</p><p>-   Fixed sorting of new time columns in the stock subscriber insights overview</p><p><br /></p>","creationDate":{"date":"2023-02-15 18:09:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.11","text":"<p>-   Added batching to the scheduled tasks to avoid running out of RAM for huge subscriber lists</p><p>-   Added two extra columns to the subscriber insights table to give more time-based insights into your subscriber base</p>","creationDate":{"date":"2023-02-08 07:37:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.10","text":"<p>-   Changed path to url to avoid strange resolving issues from occurring.</p><p><br /></p>","creationDate":{"date":"2023-01-09 14:19:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.9","text":"<p>-   Added title snippet for notification form on product detail page</p><p><br /></p>","creationDate":{"date":"2022-12-28 09:41:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.8","text":"<p>-   Updated default mail templates to be more bullet proof with Windows mail clients like Outlook and Windows Mail</p><p><br /></p>","creationDate":{"date":"2022-12-08 12:06:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.7","text":"<p>-   Added product SEO url support using the {{ product.url }} variable</p><p>-   Added partial support for google recaptcha V2, V2 invisible recaptcha still not supported, use V3 instead.</p><p><br /></p>","creationDate":{"date":"2022-12-01 12:22:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.6","text":"<p>-   Added a plugin vitals check which automatically povides the admin with a notification when something is not going as planned.</p><p>-   Added auto-recovery function, resetting the scheduled task status when it got stuck</p><p><br /></p>","creationDate":{"date":"2022-11-29 12:57:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.5","text":"<p>-   Added support for package unit plural</p><p><br /></p>","creationDate":{"date":"2022-11-23 14:05:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.4","text":"<p>-   Added salutation association to the back in stock mail template.</p><p>-   Reduced performance impact of flow builder hooks by moving expensive computational tasks to the message queue</p><p><br /></p>","creationDate":{"date":"2022-11-23 11:13:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"<p>- Adjusted optiply suggestion message to be less invasive</p><p>- Added option to hide the optiply suggestion message</p>","creationDate":{"date":"2022-09-08 12:10:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<p>- Added option to show a notification bell in the swatch of unavailable variants</p><p><br /></p>","creationDate":{"date":"2022-09-02 09:00:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<p># 1.6.0</p><p>- Added option to set stock threshold before a mail is send</p><p>- Optimised product detail admin interface to support more stock configuration options</p><p>- Added notification for products that are frequently out of stock and in high demand</p><p>- Added alert on product detail page to give store owners insights into the current number of subscribers for that product</p><p><br /></p>","creationDate":{"date":"2022-08-08 16:17:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.43","text":"<p>- Added support for Google Recaptcha V3</p><p><br /></p>","creationDate":{"date":"2022-07-18 14:09:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.42","text":"<p>- Fixed leading \".\" for dutch snippet file</p><p><br /></p>","creationDate":{"date":"2022-07-07 13:11:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.41","text":"<p>- Fixed issue with the subscription updated feedback</p><p><br /></p>","creationDate":{"date":"2022-07-05 15:37:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.40","text":"<p>- Added feedback in case the subscriber is already subscribed to a product.</p><p><br /></p>","creationDate":{"date":"2022-07-04 11:36:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.39","text":"<p>- Added captcha support for subscribe controller</p><p><br /></p>","creationDate":{"date":"2022-06-27 17:02:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.38","text":"- Fixed issue in use of minimal purchase","creationDate":{"date":"2022-06-23 09:52:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.37","text":"<p>- Resolved error where notification form not showing up when the stock is lower than the minimal purchase quantity</p><p><br /></p>","creationDate":{"date":"2022-06-16 12:23:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.36","text":"<p>- Changed double opt-in confirmation route to non-cached page to avoid caching of flash message.</p><p><br /></p>","creationDate":{"date":"2022-05-27 02:11:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.35","text":"- Fixed bug in Business event collector leading to the notification action not being available on 6.4.9.0","creationDate":{"date":"2022-05-25 05:54:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.34","text":"- Fixed a bug in FlowBuilder configuration occurring due to a backwards compatibility patch","creationDate":{"date":"2022-05-19 05:27:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.33","text":"- Fixed bug in disabling of stock notification form on product level","creationDate":{"date":"2022-05-13 13:54:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.32","text":"- Added Flow Builder support for back in stock notifications. Requires Shopware 6.4.6.0 or higher.","creationDate":{"date":"2022-05-11 13:02:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.31","text":"- Rebuild administration JS files under v6.4.5.0 to fix issue https://github.com/shopware/platform/issues/2420","creationDate":{"date":"2022-05-05 11:14:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.30","text":"- Fixed bug where product subscriptions would only be removed once a notification was sent for all products a customer subscribed for","creationDate":{"date":"2022-05-04 09:41:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.29","text":"- Added configurable double opt-in mechanic to allow marketing emails to be sent.","creationDate":{"date":"2022-05-04 09:09:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.28","text":"- Added v6.4.10.0 compatibility","creationDate":{"date":"2022-04-15 10:26:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.27","text":"- Fixed conflict with gallery buy box cms element","creationDate":{"date":"2022-04-13 09:17:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.26","text":"<p>- RE-CONFIGURATION REQUIRED. Replaced \"Don't show the stock subscription form for products that are on clearance sale\" configuration option with \"Presentation for products with status backorders denied\" configuration option.</p><p>- Improved feedback of scheduler status message.</p><p>- Improved configuration experience with introduction</p><p>- Added recommendations to extension config page.</p>","creationDate":{"date":"2022-04-07 19:03:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.25","text":"- Improved sorting of overview in administration","creationDate":{"date":"2022-04-05 10:24:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.24","text":"- Fixed compatibility issue with the MaxiaListingVariants6 plugin","creationDate":{"date":"2022-03-30 17:13:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.23","text":"- Fixed sorting issue","creationDate":{"date":"2022-03-28 14:24:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.22","text":"- Resolved conflict with SwagCustomizedProducts in combination with SwagCmsExtensions","creationDate":{"date":"2022-03-28 13:36:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.21","text":"- Added search function to product subscription insights overview <p>- Added batch size configuration for notification emails to avoid issues with certain SMTP servers</p>","creationDate":{"date":"2022-03-22 11:13:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.20","text":"- Fixed sorting error in administration overview","creationDate":{"date":"2022-03-18 09:53:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.19","text":"- Added fallback for available_stock null value","creationDate":{"date":"2022-03-15 16:40:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.18","text":"- Added wishlist support","creationDate":{"date":"2022-03-08 10:02:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.17","text":"- Fixed bug where listing notification form visibility configuration affected visibility on product detail page with custom layout","creationDate":{"date":"2022-01-19 17:22:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.16","text":"- Fixed bug in administration regarding disabling stock notifications for specific products","creationDate":{"date":"2021-12-13 09:48:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.15","text":"- Fixed notification form caching issue<p>- Converted quantity option label to snippet</p>","creationDate":{"date":"2021-11-22 10:16:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.14","text":"- Patch to avoid error in migrations for v6.4.0.0 installations. <p>- Fixed issue in admin worker in combination with scheduled task</p>","creationDate":{"date":"2021-11-17 12:17:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.13","text":"<p>- Fix issue in loading of products in Insights tab in the administration.</p><p>- Improved UX of administration views.</p>","creationDate":{"date":"2021-11-05 14:37:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.12","text":"- Fixed the presentation of submit button for the logged in scenario","creationDate":{"date":"2021-10-22 11:18:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.11","text":"<p>- Improved administration overview by adding an extra insights view, listing the products that people are awaiting new stock for.</p><p>- Added \"Subscription count\" column to subscriber overview.</p><p>- Changed labels for created and updated at columns in subscriber overview.</p><p>- Added option to show privacy statement in subscription form.</p>","creationDate":{"date":"2021-10-04 13:03:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.10","text":"<p>- Added compatibility with Product Shopping Experiences layouts</p>","creationDate":{"date":"2021-09-30 09:25:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.9","text":"<p>- Upgraded debug command to make it easier to gain insights in errors in the stock notification process</p><p>- Fixed issue where inactive products would cause an error during the stock notification process</p><p>- Mapping product translations to properties to make email variables more intuitive </p><p><br /></p>","creationDate":{"date":"2021-09-26 08:41:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.8","text":"<p>- Updated documentation<br /></p><p>- Improved plugin configuration structure</p><p>- Added scheduler check to plugin config to allow users to verify if the scheduler is running</p><p>- Added mail template type template data to allow previewing the e-mail template</p><p>- Moved template creation to migrations</p>","creationDate":{"date":"2021-09-16 09:15:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.7","text":"- Fixed missing EntityFactory dependency in StockSubscriberRepository and StockSubscriberProductRepository","creationDate":{"date":"2021-09-09 09:09:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.6","text":"- Added B2B options to allow only logged in customers to see the stock subscription form.","creationDate":{"date":"2021-08-18 12:39:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.5","text":"- Made echo outputs in task handler conditional to only output in test environments","creationDate":{"date":"2021-08-17 13:36:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<p>- Added logger with catch to avoid subscription error if a mail notification error occurs.</p><p>- Some refactoring.</p><p>- Changed default email subject of \"back in stock notification\"-email from product.name to product.translated.name to avoid empty value.</p><p>- Fixed spelling error in German translation</p>","creationDate":{"date":"2021-07-29 10:39:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"- Added mail template translation inheritance <p>- Made replacement of add to cart and detail buttons optional with the 'Replace \"add to cart\" form with the stock-subscription form' configuration </p><p> - Fixed bug causing mail template header and footers to not be added to the mail.</p>","creationDate":{"date":"2021-07-16 10:35:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"- Added option to send notifications to a configurable email address on new product stock subscriptions","creationDate":{"date":"2021-06-30 12:21:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"# 1.5.1<p></p><p>- Changed id of get-notified-widget-form to \"#productDetailPageBuyProductForm\" to avoid incompatibility with Shopware JS plugins. </p><p>- Improved some code structure</p>","creationDate":{"date":"2021-05-26 12:18:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"- Made plugin compatible to 6.4.0","creationDate":{"date":"2021-05-07 09:07:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.8","text":"<p>Addressed issue where an error would be thrown during the notification process if a product is no longer active for a Sales Channel a customer subscribed from.</p>","creationDate":{"date":"2021-09-26 10:21:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.7","text":"<p>- Updated documentation</p><p>- Improved plugin configuration structure</p><p>- Added scheduler check to plugin config to allow users to verify if the scheduler is running</p><p>- Added mail template type template data to allow previewing the e-mail template</p><p>- Moved template creation to migrations</p><p>- Fixed missing EntityFactory dependency in StockSubscriberRepository and StockSubscriberProductRepository </p><p>- Added B2B options to allow only logged in customers to see the stock subscription form.</p><p>- Made echo outputs in task handler conditional to only output in test environments</p><p>- Added logger with catch to avoid subscription error if a mail notification error occurs.</p><p>- Some refactoring.</p><p>- Changed default email subject of \"back in stock notification\"-email from product.name to product.translated.name to avoid empty value.</p><p>- Fixed spelling error in German translation</p><p>- Added mail template translation inheritance</p><p>- Made replacement of add to cart and detail buttons optional with the 'Replace \"add to cart\" form with the stock-subscription form' configuration </p><p>- Fixed bug causing mail template header and footers to not be added to the mail.</p><p>- Added option to send notifications to a configurable email address on new product stock subscriptions</p><p>- Changed id of get-notified-widget-form to \"#productDetailPageBuyProductForm\" to avoid incompatibility with Shopware JS plugins.</p><p>- Improved some code structure</p>","creationDate":{"date":"2021-09-16 13:57:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.6","text":"- Addressed issue where notification form would not appear for products with advanced prices in the listing page","creationDate":{"date":"2021-05-21 10:43:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.5","text":"- Added option to disable quantity input, when disabled quantity will default to \"1\"","creationDate":{"date":"2021-03-31 09:57:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"- Added support for use of product cover image in mail template","creationDate":{"date":"2021-03-26 10:32:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"- Added fallback for missing sw-domain-id","creationDate":{"date":"2021-03-17 10:12:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"- Replaced concrete MailService implementation with MailServiceInterface","creationDate":{"date":"2021-03-10 10:13:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"- Added option to disable/enable the form in combination with products which are on clearance sale.","creationDate":{"date":"2021-03-05 09:13:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"- Added compatibility with SwagCmsExtensions","creationDate":{"date":"2021-02-20 16:35:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"- Added compatibility with disabled CSRF-protection","creationDate":{"date":"2021-01-26 11:37:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"- Updated notify command exit code.","creationDate":{"date":"2021-01-26 08:40:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"- Solved issue with quantity-selection field when a max purchase is configured","creationDate":{"date":"2021-01-18 09:11:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"- Patched issue where product basic information wouldn't appear if no custom fields would be configured.","creationDate":{"date":"2021-01-08 11:47:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"- Added try catch to notification handler to avoid dead-lock in scheduler queue","creationDate":{"date":"2021-01-04 15:37:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"- Improved entity definition","creationDate":{"date":"2020-12-17 16:27:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p>- Fixed rich snippet error</p>","creationDate":{"date":"2020-12-07 16:39:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"- Added option to disable the stock subscriber from on product level","creationDate":{"date":"2020-12-04 16:25:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"- Patch to apply product data inheritance and translations to mail templates","creationDate":{"date":"2020-11-20 10:06:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"- Minor patch to mail service","creationDate":{"date":"2020-10-26 11:43:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"- Added support for inherited product data","creationDate":{"date":"2020-10-16 16:09:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"- PHP 7.3 compatibility patch <p>- Google analytics compatibility patch</p>","creationDate":{"date":"2020-10-16 08:26:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"# 1.2.0 <p>- Added configuration option to automatically remove stock subscriber information once all notifications have been send </p><p>- Added \"Show details\" context action </p><p>- Added stock subscriber details modal to view which products a stock subscriber is subscribed to</p>","creationDate":{"date":"2020-10-09 11:29:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"# 1.1.6 <p>- Patch for deprecation of getSearchResults function.</p>","creationDate":{"date":"2020-09-09 09:01:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"# 1.1.5 <p>- v6.3.0.0 compatibility update</p>","creationDate":{"date":"2020-08-05 10:47:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"# 1.1.4 <p>- Small patch to template file</p>","creationDate":{"date":"2020-05-19 13:59:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"# 1.1.3 <p>- Added compatibility with CSRF-mode AJAX</p>","creationDate":{"date":"2020-03-13 11:38:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p># 1.1.2</p><p>- Removed debug dependencies</p><p><br /></p>","creationDate":{"date":"2020-01-25 10:38:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p># 1.1.1</p><p>- Patch for invalid production dependency.</p><p>- Small style fix to notify button to match 'Add to cart'-button style.</p>","creationDate":{"date":"2020-01-15 13:37:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p># 1.1.0</p><p>- Added Stock subscription form to listing and search page results.</p><p>- Added minimalStockThreshhold to shouldNotifySubscriber condition in the StockSubscriptionService to only notify stock subscribers when the minimal stock threshold is reached.</p><p>- Added some margin under subscription form for better presentation on product detail page.</p>","creationDate":{"date":"2020-01-10 09:22:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"# 1.0.1 <p>- Compatibility fixes for Shopware 6.1.0-rc3</p>","creationDate":{"date":"2020-01-05 11:55:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"# 1.0.0<p> - First version of the Zeo Get Notified for Shopware 6\n</p>","creationDate":{"date":"2019-11-01 14:43:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv82482397379","redirectToStore":false,"lowestPriceValue":19.99}