{"id":10231,"name":"HatslogicSwAbandonedCartNotification","code":"Hatsl20556352288","lastChange":{"date":"2023-07-18 11:16:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvxqpil","examplePageUrl":"","moduleKey":"HatslogicSwAbandonedCartNotification","creationDate":{"date":"2019-11-08 11:41:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-01-27 12:28:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-02-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-07-12 18:56:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2353,"prefix":"Hatslogic","name":"2Hats Logic Solutions Private Limited","website":"//www.2hatslogic.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2353_icon-logo-2hatslogic.jpg"},"infos":[{"id":15918,"name":"E-Mail Benachrichtigungen für verlassene Warenkörbe","description":"Wie oft verlassen Ihre Kunden den Warenkorb?<br><br>Erhebungen zufolge liegt die durchschnittliche Abbruchquote bei Verkäufen bei 70 % und bei direkten Käufen bei 30 %.&nbsp; Das bedeutet, dass es auch bei Online-Käufen eine hohe Abbruchquote gibt, bei der die Kunden ihre Warenkörbe mit Produkten verlassen, ohne die Bestellung aus verschiedenen Gründen abzuschließen, z. B:<br><br>- sie denken über ein anderes Produkt nach<br><br>- sie wollen sich in anderen Web-Shops umsehen und vergleichen<br><br>- mitten im Bestellvorgang abgelenkt werden<br><br>- ein schlechtes Netz usw. <br><br><br>Nur selten kehren die Kunden zu den verlassenen Warenkörben zurück und schließen die Bestellung ab. Im Falle von Shopware gibt es auch keinen persistenten Warenkorb, was es für den Benutzer schwierig macht, das Produkt, das er sich angesehen hat, wiederzufinden.<br><br><br>Wie hilft die Abandoned Cart Notification, das Problem zu lösen und die Conversion zu steigern?<br><br>Unser Plugin für abgebrochene Warenkörbe verfügt von Haus aus über eine Funktion für dauerhafte Warenkörbe. Dies kann einen großen Beitrag zu einer besseren Konversion leisten, da Shopware diese Funktion nicht hat.<br><br><br>Aber unser Plugin kommt mit noch mehr Funktionen. Das Plugin zeigt Ihnen eine Liste der Benutzer, die noch Artikel im Warenkorb haben und zeigt Ihnen auch, welche Artikel sich im Warenkorb befinden. So können Sie eine andere Marketingstrategie planen, um die Konversion zu erhöhen. Das Plugin sendet Erinnerungs-E-Mails an Kunden (die den ersten Schritt der Kaufabwicklung oder des Logins abgeschlossen haben) über die Produkte, die sie im Warenkorb gelassen haben, ohne die Bestellung abzuschließen. Der Shop-Betreiber kann die Intervalle festlegen, in denen diese freundlichen Erinnerungen verschickt werden sollen. Durch diese Begrenzung wird es für den Kunden nie lästig.&nbsp; Die Anzahl der Intervalltage sind kommagetrennte Werte wie 2,5,15. Wenn es so eingestellt ist, sendet das Plugin am zweiten Tag, am 5. Tag und am 15. Danach sendet es keine weiteren E-Mails mehr. Wenn der Shop-Betreiber nur eine Erinnerung senden möchte, kann er diese als eine Nummer einstellen.<br><br><br>Die E-Mail-Vorlage ist vollständig anpassbar und enthält eine Betreffzeile oder einen Text mit einer Liste von Produkten und einem Link zum Abschluss der Bestellung.&nbsp; Der Geschäftsinhaber kann Gutscheincodes einrichten und sie über diese E-Mails versenden, um den Kunden die Entscheidung zu erleichtern. Dies kann die Konversionsrate um 20 % erhöhen und damit den Umsatz um 20 % steigern - was bemerkenswert ist.<br><br><br>Das ist auch ein großartiges Kundenerlebnis, denn wer mag nicht eine freundliche Erinnerung an seine Lieblingsprodukte, die er im Warenkorb vergessen hat? Auf jeden Fall ein Verkaufsschlager!<br><br><br><p>Hier ist eine Video-Demonstration - https://www.youtube.com/watch?v=do3kWIQk8G4</p>","installationManual":"<p>Installation</p><p>Schritt 1: Kaufen Sie das Plugin unter https://store.shopware.com.<br /></p><p>Schritt 2: Melden Sie sich mit Ihrem Benutzerkonto bei Shopware an<br /></p><p>Schritt 3: Öffnen Sie Einstellungen-&gt; Plugin Manager</p><p>Schritt 4: Klicken Sie auf Meine Einkäufe und melden Sie sich an, falls Sie dies noch nicht getan haben. Geben Sie die Shopware-ID für die Website ein, mit der Sie arbeiten.</p><p>Schritt 5: Nach dem Login sehen Sie eine Liste der Plugins für die Website und Ihr Konto. Laden Sie das Plugin herunter.<br /></p><p>Schritt 6: Klicken Sie auf \"Installiert\", um eine Seite mit den Plugins zu öffnen, die installiert, deinstalliert und deaktiviert sind.<br /></p><p>Schritt 7: Suchen Sie in der Liste \"Deinstalliert\" nach dem AbandonedCart-Plugin.<br /></p><p>Schritt 8: Klicken Sie auf Installieren und aktivieren Sie das Plugin.<br /></p><p><br /></p><p>Konstruktion<br /></p><p>1) Legen Sie das Intervall für die E-Mail in Tagen fest.<br /></p><p>a) Öffnen Sie Einstellungen -&gt; System -&gt; Plugins -&gt; Meine Plugins -&gt; Benachrichtigung über verlassenen Warenkorb -&gt; Konfiguration<br /></p><p>So legen Sie die Mailintervalltage für die Benachrichtigung über verlassene Einkaufswagen fest:<br /></p><p>(Bitte verwenden Sie ein Koma-Trennzeichen, um mehr als einen Tag hinzuzufügen.)</p><p><br /></p><p>2) Ändern Sie die E-Mail-Vorlage<br /></p><p>(Einstellungen&gt; E-Mail-Vorlage&gt; Nach \"Benachrichtigung über den Abbruch des Einkaufswagens\" suchen&gt; Bearbeiten&gt;<br /></p><p><br /></p><p>Aktualisierungsanweisungen für bestehende Kunden: So zeigen Sie das Produktbild in der E-Mail an.<br /></p><p>===========================================================================</p><p>Schritt 1. Bitte aktualisieren Sie Ihr Plugin auf die neueste Version \"Abandoned Cart v.1.0.4\".<br /></p><p>Schritt 2. Kopieren Sie die folgenden Codezeilen in E-Mail-Vorlagen - HTML-Vorlage<br /></p><p>(Einstellungen&gt; E-Mail-Vorlage&gt; Suche nach \"Abandoned Shopping Cart\"&gt; Bearbeiten&gt; Code in HTML-ABSCHNITT einfügen)<br /></p><p>Schritt 3. Suchen Sie im HTML-Abschnitt nach dem folgenden Code<br /></p><p>&lt;td bgcolor = \"# F7F7F2\" style = \"border-bottom: 1px solid #cccccc;\"&gt; &lt;strong&gt; Pos. &lt;/ strong&gt; &lt;/ td&gt;<br /></p><p>Schritt 4. Fügen Sie darunter die folgende Codezeile hinzu<br /></p><p>&lt;td bgcolor = \"# F7F7F2\" style = \"border-bottom: 1px solid #cccccc;\"&gt; &lt;strong&gt; Produkt &lt;/ strong&gt; &lt;/ td&gt;<br /></p><p>Schritt 5. Suchen Sie nach &lt;td style = \"border-bottom: 1px solid #cccccc;\"&gt; {{loop.index}} &lt;/ td&gt;<br /></p><p>Schritt 6. Fügen Sie die folgende Codezeile ein<br /></p><p>&lt;td style = \"border-bottom: 1px solid #cccccc;\"&gt;<br /></p><p>{% if lineItem.productImage! = \"\"%}</p><p>&lt;img style = \"height: 57px;\" height = \"57\" src = \"{{lineItem.productImage}}\" alt = \"{{lineItem.productName | u.wordwrap (80)}}\" /&gt;</p><p>{% endif%}</p><p>&lt;/ td&gt;</p><p>Schritt 7. Speichern Sie die Vorlage</p><p>Bitte beachten Sie, dass wir das Code-Snippet in den Bildern hinzugefügt haben.<br /></p><p><br /></p><p>=======================================================================================================</p><p>Aktualisierungsanweisungen für bestehende Kunden: So fügen Sie Produktlinks für die Produktbilder in verlassenen Warenkorb-E-Mails hinzu.</p><p>================================================== ======================================================</p><p>Schritt 1. Bitte aktualisieren Sie Ihr Plugin auf die neueste Version \"Abandoned Cart v.1.0.7\".<br /></p><p>Schritt 2. Kopieren Sie die folgenden Codezeilen in E-Mail-Vorlagen - HTML-Vorlage<br /></p><p>(Einstellungen&gt; E-Mail-Vorlage&gt; Suche nach \"Abandoned Shopping Cart\"&gt; Bearbeiten&gt; Code in HTML-ABSCHNITT einfügen)<br /></p><p>Schritt 3. Bearbeiten Sie die HTML-E-Mail-Vorlage und suchen Sie nach dem folgenden Code:<br /></p><p> &lt;img style=\"height: 57px;\" height=\"57\" src=\"{{ lineItem.productImage }}\" alt=\"{{ lineItem.productName|u.wordwrap(80) }}\" /&gt;<br /></p><p>Schritt 4: Wickeln Sie das Produktbild wie unten gezeigt mit dem Ankertag ein:<br /></p><p>&lt;a href=\"{{ lineItem.productSeoUrl }}\"&gt;<br /></p><p>&lt;/a&gt;<br /></p><p>Zum Beispiel:<br /></p><p>&lt;a href=\"{{ lineItem.productSeoUrl }}\"&gt;<br /></p><p>&lt;img style=\"height: 57px;\" height=\"57\" src=\"{{ lineItem.productImage }}\" alt=\"{{ lineItem.productName|u.wordwrap(80) }}\" /&gt;<br /></p><p>&lt;/a&gt;<br /></p><p>Bitte beachten Sie, dass wir das Code-Snippet in den Bildern hinzugefügt haben.<br /></p><p><br /></p><p>* Für bestehende Kunden: Der grün hervorgehobene Code ist die Änderung, die in Ihrer E-Mail-Vorlage enthalten sein sollte</p>","shortDescription":"Senden Sie regemäßige Erinnerungen für nicht abgeschlossene Online-Käufe an Kunden und steigern Sie damit Ihre Konversionsrate. Verwenden Sie E-Mail-Vorlagen für bessere Marketinginhalt","highlights":"Einfach zu installieren und zu konfigurieren\nKonversion um 20% steigern met Möglichkeit zum Anzeigen von Benutzern mit verlassenen Wagen und Wagenartikeln.\nDauerhafter Warenkorb ist integriert, kein weiteres Plugin nötig\nKostenlose Updates und neue Features","features":"Das Plugin verfügt über einen integrierten dauerhaften Warenkorb, so dass die Artikel auch nach dem Abmelden für den Benutzer bei der nächsten Anmeldung verfügbar bleiben.\nDas Plugin bietet die Möglichkeit, Benutzer aufzulisten, die noch Artikel im Warenkorb haben, und die Artikel in ihrem Warenkorb aufzulisten.\nDas Plugin sendet in vorgegebenen Zeitabständen E-Mail-Erinnerungen an die Benutzer, damit sie ihren Kauf mit den im Warenkorb befindlichen Artikeln abschließen können.\nDas E-Mail-Format kann mit Hilfe von E-Mail-Vorlagen aus dem Shopware-Backend gespeichert und angepasst werden.\nDer E-Mail-Versand kann jederzeit deaktiviert werden oder es können Intervalle festgelegt werden, die den Bedürfnissen Ihres Geschäfts entsprechen.\nFreundliche und Marketing-Betreffzeilen können für E-Mails verwendet werden.\nGDPR-konformes Plugin"},{"id":15919,"name":"Abandoned Cart List & Notification - Increase conversion with reminder emails","description":"<h2>How often do your customers leave the cart?</h2><p>According to surveys, the average abandonment rate in sales is 70 percent and straight purchases are 30%.&nbsp; This means there is a high abandonment rate in online purchases as well where customers leave their carts with products without completing the order for various reasons like:</p><p>- thinking about another product</p><p>- want to check and compare with other web-stores</p><p>- get distracted in the middle of completing the order</p><p>- a bad network etc.&nbsp;</p><p><br></p><p>Rarely does customers come back to the abandoned carts and fulfil the order. In case of Shopware it doesn't come with a persistent cart either which makes it difficult for a user to easily get access to the product they were looking at.</p><p><br></p><h2>How Abandoned Cart Notification Help Solve the Issue and Boost Conversion?</h2><p>Our abandoned cart plugin comes with a persistent cart feature out of the box. This can go a long way in better conversion since Shopware doesn’t have this feature.</p><p><br></p><p>But our plugin comes with even more features. The plugin shows you a&nbsp;<b>list of users who have items left in the cart and also show you which items are there in the cart</b>. So you can plan a different marketing strategy to increase conversion. The plugin sends out reminder emails to customers (who finish the first step of checkout or login) about the products they left in the cart without completing the order. The store owner can set the intervals in which these friendly reminders should be sent. Because of this limit, it never becomes annoying for the customer.&nbsp; The number of interval days is comma-separated values like 2,5,15. If its set like this – the plugin will send emails on the second day, 5th day and 15th day after the user abandon the cart. Then it doesn’t send any more emails. If the store owners just want to send one reminder, they can set it as one number.</p><p><br></p><p>The email template is completely customizable with your marketing subject line or text with list of products and a link to complete the order.&nbsp; The store owner can set up coupon codes and send it via these emails to make the decision easier for the customers. This can increase the conversion by 20% and thereby increasing the revenue by 20% - which is remarkable.</p><p><br></p><p>This is also a great customer experience because who doesn’t like a friendly reminder and follow up about their favourite products which they left out in the cart? Definitely a sales booster!</p><p><br></p><p>Here is a video demonstration&nbsp; - https://www.youtube.com/watch?v=do3kWIQk8G4<br></p>","installationManual":"<p>Installation</p><p>Step 1: Buy the plugin at https://store.shopware.com.<br /></p><p>Step 2: Log in to Shopware with your user account<br /></p><p>Step 3: Open Settings-&gt; Plugin Manager<br /></p><p>Step 4: Click My Purchases and sign in if you haven't already. Enter the Shopware ID for the website you are working with.</p><p>Step 5: After login you will see a list of plugins for the website and your account. Download the plugin.</p><p>Step 6: Click on \"Installed\" to open a page with the plugins that are installed, uninstalled and deactivated.<br /></p><p>Step 7: Look for the AbandonedCart plugin in the \"Uninstalled\" list.<br /></p><p>Step 8: Click Install and activate the plugin.<br /></p><p><br /></p><p>construction<br /></p><p>1) Set the interval for the email in days.<br /></p><p>a) Open Settings -&gt; System -&gt; Plugins -&gt; My Plugins -&gt; Notification of abandoned shopping cart -&gt; Configuration<br /></p><p>To set the mail interval days for the abandoned cart notification:<br /></p><p>(Please use a coma separator to add more than one day.)</p><p><br /></p><p>2) Change the email template<br /></p><p>(Settings&gt; Email Template&gt; Search for \"Abandoned Cart\"&gt; Edit&gt;<br /></p><p><br /></p><p>Update instructions for existing customers: How to display the product image in the email.<br /></p><p>================================================================</p><p>Step 1. Please update your plugin to the latest version \"Abandoned Cart v.1.0.4\".<br /></p><p>Step 2. Copy the following lines of code into Email Templates - HTML Template<br /></p><p>(Settings&gt; Email Template&gt; Search For \"Abandoned Shopping Cart\"&gt; Edit&gt; Paste Code Into HTML SECTION)<br /></p><p>Step 3. Look for the following code in the HTML section<br /></p><p>&lt;td bgcolor = \"# F7F7F2\" style = \"border-bottom: 1px solid #cccccc;\"&gt; &lt;strong&gt; Pos. &lt;/strong&gt; &lt;/ td&gt;<br /></p><p>Step 4. Add the following line of code below it<br /></p><p>&lt;td bgcolor = \"# F7F7F2\" style = \"border-bottom: 1px solid #cccccc;\"&gt; &lt;strong&gt; product &lt;/ strong&gt; &lt;/ td&gt;<br /></p><p>Step 5. Search for &lt;td style = \"border-bottom: 1px solid #cccccc;\"&gt; {{loop.index}} &lt;/td&gt;<br /></p><p>Step 6. Paste the following line of code<br /></p><p>&lt;td style = \"border-bottom: 1px solid #cccccc;\"&gt;<br /></p><p>{% if lineItem.productImage! = \"\"%}</p><p>&lt;img style = \"height: 57px;\" height = \"57\" src = \"{{lineItem.productImage}}\" alt = \"{{lineItem.productName | u.wordwrap (80)}}\" /&gt;</p><p>{% endif%}</p><p>&lt;/ td&gt;</p><p>Step 7. Save the template</p><p><br /></p><p>For your reference, we have added the code snippet in the images.</p><p><br /></p><p>==================================================================================</p><p>Update instructions for existing customers: To add product links for the product images in abandoned cart emails.<br /></p><p>==================================================================================</p><p>Step 1. Please update your plugin to the latest version \"Abandoned Cart v.1.0.7\".</p><p>Step 2. Copy the following lines of code into Email Templates - HTML Template<br /></p><p>(Settings&gt; Email Template&gt; Search For \"Abandoned Shopping Cart\"&gt; Edit&gt; Paste Code Into HTML SECTION)<br /></p><p>Step 3. Please edit the HTML email template and search for the following code:<br /></p><p> &lt;img style=\"height: 57px;\" height=\"57\" src=\"{{ lineItem.productImage }}\" alt=\"{{ lineItem.productName|u.wordwrap(80) }}\" /&gt;</p><p>Step 4:  Wrap the product image with the anchor tag as shown below :<br /></p><p>&lt;a href=\"{{ lineItem.productSeoUrl }}\"&gt;</p><p>&lt;/a&gt;</p><p>For eg:</p><p>&lt;a href=\"{{ lineItem.productSeoUrl }}\"&gt;</p><p>&lt;img style=\"height: 57px;\" height=\"57\" src=\"{{ lineItem.productImage }}\" alt=\"{{ lineItem.productName|u.wordwrap(80) }}\" /&gt;</p><p>&lt;/a&gt;</p><p>For your reference, we have added the code snippet in the images.<br /></p><p><br /></p><p>* For existing customers: The code highlighted in green is the change that should be included in your email template<br /></p>","shortDescription":"Boost your conversion rate by sending reminder emails to customers to recover their abandoned carts. Use email templates for better marketing content and set the frequency of emails.","highlights":"Easy to install and configure\n20% more conversion with Ability to view users with Abandoned carts and cart items.\nBuilt-in persistent cart feature so you don't have to pay for another plugin.\nFree updates for upcoming features","features":"The plugin comes with a built-in persistent cart, so even after logout the items in cart remain available for the user the next time he logs in.\nThe plugin has the ability to list users who have items left in the cart and also list the items in their cart.\nThe plugin sends email reminders to users to complete their purchase on set intervals for the items they leave in their carts.\nThe email format can be saved and customized using email templates from Shopware backend.\nThe email sending can be disabled anytime or intervals can be set to suit the needs of your store.\nFriendly and Marketing subject lines can be used for emails.\nGDPR compliant plugin"}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":169905,"bookingKey":"Hatsl20556352288_M","bookingText":"Abandoned Cart List & Notification - Increase conversion with reminder emails","price":14,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169906,"bookingKey":"Hatsl20556352288_M12","bookingText":"Abandoned Cart List & Notification - Increase conversion with reminder emails","price":140,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3wUIKL","preview":true,"priority":0,"id":38840},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLT8RjN","preview":false,"priority":0,"id":38841},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqeUetR","preview":false,"priority":0,"id":38842},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvOAmBS","preview":false,"priority":0,"id":38843},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpr7dmvS","preview":false,"priority":0,"id":38844},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5hWlYS","preview":false,"priority":0,"id":38845},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaxmXA2","preview":false,"priority":0,"id":43849},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1ypOqR","preview":false,"priority":0,"id":44667}],"comments":[{"authorName":"Viktor Franz","text":"","headline":"Super Plugin, einige tolle Funktionen werden ja noch dazukommen! Wir freuen uns!","creationDate":{"date":"2020-04-20 10:02:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"E-Mail Benachrichtigungen für verlassene Warenkörbe","description":"Wie oft verlassen Ihre Kunden den Warenkorb?<br /><br />Erhebungen zufolge liegt die durchschnittliche Abbruchquote bei Verkäufen bei 70 % und bei direkten Käufen bei 30 %.  Das bedeutet, dass es auch bei Online-Käufen eine hohe Abbruchquote gibt, bei der die Kunden ihre Warenkörbe mit Produkten verlassen, ohne die Bestellung aus verschiedenen Gründen abzuschließen, z. B:<br /><br />- sie denken über ein anderes Produkt nach<br /><br />- sie wollen sich in anderen Web-Shops umsehen und vergleichen<br /><br />- mitten im Bestellvorgang abgelenkt werden<br /><br />- ein schlechtes Netz usw. <br /><br /><br />Nur selten kehren die Kunden zu den verlassenen Warenkörben zurück und schließen die Bestellung ab. Im Falle von Shopware gibt es auch keinen persistenten Warenkorb, was es für den Benutzer schwierig macht, das Produkt, das er sich angesehen hat, wiederzufinden.<br /><br /><br />Wie hilft die Abandoned Cart Notification, das Problem zu lösen und die Conversion zu steigern?<br /><br />Unser Plugin für abgebrochene Warenkörbe verfügt von Haus aus über eine Funktion für dauerhafte Warenkörbe. Dies kann einen großen Beitrag zu einer besseren Konversion leisten, da Shopware diese Funktion nicht hat.<br /><br /><br />Aber unser Plugin kommt mit noch mehr Funktionen. Das Plugin zeigt Ihnen eine Liste der Benutzer, die noch Artikel im Warenkorb haben und zeigt Ihnen auch, welche Artikel sich im Warenkorb befinden. So können Sie eine andere Marketingstrategie planen, um die Konversion zu erhöhen. Das Plugin sendet Erinnerungs-E-Mails an Kunden (die den ersten Schritt der Kaufabwicklung oder des Logins abgeschlossen haben) über die Produkte, die sie im Warenkorb gelassen haben, ohne die Bestellung abzuschließen. Der Shop-Betreiber kann die Intervalle festlegen, in denen diese freundlichen Erinnerungen verschickt werden sollen. Durch diese Begrenzung wird es für den Kunden nie lästig.  Die Anzahl der Intervalltage sind kommagetrennte Werte wie 2,5,15. Wenn es so eingestellt ist, sendet das Plugin am zweiten Tag, am 5. Tag und am 15. Danach sendet es keine weiteren E-Mails mehr. Wenn der Shop-Betreiber nur eine Erinnerung senden möchte, kann er diese als eine Nummer einstellen.<br /><br /><br />Die E-Mail-Vorlage ist vollständig anpassbar und enthält eine Betreffzeile oder einen Text mit einer Liste von Produkten und einem Link zum Abschluss der Bestellung.  Der Geschäftsinhaber kann Gutscheincodes einrichten und sie über diese E-Mails versenden, um den Kunden die Entscheidung zu erleichtern. Dies kann die Konversionsrate um 20 % erhöhen und damit den Umsatz um 20 % steigern - was bemerkenswert ist.<br /><br /><br />Das ist auch ein großartiges Kundenerlebnis, denn wer mag nicht eine freundliche Erinnerung an seine Lieblingsprodukte, die er im Warenkorb vergessen hat? Auf jeden Fall ein Verkaufsschlager!<br /><br /><br /><p>Hier ist eine Video-Demonstration - https://www.youtube.com/watch?v=do3kWIQk8G4</p>","installationManual":"<p>Installation</p><p>Schritt 1: Kaufen Sie das Plugin unter https://store.shopware.com.<br /></p><p>Schritt 2: Melden Sie sich mit Ihrem Benutzerkonto bei Shopware an<br /></p><p>Schritt 3: Öffnen Sie Einstellungen-&gt; Plugin Manager</p><p>Schritt 4: Klicken Sie auf Meine Einkäufe und melden Sie sich an, falls Sie dies noch nicht getan haben. Geben Sie die Shopware-ID für die Website ein, mit der Sie arbeiten.</p><p>Schritt 5: Nach dem Login sehen Sie eine Liste der Plugins für die Website und Ihr Konto. Laden Sie das Plugin herunter.<br /></p><p>Schritt 6: Klicken Sie auf \"Installiert\", um eine Seite mit den Plugins zu öffnen, die installiert, deinstalliert und deaktiviert sind.<br /></p><p>Schritt 7: Suchen Sie in der Liste \"Deinstalliert\" nach dem AbandonedCart-Plugin.<br /></p><p>Schritt 8: Klicken Sie auf Installieren und aktivieren Sie das Plugin.<br /></p><p><br /></p><p>Konstruktion<br /></p><p>1) Legen Sie das Intervall für die E-Mail in Tagen fest.<br /></p><p>a) Öffnen Sie Einstellungen -&gt; System -&gt; Plugins -&gt; Meine Plugins -&gt; Benachrichtigung über verlassenen Warenkorb -&gt; Konfiguration<br /></p><p>So legen Sie die Mailintervalltage für die Benachrichtigung über verlassene Einkaufswagen fest:<br /></p><p>(Bitte verwenden Sie ein Koma-Trennzeichen, um mehr als einen Tag hinzuzufügen.)</p><p><br /></p><p>2) Ändern Sie die E-Mail-Vorlage<br /></p><p>(Einstellungen&gt; E-Mail-Vorlage&gt; Nach \"Benachrichtigung über den Abbruch des Einkaufswagens\" suchen&gt; Bearbeiten&gt;<br /></p><p><br /></p><p>Aktualisierungsanweisungen für bestehende Kunden: So zeigen Sie das Produktbild in der E-Mail an.<br /></p><p>===========================================================================</p><p>Schritt 1. Bitte aktualisieren Sie Ihr Plugin auf die neueste Version \"Abandoned Cart v.1.0.4\".<br /></p><p>Schritt 2. Kopieren Sie die folgenden Codezeilen in E-Mail-Vorlagen - HTML-Vorlage<br /></p><p>(Einstellungen&gt; E-Mail-Vorlage&gt; Suche nach \"Abandoned Shopping Cart\"&gt; Bearbeiten&gt; Code in HTML-ABSCHNITT einfügen)<br /></p><p>Schritt 3. Suchen Sie im HTML-Abschnitt nach dem folgenden Code<br /></p><p>&lt;td bgcolor = \"# F7F7F2\" style = \"border-bottom: 1px solid #cccccc;\"&gt; &lt;strong&gt; Pos. &lt;/ strong&gt; &lt;/ td&gt;<br /></p><p>Schritt 4. Fügen Sie darunter die folgende Codezeile hinzu<br /></p><p>&lt;td bgcolor = \"# F7F7F2\" style = \"border-bottom: 1px solid #cccccc;\"&gt; &lt;strong&gt; Produkt &lt;/ strong&gt; &lt;/ td&gt;<br /></p><p>Schritt 5. Suchen Sie nach &lt;td style = \"border-bottom: 1px solid #cccccc;\"&gt; {{loop.index}} &lt;/ td&gt;<br /></p><p>Schritt 6. Fügen Sie die folgende Codezeile ein<br /></p><p>&lt;td style = \"border-bottom: 1px solid #cccccc;\"&gt;<br /></p><p>{% if lineItem.productImage! = \"\"%}</p><p>&lt;img style = \"height: 57px;\" height = \"57\" src = \"{{lineItem.productImage}}\" alt = \"{{lineItem.productName | u.wordwrap (80)}}\" /&gt;</p><p>{% endif%}</p><p>&lt;/ td&gt;</p><p>Schritt 7. Speichern Sie die Vorlage</p><p>Bitte beachten Sie, dass wir das Code-Snippet in den Bildern hinzugefügt haben.<br /></p><p><br /></p><p>=======================================================================================================</p><p>Aktualisierungsanweisungen für bestehende Kunden: So fügen Sie Produktlinks für die Produktbilder in verlassenen Warenkorb-E-Mails hinzu.</p><p>================================================== ======================================================</p><p>Schritt 1. Bitte aktualisieren Sie Ihr Plugin auf die neueste Version \"Abandoned Cart v.1.0.7\".<br /></p><p>Schritt 2. Kopieren Sie die folgenden Codezeilen in E-Mail-Vorlagen - HTML-Vorlage<br /></p><p>(Einstellungen&gt; E-Mail-Vorlage&gt; Suche nach \"Abandoned Shopping Cart\"&gt; Bearbeiten&gt; Code in HTML-ABSCHNITT einfügen)<br /></p><p>Schritt 3. Bearbeiten Sie die HTML-E-Mail-Vorlage und suchen Sie nach dem folgenden Code:<br /></p><p> &lt;img style=\"height: 57px;\" height=\"57\" src=\"{{ lineItem.productImage }}\" alt=\"{{ lineItem.productName|u.wordwrap(80) }}\" /&gt;<br /></p><p>Schritt 4: Wickeln Sie das Produktbild wie unten gezeigt mit dem Ankertag ein:<br /></p><p>&lt;a href=\"{{ lineItem.productSeoUrl }}\"&gt;<br /></p><p>&lt;/a&gt;<br /></p><p>Zum Beispiel:<br /></p><p>&lt;a href=\"{{ lineItem.productSeoUrl }}\"&gt;<br /></p><p>&lt;img style=\"height: 57px;\" height=\"57\" src=\"{{ lineItem.productImage }}\" alt=\"{{ lineItem.productName|u.wordwrap(80) }}\" /&gt;<br /></p><p>&lt;/a&gt;<br /></p><p>Bitte beachten Sie, dass wir das Code-Snippet in den Bildern hinzugefügt haben.<br /></p><p><br /></p><p>* Für bestehende Kunden: Der grün hervorgehobene Code ist die Änderung, die in Ihrer E-Mail-Vorlage enthalten sein sollte</p>","version":"4.0.0","changelog":[{"version":"4.0.0","text":"<p>Compatibility fixes with shopware 6.5</p>","creationDate":{"date":"2023-04-17 17:45:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.5","text":"<p>New Email template added for Polish/Poland language</p>","creationDate":{"date":"2022-05-26 08:07:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"<p>Modified to work with Amazon pay plugin</p>","creationDate":{"date":"2022-05-04 08:56:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<p>Email template added for de-CH German (Switzerland)</p>","creationDate":{"date":"2022-01-25 08:25:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>compatibility fix for shopware 6.4.7.0</p>","creationDate":{"date":"2021-12-21 12:55:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>New email template added for swiss german </p>","creationDate":{"date":"2021-11-25 08:48:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>compatibility fix for shopware 6.4</p>","creationDate":{"date":"2021-06-23 08:23:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Some minor bug fixes</p>","creationDate":{"date":"2021-05-28 16:35:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>Minor bug fixes and compatibility fixes</p>","creationDate":{"date":"2021-03-26 15:37:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Shopware compatibility fixes </p>","creationDate":{"date":"2020-09-29 15:13:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Added an option for the store owner to keep the \"Get abandoned cart notification emails\" checkbox in registration form checked/unchecked by default.</p>","creationDate":{"date":"2020-08-05 10:34:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>Domain URL cleanup for images and product URLs in the abandoned cart notification email</p>","creationDate":{"date":"2020-07-02 12:13:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>Some minor bug fixes with shopware promotions</p>","creationDate":{"date":"2020-06-19 13:08:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>Update: Product link for the product images in abandoned shopping cart emails</p>","creationDate":{"date":"2020-06-11 10:50:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>Missing domain URL for product images in email handled in this version </p><p><br /></p>","creationDate":{"date":"2020-06-04 15:42:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>Code quality improvements</p>","creationDate":{"date":"2020-05-28 11:49:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Added new feature to show product image in \"Abandoned cart\" email template</p>","creationDate":{"date":"2020-05-20 15:59:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- The abandoned cart notification email is sent based on the domain language of the sales channel.</p><p>- Some bug fixes</p>","creationDate":{"date":"2020-05-13 08:41:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Fix minor issue in adding promotion</p>","creationDate":{"date":"2020-04-20 16:46:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Configurable variables saving issue fixed</p>","creationDate":{"date":"2020-02-11 14:16:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First set of plugin files added here.</p>","creationDate":{"date":"2020-01-27 08:13:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Hatsl20556352288","redirectToStore":true,"lowestPriceValue":14}