{"id":10406,"name":"KlarnaPayment","code":"Klarn97469362120","lastChange":{"date":"2023-07-18 11:16:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKjer3T","examplePageUrl":"","moduleKey":"KlarnaPayment","creationDate":{"date":"2019-12-16 15:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-01-22 16:47:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2019-12-16 16:16:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":216,"prefix":"Klarna","name":"Klarna","website":"//www.klarna.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod216_Klarna_128x128.png"},"infos":[{"id":16304,"name":"Klarna Payments für Shopware 6","description":"<h3>Mit Klarna wird das Einkaufserlebnis Ihrer Kunden einfach smoooth. Die Partnerschaft mit Klarna ist der einfachste Weg, um Ihren Umsatz und durchschnittlichen Warenkorb zu steigern. Sie erhalten mehr Kunden, die mehr und öfters bei Ihnen kaufen. Sie werden immer im Voraus vollständig bezahlt, während Ihre Kunden selbst entscheiden können, wann sie bezahlen. Einfacher geht’s nicht.</h3><p><br /></p><h3><i>Klarna Payments</i></h3><p><br /></p><p>3 einfache und beliebte Zahlungs-Optionen für Ihre Kunden, um den Checkout Prozess so angenehm wie möglich zu gestalten:</p><p><br /></p><p></p><ul><li>Sofort bezahlen (via Sofortüberweisung, Lastschrift und Kreditkarte)</li><li>Später bezahlen (via Rechnung)</li><li>in Raten bezahlen (flexibel oder fester Zeitraum)</li></ul><p><br /></p><p><br /></p><h3>Ihre Vorteile mit Klarna</h3><p><br /></p><p></p><ul><li>Klarna Payments ist einfach zu integrieren</li><li>Klarna übernimmt das gesamte Risiko</li><li>pünktliche und garantierte Auszahlung</li><li>Klarnas Zahlungsarten steigern die Conversionsrate und erhöhen durchschnittliche Warenkörbe</li><li>minimale Dateneingabe, keine Medienbrüche</li><li>Entscheidung in Echtzeit, sofortiger Warenversand möglich</li><li>günstiger als eine Inhouse-Lösung</li><li>minimaler Verwaltungsaufwand</li></ul><p><br /></p><p>Durch eine einfache Integration in Ihre bestehende Checkout-Lösung sind Sie im Handumdrehen einsatzbereit. </p><p><br /></p><p><br /></p><h3>Möchten Sie mehr erfahren oder weitere Informationen erhalten?</h3><h4>Besuchen Sie uns unter <a href=\"https://www.klarna.com/de/verkaeufer/standardisierte-integration/shopware/\">https://www.klarna.com/de/verkaeufer/standardisierte-integration/shopware/</a> und erfahren Sie, wie sich auch Ihre Conversion mit Klarna steigern lässt. </h4><p><br /></p><p></p><p><br /></p><p></p>","installationManual":"<h4>Eine Installationsanleitung finden Sie unter <a href=\"https://klarna.kellerkinder.de/sw6/de/index.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://klarna.kellerkinder.de/sw6/de/index.html</a></h4><p><br /></p><p>Sofern Sie noch keine Klarna Registrierung durchlaufen haben oder Ihre Klarna Kundennummer nicht mit Kxxxxxx beginnt, registrieren Sie sich bitte via <a href=\"https://www.klarna.com/de/verkaeufer/\">https://www.klarna.com/de/verkaeufer/</a></p><p><br /></p><p><br /></p>","shortDescription":"Mit Klarna die beliebten Zahlarten Rechnung, Ratenkauf, SOFORT, Lastschrift und Kreditkarte anbieten - alles aus einer Hand und einfach integriert. Kein Ausfallrisiko für Händler.","highlights":"Klarna Rechnung - Lassen Sie Ihre Kunden die Ware erst erhalten und später bezahlen, indem Sie ihnen zusätzliche 14 Tage anbieten, um ihre Zahlung abzuschließen. Ohne Gebühren.\nKlarna Ratenkauf - Geben Sie Ihren Kunden die flexible Möglichkeit, jetzt zu kaufen und die Kosten auf  monatliche Zahlungen zu verteilen.\nKlarna Sofortüberweisung, Lastschrift und Kreditkarte - Die Direktzahlung bietet Ihren Kunden einen schnellen, sicheren und einfachen Weg für direkte und automatische Zahlungen.","features":""},{"id":16305,"name":"Klarna Payments for Shopware 6","description":"<h2><b>Klarna Payments</b></h2><h4>Klarna Payments​ are standalone payment methods. With Klarna Payments you can complement your checkout with a Klarna hosted widget located in your existing checkout. </h4><p><br /></p><p></p><ul><li>Pay Now - bank payments are direct options for a fast checkout with Direct Debit, Direct Bank Transfer and Credit Card</li><li>Pay in 30 days - let your customer try before they buy</li><li>Installments - interest-free installments give your customer an alternative to credit</li></ul><p><br /></p><p><br /></p><h2><b>Benefits with Klarna</b></h2><p></p><ul><li>Give shoppers flexible payment options while you always get paid upfront and in full</li><li>All of Klarnas payment methods are optimized for mobile checkout</li><li>Differentiate from competitors by providing a better customer experience</li><li>Safe and secure with 100% risk-free guarantee</li><li>Relevant presentation of payment options with local payment</li></ul><p><br /></p><p>Simple integration into your existing checkout solution means you will be up and running in no time.</p><p><br /></p><h2><b>You want to know more about Klarna Payments?</b></h2><p>Visit us https://www.klarna.com/uk/business/payment-methods/ and get more information on how your conversion can be increased with Klarna. <br /></p><p></p><h2><br /></h2><p></p>","installationManual":"<p></p><h4>The installation guide can be found via <a href=\"https://klarna.kellerkinder.de/sw6/en/index.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://klarna.kellerkinder.de/sw6/en/index.html</a><br /></h4><p><br /></p><p><br /></p><p></p>","shortDescription":"With Klarna you get more ways to pay - more chances to sell. Invoice, Installments, Direct Debit, Direct Bank Transfer and Credit Card - easily integrated into your Checkout.","highlights":"Pay in 30 days - Pay in 30 days is designed to make shopping easier for your customers. By offering them an opportunity to try before they buy, you're increasing the checkout flexibility – creating more business for you. \n\nInstallments - Klarna’s interest-free installments give shoppers the freedom to choose how and when to pay. They get to spread the cost over time while you get paid in full, straight away. As an alternative to credit, installments increase sales and customer loyalty when added to your online checkout.\n\nPay now - Pay now goes straight to the point, giving your customers the option to pay today by completing secure bank or card payments. Pay now is designed to increase conversions by letting your customers make safe payments in seconds.","features":""}],"addons":["SW6_integrated","initialSupportByShopware"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":158100,"bookingKey":"Klarn97469362120","bookingText":"Klarna Payments for Shopware 6","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbRGNnJ","preview":true,"priority":0,"id":38615},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCC2bLl","preview":false,"priority":0,"id":38610},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDk656m","preview":false,"priority":0,"id":38611},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0oVNon","preview":false,"priority":0,"id":38612},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpH0bYeg","preview":false,"priority":0,"id":38613},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkqDVyn","preview":false,"priority":0,"id":38614},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNzmMHi","preview":false,"priority":0,"id":38617}],"comments":[{"authorName":"BRANDJUNG Agentur GmbH","text":"Leider hängt die Klarna Erweiterung immer wieder mit den Updates hinterher. Andere, deutlich kleinere Plugin-Hersteller haben keine Probleme damit, zum Release einer neuen Shopware Version die passenden Updates bereitzustellen. Oft müssen wir nur aufgrund der Klarna Erweiterung ein Shopware Update hinten anstellen.","headline":"Leider nicht kompatibel","creationDate":{"date":"2023-05-15 11:05:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"User","text":"Shopware stellt doch bei größeren Updates vorab Testversionen zur Verfügung, damit Plugins rechtzeitig angepasst werden können. Shopware 6.5.0.0 steht seit 05.05.23 als final release zur Verfügung, aber wann kommt das angepasste Klarna Plugin?\nEs ist nicht nachvollziehbar, warum man hier so hinterherhängt.","headline":"Warum gibt es noch kein Update zur Kompatibilität mit Shopware 6.5.0.0?","creationDate":{"date":"2023-05-10 20:25:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"kontorplus.De","text":"Hallo, \nleider können wir das KLARNA Plugin NICHT nutzen, weil KLARNA überraschenderweise (noch) gar kein B2B-Zahlungen anbietet (Ausnahmen sind hier Schweden, Norwegen, Finnland) UND diesbezüglich leider bei den Voraussetzungen NICHT darauf hingewiesen wird/wurde das es für mögliches B2B nur sehr sehr eingeschränkt nutzbar ist! \n\nFür den Zahlungsverkehr mit dem privaten Endkunden kann man das Plugin gebrauchen und es hat funktioniert - so kommen doch ein paar Sterne zusammen! \n\nARTIKEL von KLARNA \"Kann ich mit Klarna an andere Unternehmen verkaufen?\"\nhttps://www.klarna.com/de/verkaeufer/haendlersupport/kann-ich-mit-klarna-an-andere-unternehmen-verkaufen/","headline":"Aktuell NUR sehr eingeschränkt im B2B nutzbar!","creationDate":{"date":"2023-04-18 17:48:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":5},{"authorName":"Dirk von Mannsbild","text":"App verabschiedet sich ohne Meldung in den Hintergrund,Symbole werden plötzlich nicht mehr angezeigt, authorisierte Bestellungen werden auf Klarna nicht angezeigt  und der Support stellt nur Standardfragen und verweist lediglich auf Kellerkinder oder schickt nicht zum Thema passende Fragenlisten. Schulnote: Ungenügend.","headline":"Ständig Abbrüche","creationDate":{"date":"2023-02-22 10:00:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Mark A.","text":"Kommt schon ... was ist nun mit SW 6.5","headline":"was ist denn nun mit euch ?","creationDate":{"date":"2023-02-04 15:52:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Jacob","text":"We had a lot of problems while getting Klarna to work, probably caused by different issues on our end, I suspect the test server we were first trying to install Klarna on had unknown errors that prevented Klarna payment methods from showing up.\n\nWe ended up creating a fresh test server based on our live environment, and suddenly the payment methods started showing up.\n\nThe final problem we had was semi-hidden, and you have to open console from the developer tools in your browser to get an actual description of what is happening. Basically the klarna element was just loading (endless spinning) on the checkout page. This was caused by our \"Content-Security-Policy\" preventing Klarna's iframe from being loaded. Klarna's domain needs to be added like this:\n\nContent-Security-Policy \"frame-src https://*.klarna.com\"\n\nYou probably need to do this from the web server (Nginx or Apache), in the vhost settings, but then it should work.\n\nKlarna's support has been super friendly and helpful. I was in contact with someone on Shopware's Slack too.","headline":"I got it to work in 6.4.18.0, after much fiddling","creationDate":{"date":"2022-12-20 09:52:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Franck Boodo","text":"Sehr geehrte Damen und Herren,\nVielen Dank für das tolle Plugin\nwir verwenden Shopware 6 in der Version 6.4.13.0 in Verbindung mit Ihrem Plugin „Klarna Checkout und Klarna Payments“ in der aktuell letzten Version 1.7.0.\nBei einem Änderungsversuch des Bestellstatus (bei einer Gastbestellung mit Zahlungsstatus „bezahlt“) von „Offen“ auf „In Bearbeitung“ bekommen wir eine Fehlermeldung im Backend (siehe Bild im Anhang).\nDie Antwort des Netzwerkanalysetools hat uns erst auf das Plugin von Klarna gebracht und uns darüber hinaus auch etwas mehr Auskunft gegeben:\n{\"errors\":[\n{\"code\":\"FRAMEWORK__WRITE_CONSTRAINT_VIOLATION\",\"status\":\"400\",\"detail\":\"KlarnaPayment.errorMessages.addressChangeDeclined\",\"template\":\"\",\"meta\":{\"parameters\":[]},\"source\":{\"pointer\":\"\"}},\n{\"code\":\"FRAMEWORK__WRITE_CONSTRAINT_VIOLATION\",\"status\":\"400\",\"detail\":\"KlarnaPayment.errorMessages.lineItemChangeDeclined\",\"template\":\"\",\"meta\":{\"parameters\":[]},\"source\":{\"pointer\":\"\"}}\n]}\nIst das ein (vielleicht gewollter) Spezialfall? Und falls ja, welcher? Oder ist es tatsächlich ein Fehler und könnte dieser dann bitte behoben werden?","headline":"Error bei manuellem Änderung eines Bestellstatus","creationDate":{"date":"2022-12-20 09:07:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":7},{"authorName":"frank eichner","text":"Man kann kein Update auf 6.4.10 machen weil Klarna ewig lange für das Plugin Update braucht.","headline":"Update dauert zu lange","creationDate":{"date":"2022-04-17 13:05:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"P. Jordan","text":"Update auf v6.4.10 Stable Version von Shopware gemacht. Nun steht Klarna nichtm ehr zur Verfügung.\nIhr solltet echt mal Up to Date sein was eure Plugins angeht, geht echt nicht klar das ich nun weniger Zahlungsarten anbieten kann.","headline":"Klarna ist echt nervig langsam was ihr Plugin angeht","creationDate":{"date":"2022-04-07 17:21:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Ann Kathrin Esch","text":"Seit dem letzten Update auf 6.8.4 verschwand trotz richtiger Konfiguration die Zahlungsmöglichkeit Klarna von der Homepage. Jetzt durch das Update auf 6.4.9.0 ist alles verschwunden. Weder Klarna, noch Paypal sind aufzufinden. Absolut unverständlich","headline":"Mies","creationDate":{"date":"2022-03-31 16:16:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Thomas Schneider","text":"Egal was man macht, kommt die Fehlermeldung.\nklarnaAuthorizationToken darf nicht leer sein.\n\nSupport reagiert nicht.","headline":"Funktioniert nicht.","creationDate":{"date":"2022-03-24 18:33:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"XMLUser","text":"Die Erweiterung funktioniert ohne Probleme.\nEs wäre toll wenn man den Bezahlstatus automatisch auf bezahlt setzen könnte nachdem die Zahlung von Klarna akzeptiert wurde. Momentan ist die Zahlung auf Offen. Das bildet dann zusätlichen Aufwand alle Bestellungen per Hand auf bezahlt zu setzen.","headline":"Funktioniert einwandfrei, einen kleinen Wunsch hätten wir jedoch","creationDate":{"date":"2022-01-03 00:31:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Yunus A.","text":"Ihr seid allesamt Helden, die es nicht hinkriegen ein Plugin vernünftig zu verwenden. \nFast alle 1 Stern Bewertungen sind nicht gerechtfertig.\nEs liegt an euch, dass es nicht funktioniert. Da hat weder Klarna, noch Shopware einen Einfluss darauf. \n#EigeneNaseUndSo","headline":"Funktioniert seither tadellos!","creationDate":{"date":"2021-11-17 08:48:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Fabian Ziemann","text":"Das Plugin funktioniert nicht. Die gewünschten Standardzahlungsmöglichkeiten von Klarna werden nicht im Check-out Prozess angezeigt. \nDer Support antwortet nicht auf Anfragen.","headline":"Support antwortet nicht auf Anfrage","creationDate":{"date":"2021-06-02 10:34:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Anika Zinndorf","text":"Keine Antwort auf Registrierungs-Anfrage. Nein Danke.","headline":"Schlecht","creationDate":{"date":"2021-04-23 21:06:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Jan Pawellek","text":"Vorsicht, dieses Plugin spioniert dich und deine Kunden aus!\n\nSobald dein Kunde auf die Bestellbestätigungsseite kommt, kommuniziert dieses Plugin mit Klarna. Und das sogar, wenn der Kunde gar nicht Klarna als Zahlungsmethode auswählt.\n\nDabei werden Tracking-Methoden angewendet, sogenanntes Device Recognition oder Fingerprinting. Das sind Methoden, die sicherstellen, dass dein Kunde getrackt wird, selbst wenn er seine Cookies löscht.\n\nDieses Plugin verfolgt also deine Kunden und erhebt Statistiken über deinen Shop, ohne dass dir oder deinen Kunden eine Wahl gelassen wird.\n\nMit einem Unternehmen, dass solche Praktiken anwendet, will ich keine Geschäfte machen. Klarna werde ich nicht mehr als Zahlungsmethode anbieten.","headline":"Spioniert deinen Shop und deine Kunden aus","creationDate":{"date":"2021-03-25 10:44:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Nico O.","text":"Kann mich dem Johannes, nur anschließen, laufen ganze Zeit hinterher dass da mal eine Plugin Anpassung / Freigabe stattfindet. Dass Shopware 6 in Kinderschuhen steckt ist uns allen bekannt, hier ist man auf jedes Update angewiesen und erwartet rasches Updates vom Plugin. Sehr schade um das entgangene Potenzial.","headline":"Ewiges Katz und Maus Spiel","creationDate":{"date":"2020-12-14 13:47:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Johannes","text":"Das Plugin funktioniert gut und tut was es soll. Leider dauert es ewig, bis das Plugin auf jeweils die aktuelle Shopware-Version aktualisiert ist. So muss man entweder mit einem Shopware-Update warten, oder auf den Zahlungsanbieter so lange verzichten.. sehr schade..","headline":"Funktioniert gut - dauert jedoch lange bis aktuell","creationDate":{"date":"2020-12-11 09:00:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Dennis Floer","text":"","headline":"Schlechter und frecher E-mail support, Plugin läuft leider nicht wie geplant.","creationDate":{"date":"2020-11-04 08:55:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Uwe Leitner","text":"scheint tolles system zu sein. leider nur über callcenter erreichbar die anderes zahlsystem promoten. Konnte keinen kontak herstellen. Bis auf 2 Emails aber dan kam keine Antowrt mehr. schade. sehr schade. habe es nicht geschafft jemand zu erreichen mit dem man den vertrag hätte machen können, dies als schweizer firma.","headline":"Kein kontakt möglich","creationDate":{"date":"2020-10-05 15:01:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Marvin Reuter","text":"Support vom Klarna Plugin einwandfrei! \nAlle gefundenen Fehler wurden schnell gefunden und behoben.","headline":"Support Top!","creationDate":{"date":"2020-08-09 13:44:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Darius Pauly","text":"Seit Wochen versuchen wir vom Klarna eine Antwort zu bekommen Wann wir mit Plugin für Version 6.2 Starten können Keine Antwort bis heute","headline":"Lange Entwicklung Zeiten 0 Support","creationDate":{"date":"2020-07-02 16:15:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Frederik Baumgärtner","text":"Anfangs hatten wir Probleme und trafen beim Klarna-Support auf taube Ohren. Der Shopware-Support konnte uns dann aber an die Plugin-Entwickler weiterleiten, welche unser Problem mit einem Update beheben konnten. \nLeider dauert es recht lange, bis das Plugin auf die aktuelle Shopware-Version angepasst wurde, was uns dazu brachte hier zuerst eine 1-Sterne Bewertung zu hinterlassen, da das Plugin von Shopware empfohlen wird und als Zahlungsplugin für uns einen integrale Rolle spielt, uns jedoch hinderte auf aktuellere Shopware-Versionen zu aktualisieren.  Nach einem freundlichen Telefonat mit dem Support wurden uns jedoch die Hintergründe für die langen Update-Zeiten genant (zu viele bzw. last-minute Änderungen von Shopware selbst, weshalb bei größeren Releases ersteinmal abgewartet wird, bis diese stabil genug sind), was natürlich aus IT-Sicht auch vollkommen verständlich ist, jedoch den Shopbetreibern einfach hätte besser kommuniziert werden müssen, sodass man dies besser mit einplanen kann.","headline":"Kleinere Probleme, freundlicher Support","creationDate":{"date":"2020-06-25 13:22:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8}],"ratingAverage":5,"label":"Klarna Payments für Shopware 6","description":"<h3>Mit Klarna wird das Einkaufserlebnis Ihrer Kunden einfach smoooth. Die Partnerschaft mit Klarna ist der einfachste Weg, um Ihren Umsatz und durchschnittlichen Warenkorb zu steigern. Sie erhalten mehr Kunden, die mehr und öfters bei Ihnen kaufen. Sie werden immer im Voraus vollständig bezahlt, während Ihre Kunden selbst entscheiden können, wann sie bezahlen. Einfacher geht’s nicht.</h3><p><br /></p><h3><i>Klarna Payments</i></h3><p><br /></p><p>3 einfache und beliebte Zahlungs-Optionen für Ihre Kunden, um den Checkout Prozess so angenehm wie möglich zu gestalten:</p><p><br /></p><p></p><ul><li>Sofort bezahlen (via Sofortüberweisung, Lastschrift und Kreditkarte)</li><li>Später bezahlen (via Rechnung)</li><li>in Raten bezahlen (flexibel oder fester Zeitraum)</li></ul><p><br /></p><p><br /></p><h3>Ihre Vorteile mit Klarna</h3><p><br /></p><p></p><ul><li>Klarna Payments ist einfach zu integrieren</li><li>Klarna übernimmt das gesamte Risiko</li><li>pünktliche und garantierte Auszahlung</li><li>Klarnas Zahlungsarten steigern die Conversionsrate und erhöhen durchschnittliche Warenkörbe</li><li>minimale Dateneingabe, keine Medienbrüche</li><li>Entscheidung in Echtzeit, sofortiger Warenversand möglich</li><li>günstiger als eine Inhouse-Lösung</li><li>minimaler Verwaltungsaufwand</li></ul><p><br /></p><p>Durch eine einfache Integration in Ihre bestehende Checkout-Lösung sind Sie im Handumdrehen einsatzbereit. </p><p><br /></p><p><br /></p><h3>Möchten Sie mehr erfahren oder weitere Informationen erhalten?</h3><h4>Besuchen Sie uns unter <a href=\"https://www.klarna.com/de/verkaeufer/standardisierte-integration/shopware/\">https://www.klarna.com/de/verkaeufer/standardisierte-integration/shopware/</a> und erfahren Sie, wie sich auch Ihre Conversion mit Klarna steigern lässt. </h4><p><br /></p><p></p><p><br /></p><p></p>","installationManual":"<h4>Eine Installationsanleitung finden Sie unter <a href=\"https://klarna.kellerkinder.de/sw6/de/index.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://klarna.kellerkinder.de/sw6/de/index.html</a></h4><p><br /></p><p>Sofern Sie noch keine Klarna Registrierung durchlaufen haben oder Ihre Klarna Kundennummer nicht mit Kxxxxxx beginnt, registrieren Sie sich bitte via <a href=\"https://www.klarna.com/de/verkaeufer/\">https://www.klarna.com/de/verkaeufer/</a></p><p><br /></p><p><br /></p>","version":"1.9.065","changelog":[{"version":"1.9.065","text":"<ul><li>Added compatibility with Shopware 6.5.0.0</li><li>Adjusted the display of the payment names in the checkout</li></ul>","creationDate":{"date":"2023-05-22 14:57:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.064","text":"<ul><li>Added compatibility with Shopware 6.5.0.0</li><li>Adjusted the display of the payment names in the checkout</li></ul>","creationDate":{"date":"2023-05-22 14:50:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.0","text":"<ul><li>Fixed translation of error message when adjusting order in administration</li><li>Added product variant information in capture/refund modal</li><li>Fixed error that occurred by closing the order history detail modal</li><li>Optimize code to reduce possible errors</li><li>Injected environment variable APP_SECRET via Symfony service definition in respective services to fix LogicException in checkout.</li><li>Added compatibility for USA</li><li>Fixed overwrite of administration component sw-order-detail-base for other plugins</li></ul>","creationDate":{"date":"2023-03-21 16:29:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"<ul><li>Added Klarna Express Login functionality to the checkout</li><li>Added session update request to reduce session creation with Klarna</li><li>Fixed validation of tos checkbox in checkout</li></ul>","creationDate":{"date":"2022-10-26 14:43:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.3","text":"<ul><li>Added a check if terms and conditions were accepted in the checkout<br /></li></ul>","creationDate":{"date":"2022-08-19 09:33:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"<ul><li>Added compatibility with CSRF mode \"ajax\"<br /></li></ul>","creationDate":{"date":"2022-07-25 12:19:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<p></p><ul><li>Added compatibility with Shopware 6.4.10.0</li></ul>","creationDate":{"date":"2022-04-20 08:27:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<ul><li>Added NetiNextEasyCoupon compatibility. Vouchers will be transferred to Klarna as gift cards.</li><li>Updated minimum version to Shopware 6.3.0.0</li><li>Added notice for inheritance of plugin configuration for Shopware versions lower 6.3.4.0</li><li>Fixed the de- and activation of the button for order completion with Klarna payment methods</li><li>Fixed transition from authorized to paid status with manual full capture</li><li>Removed Rule installer due to overwriting of custom rules</li><li>Removed the explicit conditions for payment methods</li><li>Fixed the cover URL for order requests to the Klarna API</li><li>Added the product URL for order requests to the Klarna API</li><li>Fixed the available payment methods depending on the response from the Klarna API</li></ul>","creationDate":{"date":"2022-04-12 16:21:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Moved language files to new location</li><li>Added Ireland to available countries</li><li>Optimized the display of inherited values in the plugin configuration</li><li>Set order payment status to authorized if payment is authorized by Klarna</li><li>Use selected shipping method name as order position for Klarna order</li><li>Added SwagCustomizedProducts compatibility</li></ul>","creationDate":{"date":"2022-02-28 09:09:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<ul><li>Fix usage of vouchers with multiple tax rates</li><li>Fix handling of the payment finish modal, when being closed</li><li>The Klarna widget is now displayed above the position table in the checkout if at least Shopware 6.4 is used</li><li>Fix the button for order completion when closing the Klarna modal</li><li>Fix eslint error message with Shopware 6.4.5.x</li></ul>","creationDate":{"date":"2021-11-04 16:41:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<ul><li>Fix uninstall of plugin when user data should not be kept<br /></li></ul>","creationDate":{"date":"2021-10-11 08:15:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p></p><ul><li>Added support for PHP 8</li><li>Update cart hash logic for verification of order editing</li></ul>","creationDate":{"date":"2021-08-10 16:11:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<ul><li>Added compatibility with Shopware 6.4<br /></li></ul>","creationDate":{"date":"2021-05-04 14:19:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Removed instant Shopping.</li><li>Added translations for payment methods.</li><li>Fix error in Internet Explorer that prevents order completion</li></ul>","creationDate":{"date":"2021-04-16 14:40:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.8","text":"Removed Klarna payments rule from Rule-Builder.\nAdded Italy as a supported country. Note: Instant Shopping is not supported for Italy.\nFix rare error for invalid values when saving plugin configuration.\nAutomatic captures will only be executed if the fraud status is accepted.\nAutomatic capture for delivery and order status open is now possible.","creationDate":{"date":"2021-02-10 14:13:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"Fix plugin configuration value errors\n<b>Please note</b>: There are known erroneous configuration behaviors with sales channel inheritance in the documentation https://klarna.pluginwerk.de/en/1-3/index.html#h-limitations-for-configuration-in-shopware-6-3-4-0-and-above","creationDate":{"date":"2020-12-23 17:51:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"<p></p><ul><li>Improve error handling for Instant Shopping</li><li>Fix missing labels in plugin configuration</li><li>Added note in documentation (https://klarna.pluginwerk.de/en/1-3/index.html#h-translation-of-the-payment-methods) about translation of payment methods.</li></ul>","creationDate":{"date":"2020-12-18 16:36:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"<ul><li>Add default name for payment methods for the installation with a different system language<br /></li></ul>","creationDate":{"date":"2020-12-03 09:27:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<p></p><ul><li>Fix handling of promotions in cart</li></ul>","creationDate":{"date":"2020-11-20 14:41:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<p></p><ul><li>Fix automatic package of zip archive to include compiled files again</li><li>Fix use of wrong exception class</li></ul>","creationDate":{"date":"2020-11-16 15:08:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>- Fix styling issues of the Instant Shopping button</p><p>- Fix error on updating order when order has been captured</p><p>- Improve performance in checkout and order update</p><p><br /></p>","creationDate":{"date":"2020-11-13 16:28:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p></p><ul><li>Fix error when selecting an order from the search results</li></ul>","creationDate":{"date":"2020-10-06 10:01:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>Add locale and currency to the rule for available Klarna payment methods in the checkout</li><li>Send shipping tracking information to the Klarna merchant portal</li><li>Fix error during installation if a language could not be found</li><li>Fix Instant Shopping for guests with activated required registration settings</li><li>Optimize validation of API credentials</li></ul>","creationDate":{"date":"2020-09-14 14:37:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"Fix delivery information display on detail pages\nFix administration order updates for non-Klarna orders","creationDate":{"date":"2020-07-21 13:01:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>Added compatibility with Shopware 6.2</p><p><br /></p><p><b>Warning</b></p><p>An error can occur during the update. After downloading the new version in the administration (or uploading the ZIP archive) you have to clear the cache once manually, e.g. via <i>bin/console cache:clear</i>. After that, the update can be done in the plugin manager.</p>","creationDate":{"date":"2020-07-08 09:39:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Implementation of Klarna instant shopping</p><p></p><p>Add support for net prices (preparation for Shopware 6.2.0, compatibility is upcoming)</p><p><b><br /></b></p><p><b>Warning</b></p><p>An error can occur during the update. After downloading the new version in the administration (or uploading the ZIP archive) you have to clear the cache once manually, e.g. via <i>bin/console cache:clear</i>. After that, the update can be done in the plugin manager.</p>","creationDate":{"date":"2020-06-19 13:51:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Fix checkout confirmation button for non-Klarna payment methods<br /></p><p><br /></p><p><b>Warning</b></p><p>An error can occur during the update. After downloading the new version in the administration (or uploading the ZIP archive) you have to clear the cache once manually, e.g. via <i>bin/console cache:clear</i>. After that, the update can be done in the plugin manager.</p>","creationDate":{"date":"2020-04-29 18:06:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Fix customer name for Klarna Payment session</p><p><br /></p><p><b>Warning</b></p><p>An error can occur during the update. After downloading the new version in the administration (or uploading the ZIP archive) you have to clear the cache once manually, e.g. via <i>bin/console cache:clear</i>. After that, the update can be done in the plugin manager.</p>","creationDate":{"date":"2020-04-27 17:04:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Added combined Pay Now payment method and Credit Card</p><p>Order changes in the administration are verified with Klarna before persisting the changes</p><p>Changed address structure</p><p>Payment method categories can now be disabled from the plugin configuration</p><p>Skip verification of order changes during order process before Klarna order is created</p>","creationDate":{"date":"2020-04-27 15:31:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Fixed a rounding issue for Klarna calls</p>","creationDate":{"date":"2020-01-30 11:55:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First version of the Klarna Payment integration for Shopware 6.1</p>","creationDate":{"date":"2020-01-22 13:42:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Klarn97469362120","redirectToStore":false,"lowestPriceValue":0}