{"id":10467,"name":"NgsAchieveFreeShippingSw6","code":"ngs5893843108318","lastChange":{"date":"2023-07-18 14:09:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqg8K56","examplePageUrl":"","moduleKey":"NgsAchieveFreeShippingSw6","creationDate":{"date":"2019-12-24 21:52:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-08-18 12:27:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-08-15 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-08-09 20:42:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":902,"prefix":"ngs","name":"Naghashyan Solutions","website":"//naghashyan.com","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod902_sw_128.jpg"},"infos":[{"id":16394,"name":"Erreichen kostenlosen Versand","description":"<h3>Der beste Weg, Kunden anzuziehen, mehr Produkte zu kaufen.</h3><p>\"Erreichen kostenlosen Versand\" -Programmerweiterung ist hier, um Ihren Kunden zu helfen, ihre Bestellungen zu organisieren, indem sie die kostenlose Versandmöglichkeit als Ziel haben. Sie haben vielleicht eine Frage, wie es gemacht werden könnte? Hier ist eine einfache Lösung. Diese&nbsp;Programmerweiterung zeigt, wie viel Summe im Warenkorb übrig ist, bis der Nutzer den kostenlosen Versand erreicht. Die&nbsp;Programmerweiterung ist der beste Weg, um den Kunden anzuziehen, mehr Produkte zu kaufen, so werden die Verkäufe des Shopes wachsen. Wenn der Benutzer einen Artikel zum Warenkorb hinzufügt, die verbleibenden Kosten, die für den kostenlosen Versand der Bestellung erforderlich sind, werden berechnet. Die Restkosten werden auf Basis des Parameters \"Versand frei von\" (Konfigurationen -&gt; Versandkosten -&gt; Versandmethode) berechnet. Auf der Website wird es mit einem Lader und einer kurzen Nachricht angezeigt. Mit der Hilfe der Konfigurationen kann Shop-Manager auswählen, auf welchen Seiten der Lader mit der Nachricht angezeigt werden soll, folgende Varianten sind verfügbar: Warenkorb, Checkout Cart Seite, Checkout Bestätigen Seite, Zahlung und Versand Seite. Darüber hinaus gibt es ein Popup-Fenster mit dem Lader, das von dem Knopf \"Warenkorb\" entweder beim Schweben oder bei jeder Seitenumleitung / Aktualisierung geöffnet wird. Das kleine \"Lastwagen\" -Symbol bleibt auf den Knopf, nachdem das Pop-up geschlossen wurde. Unter mobilen Geräten wird das Pop-up durch einen \"Lastwagen\" -Knopf neben dem Warenkorb ersetzt. Der Shop-Manager kann auch eine Standardlieferungsmethode festlegen, nach dem wird die kostenlose Lieferung verbleibenden Kosten gezählt, bis der Benutzer eine geeignete Methode wählt. Im Fall, wenn eine neue Versandmethode im Shop hinzugefügt wird, wird es automatisch in den Programmerweiterungn-Konfigurationen angezeigt. Im Fall, wenn es mindestens ein kostenloser Versandartikel im Warenkorb gibt, wird der Lader mit der Nachricht nicht angezeigt, da der Versand schon frei sein wird. Es wird auch nicht angezeigt, wenn die Summe der Produktkosten im Warenkorb die freie Versandgrenze überschritten hat, nach dem freie Versandkosten angezeigt werden, bis der Benutzer eine beliebige Methode wählt. Es gibt auch die Möglichkeit, Größe und Farbe des Symbols, des Textes usw. für verschiedene Seiten zu ändern. So wird die&nbsp;Programmerweiterung perfekt mit Ihrem Shop-Design passen.</p><h3>Vorteile</h3><ul><li>Die Kunden werden angezogen, um mehr Produkte zu kaufen</li><li>Das kreative Design wird die Aufmerksamkeit der Kunden auf sich ziehen</li><li>Die&nbsp;Programmerweiterung ist auch für mobile Geräte verfügbar</li><li>Der Shop-Manager selbst wählt die Seiten, auf denen der Lader mit der Nachricht erscheinen soll</li><li>Die Nachricht ist ein Snippet, so kann jeder Text hinzugefügt werden</li><li>Eine neue Versandkosten erscheint automatisch in den Konfigurationen</li><li>Das Pop-up verschwindet, sobald das Limit erreicht ist, so dass es die Kunden nicht stören wird</li></ul><h3>Unterstützung</h3>Für technische Unterstützung senden Sie bitte eine E-Mail an info@naghashyan.com<br><br><h3>Über Naghashyan Solutions</h3><b>Website:</b>&nbsp;naghashyan.com<br><b>Tel:</b>&nbsp;+374 77 77 79 42<br><b>Email:</b>&nbsp;info@naghashyan.com<br><b>Adresse:</b>&nbsp;Arabkir 49str, 22bld, Armenia, Yerevan 0037","installationManual":"<p>Die Installation der&nbsp;Programmerweiterung dauert einige Sekunden mit einem Klick. Die&nbsp;Programmerweiterung wird seine Standardkonfigurationen einrichten, sobald die Installation abgeschlossen ist. Sie können die Konfigurationen jederzeit ändern, wann Sie wollen. Die&nbsp;Programmerweiterung unterstützt Shopware 6 Versionen ab 6.4.0.&nbsp;</p><p>Um die&nbsp;Programmerweiterung zu konfigurieren, müssen Sie die&nbsp;Programmerweiterung unter Erweiterungen &gt; Meine Erweiterungen &gt; Apps öffnen.</p><h3>Schritte:</h3><ol><li>Laden Sie die&nbsp;Programmerweiterung hoch</li><li>Installieren</li><li>Aktivieren</li><li>Öffnen Sie die Programmerweiterung-Einstellungen</li><li>Aktivieren Sie die&nbsp;Programmerweiterung für einen Verkaufskanäle, den Sie möchten</li><li>Ändern Sie andere Stile, um die&nbsp;Programmerweiterung an Design Ihres Shops anzupassen<br></li></ol><h3>Konfigurationen Beschreibung</h3><p>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Aktivieren Sie die Programmerweiterung&nbsp;für diesen&nbsp;</i>Verkaufskanäle- Soll die&nbsp;Programmerweiterung in diesem Verkaufskanäle aktiv sein?&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;•&nbsp;<i>Zeigen Sie für angemeldete Benutzer</i>&nbsp;- Soll die&nbsp;Programmerweiterung nur für angemeldete Benutzer aktiv sein?<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;•&nbsp;<i>Fortschrittsbalken auf den Knopf \"Warenkorb\" anzeigen</i>&nbsp;- Ein Popup-Fenster mit dem Ladeprogramm und mit der Nachricht wird von dem Knopf \"Warenkorb\" entweder beim Schweben oder bei jeder Seitenumleitung / Aktualisierung geöffnet<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Lastwagen-Symbol Farbe im Korb</i>&nbsp;- Dies ist die Farbe des Lastwagens, der im Navigationskorb angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Lastwagen-Symbol Größe im Korb</i>&nbsp;- Dies ist die Größe des Lastwagens, der im Navigationskorb angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Tooltip Hintergrundfarbe der Information im Korb</i>&nbsp;- Dies ist die Hintergrundfarbe des Tooltips, der beim Schweben auf dem Lastwagen-Symbol (im Navigationskorb) erscheint.<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Tooltip Rahmenfarbe der Information im Korb</i>&nbsp;- Dies ist die Rahmenfarbe des Tooltips, der beim Schweben auf dem Lastwagen-Symbol (im Navigationskorb) erscheint.<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Textfarbe des Tooltips im Korb</i>&nbsp;- Dies ist die Textfarbe des Tooltips, der beim Schweben auf dem Lastwagen-Symbol (im Navigationskorb) erscheint.<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Lastwagen-Symbol Farbe im Korb für mobile Geräte:</i>&nbsp;- Dies ist die Farbe des Lastwagens, der im Navigationskorb für Mobilgeräte angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Lastwagen-Symbol Größe im Korb für mobile Geräte (px)</i>&nbsp;- Dies ist die Größe des Lastwagens, der im Navigationskorb für Mobilgeräte angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Tooltip Hintergrundfarbe der Information im Korb für mobile Geräte</i>&nbsp;- Dies ist die Hintergrundfarbe des Tooltips, das beim Klicken auf den Lastwagen-Knopf (auf dem Navigationskorb) für mobile Geräte erscheint<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Tooltip Rahmenfarbe der Information im Korb für mobile Geräte</i>&nbsp;- Dies ist die Rahmenfarbe des Tooltips, das beim Klicken auf den Lastwagen-Knopf (auf dem Navigationskorb) für mobile Geräte erscheint<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Textfarbe des Tooltips im Korb für mobile Geräte</i>&nbsp;- Dies ist die Textfarbe des Tooltips, die beim Klicken auf den Lastwagen-Knopf (auf dem Navigationskorb) für Mobilgeräte erscheint<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Im Einkaufswagenmenü anzeigen</i>&nbsp;- Der Lader mit der Nachricht wird im Einkaufswagenmenü angezeigt<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Lastwagen-Farbe im Einkaufswagenmenü</i>&nbsp;- Dies ist die Farbe des Lastwagens, die im rechten Menü des Einkaufswagens angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Lastwagen-Größe im Einkaufswagenmenü</i>&nbsp;- Dies ist die Größe des Lastwagens, die im rechten Menü des Einkaufswagens angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Hintergrundfarbe der Information im Einkaufswagenmenü</i>&nbsp;- Dies ist die Hintergrundfarbe der Information, die im rechten Menü des Einkaufswagens angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Rahmen und Textfarbe der Information im Einkaufswagenmenü</i>&nbsp;- Dies ist die Farbe des Informationsrahmens, der im rechten Menü des Einkaufswagens angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Informationstext im Einkaufswagenmenü</i>&nbsp;- Dies ist die Farbe des Informationstextes, der im rechten Menü des Einkaufswagens angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Auf der Checkout-Warenkorbseite anzeigen</i>&nbsp;- Der Lader mit der Nachricht wird auf der Warenkorbseite angezeigt<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Auf der Checkout-Bestätigungsseite anzeigen</i>&nbsp;- Der Lader mit der Nachricht wird auf der Checkout-Bestätigungsseite angezeigt<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Auf der Zahlung- und Versandseite anzeigen</i>&nbsp;- Der Lader mit der Nachricht wird auf der Zahlung- und Versandseite angezeigt<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Lastwagen-Symbolfarbe auf der Checkout-Seite</i>&nbsp;- Dies ist die Farbe des Lastwagens, der auf den Checkoutseiten angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Lastwagen-Symbolgröße auf der Checkout-Seite</i>&nbsp;- Dies ist die Größe des Lastwagens, der auf den Checkout-Seiten angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Hintergrundfarbe der Lastwagen-Symbolfarbe auf der Checkout-Seite</i>&nbsp;- Dies ist die Hintergrundfarbe der Information, die auf den Checkout-Seiten angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Rahmenfarbe der Information auf der Checkout-Seite</i>&nbsp;- Dies ist die Rahmenfarbe der Information, die auf den Checkout-Seiten angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Farbe des Informationstextes auf der Checkout-Seite</i>&nbsp;- Dies ist die Farbe des Informationstextes, der auf den Checkout-Seiten angezeigt wird<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Die Hintergrundfarbe des Informationstextes auf der Checkout-Seite</i>&nbsp;- Dies ist die Hintergrundfarbe des Informationstextes, der auf den Checkout-Seiten angezeigt wird<br></p><b>HINWEIS:</b>&nbsp;Alle vorgenommenen Änderungen können im Frontend angezeigt werden, nachdem das Thema aus dem Caches-Management-Panel neu kompiliert wird.<p><b>Die&nbsp;Programmerweiterung</b><b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\">&nbsp;unterstützt derzeit Versandmethoden, die auf der Grundlage der Preismatrix der Eigenschaft Warenkorb konfiguriert werden.</b></p>","shortDescription":"\"Erreichen kostenlosen Versand\" Programmerweiterung ist der beste Weg,Kunden anzuziehen, mehr Produkte zu kaufen. Es ist der beste Weg, um den Kunden anzuziehen, mehr Produkte zu kaufen","highlights":"","features":""},{"id":16395,"name":"Achieve Free Shipping","description":"<p>The best way to attract Customers to buy more products.</p><p>\"Achieve Free Shipping\" extension&nbsp;is here to help your customers to organize their orders by having the free shipping opportunity as a goal. You may have a question how it could be done? Here is a simple solution. This extension&nbsp;shows how much amount is left in the basket till user achieves the free shipping. The extension&nbsp;is the best way to attract Customers to buy more products, so the sales of the shop will grow. When the user adds an item to the basket, the remaining cost, that is required for free shipping of the order, is being calculated. Remaining cost is calculated based on the \"Shipping Free from\" parameter value (Configurations --&gt; Shipping costs --&gt; Shipping method). On the website this is displayed with a loader and a short message. With the help of configurations, the Shop Manager can choose on which pages the loader with message should be shown, the following variants are available: Basket, Checkout Cart page, Checkout Confirm page, Payment and Dispatch page. In addition, there is a pop-up with the loader which opens from the \"Shopping Cart\" button either on hover or any page redirection/refresh. The small ''truck'' icon stays on the button after pop-up closes. Under mobile devices, the pop-up is replaced with a \"truck\" button next to the basket. The Shop Manager can also set a default delivery method, according to which free delivery remaining cost will be counted until the user chooses a proper method. In case if a new shipping method is added in the shop, it will automatically appear in the extension&nbsp;configurations. In case if there is at least one free shipping item in the basket, the loader with the message will not be shown, as the shipping will already be free. It will not be shown also when the sum of products cost in the Basket have crossed the free shipping border. according to which free delivery cost will be displayed until the user chooses any method. There is also an opportunity to change colors of the icon, text etc. for different pages. So the extension&nbsp;will perfectly match with your shop design.</p><p><br></p><p><b>Benefits</b></p><p>The Customers will be attracted to buy more products</p><p>The creative design will get Customers' attention</p><p>The extension&nbsp;is available for mobile devices as well</p><p>The shop manager himself chooses the pages on which the loader with the message should appear</p><p>The message is a snippet, so any text can be added</p><p>A new shipping cost automatically appears in the configs</p><p>The pop up disappears as soon as limit is reached, so it will not bother customers</p><p><b><br></b></p><p><b>Support</b></p><p>For technical support, please send an email to info@naghashyan.com</p><p><br></p><p>About Naghashyan Solutions</p><p>Website: naghashyan.com</p><p>Tel: +374 77 77 79 42</p><p>Email: info@naghashyan.com</p><p>Address: Arabkir 49str, 22bld, Armenia, Yerevan 0037</p>","installationManual":"<p>The installation of extension&nbsp;takes some seconds by one click. The extension&nbsp;will set up its default configurations as soon as the installation is done. You will be able to change the configurations anytime you want. The extension&nbsp;supports Shopware 6 versions started from 6.4.0. &nbsp;<br>To configure the extension&nbsp;you need to open the extension&nbsp;from extensions &gt; my extensions &gt; apps.</p><h3>Steps:</h3><ol><li>Upload the extension&nbsp;</li><li>Install</li><li>Activate</li><li>Open the extension&nbsp;configs</li><li>Make the extension&nbsp;active for sales channel you would like</li><li>Change other styles to match the extension&nbsp;with your shop design<br></li></ol><h3>Configurations Description</h3><p>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Activate plugin for this sales channel&nbsp;</i>- Should the extension&nbsp;be active on this&nbsp;<i>sales channel</i>?&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;•&nbsp;<i>Show for logged in user</i>&nbsp;-&nbsp;Should the extension&nbsp;be active only for logged in user?&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;•&nbsp;<i>Display progress bar on Basket button</i>&nbsp;- A pop-up with the loader and message will open from the \"Shopping Cart\" button either on hover&nbsp; or any page redirection/refresh<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Truck Icon Color</i>&nbsp;- This is the color of truck which is displayed on navigation basket<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Truck Icon Size (px)</i>&nbsp;- This is the size of truck which is displayed on navigation basket<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Info tool-tip Background Color</i>&nbsp;- This is the background color of tool-tip which appears on hover on the truck icon (on navigation basket)<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Info tool-tip Border Color</i>&nbsp;- This is the border color of tool-tip which appears on hover on the truck icon (on navigation basket)<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Info tool-tip Text Color</i>&nbsp;- This is the text color of tool-tip which appears on hover on the truck icon (on navigation basket)<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Truck Icon Color for Mobile Devices</i>&nbsp;- This is the color of truck which is displayed on navigation basket for Mobile devices<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Truck Icon Size for Mobile Devices (px)</i>&nbsp;- This is the size of truck which is displayed on navigation basket for Mobile devices<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Info tool-tip Background Color for Mobile Devices</i>&nbsp;- This is the background color of tool-tip which appears on click on the truck button (on navigation basket) for Mobile devices<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Info tool-tip Border Color for Mobile Devices</i>&nbsp;- This is the border color of tool-tip which appears on click on the truck button (on navigation basket) for Mobile devices<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Basket Info tool-tip Text Color for Mobile Devices</i>&nbsp;- This is the text color of tool-tip which appears on click on the truck button (on navigation basket) for Mobile devices<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Display in Shopping Cart menu</i>&nbsp;- The loader with message will be shown in the Shopping Cart menu<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Shopping Cart menu Truck Color</i>&nbsp;- This is the color of truck which is displayed on right menu of the shopping cart<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Shopping Cart menu Truck Size (px)</i>&nbsp;- This is the size of truck which is displayed on right menu of the shopping cart<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Shopping Cart menu Info Background Color</i>&nbsp;- This is the background color of info which is displayed on right menu of the shopping cart<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Shopping Cart menu Info Border Color</i>&nbsp;- This is the color of info border which is displayed on right menu of the shopping cart<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Shopping Cart menu Info Text</i>&nbsp;- This is the color of info text which is displayed on right menu of the shopping cart<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Display on Checkout Cart page</i>&nbsp;- The loader with message will be shown on Checkout Cart page<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Display on Checkout Confirm page</i>&nbsp;- The loader with message will be shown on Checkout Confirm paget<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Display on Payment and Dispatch page</i>&nbsp;- The loader with message will be shown on Payment and Dispatch page<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Checkout Page Truck Icon Color</i>&nbsp;- This is the color of truck which is displayed on Checkout pages<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Checkout Page Truck Icon Size (px)</i>&nbsp;- This is the size of truck which is displayed on Checkout pages<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Checkout Page Truck Background Color</i>&nbsp;- This is the background color of truck which is displayed on Checkout pages<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Checkout Page Info Border Color</i>&nbsp;- This is the color of info border which is displayed on on Checkout pages<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Checkout Page Info Text Color</i>&nbsp;- This is the color of info text which is displayed on Checkout pages<br>&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;•&nbsp;<i>Checkout Page Info Text Background Color&nbsp;</i>- This is the background color of info text which is displayed on Checkout pages<br></p><p><br></p><b>NOTE:</b>&nbsp;Any changes that are made may appear on frontend after the theme will be recompiled from the caches management panel.<p><b>The extension currently supports shipping methods which are configured based on Cart price property price matrix.</b></p>","shortDescription":"\"Achieve Free Shipping\" extension is here to help your customers to organize their orders by having the free shipping opportunity as a goal. The best way to attract he checkout.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163840,"bookingKey":"ngs5893843108318","bookingText":"Achieve Free Shipping","price":24.99,"subscription":false,"discount":0,"discr":"priceModelBuy"},{"id":163839,"bookingKey":"ngs5893843108318_T","bookingText":"Achieve Free Shipping","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiwUzNJ","preview":true,"priority":6,"id":70581},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaq2M4K","preview":false,"priority":5,"id":70578},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppxiA8E","preview":false,"priority":4,"id":70575},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9BpHfP","preview":false,"priority":3,"id":70577},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7XmSQE","preview":false,"priority":2,"id":70576},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaMjQID","preview":false,"priority":1,"id":70579}],"comments":[],"ratingAverage":0,"label":"Erreichen kostenlosen Versand","description":"<h3>Der beste Weg, Kunden anzuziehen, mehr Produkte zu kaufen.</h3><p>\"Erreichen kostenlosen Versand\" -Programmerweiterung ist hier, um Ihren Kunden zu helfen, ihre Bestellungen zu organisieren, indem sie die kostenlose Versandmöglichkeit als Ziel haben. Sie haben vielleicht eine Frage, wie es gemacht werden könnte? Hier ist eine einfache Lösung. Diese Programmerweiterung zeigt, wie viel Summe im Warenkorb übrig ist, bis der Nutzer den kostenlosen Versand erreicht. Die Programmerweiterung ist der beste Weg, um den Kunden anzuziehen, mehr Produkte zu kaufen, so werden die Verkäufe des Shopes wachsen. Wenn der Benutzer einen Artikel zum Warenkorb hinzufügt, die verbleibenden Kosten, die für den kostenlosen Versand der Bestellung erforderlich sind, werden berechnet. Die Restkosten werden auf Basis des Parameters \"Versand frei von\" (Konfigurationen -&gt; Versandkosten -&gt; Versandmethode) berechnet. Auf der Website wird es mit einem Lader und einer kurzen Nachricht angezeigt. Mit der Hilfe der Konfigurationen kann Shop-Manager auswählen, auf welchen Seiten der Lader mit der Nachricht angezeigt werden soll, folgende Varianten sind verfügbar: Warenkorb, Checkout Cart Seite, Checkout Bestätigen Seite, Zahlung und Versand Seite. Darüber hinaus gibt es ein Popup-Fenster mit dem Lader, das von dem Knopf \"Warenkorb\" entweder beim Schweben oder bei jeder Seitenumleitung / Aktualisierung geöffnet wird. Das kleine \"Lastwagen\" -Symbol bleibt auf den Knopf, nachdem das Pop-up geschlossen wurde. Unter mobilen Geräten wird das Pop-up durch einen \"Lastwagen\" -Knopf neben dem Warenkorb ersetzt. Der Shop-Manager kann auch eine Standardlieferungsmethode festlegen, nach dem wird die kostenlose Lieferung verbleibenden Kosten gezählt, bis der Benutzer eine geeignete Methode wählt. Im Fall, wenn eine neue Versandmethode im Shop hinzugefügt wird, wird es automatisch in den Programmerweiterungn-Konfigurationen angezeigt. Im Fall, wenn es mindestens ein kostenloser Versandartikel im Warenkorb gibt, wird der Lader mit der Nachricht nicht angezeigt, da der Versand schon frei sein wird. Es wird auch nicht angezeigt, wenn die Summe der Produktkosten im Warenkorb die freie Versandgrenze überschritten hat, nach dem freie Versandkosten angezeigt werden, bis der Benutzer eine beliebige Methode wählt. Es gibt auch die Möglichkeit, Größe und Farbe des Symbols, des Textes usw. für verschiedene Seiten zu ändern. So wird die Programmerweiterung perfekt mit Ihrem Shop-Design passen.</p><h3>Vorteile</h3><ul><li>Die Kunden werden angezogen, um mehr Produkte zu kaufen</li><li>Das kreative Design wird die Aufmerksamkeit der Kunden auf sich ziehen</li><li>Die Programmerweiterung ist auch für mobile Geräte verfügbar</li><li>Der Shop-Manager selbst wählt die Seiten, auf denen der Lader mit der Nachricht erscheinen soll</li><li>Die Nachricht ist ein Snippet, so kann jeder Text hinzugefügt werden</li><li>Eine neue Versandkosten erscheint automatisch in den Konfigurationen</li><li>Das Pop-up verschwindet, sobald das Limit erreicht ist, so dass es die Kunden nicht stören wird</li></ul><h3>Unterstützung</h3>Für technische Unterstützung senden Sie bitte eine E-Mail an info@naghashyan.com<br /><br /><h3>Über Naghashyan Solutions</h3><b>Website:</b> naghashyan.com<br /><b>Tel:</b> +374 77 77 79 42<br /><b>Email:</b> info@naghashyan.com<br /><b>Adresse:</b> Arabkir 49str, 22bld, Armenia, Yerevan 0037","installationManual":"<p>Die Installation der Programmerweiterung dauert einige Sekunden mit einem Klick. Die Programmerweiterung wird seine Standardkonfigurationen einrichten, sobald die Installation abgeschlossen ist. Sie können die Konfigurationen jederzeit ändern, wann Sie wollen. Die Programmerweiterung unterstützt Shopware 6 Versionen ab 6.4.0. </p><p>Um die Programmerweiterung zu konfigurieren, müssen Sie die Programmerweiterung unter Erweiterungen &gt; Meine Erweiterungen &gt; Apps öffnen.</p><h3>Schritte:</h3><ol><li>Laden Sie die Programmerweiterung hoch</li><li>Installieren</li><li>Aktivieren</li><li>Öffnen Sie die Programmerweiterung-Einstellungen</li><li>Aktivieren Sie die Programmerweiterung für einen Verkaufskanäle, den Sie möchten</li><li>Ändern Sie andere Stile, um die Programmerweiterung an Design Ihres Shops anzupassen<br /></li></ol><h3>Konfigurationen Beschreibung</h3><p>         • <i>Aktivieren Sie die Programmerweiterung für diesen </i>Verkaufskanäle- Soll die Programmerweiterung in diesem Verkaufskanäle aktiv sein? <br />         • <i>Zeigen Sie für angemeldete Benutzer</i> - Soll die Programmerweiterung nur für angemeldete Benutzer aktiv sein?<br />         • <i>Fortschrittsbalken auf den Knopf \"Warenkorb\" anzeigen</i> - Ein Popup-Fenster mit dem Ladeprogramm und mit der Nachricht wird von dem Knopf \"Warenkorb\" entweder beim Schweben oder bei jeder Seitenumleitung / Aktualisierung geöffnet<br />         • <i>Lastwagen-Symbol Farbe im Korb</i> - Dies ist die Farbe des Lastwagens, der im Navigationskorb angezeigt wird<br />         • <i>Lastwagen-Symbol Größe im Korb</i> - Dies ist die Größe des Lastwagens, der im Navigationskorb angezeigt wird<br />         • <i>Tooltip Hintergrundfarbe der Information im Korb</i> - Dies ist die Hintergrundfarbe des Tooltips, der beim Schweben auf dem Lastwagen-Symbol (im Navigationskorb) erscheint.<br />         • <i>Tooltip Rahmenfarbe der Information im Korb</i> - Dies ist die Rahmenfarbe des Tooltips, der beim Schweben auf dem Lastwagen-Symbol (im Navigationskorb) erscheint.<br />         • <i>Die Textfarbe des Tooltips im Korb</i> - Dies ist die Textfarbe des Tooltips, der beim Schweben auf dem Lastwagen-Symbol (im Navigationskorb) erscheint.<br />         • <i>Lastwagen-Symbol Farbe im Korb für mobile Geräte:</i> - Dies ist die Farbe des Lastwagens, der im Navigationskorb für Mobilgeräte angezeigt wird<br />         • <i>Lastwagen-Symbol Größe im Korb für mobile Geräte (px)</i> - Dies ist die Größe des Lastwagens, der im Navigationskorb für Mobilgeräte angezeigt wird<br />         • <i>Tooltip Hintergrundfarbe der Information im Korb für mobile Geräte</i> - Dies ist die Hintergrundfarbe des Tooltips, das beim Klicken auf den Lastwagen-Knopf (auf dem Navigationskorb) für mobile Geräte erscheint<br />         • <i>Tooltip Rahmenfarbe der Information im Korb für mobile Geräte</i> - Dies ist die Rahmenfarbe des Tooltips, das beim Klicken auf den Lastwagen-Knopf (auf dem Navigationskorb) für mobile Geräte erscheint<br />         • <i>Die Textfarbe des Tooltips im Korb für mobile Geräte</i> - Dies ist die Textfarbe des Tooltips, die beim Klicken auf den Lastwagen-Knopf (auf dem Navigationskorb) für Mobilgeräte erscheint<br />         • <i>Im Einkaufswagenmenü anzeigen</i> - Der Lader mit der Nachricht wird im Einkaufswagenmenü angezeigt<br />         • <i>Lastwagen-Farbe im Einkaufswagenmenü</i> - Dies ist die Farbe des Lastwagens, die im rechten Menü des Einkaufswagens angezeigt wird<br />         • <i>Lastwagen-Größe im Einkaufswagenmenü</i> - Dies ist die Größe des Lastwagens, die im rechten Menü des Einkaufswagens angezeigt wird<br />         • <i>Hintergrundfarbe der Information im Einkaufswagenmenü</i> - Dies ist die Hintergrundfarbe der Information, die im rechten Menü des Einkaufswagens angezeigt wird<br />         • <i>Rahmen und Textfarbe der Information im Einkaufswagenmenü</i> - Dies ist die Farbe des Informationsrahmens, der im rechten Menü des Einkaufswagens angezeigt wird<br />         • <i>Informationstext im Einkaufswagenmenü</i> - Dies ist die Farbe des Informationstextes, der im rechten Menü des Einkaufswagens angezeigt wird<br />         • <i>Auf der Checkout-Warenkorbseite anzeigen</i> - Der Lader mit der Nachricht wird auf der Warenkorbseite angezeigt<br />         • <i>Auf der Checkout-Bestätigungsseite anzeigen</i> - Der Lader mit der Nachricht wird auf der Checkout-Bestätigungsseite angezeigt<br />         • <i>Auf der Zahlung- und Versandseite anzeigen</i> - Der Lader mit der Nachricht wird auf der Zahlung- und Versandseite angezeigt<br />         • <i>Die Lastwagen-Symbolfarbe auf der Checkout-Seite</i> - Dies ist die Farbe des Lastwagens, der auf den Checkoutseiten angezeigt wird<br />         • <i>Die Lastwagen-Symbolgröße auf der Checkout-Seite</i> - Dies ist die Größe des Lastwagens, der auf den Checkout-Seiten angezeigt wird<br />         • <i>Die Hintergrundfarbe der Lastwagen-Symbolfarbe auf der Checkout-Seite</i> - Dies ist die Hintergrundfarbe der Information, die auf den Checkout-Seiten angezeigt wird<br />         • <i>Die Rahmenfarbe der Information auf der Checkout-Seite</i> - Dies ist die Rahmenfarbe der Information, die auf den Checkout-Seiten angezeigt wird<br />         • <i>Die Farbe des Informationstextes auf der Checkout-Seite</i> - Dies ist die Farbe des Informationstextes, der auf den Checkout-Seiten angezeigt wird<br />         • <i>Die Hintergrundfarbe des Informationstextes auf der Checkout-Seite</i> - Dies ist die Hintergrundfarbe des Informationstextes, der auf den Checkout-Seiten angezeigt wird<br /></p><b>HINWEIS:</b> Alle vorgenommenen Änderungen können im Frontend angezeigt werden, nachdem das Thema aus dem Caches-Management-Panel neu kompiliert wird.<p><b>Die Programmerweiterung</b><b> unterstützt derzeit Versandmethoden, die auf der Grundlage der Preismatrix der Eigenschaft Warenkorb konfiguriert werden.</b></p>","version":"1.1.0","changelog":[{"version":"1.1.0","text":"<p>Shopware 6.5 version support</p>","creationDate":{"date":"2023-06-30 14:19:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First Production Release</p>","creationDate":{"date":"2021-08-09 20:44:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=ngs5893843108318","redirectToStore":false,"lowestPriceValue":24.99}