{"id":10469,"name":"NgsNotificationBarSW6","code":"ngs4342935765852","lastChange":{"date":"2023-07-18 11:16:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7ExA1J","examplePageUrl":"","moduleKey":"NgsNotificationBarSW6","creationDate":{"date":"2019-12-24 21:54:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-07-08 21:07:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-06-18 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-07-01 21:09:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":902,"prefix":"ngs","name":"Naghashyan Solutions","website":"//naghashyan.com","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod902_sw_128.jpg"},"infos":[{"id":16398,"name":"Notification Bar","description":"<h3>Ermöglicht die Schaffung der Kommunikation zwischen dem Benutzer und Shop-Management durch die Freigabe wichtiger Nachrichten in der Benachrichtigungsleiste.</h3><p>Die Programmerweiterung&nbsp;\"Benachrichtigungsleiste\" ermöglicht die Schaffung der Kommunikation zwischen dem Benutzer und Shop-Management durch die Freigabe wichtiger Nachrichten in der Benachrichtigungsleiste, die in der&nbsp; Kopf- oder Fußzeile der Website angezeigt wird. Mit der \"Benachrichtigungsleiste\" kann der Shop-Manager die Benutzer über Ausfallzeiten, Verkäufe, Wettbewerbe usw. informieren. Die&nbsp;Programmerweiterung erlaubt es den Hintergrund,&nbsp; das Design des Knopfs \"schließen\" (x), Textfarbe, Größe der Benachrichtigungsleiste zu konfigurieren. Alle diese Konfigurationen helfen Ihnen,die Nachrichtenbox an das Erscheinungsbild Ihrer Website anzupassen.&nbsp; Jeder Subshop hat seine eigene Registerkarte in Konfigurationen. Es ermöglicht die Anzeige spezifischer Benachrichtigungen pro Subshop. Mit dem speziellen \"Cookie-Lebensdauer \" -Feld kann der Shop-Manager sogar&nbsp; festlegen, wann die Benachrichtigung nochmal angezeigt werden soll, nachdem der Benutzer sie geschlossen hat.</p><h3>Vorteile</h3><ul><li>Der Shop-Manager kann leicht jede Nachricht hinzugefügt durch das Shop-Backend teilen</li><li>Der Shop-Manager kann das Design der Benachrichtigungsleiste problemlos anpassen</li><li>Jeder Subshop kann verschiedene Texte und Stile haben</li></ul><h3>Unterstützung</h3>Für technische Unterstützung senden Sie bitte eine E-Mail an info@naghashyan.com&nbsp;<br><br><h3>Über Naghashyan Solutions</h3><b>Website:</b>&nbsp;naghashyan.com&nbsp;<br><b>Tel:</b>&nbsp;+374 77 77 79 42&nbsp;<br><b>Email:</b>&nbsp;info@naghashyan.com&nbsp;<br><b>Adresse:</b>&nbsp;Arabkir 49str, 22bld,&nbsp;Armenia, Yerevan 0037","installationManual":"<p><strong>Installationsanleitung</strong></p><p>Die Installation der&nbsp;Programmerweiterung dauert einige Sekunden mit einem Klick. Die Programmerweiterung wird seine Standardkonfigurationen einrichten, sobald die Installation abgeschlossen ist. Sie können die Konfigurationen jederzeit ändern, wann Sie wollen. Die&nbsp;Programmerweiterung unterstützt Shopware 6 Versionen angefangen von 6.2.2</p><p>Um die&nbsp;Programmerweiterung zu konfigurieren, müssen Sie die&nbsp;Programmerweiterung aus den Konfigurationen&gt; Programmerweiterung&gt; installiert öffnen.</p><h3><strong>Schritte:</strong></h3><ol><li>Laden Sie die Programmerweiterung hoch</li><li>Installieren</li><li>Aktivieren</li><li>Öffnen Sie die Programmerweiterung-Einstellungen</li><li>Aktivieren Sie die Programmerweiterung für einen Subshop, den Sie möchten</li><li>Ändern Sie die Stile, um die&nbsp; Programmerweiterung mit Ihrem Shop- Design entsprechend zu machen</li><li>Shop-Cache löschen</li></ol><h3><strong>Konfigurationen Beschreibung:</strong></h3><ul><li><em>Benachrichtigungsleiste aktiv</em>&nbsp;- Es gibt 3 mögliche Varianten: vererbt, ja, nein. Wenn Sie vererbt auswählen, bedeutet das, dass andere Subshops die Konfiguration (aktiv oder nicht) übernehmen, die Sie hier vorgenommen haben.</li><li>Die Position der Benachrichtigungsleiste - Es gibt 2 mögliche Varianten: oben, unten</li><li>Cookie Lebensdauer in Minuten - Der Zeitraum, in dem die Benachrichtigungsleiste nochmal angezeigt werden soll, nachdem der Benutzer auf den Knopf \"x\" geklickt hat</li><li><em>Schließen Sie die Symbolfarbe</em>&nbsp;- Dieses Feld erlaubt es die Symbolfarbe für “Schließen” (x) zu definieren<br><br>&nbsp; &nbsp; &nbsp; • Hintergrundfarbe - Diese Feld erlaubt es die Hintergrundfarbe der Benachrichtigungsleiste zu definieren<br><br>&nbsp; &nbsp; &nbsp; • Rahmenfarbe - Diese Feld erlaubt es die Rahmenfarbe der Benachrichtigungsleiste zu definieren</li><li><em>Text</em>&nbsp;- Das Textfeld von Benachrichtigungen ist wysiwyg, was bedeutet, dass Sie den Text in einem anderen Stil konfigurieren können, sogar mit HTML</li><li><em>Textausrichtung</em>&nbsp;- Es gibt 3 mögliche Varianten: links, zentriert, rechts</li></ul><p>HINWEIS: Alle vorgenommenen Änderungen können im Frontend angezeigt werden, nachdem das Thema aus dem Caches-Management-Panel neu kompiliert wird.</p>","shortDescription":"Erweiterung \"Benachrichtigungsleiste\" ermöglicht die Schaffung der Kommunikation zwischen dem Benutzer und Shop-Management durch  Freigabe wichtiger Nachrichten in der Benachrichtigung","highlights":"","features":""},{"id":16399,"name":"Notification Bar","description":"<h3>Establish communication between the user and the shop management by sharing important messages within notification bar.</h3><p>The \"Notification Bar\" extension allows to establish communication between the user and the shop management by sharing important messages within notification bar, that appears in the header or footer of the web site.&nbsp; Using the \"Notification Bar\", shop manager can inform users about down times, sales, contests, etc.&nbsp; &nbsp;The extension allows to configure the background, \"close\" (x) button styling, text color,&nbsp; size of the notification bar. All these configurations will help you easily adapt the message box to your site look and feel. Every Subshop has its own tab in Configurations.&nbsp; This makes possible to display specific notification per Subshop. Using the special \"Cookie Lifetime\" field, shop manager can even set time when the Notification should appear again after the user closes it.&nbsp; &nbsp; &nbsp;</p><h3>Benefits</h3><ul><li>Shop manager can easily share any message adding it through the shop backend</li><li>Shop manager can easily adjust the Notification Bar design</li><li>Every subshop can have different texts and styles</li></ul><h3>Support</h3>For technical support, please send an email to info@naghashyan.com&nbsp;<br><br><h3>About Naghashyan Solutions</h3><b>Website:</b>&nbsp;naghashyan.com&nbsp;<br><b>Tel:</b>&nbsp;+374 77 77 79 42&nbsp;<br><b>Email:</b>&nbsp;info@naghashyan.com&nbsp;<br><b>Address:</b>&nbsp; Arabkir 49str, 22bld,&nbsp;Armenia, Yerevan 0037","installationManual":"<h2><strong>Installation manual</strong></h2><h2></h2><p>Installation of the extension takes only few seconds by one click, after which it will automatically set up its default configurations as soon as the installation will be done. You will be able to change the configurations anytime you want. The extension supports Shopware 6 versions started from 6.2.2</p><p>To configure the extension&nbsp;you need to open the extension&nbsp;from Extensions &gt; My Extensions.</p><h3><strong>Steps:</strong></h3><h2></h2><ol><li>Upload the extension</li><li>Install</li><li>Activate</li><li>Open the extension&nbsp;configs</li><li>Activate extension&nbsp;for particular subshop</li><li>Change styles to match the extension&nbsp;with your shop design</li><li>Clear shop cache</li></ol><h3><strong>Configurations Description:</strong></h3><h2></h2><ul><li><em>Notification Bar Active</em>&nbsp;- There are 3 possible variants: inherited, yes, no. If you select inherited, it will mean that other subshops, will inherit the configuration (active or not) you made here.</li><li>Notification Bar Position - There are 2 possible variants: top, bottom</li><li>Cookie Lifetime in Minutes - The period of time when the Notification Bar should appear again after user clicks on \"x\" button</li><li><em>Close Icon Color</em>&nbsp;- This field allows defining color of the close (x) icon</li><li>Background Color - This field allows defining background color of the Notification Bar</li><li>Border Color - This field allows defining border color of the Notification Bar</li><li><em>Text</em>&nbsp;- The Notification text field is wysiwyg, which means you can configure the text in different style, even using HTML</li><li><em>Text Alignment</em>&nbsp;- There are 3 possible variants: left, center, right</li></ul><p>NOTE: Any changes that are made may appear on frontend after the theme will be recompiled from the caches management panel.</p>","shortDescription":"The \"Notification Bar\" extension allows to establish communication between the user and the shop management by sharing important messages within notification bar.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160461,"bookingKey":"ngs4342935765852","bookingText":"Notification Bar","price":14.99,"subscription":false,"discount":0,"discr":"priceModelBuy"},{"id":160460,"bookingKey":"ngs4342935765852_T","bookingText":"Notification Bar","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpy2uQAm","preview":true,"priority":0,"id":46264},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6r22sV","preview":false,"priority":2,"id":46265},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvAIio2","preview":false,"priority":1,"id":46266}],"comments":[],"ratingAverage":0,"label":"Notification Bar","description":"<h3>Ermöglicht die Schaffung der Kommunikation zwischen dem Benutzer und Shop-Management durch die Freigabe wichtiger Nachrichten in der Benachrichtigungsleiste.</h3><p>Die Programmerweiterung \"Benachrichtigungsleiste\" ermöglicht die Schaffung der Kommunikation zwischen dem Benutzer und Shop-Management durch die Freigabe wichtiger Nachrichten in der Benachrichtigungsleiste, die in der  Kopf- oder Fußzeile der Website angezeigt wird. Mit der \"Benachrichtigungsleiste\" kann der Shop-Manager die Benutzer über Ausfallzeiten, Verkäufe, Wettbewerbe usw. informieren. Die Programmerweiterung erlaubt es den Hintergrund,  das Design des Knopfs \"schließen\" (x), Textfarbe, Größe der Benachrichtigungsleiste zu konfigurieren. Alle diese Konfigurationen helfen Ihnen,die Nachrichtenbox an das Erscheinungsbild Ihrer Website anzupassen.  Jeder Subshop hat seine eigene Registerkarte in Konfigurationen. Es ermöglicht die Anzeige spezifischer Benachrichtigungen pro Subshop. Mit dem speziellen \"Cookie-Lebensdauer \" -Feld kann der Shop-Manager sogar  festlegen, wann die Benachrichtigung nochmal angezeigt werden soll, nachdem der Benutzer sie geschlossen hat.</p><h3>Vorteile</h3><ul><li>Der Shop-Manager kann leicht jede Nachricht hinzugefügt durch das Shop-Backend teilen</li><li>Der Shop-Manager kann das Design der Benachrichtigungsleiste problemlos anpassen</li><li>Jeder Subshop kann verschiedene Texte und Stile haben</li></ul><h3>Unterstützung</h3>Für technische Unterstützung senden Sie bitte eine E-Mail an info@naghashyan.com <br /><br /><h3>Über Naghashyan Solutions</h3><b>Website:</b> naghashyan.com <br /><b>Tel:</b> +374 77 77 79 42 <br /><b>Email:</b> info@naghashyan.com <br /><b>Adresse:</b> Arabkir 49str, 22bld, Armenia, Yerevan 0037","installationManual":"<p><strong>Installationsanleitung</strong></p><p>Die Installation der Programmerweiterung dauert einige Sekunden mit einem Klick. Die Programmerweiterung wird seine Standardkonfigurationen einrichten, sobald die Installation abgeschlossen ist. Sie können die Konfigurationen jederzeit ändern, wann Sie wollen. Die Programmerweiterung unterstützt Shopware 6 Versionen angefangen von 6.2.2</p><p>Um die Programmerweiterung zu konfigurieren, müssen Sie die Programmerweiterung aus den Konfigurationen&gt; Programmerweiterung&gt; installiert öffnen.</p><h3><strong>Schritte:</strong></h3><ol><li>Laden Sie die Programmerweiterung hoch</li><li>Installieren</li><li>Aktivieren</li><li>Öffnen Sie die Programmerweiterung-Einstellungen</li><li>Aktivieren Sie die Programmerweiterung für einen Subshop, den Sie möchten</li><li>Ändern Sie die Stile, um die  Programmerweiterung mit Ihrem Shop- Design entsprechend zu machen</li><li>Shop-Cache löschen</li></ol><h3><strong>Konfigurationen Beschreibung:</strong></h3><ul><li><em>Benachrichtigungsleiste aktiv</em> - Es gibt 3 mögliche Varianten: vererbt, ja, nein. Wenn Sie vererbt auswählen, bedeutet das, dass andere Subshops die Konfiguration (aktiv oder nicht) übernehmen, die Sie hier vorgenommen haben.</li><li>Die Position der Benachrichtigungsleiste - Es gibt 2 mögliche Varianten: oben, unten</li><li>Cookie Lebensdauer in Minuten - Der Zeitraum, in dem die Benachrichtigungsleiste nochmal angezeigt werden soll, nachdem der Benutzer auf den Knopf \"x\" geklickt hat</li><li><em>Schließen Sie die Symbolfarbe</em> - Dieses Feld erlaubt es die Symbolfarbe für “Schließen” (x) zu definieren<br /><br />      • Hintergrundfarbe - Diese Feld erlaubt es die Hintergrundfarbe der Benachrichtigungsleiste zu definieren<br /><br />      • Rahmenfarbe - Diese Feld erlaubt es die Rahmenfarbe der Benachrichtigungsleiste zu definieren</li><li><em>Text</em> - Das Textfeld von Benachrichtigungen ist wysiwyg, was bedeutet, dass Sie den Text in einem anderen Stil konfigurieren können, sogar mit HTML</li><li><em>Textausrichtung</em> - Es gibt 3 mögliche Varianten: links, zentriert, rechts</li></ul><p>HINWEIS: Alle vorgenommenen Änderungen können im Frontend angezeigt werden, nachdem das Thema aus dem Caches-Management-Panel neu kompiliert wird.</p>","version":"1.1.0","changelog":[{"version":"1.1.0","text":"<p>Shopware 6.5 version support</p>","creationDate":{"date":"2023-06-30 14:29:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Inheritance option support for notification bar text configuration field</p>","creationDate":{"date":"2023-05-31 21:08:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>The Initial Release.</p>","creationDate":{"date":"2020-07-01 21:13:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=ngs4342935765852","redirectToStore":false,"lowestPriceValue":14.99}