{"id":10489,"name":"GirosGiroCheckout6","code":"giros10007224588","lastChange":{"date":"2023-07-19 22:58:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8en14v","examplePageUrl":"","moduleKey":"GirosGiroCheckout6","creationDate":{"date":"2019-12-27 13:56:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-02-04 15:07:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-02-02 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-11-13 16:10:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":351,"prefix":"giros","name":"S-Public Services GmbH","website":"//www.s-publicservices.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod351_S-PS_RT_small.png"},"infos":[{"id":16430,"name":"GiroCheckout Payment","description":"Für jeden, der eine beliebige Art von Online-Shop betreibt, ist die Bezahlung ein lebenswichtiger Faktor, der\nim Shop umgesetzt werden muss. Um seinem Shop Zahlungsoptionen hinzufügen zu können, braucht der Händler einen Payment Service Provider\n\n(PSP), der die notwendigen Verträge mit den Zahlungsanbietern (Akquirern) und die Zahlungsplugins für den Shop zur Verfügung stellt. <a href=\"https://www.girosolution.de/\">GiroSolution GmbH</a> ist ein solcher PSP in Deutschland, der zu diesem Zweck die Zahlungsplattform GiroCheckout betreibt. <br /><br /><h2>Zugang und Preise</h2><p>\nUm dieses Modul nutzen zu können, ist ein separater Vertrag mit GiroSolution sowie ein Zugang zum GiroCockpit notwendig. Dieser Zugang\nwird angelegt, indem Kontakt mit GiroSolution aufgenommen wird, also bitte tun Sie dies, bevor Sie das Modul installieren. Das\n\nModul selbst ist kostenlos aber die PSP-Dienstleistung und der Akquirervertrag beinhalten Transaktionskosten und Gebühren.  Besuchen Sie <a href=\"https://www.girosolution.de\" target=\"_blank\" rel=\"noreferrer noopener\">unsere Webseite</a>, um mehr Informationen zu den Gebühren zu erhalten. <br /></p><p><br /></p><h2>Modul-Details</h2>\nGiroCheckout ist eine einfache, schnelle und sichere Komplettlösung für die Integration verschiedener Bezahlverfahren in Ihren Online-Shop (jede Zahlungsart erfordert einen Vertrag). GiroCheckout für Shopware ist ein Zahlungsmodul für Online-Geschäfte in Deutschland und anderen mitteleuropäischen Ländern, das vom deutschen Payment Service Provider Girosolution GmbH angeboten wird.  Es bietet eine einfache, schnelle und sichere Lösung für die Einbindung mehrerer Bezahlverfahren in Ihren Online-Shop.  Bitte denken Sie daran, dass die Anbindung Ihres Shops an Bezahlverfahren immer drei Schritte erfordert:\n\n\n<ol><li>Entscheiden, welche Bezahlverfahren Sie anbieten möchten (s. Liste weiter unten)</li><li>Unterzeichnung von Akteptanzverträgen für jede Zahlungsart mit dem Payment Service Provider und dem Akquirer (bitte\nnehmen Sie hierfür Kontakt mit <a href=\"http://www.girosolution.de/\">Girosolution</a> auf)</li><li>Download, Installation und Konfiguration des entsprechenden Zahlungsplugins für Ihren Shop. Anleitungen finden Sie auf <a href=\"https://www.girosolution.de/e-solutions/tools-support/shop-plug-ins/shopware-plug-in\">unserer Webseite zum Plugin für Shopware</a>.</li></ol><p><br /></p><h2>Weitere Plugin-Features:</h2><ol><li>Erstattung für Kreditkarte, Lastschrift, Maestro und paydirekt direkt im Backend in der Bestellungsverwaltung verfügbar.</li><li>Für Kreditkarte, Lastschrift, Maestro und paydirekt kann der Modus \"Nur reservieren\" anstatt \"Reservieren und Bezahlen\" eingestellt werden.  Dadurch erfolgt bei Bezahlung erst einmal nur eine Reservierung, die dann erst zu einem späteren Zeitpunkt (z.B. beim Versenden der Ware) gebucht wird.</li></ol><p><br /></p><h2>Von GiroCheckout unterstützte Bezahlverfahren:</h2><ul><li>giropay (Garantierte Online-Überweisung für Deutschland) - auch in Kombination mit der Altersverifikation giropay-ID</li><li>eps (Garantierte Online-Überweisungen in Österreich)</li><li>iDEAL (Garantierte Online-Überweisungen in den Niederlanden)</li><li>Lastschriftverfahren mit/ohne Sperrdatei</li><li>Kreditkartenzahlungen (alle Länder)</li><li>Paydirekt (Garantierte Online-Überweisung für Deutschland)</li><li>Sofort-Überweisung (Online-Überweisung für Deutschland)</li><li><p>Maestro</p></li><li><p>Bluecode (Bezahlung mit einer Handy-App)</p></li></ul><p><br /></p>\n\nEinfache Integration, höchste Sicherheitsstandards und ein transparentes Gebührenmodell zeichnen GiroCheckout aus. <br /><br /><p><b>\n\nSupport:\n</b></p><ul><li>E-Mail: <a href=\"mailto:support@girosolution.de\">support@girosolution.de</a></li><li><p>Telefon: +49 7554 97090-00</p></li></ul>","installationManual":"<h2><b>Installation:</b></h2><p><strong>Benötigte Shopware-Version: mindestens 6.2.0<strong></strong></strong></p><br /><h3>Installation über den Community Store (empfohlene Methode)</h3><ol><li>Gehen Sie zu \"Einstellungen - System - Plugins\" und klicken Sie unter \"Shopware Account\" auf \"Anmelden\", wenn Sie nicht bereits dort angemeldet sind.</li><li>Suchen Sie dann nach dem Plugin namens \"GiroCheckout\" und folgen Sie den Anweisungen zur Installation.</li><li>Aktivieren Sie das Plugin.</li><li>Konfigurieren Sie das Plugin wie weiter unten im Bereich \"Konfiguration\" beschrieben.</li></ol><br /><h3>Manuelle installation</h3><ol><li>Laden Sie die Zip-Datei des Plugins hier hoch: \"Einstellungen - System - Plugins - Plugin hochladen\"</li><li>Wählen Sie dann in der Übersicht das neue Plugin aus und wählen im ...-Menü die Option \"Installieren\"</li><li>Aktivieren Sie dann das Plugin in der Spalte \"Status\".</li><li>Konfigurieren Sie das Plugin wie weiter unten im Bereich \"Konfiguration\" beschrieben.</li></ol><br /><h3>Konfiguration</h3><ol><li>Passen Sie die Einstellungen des Plugins an, indem Sie zu \"Einstellungen - System - Plugins\" gehen. Wählen Sie im ...-Menü der Zeile \"GiroCheckout Payment\" die Option \"Konfiguration\" aus. Konfigurieren Sie dann im folgenden Dialog für jede Zahlungsart, die Sie verwenden werden, folgendes:<ol><li>Die Verkäufer-ID ist für alle GiroCheckout-Zahlungsarten gleich. Sie finden sie in Ihrem GiroCockpit auch unter dem Namen \"Kundennummer\". Sie sollten sie auch per E-Mail erhalten haben.</li><li>Die korrekte Information für die Felder \"Projekt-ID\" und \"Projekt-Passwort\" finden Sie ebenfalls in Ihrem GiroCockpit unter <a href=\"https://www.girosolution.de/user\">https://www.girosolution.de/user</a>.  Beachten Sie, dass diese Einstellungen für jede Zahlungsart anders ist.</li><li>Das Feld \"Verwendungszweck\" erscheint je nach Zahlungsart auf dem Kontoauszug des Kunden oder Ihrer Abrechnung zu jeder Transaktion.  Er dient der Zuordnung der Zahlungen und erlaubt den Einsatz von Platzhaltern.  Folgende Platzhalter stehen zur Verfügung:</li></ol></li></ol><ul><li>{ORDERID} oder {TRANSACTIONID}: Bestellnummer. TRANSACTIONID ist ein Synonym (Alias), welches zur Kompatibilität mit älteren Shopware-Versionen beibehalten wurde, wo es keine Bestellnummer gab.</li><li>{CUSTOMERID}:Kundennummer</li><li>{SHOPNAME}: Shop-Name</li><li>{CUSTOMERNAME}: Vollständiger Name des Kunden</li><li>{CUSTOMERFIRSTNAME}: Vorname des Kunden</li><li>{CUSTOMERLASTNAME}: Nachname des Kunden</li><li>Die Voreinstellung ist \"{CUSTOMERID}, {SHOPNAME}\", aber wenn Sie nur einen Online-Shop betreiben, macht evtl. folgende Einstellung mehr Sinn: \"Best. {ORDERID}, {CUSTOMERID}\" oder \"{ORDERID}, {CUSTOMERLASTNAME}\".  Die maximale Länge des resultierenden Verwendungszweckes nach Ersetzen der Platzhalter darf 27 Zeichen nicht überschreiten und wird ggf. abgeschnitten.  Halten Sie ihn also kurz und wundern Sie sich nicht, wenn evtl. Text unvollständig in Ihrer Transaktionsansicht im GiroCockpit erscheint.</li></ul>Bei der Kreditkarte können und sollten Sie auswählen, welche Kartentypen Sie in Ihrem Shop akzeptieren.  Es werden dann entsprechende Logos angezeigt.Bei Lastschrift, Kreditkarte, Paydirekt, Bluecode und Maestro gibt es ferner die Option \"Transaktionsart\". Hier können Sie anstatt der Voreinstellung \"Autorisieren und buchen\" auch erst einmal nur Reservierungen vornehmen lassen (Einstellung \"Nur autorisieren\").  In diesem Fall wird der Bestellungsbetrag zunächst nur reserviert und erst gebucht, wenn im Backend die Buchung explizit ausgelöst wird (Button \"Capture\" in den Bestellungsdetails).Prüfen Sie die eingegebenen Zugangsdaten durch Klick auf den Button \"Test Zugangsdaten\" und speichern Sie dann.Jede Zahlungsart, die Sie von GiroCheckout einsetzen wollen, muss nun noch in Shopware aktiviert werden:<ol><li>Gehen Sie zu \"Einstellungen - Shop - Zahlungsarten\" und aktivieren Sie Ihre Zahlungsarten wir im Folgenden beschrieben</li><li>Wählen Sie im ...-Menü die Option \"Bearbeiten\"</li><li>Schalten Sie die Option \"Aktiv\" ein</li><li>Klicken Sie oben auf \"Speichern\"</li></ol>Nun müssen Sie die gewünschten Zahlungsarten noch Ihrem Verkaufskanal hinzufügen. Wählen Sie dazu im linken Hauptmenü unter \"Verkaufskanäle\" den/die entsprechenden Kanäle aus. In den Grundeinstellungen suchen Sie dann das Feld \"Zahlungsarten\" und fügen Sie hier über den rechten Abwärtspfeil alle GiroCheckout-Zahlungsarten hinzu, die Sie nutzen werden. Speichern Sie dann.","shortDescription":"Zahlungsplugin des deutschen PSPs GiroSolution GmbH, das 9 Zahlungsarten zur Verfügung stellt.  Es erlaubt einfache Integration dieser Zahlungsarten in Ihren Online-Shop.","highlights":"","features":""},{"id":21479,"name":"GiroCheckout Payment","description":"For anyone who runs an online store of any kind, payment is an essential factor that needs to be implemented in\n\n\nthe store. In order to add payment to his store, a merchant needs a payment service provider (PSP) who provides the necessary contracts with acquirers and the required payment plugins for the store. <a href=\"https://www.girosolution.de/\">GiroSolution GmbH</a> is such a PSP in Germany that runs its platform \"GiroCheckout\" to provide these services. <br /><br /><h2>Account &amp; Pricing</h2>In order to use this module, a separate contract with GiroSolution and an account for GiroCockpit is required. This account is created after contacting GiroSolution, so please do this prior to installing the module. The module is\n\n\nprovided free of charge, but there are costs and transaction fees associated to the PSP and the acquiring contract. Please see <a href=\"https://www.girosolution.de\">our website</a> for more information on fees and other details.<br /><h3>Module Details</h3>\n\nGiroCheckout is both an API platform for connecting online stores to payment gateways, and a set of payment modules for German and other Central European online businesses offered by Girosolution GmbH.  It is a simple, fast and secure solution for the integration of several payment methods in your online store.  Please remember that adding payment methods to your shop always requires three steps:\n\n\n<ol><li>Deciding which payment methods you want to offer (see list below)\n</li><li>Signing acceptance contracts with the corresponding payment service provider and acquirer (please contact <a href=\"http://www.girosolution.de/\">GiroSolution</a> for this step)\n</li><li>Downloading, installing and configuring the corresponding payment plugin for your shop.  For instructions, please see <a href=\"https://www.girosolution.de/e-solutions/tools-support/shop-plug-ins/shopware-plug-in/\">our plugin for Shopware page</a>.\n\n\n</li></ol><p><br /></p><p></p><h3>Other plugin features:</h3><ol><li>Refund for creditcard, direct debit, Maestro and paydirekt is possible directly from the backend in the order administration.</li><li>For creditcard, direct debit, Maestro and paydirekt the mode \"Authorize only\" is available instead of the default \"Authorize and Sale\".  In this mode, the payment amount is only reserverd initially and then booked at a later stage (e.g. when shipping the order).</li></ol><p><br /></p><h2>Payment methods currently provided by GiroCheckout:</h2><ul><li>giropay (Guaranteed online credit transfer for Germany) – also in combination with the age verification service giropay-ID\n\n\n</li><li>eps (guaranteed online credit transfer for Austria)\n</li><li>iDEAL (guaranteed online credit transfer for the Netherlands)\n</li><li>Direct debit with/without black list check (for Germany)\n</li><li>Credit card payments (for any country)\n</li><li>Paydirekt (guaranteed online credit transfer for Germany)\n</li><li>Klarna Sofort-Überweisung (Online credit transfer for Germany)\n\n\n</li><li>Maestro</li><li>Bluecode (pay with an app on your mobile phone)</li></ul><p><br /></p><p>A simple integration, highest safety standards and a transparent fee model are characteristics of GiroCheckout.  \n\n</p><p><br /></p><p><b>Support:</b></p><ul><li><p>E-Mail: <a href=\"mailto:support@girosolution.de\">support@girosolution.de</a></p></li><li><p>Phone: +49 7554 97090-00\n</p></li></ul>","installationManual":"<h2><b>Installation:</b></h2><p><strong>Required Shopware Version:  at least 6.2.0<strong></strong></strong></p><br /><h3>Installation via Community Store (recommended way)</h3><ol><li>Go to \"Settings - System - Plugins\" and click on \"Login\" under \"Shopware Account\" if you are not logged in to it yet.</li><li>Search for the plugin named \"GiroCheckout\" and follow the on-screen instructions to install it.</li><li>Enable the plugin.</li><li>Configure the plugin as described in the Configuration section of this documentation.</li></ol><br /><h3>Manual installation</h3><ol><li>Upload the plugin zip file in: \"Settings - System - Plugins - Upload plugin\"</li><li>Select the plugin and choose \"install\" (see the button ...)</li><li>Activate the plugin</li><li>Configure the plugin as described in the Configuration section of this documentation.</li></ol><br /><h3>Configuration</h3><ol><li>Adjust the plugin settings by going to \"Settings - System - Plugins\". Select \"Config\" in the ... menu for \"GiroCheckout Payment\". Configure the following for each GiroCheckout payment method you will use:<ol><li>The merchant ID is the same for all GiroCheckout payment methods. Enter your merchant ID found in GiroCockpit. You should also have received this via email.</li><li>You may find the information required for the fields 'Project ID' and 'Project password' in your GiroCockpit at <a href=\"https://www.girosolution.de/user\">&gt;https://www.girosolution.de/user</a>.  Keep in mind that this setting is different for each payment method.</li><li>The purpose field allows the use of place holders. The following are available:        </li></ol></li></ol><ul><li>{ORDERID} or {TRANSACTIONID}: Order number. TRANSACTIONID is an alias for compatibility with previous Shopware versions where there was no order id.</li><li>{CUSTOMERID}: Customer number</li><li>{SHOPNAME}: Shop name</li><li>{CUSTOMERNAME}: Full customer name</li><li>{CUSTOMERFIRSTNAME}: Customer first name</li><li>{CUSTOMERLASTNAME}: Customer last name</li><li>The default is \"Best. {ORDERID}, {SHOPNAME}\", but if you only have one online shop, a purpose string that contains the customer number may make more sense: \"Order {ORDERID}, {CUSTOMERID}\" or \"{ORDERID}, {CUSTOMERID} {CUSTOMERNAME}\".  The maximum length of the resulting purpose string after replacing the place holders may not exceed 27 characters. So please keep it short and don't be surprised then some text may appear truncated in your bank statement or the GiroCockpit transaction list.</li></ul>For credit card you may and should select the card types you accept in your shop.  This causes the corresponding logos to be displayed in checkout.For direct debit, credit card, Paydirekt, Bluecode and Maestro there is also the option \"Transaction type\"\". Here you may change the default \"Authorize and Sale\" to only make reservations initially by choosing \"Authorize only\". In this case, the order amount will only be reserved when placing the order and is the captured when the corresponding button is clicked in the order details in the backend.Validate the access info using the button \"Validate Access data\" and then save.Each GiroCheckout payment method that you want to use, must now be activated in Shopware:<ol><li>Go to 'Settings - Shop - Payment' and enable each of the corresponding methods as detailed below</li><li>Select the 'Edit' option in the ... menu</li><li>Turn on the \"Active\" selector</li><li>Click \"Save\"</li></ol>Select the store where the payment methods will be used in the \"Sales Channel\" section of the mail menu. Select the channel then, in \"General Settings\" find the \"Payment methods\" box and add all GiroCheckout methods you will use through the down arrow on the right. Then Save.","shortDescription":"Payment plugin offered by the German PSP Girosolution GmbH, which contains 9 payment methods. It allows easy integration of these payment methods into your shops.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161836,"bookingKey":"giros10007224588","bookingText":"","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7vlMCf","preview":true,"priority":0,"id":52034}],"comments":[],"ratingAverage":0,"label":"GiroCheckout Payment","description":"Für jeden, der eine beliebige Art von Online-Shop betreibt, ist die Bezahlung ein lebenswichtiger Faktor, der\nim Shop umgesetzt werden muss. Um seinem Shop Zahlungsoptionen hinzufügen zu können, braucht der Händler einen Payment Service Provider\n\n(PSP), der die notwendigen Verträge mit den Zahlungsanbietern (Akquirern) und die Zahlungsplugins für den Shop zur Verfügung stellt. <a href=\"https://www.girosolution.de/\">GiroSolution GmbH</a> ist ein solcher PSP in Deutschland, der zu diesem Zweck die Zahlungsplattform GiroCheckout betreibt. <br /><br /><h2>Zugang und Preise</h2><p>\nUm dieses Modul nutzen zu können, ist ein separater Vertrag mit GiroSolution sowie ein Zugang zum GiroCockpit notwendig. Dieser Zugang\nwird angelegt, indem Kontakt mit GiroSolution aufgenommen wird, also bitte tun Sie dies, bevor Sie das Modul installieren. Das\n\nModul selbst ist kostenlos aber die PSP-Dienstleistung und der Akquirervertrag beinhalten Transaktionskosten und Gebühren.  Besuchen Sie <a href=\"https://www.girosolution.de\" target=\"_blank\" rel=\"noreferrer noopener\">unsere Webseite</a>, um mehr Informationen zu den Gebühren zu erhalten. <br /></p><p><br /></p><h2>Modul-Details</h2>\nGiroCheckout ist eine einfache, schnelle und sichere Komplettlösung für die Integration verschiedener Bezahlverfahren in Ihren Online-Shop (jede Zahlungsart erfordert einen Vertrag). GiroCheckout für Shopware ist ein Zahlungsmodul für Online-Geschäfte in Deutschland und anderen mitteleuropäischen Ländern, das vom deutschen Payment Service Provider Girosolution GmbH angeboten wird.  Es bietet eine einfache, schnelle und sichere Lösung für die Einbindung mehrerer Bezahlverfahren in Ihren Online-Shop.  Bitte denken Sie daran, dass die Anbindung Ihres Shops an Bezahlverfahren immer drei Schritte erfordert:\n\n\n<ol><li>Entscheiden, welche Bezahlverfahren Sie anbieten möchten (s. Liste weiter unten)</li><li>Unterzeichnung von Akteptanzverträgen für jede Zahlungsart mit dem Payment Service Provider und dem Akquirer (bitte\nnehmen Sie hierfür Kontakt mit <a href=\"http://www.girosolution.de/\">Girosolution</a> auf)</li><li>Download, Installation und Konfiguration des entsprechenden Zahlungsplugins für Ihren Shop. Anleitungen finden Sie auf <a href=\"https://www.girosolution.de/e-solutions/tools-support/shop-plug-ins/shopware-plug-in\">unserer Webseite zum Plugin für Shopware</a>.</li></ol><p><br /></p><h2>Weitere Plugin-Features:</h2><ol><li>Erstattung für Kreditkarte, Lastschrift, Maestro und paydirekt direkt im Backend in der Bestellungsverwaltung verfügbar.</li><li>Für Kreditkarte, Lastschrift, Maestro und paydirekt kann der Modus \"Nur reservieren\" anstatt \"Reservieren und Bezahlen\" eingestellt werden.  Dadurch erfolgt bei Bezahlung erst einmal nur eine Reservierung, die dann erst zu einem späteren Zeitpunkt (z.B. beim Versenden der Ware) gebucht wird.</li></ol><p><br /></p><h2>Von GiroCheckout unterstützte Bezahlverfahren:</h2><ul><li>giropay (Garantierte Online-Überweisung für Deutschland) - auch in Kombination mit der Altersverifikation giropay-ID</li><li>eps (Garantierte Online-Überweisungen in Österreich)</li><li>iDEAL (Garantierte Online-Überweisungen in den Niederlanden)</li><li>Lastschriftverfahren mit/ohne Sperrdatei</li><li>Kreditkartenzahlungen (alle Länder)</li><li>Paydirekt (Garantierte Online-Überweisung für Deutschland)</li><li>Sofort-Überweisung (Online-Überweisung für Deutschland)</li><li><p>Maestro</p></li><li><p>Bluecode (Bezahlung mit einer Handy-App)</p></li></ul><p><br /></p>\n\nEinfache Integration, höchste Sicherheitsstandards und ein transparentes Gebührenmodell zeichnen GiroCheckout aus. <br /><br /><p><b>\n\nSupport:\n</b></p><ul><li>E-Mail: <a href=\"mailto:support@girosolution.de\">support@girosolution.de</a></li><li><p>Telefon: +49 7554 97090-00</p></li></ul>","installationManual":"<h2><b>Installation:</b></h2><p><strong>Benötigte Shopware-Version: mindestens 6.2.0<strong></strong></strong></p><br /><h3>Installation über den Community Store (empfohlene Methode)</h3><ol><li>Gehen Sie zu \"Einstellungen - System - Plugins\" und klicken Sie unter \"Shopware Account\" auf \"Anmelden\", wenn Sie nicht bereits dort angemeldet sind.</li><li>Suchen Sie dann nach dem Plugin namens \"GiroCheckout\" und folgen Sie den Anweisungen zur Installation.</li><li>Aktivieren Sie das Plugin.</li><li>Konfigurieren Sie das Plugin wie weiter unten im Bereich \"Konfiguration\" beschrieben.</li></ol><br /><h3>Manuelle installation</h3><ol><li>Laden Sie die Zip-Datei des Plugins hier hoch: \"Einstellungen - System - Plugins - Plugin hochladen\"</li><li>Wählen Sie dann in der Übersicht das neue Plugin aus und wählen im ...-Menü die Option \"Installieren\"</li><li>Aktivieren Sie dann das Plugin in der Spalte \"Status\".</li><li>Konfigurieren Sie das Plugin wie weiter unten im Bereich \"Konfiguration\" beschrieben.</li></ol><br /><h3>Konfiguration</h3><ol><li>Passen Sie die Einstellungen des Plugins an, indem Sie zu \"Einstellungen - System - Plugins\" gehen. Wählen Sie im ...-Menü der Zeile \"GiroCheckout Payment\" die Option \"Konfiguration\" aus. Konfigurieren Sie dann im folgenden Dialog für jede Zahlungsart, die Sie verwenden werden, folgendes:<ol><li>Die Verkäufer-ID ist für alle GiroCheckout-Zahlungsarten gleich. Sie finden sie in Ihrem GiroCockpit auch unter dem Namen \"Kundennummer\". Sie sollten sie auch per E-Mail erhalten haben.</li><li>Die korrekte Information für die Felder \"Projekt-ID\" und \"Projekt-Passwort\" finden Sie ebenfalls in Ihrem GiroCockpit unter <a href=\"https://www.girosolution.de/user\">https://www.girosolution.de/user</a>.  Beachten Sie, dass diese Einstellungen für jede Zahlungsart anders ist.</li><li>Das Feld \"Verwendungszweck\" erscheint je nach Zahlungsart auf dem Kontoauszug des Kunden oder Ihrer Abrechnung zu jeder Transaktion.  Er dient der Zuordnung der Zahlungen und erlaubt den Einsatz von Platzhaltern.  Folgende Platzhalter stehen zur Verfügung:</li></ol></li></ol><ul><li>{ORDERID} oder {TRANSACTIONID}: Bestellnummer. TRANSACTIONID ist ein Synonym (Alias), welches zur Kompatibilität mit älteren Shopware-Versionen beibehalten wurde, wo es keine Bestellnummer gab.</li><li>{CUSTOMERID}:Kundennummer</li><li>{SHOPNAME}: Shop-Name</li><li>{CUSTOMERNAME}: Vollständiger Name des Kunden</li><li>{CUSTOMERFIRSTNAME}: Vorname des Kunden</li><li>{CUSTOMERLASTNAME}: Nachname des Kunden</li><li>Die Voreinstellung ist \"{CUSTOMERID}, {SHOPNAME}\", aber wenn Sie nur einen Online-Shop betreiben, macht evtl. folgende Einstellung mehr Sinn: \"Best. {ORDERID}, {CUSTOMERID}\" oder \"{ORDERID}, {CUSTOMERLASTNAME}\".  Die maximale Länge des resultierenden Verwendungszweckes nach Ersetzen der Platzhalter darf 27 Zeichen nicht überschreiten und wird ggf. abgeschnitten.  Halten Sie ihn also kurz und wundern Sie sich nicht, wenn evtl. Text unvollständig in Ihrer Transaktionsansicht im GiroCockpit erscheint.</li></ul>Bei der Kreditkarte können und sollten Sie auswählen, welche Kartentypen Sie in Ihrem Shop akzeptieren.  Es werden dann entsprechende Logos angezeigt.Bei Lastschrift, Kreditkarte, Paydirekt, Bluecode und Maestro gibt es ferner die Option \"Transaktionsart\". Hier können Sie anstatt der Voreinstellung \"Autorisieren und buchen\" auch erst einmal nur Reservierungen vornehmen lassen (Einstellung \"Nur autorisieren\").  In diesem Fall wird der Bestellungsbetrag zunächst nur reserviert und erst gebucht, wenn im Backend die Buchung explizit ausgelöst wird (Button \"Capture\" in den Bestellungsdetails).Prüfen Sie die eingegebenen Zugangsdaten durch Klick auf den Button \"Test Zugangsdaten\" und speichern Sie dann.Jede Zahlungsart, die Sie von GiroCheckout einsetzen wollen, muss nun noch in Shopware aktiviert werden:<ol><li>Gehen Sie zu \"Einstellungen - Shop - Zahlungsarten\" und aktivieren Sie Ihre Zahlungsarten wir im Folgenden beschrieben</li><li>Wählen Sie im ...-Menü die Option \"Bearbeiten\"</li><li>Schalten Sie die Option \"Aktiv\" ein</li><li>Klicken Sie oben auf \"Speichern\"</li></ol>Nun müssen Sie die gewünschten Zahlungsarten noch Ihrem Verkaufskanal hinzufügen. Wählen Sie dazu im linken Hauptmenü unter \"Verkaufskanäle\" den/die entsprechenden Kanäle aus. In den Grundeinstellungen suchen Sie dann das Feld \"Zahlungsarten\" und fügen Sie hier über den rechten Abwärtspfeil alle GiroCheckout-Zahlungsarten hinzu, die Sie nutzen werden. Speichern Sie dann.","version":"4.1.1","changelog":[{"version":"4.1.1","text":"<h3>V 4.1.1 (28-06-2023)</h3>\n\n<ul><li> Made plugin compatible with Shopware 6.5. CAUTION: This plugin is NOT compatible with previous versions!\n</li></ul>","creationDate":{"date":"2023-06-28 16:54:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.0","text":"<p><b>V 4.0.16 (28-09-2022): </b></p><ul><li>Fixed problem with locales (languages) not being correctly passed to payment forms.</li></ul><br /><p><br /></p>","creationDate":{"date":"2023-04-26 16:26:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.16","text":"<h3>V 4.0.16 (28-09-2022)</h3><ul><li> Fixed problem with locales (languages) not being correctly passed to payment forms.\n</li></ul>","creationDate":{"date":"2022-09-29 16:30:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.15","text":"<h3>V 4.0.15 (30-03-2022)</h3>\n\n<ul><li> Fixed problem with migrations in plugin installation for Shopware 6.4.8 or newer.\n</li></ul>","creationDate":{"date":"2022-03-30 23:05:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.14","text":"<h3>V 4.0.14 (10-03-2022)</h3>\n\n<ul><li> Fixed problem in plugin installation for Shopware 6.4.8.</li></ul><p><br /></p><p><b>IMPORTANT: This plugin does not work with Shopware &lt; 6.4.</b></p>","creationDate":{"date":"2022-03-10 20:05:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.13","text":"<p>V 4.0.13 (08-02-2022) </p><p>  * Restored compatibility with latest Shopware version.</p>","creationDate":{"date":"2022-02-08 22:08:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.12","text":"<h3> 4.0.12 (02-09-2021)</h3>\n\n<ul><li> Fixed update problem for latest version.\n</li></ul>\n\n\n\n\n<ul><li> Fixed compatibility problem with SW 6.4.x\n</li></ul>","creationDate":{"date":"2021-09-03 00:16:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.10","text":"V 4.0.10 (14-06-2021)<ul><li>Fixed another problem in update and installation procedure.</li></ul>","creationDate":{"date":"2021-06-14 22:31:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.9","text":"V 4.0.9 (08-06-2021)<ul><li>Fixed bug in update procedure.</li></ul>","creationDate":{"date":"2021-06-09 01:50:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.8","text":"V 4.0.8 (26-05-2021)<ul><li>Replaced paydirekt logo and name with new giropay/paydirekt logo and name.</li><li>Fix in update procedure that will prevent failure if database field exists.</li></ul>","creationDate":{"date":"2021-05-26 18:15:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.7","text":"V 4.0.7 (12-05-2021)<ul><li>Fix regarding custom fields that could cause problems for opening orders in the backend. </li><li>Changed paydirekt logo and name</li><li>Changed Girosolution corporate info to S-Public Services</li></ul>","creationDate":{"date":"2021-05-13 00:04:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.6","text":"V 4.0.6 (18-03-2021)<ul><li>Bugfix regarding failed Direct Debit calls. Now the user is redirected to an error page with the error message. (Hash mismatch or wrong api configurations). Added for all payment methods (ch3443).</li><li>Bugfix in plugin uninstallation. The folders with the files and logos are now removed in the uninstall routine (ch3406).</li><li>Fixed redirect problem when cancelling a payment on certain Shopware versions. Now users who have a version greater than or equal to 6.3.3.0 are redirected to a default error page that indicates how to resume the order, and users with prior versions are redirected to a custom error page with a button to resume order or continue shopping (ch3387)</li><li>Fix in handling of data for 3-D Secure 2.0 where some information was not correctly submitted.</li></ul>","creationDate":{"date":"2021-03-18 14:14:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.5","text":"V 4.0.5 (10-02-2021)<ul><li>Fix in redirect handling in error case.</li></ul>","creationDate":{"date":"2021-02-10 17:14:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.4","text":"<ul><li>Images are now stored in own subfolder and removed on uninstall</li><li>Several fixes to comply with plugin guidelines</li></ul>","creationDate":{"date":"2021-02-02 01:28:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"<ul><li>Support for 3D-Secure 2.0</li><li>Removed debugging message on payment</li><li>Corrected payment states for refund and auth/capture</li><li>Improved error handling in payment<br /></li></ul>","creationDate":{"date":"2021-01-14 14:46:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<p>Port of the Shopware 5 plugin to Shopware 6. New name but same functionality.</p>","creationDate":{"date":"2020-12-21 15:04:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=giros10007224588","redirectToStore":false,"lowestPriceValue":0}