{"id":10595,"name":"Sync4ApiMicrotechSW6","code":"Sync696261765332","lastChange":{"date":"2023-07-18 11:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7VSaQR","examplePageUrl":"","moduleKey":"Sync4ApiMicrotechSW6","creationDate":{"date":"2020-01-06 09:21:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-06-17 08:18:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-01-06 09:23:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":75,"prefix":"Sync","name":"dupp","website":"//www.dupp.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod75_Dupp-Shopware-Cummunity-Store.png"},"infos":[{"id":16568,"name":"sync4 Schnittstelle für büro+ & ERP-complete","description":"​<i>API zur Erweiterung des shopware-Shops für die sync4 Schnittstelle*:</i><br /><h2>büro+ / ERP-complete  &amp; shopware Schnittstelle – sync4</h2><h2>Was ist sync4?</h2><br /><p>sync4 ist ein Produkt-Informations-Management System (PIM), welches Ihre ERP Produktinformationen aufbereitet und organisiert, um diese in shopware und Marktplatz zu veröffentlichen. Ihre Warenwirtschaft bleibt dabei das führende System ¬und der Datenabgleich wird automatisiert. Das spart Ihnen Zeit und Geld.</p><br /><h2><b>sync4 Schnittstelle</b> für <b>büro+ / ERP-complete</b></h2><br /><p>Mithilfe unserer sync4 Software werden ihre Daten und Produkte zwischen ihrem büro+ / ERP-complete und shopware synchronisiert.</p><p>sync4 ist darauf ausgelegt, fehlende Artikelinformationen aufzubereiten und Unzulänglichkeiten von büro+ / ERP-complete auszugleichen, und diese Daten in einen oder mehrere Onlineshops zu übertragen. Als Schnittstelle befindet sich sync4 als Vermittler zwischen Warenwirtschaft und Onlineshop. Hierbei erfolgt die Übertragung auf neuestem Sicherheitsstandard und Shopbestellungen werden GDPdU konform übermittelt.</p><br /><h2><b>sync4 Schnittstelle</b> für ein <b>anderes ERP</b>?</h2><br /><p>Sie möchten sync4 kaufen besitzen aber eine andere Warenwirtschaft? Kein Problem! Wir bieten sync4 für viele verschiedene ERP-Systeme hier im Community-Shop an:</p><br /><p>SAP Business One, SAP R3, Microsoft Dynamics, büro+, ERP Complete, SKS Business, 42 ERP, 42 Arthur, Lexware, Topkontor ERP, blue Office, sage KHK Office Line, ZDF WISO, sync4 kompakt, IN Software, Intelligix, uvm.</p><br /><i>(Sollten Sie Ihr ERP in dieser Liste oder im Community-Shop nicht wiedergefunden haben, kontaktieren Sie uns. Wir helfen Ihnen gerne weiter.)</i><br /><h2>sync4 Schnittstelle ohne ERP?</h2><br /><p>Auch ohne ERP-System ist es möglich eigene Artikel in sync4 anzulegen und diese zu pflegen. Die sync4 Version ohne Warenwirtschaft lässt auch den Druck von Lieferscheinen und Rechnungen mit Ihre Daten zu.</p><br /><h2>Unsere Schnittstelle – Ihre Lösung!</h2><br /><h3>Ihr ERP – Das führende System</h3><br /><p>sync4 bereitet Ihre Artikel für den Online-Shop auf. Dabei werden alle notwendigen Informationen Ihrer Produkte wie z.B. Artikelnummer und -bezeichnung, -beschreibung, Preislisten, Staffelpreise, Bilder, Gewicht, Warenbestand, EAN-Codes, Sonderpreise uvm. aus Ihrer Warenwirtschaft übernommen. Ihre Stammdaten des ERPs bleiben dabei unberührt.</p><br /><h3>Produkte für den Shop aufbereiten</h3><br /><p>Unsere Schnittstelle bietet die Möglichkeit viele Produkt-Attribute wie z.B. Herstellerzuordnung, allgemeine Attribute oder Varianten, Shop-Kundenverwaltungen, Explosionszeichnungen, Metadaten, mehrere Bilder pro Artikel und Shop-Kategorien hinzuzufügen und zu organisieren.</p><br /><p>Ein Mausklick genügt, um alle ausgewählten Artikel mitsamt der aufbereiteten Informationen in den Online-Shop zu übertragen. Preis- und Bestandsabgleich funktionieren ebenso einfach und können im Hintergrund über einen Dienst vollautomatisch übertragen werden.</p><br /><h3>Auftragserfassung &amp; Kundenanlage</h3><br /><p>Onlinebestellungen werden in sync4 übermittelt und direkt an die Warenwirtschaft übermittelt. Hierbei werden Kundendaten sowie Liefer- und Rechnungsadresse im Auftrag angelegt und eine doppelte Kundenanlage vermieden. Innerhalb des Prozesses wurde die aktuelle, rechtliche Anforderung der Datenschutzbestimmung erfüllt.</p><br /><h2>Kernfunktionen im Überblick:</h2><br /><h3>Artikelabgleich:</h3><br /><ul><li><br /></li><li>Per Mausklick werden alle Artikelinformationen, inklusive Bilder, aus Ihrem ERP-System in den Onlineshop übermittelt<br /></li><li>Übertragung von Artikelnamen, Artikelnummern, Artikelbeschreibungen, Preisen, Staffelpreisen, Sonderpreisen, Gewichtsangaben, Lagerbeständen, EAN Codes und Standardbildern aus der Warenwirtschaft<br /></li><li>Zusätzliche Bilder können in sync4 pro Artikel gepflegt werden<br /></li><li>Suchmaschinenoptimierte Artikeleinstellung mit Hilfe von Metadaten für eine bessere Platzierung bei Google und anderen Suchmaschinen<br /></li><li>Einfache Zuweisung von Shop-Kategorien in sync4<br /></li><li>Anreicherung der Artikel mit Zusatzinformationen wie PDF-Dokumenten, Videos, ZIP-Dateien und andere Datei-Formate pro Artikel<br /></li><li>Herstellerpflege inklusive URL und Bild sind möglich<br /></li></ul><br /><h3>Shop-Kategorien:</h3><br /><ul><li><br /></li><li>In sync4 werden Shop-Kategorien in einer übersichtlichen Baumstruktur angelegt<br /></li><li>Die Kategorienreihenfolge ist dabei veränderbar<br /></li><li>Jeder Kategorie kann ein Bild zugewiesen werden<br /></li><li>Es können Metainformationen und Beschreibungstexte hinterlegt werden<br /></li><li>Die Sortierung der Artikel ist wählbar<br /></li><li>Ein Artikel kann in mehrere Shop-Kategorien zugewiesen werden<br /></li></ul><br /><h3>Shop Kundenverwaltung:</h3><br /><ul><li><br /></li><li>Übertragung der Kundendaten aus dem Onlineshop in sync4<br /></li><li>Korrektur der Shop-Kundendaten innerhalb von sync4<br /></li><li>Kunden können einer Shop-Gruppe zugewiesen werden<br /></li><li>Shop-Kunden können Warenwirtschaftskunden zugewiesen werden<br /></li><li>Je nach ERP können kundenspezifische Sonderpreise inklusive Staffelung hinzugefügt werden<br /></li><li>Shop-Neukunde werden in die Warenwirtschaft übergeben<br /></li></ul><br /><h3>Verwaltung von Attributen oder Eigenschaften:</h3><br /><ul><li><br /></li><li>Farben und Größen einzelner Artikel (wie z.B. Jeans in Blau, Schwarz, Größe 32, 34, 36…) können über die Attributverwaltung in sync4 gepflegt werden<br /></li><li>Es können unbegrenzt Attributmerkmale hinzugefügt werden                                                 <br /></li><li>Globale Anlage von Attributen und Attributwerten in sync4 möglich                                         <br /></li><li>Attribute können per „Drag and Drop“ einem Shopartikel zugewiesen werden                       &lt; /li&gt;<br /></li><li>Pro Attributwert können Preiszuschläge sowie Gewichtszuschläge angelegt werden           &lt; /li&gt;<br /></li><li>Attributwerte können für den Shop sortiert werden                                                                   <br /></li><li>Alle möglichen Attributs-Kombinationen werden automatisch erstellt                                      <br /></li><li>In der Warenwirtschaft werden fehlende Artikel neu angelegt                                                  <br /></li><li>Vorhandene Attributartikel werden in der Warenwirtschaft zugewiesen                                  <br /><br /></li></ul><br /><h3>Explosionszeichnungen:</h3><br /><ul><li><br /></li><li>sync4 ermöglicht das Einlesen von Explosionsgrafiken und Informationsbildern                                 <br /></li><li>Bereiche innerhalb der Grafik können markiert und beliebig vielen Artikeln zugewiesen werden         <br /></li><li>Die Explosionszeichnung kann in jeder beliebigen Shop-Kategorie platziert werden                           <br /></li><li>Über die Zeichnung/Grafik können die Artikel im Shop ausgewählt und bestellt werden                      <br /><br /></li></ul><br /><h3>Bestellungsübergabe:</h3><br /><ul><li><br /></li><li>Shop-Bestellungen können automatisch oder per Mausklick abgerufen werden                                                                          <br /></li><li>Bestellübersicht und Übersicht von Einzel-Bestelldaten                                                                                                                <br /></li><li>Bestellstatus kann speziell gekennzeichnet werden                                                                                                                      <br /></li><li>Im Shop erfolgt eine automatische Bestellstatusänderung                                                                                                            <br /></li><li>Liefer- und Rechnungsadressen können beliebig angepasst werden                                                                                           <br /></li><li>Shop-Bemerkungen sind in sync4 editierbar                                                                                                                                 <br /></li><li>In der Warenwirtschaft ist das Anlegen von neuen Shop-Kunden möglich                                                                                   <br /></li><li>Zu vorhandenen Warenwirtschaftskunden können Shop-Kunden zugewiesen werden                                                               <br /></li><li>Aufträge werden automatisch in der Warenwirtschaft angelegt                                                                                                    <br /></li><li>Zahlungs- und Versandarten der Shop-Bestellung werden automatisch in die Warenwirtschaft übergeben                               <br /></li><li>Lieferschein-, Auftragsbestätigung-, und Rechnungsdruck sind mit sync4 auch ohne eine Warenwirtschaft möglich               <br /></li><li>Per Makroprogrammiersprache kann die Übergabe an die Warenwirtschaft angepasst werden<i>(sync4 ist skalierbar und durch Makros auf Ihre individuellen Wünsche und betrieblichen Abläufe anpassbar.)</i><br /></li></ul><br /><br />Weiter Informationen finden Sie auf: <a href=\"http://www.sync4.de/\" target=\"_blank\" rel=\"noreferrer noopener\">www.sync4.de</a><br /><br /><p>* Sie müssen zusätzlich zur API die Sofware-Schnittstelle sync4 kaufen. Sie erhalten alle Informationen auf www.sync4.de. Gerne beraten wir Sie auch in einem persönlichen Beratungsgespräch.</p>","installationManual":"<p>Achtung: Bitte beachten Sie, dass es sich bei dem Shopware-Plugin lediglich um die Erweiterung Ihres shopware-Shops zur Anbindung der Software-Schnittstelle sync4 handelt. Sie erhalten alle Informationen auf www.sync4.de. Gerne beraten wir Sie auch in einem persönlichen Beratungsgespräch.</p>","shortDescription":"sync4 ist eine Schnittstelle um Artikel, Bestellungen, Kunden uvm.  zwischen Shopware und Ihrer büro+ / ERP-complete Warenwirtschaft automatisch und GDPdU-konform zu synchronisieren.","highlights":"","features":""},{"id":16571,"name":"sync4 connector for büro+ & ERP-complete","description":"<p>API to extend the shopware shop for the sync4 interface*:</p><p>büro+ &amp; ERP-complete &amp; shopware interface - sync4</p><p>What is sync4?</p><p>sync4 is a product information management system (PIM), which prepares and organizes your ERP product information to publish it in shopware and marketplace. Your merchandise management system remains the leading system ¬and data synchronization is automated. This saves you time and money.</p><p><br /></p><p>sync4 interface for büro+ &amp; ERP-complete</p><p>With the help of our sync4 software your data and products will be synchronized between your büro+ &amp; ERP-complete and shopware.</p><p><br /></p><p>sync4 is designed to prepare missing item information and to compensate for shortcomings of büro+ &amp; ERP-complete, and to transfer this data to one or more online shops. As an interface, sync4 acts as an intermediary between merchandise management and online shop. Here the transfer is carried out according to the latest security standards and shop orders are transmitted GDPdU compliant.</p><p><br /></p><p>sync4 interface for another ERP?</p><p>You want to buy sync4 but have a different ERP? No problem! We offer sync4 for many different ERP systems here in our community shop:</p><p><br /></p><p>SAP Business One, SAP R3, Microsoft Dynamics, büro+, ERP Complete, SKS Business, 42 ERP, 42 Arthur, Lexware, Topkontor ERP, blue Office, say KHK Office Line, ZDF WISO, sync4 kompakt, IN Software, Intelligix, and many more.</p><p><br /></p><p>(If you did not find your ERP in this list or in the community shop, please contact us. We will be happy to help you).</p><p>sync4 interface without ERP?</p><p>Even without an ERP system it is possible to create and maintain your own articles in sync4. The sync4 version without ERP also allows printing delivery notes and invoices with your data.</p><p><br /></p><p>Our interface - your solution!</p><p>Your ERP - The leading system</p><p>sync4 prepares your articles for the online shop. All necessary information of your products, such as item number and description, price lists, graduated prices, pictures, weight, inventory, EAN codes, special prices and much more are taken from your merchandise management system. Your ERP master data remains unaffected.</p><p><br /></p><p>Preparing products for the shop</p><p>Our interface offers the possibility to add and organize many product attributes such as manufacturer assignment, general attributes or variants, shop customer management, exploded views, metadata, multiple images per item and shop categories.</p><p><br /></p><p>One mouse click is enough to transfer all selected articles together with the prepared information to the online shop. Price and inventory reconciliation is just as easy and can be transferred fully automatically in the background via a service.</p><p><br /></p><p>Order entry &amp; customer creation</p><p>Online orders are transmitted in sync4 and sent directly to the merchandise management system. Here, customer data as well as delivery and billing address are created in the order and duplicate customer creation is avoided. Within the process, the current, legal requirements of the data protection regulations were fulfilled.</p><p><br /></p><p>Core functions at a glance:</p><p>Article comparison:</p><p>All article information, including images, is transferred from your ERP system to the online shop at the click of a mouse</p><p>Transfer of article names, article numbers, article descriptions, prices, graduated prices, special prices, weight data, stock levels, EAN codes and standard images from the merchandise management system</p><p>Additional images can be maintained in sync4 per article</p><p>Search engine optimized article setting using metadata for better ranking on Google and other search engines</p><p>Easy assignment of shop categories in sync4</p><p>Enrichment of articles with additional information such as PDF documents, videos, ZIP files and other file formats per article</p><p>Manufacturer maintenance including URL and image are possible</p><p>Shop categories:</p><p>In sync4 shop categories are created in a clear tree structure</p><p>The category order can be changed</p><p>Each category can be assigned an image</p><p>Meta information and description texts can be stored</p><p>The sorting of the articles is selectable</p><p>An article can be assigned to several shop categories</p><p>Shop customer management:</p><p>Transfer of customer data from the online shop to sync4</p><p>Correction of shop customer data within sync4</p><p>Customers can be assigned to a shop group</p><p>Shop customers can be assigned to merchandise management customers</p><p>Depending on the ERP, customer-specific special prices can be added including scaling</p><p>New shop customers are transferred to the merchandise management</p><p>Management of attributes or properties:</p><p>Colors and sizes of individual articles (e.g. jeans in blue, black, size 32, 34, 36...) can be maintained via the attribute management in sync4</p><p>Unlimited attribute characteristics can be added</p><p>Global creation of attributes and attribute values in sync4 possible</p><p>Attributes can be changed using \"Drag and Dr</p><p><br /></p><p>Translated with www.DeepL.com/Translator (free version)</p>","installationManual":"","shortDescription":"sync4 is an interface to synchronize articles, orders, customers, etc. between shopware and your büro+ & ERP-complete enterprise resource planning automatically and GDPdU compliant.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":158197,"bookingKey":"Sync696261765332","bookingText":"sync4 connector for büro+ & ERP-complete","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKkTo6C","preview":true,"priority":0,"id":38179},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFm9qvB","preview":false,"priority":90,"id":38199},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVrzaEz","preview":false,"priority":80,"id":38180},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnypOwx","preview":false,"priority":50,"id":38176},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpu3Uftz","preview":false,"priority":0,"id":38178}],"comments":[],"ratingAverage":0,"label":"sync4 Schnittstelle für büro+ & ERP-complete","description":"​<i>API zur Erweiterung des shopware-Shops für die sync4 Schnittstelle*:</i><br /><h2>büro+ / ERP-complete  &amp; shopware Schnittstelle – sync4</h2><h2>Was ist sync4?</h2><br /><p>sync4 ist ein Produkt-Informations-Management System (PIM), welches Ihre ERP Produktinformationen aufbereitet und organisiert, um diese in shopware und Marktplatz zu veröffentlichen. Ihre Warenwirtschaft bleibt dabei das führende System ¬und der Datenabgleich wird automatisiert. Das spart Ihnen Zeit und Geld.</p><br /><h2><b>sync4 Schnittstelle</b> für <b>büro+ / ERP-complete</b></h2><br /><p>Mithilfe unserer sync4 Software werden ihre Daten und Produkte zwischen ihrem büro+ / ERP-complete und shopware synchronisiert.</p><p>sync4 ist darauf ausgelegt, fehlende Artikelinformationen aufzubereiten und Unzulänglichkeiten von büro+ / ERP-complete auszugleichen, und diese Daten in einen oder mehrere Onlineshops zu übertragen. Als Schnittstelle befindet sich sync4 als Vermittler zwischen Warenwirtschaft und Onlineshop. Hierbei erfolgt die Übertragung auf neuestem Sicherheitsstandard und Shopbestellungen werden GDPdU konform übermittelt.</p><br /><h2><b>sync4 Schnittstelle</b> für ein <b>anderes ERP</b>?</h2><br /><p>Sie möchten sync4 kaufen besitzen aber eine andere Warenwirtschaft? Kein Problem! Wir bieten sync4 für viele verschiedene ERP-Systeme hier im Community-Shop an:</p><br /><p>SAP Business One, SAP R3, Microsoft Dynamics, büro+, ERP Complete, SKS Business, 42 ERP, 42 Arthur, Lexware, Topkontor ERP, blue Office, sage KHK Office Line, ZDF WISO, sync4 kompakt, IN Software, Intelligix, uvm.</p><br /><i>(Sollten Sie Ihr ERP in dieser Liste oder im Community-Shop nicht wiedergefunden haben, kontaktieren Sie uns. Wir helfen Ihnen gerne weiter.)</i><br /><h2>sync4 Schnittstelle ohne ERP?</h2><br /><p>Auch ohne ERP-System ist es möglich eigene Artikel in sync4 anzulegen und diese zu pflegen. Die sync4 Version ohne Warenwirtschaft lässt auch den Druck von Lieferscheinen und Rechnungen mit Ihre Daten zu.</p><br /><h2>Unsere Schnittstelle – Ihre Lösung!</h2><br /><h3>Ihr ERP – Das führende System</h3><br /><p>sync4 bereitet Ihre Artikel für den Online-Shop auf. Dabei werden alle notwendigen Informationen Ihrer Produkte wie z.B. Artikelnummer und -bezeichnung, -beschreibung, Preislisten, Staffelpreise, Bilder, Gewicht, Warenbestand, EAN-Codes, Sonderpreise uvm. aus Ihrer Warenwirtschaft übernommen. Ihre Stammdaten des ERPs bleiben dabei unberührt.</p><br /><h3>Produkte für den Shop aufbereiten</h3><br /><p>Unsere Schnittstelle bietet die Möglichkeit viele Produkt-Attribute wie z.B. Herstellerzuordnung, allgemeine Attribute oder Varianten, Shop-Kundenverwaltungen, Explosionszeichnungen, Metadaten, mehrere Bilder pro Artikel und Shop-Kategorien hinzuzufügen und zu organisieren.</p><br /><p>Ein Mausklick genügt, um alle ausgewählten Artikel mitsamt der aufbereiteten Informationen in den Online-Shop zu übertragen. Preis- und Bestandsabgleich funktionieren ebenso einfach und können im Hintergrund über einen Dienst vollautomatisch übertragen werden.</p><br /><h3>Auftragserfassung &amp; Kundenanlage</h3><br /><p>Onlinebestellungen werden in sync4 übermittelt und direkt an die Warenwirtschaft übermittelt. Hierbei werden Kundendaten sowie Liefer- und Rechnungsadresse im Auftrag angelegt und eine doppelte Kundenanlage vermieden. Innerhalb des Prozesses wurde die aktuelle, rechtliche Anforderung der Datenschutzbestimmung erfüllt.</p><br /><h2>Kernfunktionen im Überblick:</h2><br /><h3>Artikelabgleich:</h3><br /><ul><li><br /></li><li>Per Mausklick werden alle Artikelinformationen, inklusive Bilder, aus Ihrem ERP-System in den Onlineshop übermittelt<br /></li><li>Übertragung von Artikelnamen, Artikelnummern, Artikelbeschreibungen, Preisen, Staffelpreisen, Sonderpreisen, Gewichtsangaben, Lagerbeständen, EAN Codes und Standardbildern aus der Warenwirtschaft<br /></li><li>Zusätzliche Bilder können in sync4 pro Artikel gepflegt werden<br /></li><li>Suchmaschinenoptimierte Artikeleinstellung mit Hilfe von Metadaten für eine bessere Platzierung bei Google und anderen Suchmaschinen<br /></li><li>Einfache Zuweisung von Shop-Kategorien in sync4<br /></li><li>Anreicherung der Artikel mit Zusatzinformationen wie PDF-Dokumenten, Videos, ZIP-Dateien und andere Datei-Formate pro Artikel<br /></li><li>Herstellerpflege inklusive URL und Bild sind möglich<br /></li></ul><br /><h3>Shop-Kategorien:</h3><br /><ul><li><br /></li><li>In sync4 werden Shop-Kategorien in einer übersichtlichen Baumstruktur angelegt<br /></li><li>Die Kategorienreihenfolge ist dabei veränderbar<br /></li><li>Jeder Kategorie kann ein Bild zugewiesen werden<br /></li><li>Es können Metainformationen und Beschreibungstexte hinterlegt werden<br /></li><li>Die Sortierung der Artikel ist wählbar<br /></li><li>Ein Artikel kann in mehrere Shop-Kategorien zugewiesen werden<br /></li></ul><br /><h3>Shop Kundenverwaltung:</h3><br /><ul><li><br /></li><li>Übertragung der Kundendaten aus dem Onlineshop in sync4<br /></li><li>Korrektur der Shop-Kundendaten innerhalb von sync4<br /></li><li>Kunden können einer Shop-Gruppe zugewiesen werden<br /></li><li>Shop-Kunden können Warenwirtschaftskunden zugewiesen werden<br /></li><li>Je nach ERP können kundenspezifische Sonderpreise inklusive Staffelung hinzugefügt werden<br /></li><li>Shop-Neukunde werden in die Warenwirtschaft übergeben<br /></li></ul><br /><h3>Verwaltung von Attributen oder Eigenschaften:</h3><br /><ul><li><br /></li><li>Farben und Größen einzelner Artikel (wie z.B. Jeans in Blau, Schwarz, Größe 32, 34, 36…) können über die Attributverwaltung in sync4 gepflegt werden<br /></li><li>Es können unbegrenzt Attributmerkmale hinzugefügt werden                                                 <br /></li><li>Globale Anlage von Attributen und Attributwerten in sync4 möglich                                         <br /></li><li>Attribute können per „Drag and Drop“ einem Shopartikel zugewiesen werden                       &lt; /li&gt;<br /></li><li>Pro Attributwert können Preiszuschläge sowie Gewichtszuschläge angelegt werden           &lt; /li&gt;<br /></li><li>Attributwerte können für den Shop sortiert werden                                                                   <br /></li><li>Alle möglichen Attributs-Kombinationen werden automatisch erstellt                                      <br /></li><li>In der Warenwirtschaft werden fehlende Artikel neu angelegt                                                  <br /></li><li>Vorhandene Attributartikel werden in der Warenwirtschaft zugewiesen                                  <br /><br /></li></ul><br /><h3>Explosionszeichnungen:</h3><br /><ul><li><br /></li><li>sync4 ermöglicht das Einlesen von Explosionsgrafiken und Informationsbildern                                 <br /></li><li>Bereiche innerhalb der Grafik können markiert und beliebig vielen Artikeln zugewiesen werden         <br /></li><li>Die Explosionszeichnung kann in jeder beliebigen Shop-Kategorie platziert werden                           <br /></li><li>Über die Zeichnung/Grafik können die Artikel im Shop ausgewählt und bestellt werden                      <br /><br /></li></ul><br /><h3>Bestellungsübergabe:</h3><br /><ul><li><br /></li><li>Shop-Bestellungen können automatisch oder per Mausklick abgerufen werden                                                                          <br /></li><li>Bestellübersicht und Übersicht von Einzel-Bestelldaten                                                                                                                <br /></li><li>Bestellstatus kann speziell gekennzeichnet werden                                                                                                                      <br /></li><li>Im Shop erfolgt eine automatische Bestellstatusänderung                                                                                                            <br /></li><li>Liefer- und Rechnungsadressen können beliebig angepasst werden                                                                                           <br /></li><li>Shop-Bemerkungen sind in sync4 editierbar                                                                                                                                 <br /></li><li>In der Warenwirtschaft ist das Anlegen von neuen Shop-Kunden möglich                                                                                   <br /></li><li>Zu vorhandenen Warenwirtschaftskunden können Shop-Kunden zugewiesen werden                                                               <br /></li><li>Aufträge werden automatisch in der Warenwirtschaft angelegt                                                                                                    <br /></li><li>Zahlungs- und Versandarten der Shop-Bestellung werden automatisch in die Warenwirtschaft übergeben                               <br /></li><li>Lieferschein-, Auftragsbestätigung-, und Rechnungsdruck sind mit sync4 auch ohne eine Warenwirtschaft möglich               <br /></li><li>Per Makroprogrammiersprache kann die Übergabe an die Warenwirtschaft angepasst werden<i>(sync4 ist skalierbar und durch Makros auf Ihre individuellen Wünsche und betrieblichen Abläufe anpassbar.)</i><br /></li></ul><br /><br />Weiter Informationen finden Sie auf: <a href=\"http://www.sync4.de/\" target=\"_blank\" rel=\"noreferrer noopener\">www.sync4.de</a><br /><br /><p>* Sie müssen zusätzlich zur API die Sofware-Schnittstelle sync4 kaufen. Sie erhalten alle Informationen auf www.sync4.de. Gerne beraten wir Sie auch in einem persönlichen Beratungsgespräch.</p>","installationManual":"<p>Achtung: Bitte beachten Sie, dass es sich bei dem Shopware-Plugin lediglich um die Erweiterung Ihres shopware-Shops zur Anbindung der Software-Schnittstelle sync4 handelt. Sie erhalten alle Informationen auf www.sync4.de. Gerne beraten wir Sie auch in einem persönlichen Beratungsgespräch.</p>","version":"23.0.6","changelog":[{"version":"23.0.6","text":"<p></p><ul><li>Compatibility with Shopware 6.5</li></ul>","creationDate":{"date":"2023-06-12 13:53:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial Plugin Release</p>","creationDate":{"date":"2020-04-29 11:40:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Sync696261765332","redirectToStore":false,"lowestPriceValue":0}