{"id":10608,"name":"usrlUserlike6","code":"usrl733866787956","lastChange":{"date":"2023-07-18 11:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5hS3m2","examplePageUrl":"","moduleKey":"usrlUserlike6","creationDate":{"date":"2020-01-07 10:30:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-02-05 12:51:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-02-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-01-27 18:08:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":311,"prefix":"usrl","name":"Userlike","website":"//","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpIUvCaO"},"infos":[{"id":16589,"name":"Userlike","description":"<p></p><ul><li><b>Generieren Sie Leads wie niemals zuvor.</b> Ihre wertvollsten Leads sind die Leute, die Sie direkt kontaktieren. Userlike ist ein Messaging-CRM, um Leads zu generieren und sich auf natürlichem Weg wieder bei ihnen zu melden.</li><li><b>Steigern Sie Ihre Conversion Rate.</b> Eine <a target=\"_blank\" href=\"https://www.userlike.com/de/blog/vorteile-live-chat\" rel=\"noreferrer noopener\">Case-Study</a> mit Virgin Airlines zeigte eine 3,5-fach höhere Conversion Rate sowie einen durchschnittlich 15% höheren  Bestellwert für Kunden, die gechattet hatten im Vergleich zu Nicht-Chattern.</li><li><b>Erhöhen Sie die Kundenzufriedenheit und -loyalität. </b>Live-Chat ist für die Mehrheit der Online-Shopper der bevorzugte Kontaktkanal, da sie hier schnelle Antworten erhalten. </li></ul><p><br /></p><p>Tausende Unternehmen setzen bereits auf Userlike, um mit ihren Kunden zu chatten. Von kleinen Unternehmen und Mittelständlern bis zu internationalen DAX-Konzernen wie Lufthansa, BMW, BASF und vielen weiteren.</p>","installationManual":"<p>Das Userlike-Plugin ermöglicht Ihnen, direkt mit Ihren Shop-Besuchern in Kontakt zu treten. Werfen Sie einen Blick auf <a target=\"_blank\" href=\"https://www.userlike.com/de/public/tutorial/um/website/shopware\" rel=\"noreferrer noopener\">unser Tutorial</a> für eine detaillierte Installationsanleitung oder schauen Sie sich unsere <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=9QQOlpomsRM&amp;t=99s\" rel=\"noreferrer noopener\">Video-Anleitung auf YouTube</a> an.</p>","shortDescription":"Userlike ist die erste und einzige Live-Chat-Software, die es Ihrem Unternehmen ermöglicht, Kunden über Messaging-Kanäle wie Facebook Messenger und WhatsApp zu gewinnen und zu pflegen.","highlights":"Verbinden Sie Ihren Chatbot und automatisieren Sie Teile Ihrer Kundeninteraktionen.\nStellen Sie den Schutz Ihrer Kundendaten sicher mit einer DSGVO-konformen Kommunikationssoftware, entwickelt und gehostet in Deutschland.\nBeantworten Sie alle Chats der verschiedenen Messenger Channels direkt aus dem Message Center – Ihrer zentralen Plattform für Kundenservice und Sales.\nPassen Sie das Design und Verhalten des Chats individuell an Ihre Corporate Identity und Business-Logik an.\nHelfen Sie fremdsprachigen Kunden mit der automatischen Übersetzungsfunktion.","features":"Erstellen Sie Operatorengruppen und lassen Sie Ihre Kunden vor Start des Chats wählen, mit wem sie sprechen möchten.\nLegen Sie Operatoren-Skills fest und verbinden Sie Kundenanfragen mit Fachwissen Ihrer Mitarbeiter.\nVerbinden Sie Ihre Wissensdatenbank und lassen Sie einen Chatbot häufig gestellte Fragen automatisch beantworten.\nVerwenden Sie intelligente Kundenprofile, um einen ganzheitlichen Überblick über Ihre wertvollsten Kunden zu erhalten.\nIntegrieren Sie Ihre liebsten Tech-Tools, wie Slack, Pipedrive, Help Scout und MailChimp.\nErhalten Sie schnelle Einblicke in Ihre Chat-Performance durch Chat-Bewertungen, Feedback und eingebaute Umfragen.\nNavigieren Sie Website-Besucher zur richtigen Unterseite mit Co-Browsing.\nMessen Sie die Leistung Ihres Chat-Teams mit Analytics.\nSehen Sie, was Ihre Kunde tippen und antworten Sie in Lichtgeschwindigkeit mit vorgefertigten Nachrichtenbausteinen.\n...und all die Funktionen, die Sie von einer modernen Messaging-Software erwarten: In-App-Video, Dateitransfer, Bild und URL-Vorschau, Sprachnachrichten und mehr."},{"id":16993,"name":"Userlike","description":"<p><b>Live chat for website and messenger support. Be there when your customers need you the most. </b></p><p><br /></p><p>Userlike unlocks the channels to your customers' hearts. Message your customers in real-time via your website, Facebook Messenger, or Telegram.</p><p><br /></p><p>Your customers could be anywhere. Whether they're browsing from their desktop, chilling on the couch with their tablet, or sitting on the bus with their smartphone – Userlike guarantees an optimal live chat experience. </p><p><br /></p><p>Help your customers when it matters, where it matters. </p><p><br /></p><p><b>Benefits of Userlike</b></p><p><br /></p><p></p><ul><li>Bring your website to life</li><li>Create happy and long-term customers</li><li>Raise your conversion rate by 20%</li><li>Easy to use </li></ul><p><br /></p><p>Be up and running in 3 minutes. Copy and paste your unique code into your website, go online, and start chatting with your web visitors. No software to install. Simply log in to our browser-based Chat Panel and start chatting with potential customers. </p><p><br /></p><p><b>Easy to customize</b></p><p>Build your own customized chat buttons and adapt the chat window to fit the look and feel of your website. You decide how to approach your users. Proactively invite your visitors to chat, receive feedback ratings on your service, collect social media followers through your awesome chat service, and more.</p><p><br /></p><p><b>Easy to scale</b></p><p>Whether you’re a one man show or a multinational with hundreds of service employees, we've got your back. Userlike is used by some of the world’s fastest growing companies. Our system is easy to scale when your website traffic and support team increase.</p><p><br /></p><p><b>Integrate with your workflow</b></p><p>As an additional channel, your live chat should be integrated seamlessly into your existing setup of business tools. We offer a wide range of CRM integrations and offer an Open API for a more advanced setup. Push your user information to Userlike and give your chat operators the information to offer a personalized service, or pull chat transcripts and offline messages to your CRM.</p><p><br /></p><p>Don’t take our word for it. Over 10,000 SMEs and leading businesses around the world are creating long-term customer relationships with Userlike. Start chatting today with our forever free plan.</p>","installationManual":"<p>The powerful e-commerce solution by Shopware allows you to set up and run your own online shop. Live chat will add an extra dimension of trust to your Shopware website. With our plugin you can be up and running in no time and convert valuable contacts into buyers.</p><p><br /></p><p>Simply install the Shopware plugin and enter the Widget secret from the Widget Editor in your Userlike.com (https://www.userlike.com) account's Dasboard.</p>","shortDescription":"Userlike is the first and only live chat software to help your business win and nurture customers across messaging channels such as Facebook Messenger, WhatsApp and more.","highlights":"- Generate leads like never before.  Your most valuable leads are the people who already reach out to you. Userlike is a messaging CRM for capturing leads and following up naturally.\n\n- Raise your conversion rates. A case study with Virgin Airlines showed a 3.5 times higher conversion rate as well as a 15% higher average order value for customers who chatted compared to those who didn't \n\n- Raise customer satisfaction and create loyal customers. Live chat is the preferred contact channel for 66% of online shoppers who want to ask about the products they are interested in buying.","features":"- Answer chats from all your messaging channels from the Message Center – your one central hub for support and sales.\n- Customize the chat to your corporate identity and business logic.\n- Set up Operator groups and let customers click-select who to talk to.\n- Define Operator skills and match customer requests with employee expertise.\n- Connect your knowledge base and let a chatbot automatically answer the most frequently asked questions.\n- Use smart customer profiles to get a complete view on your most valuable customers.\n- Integrate with your favorite business tools, like Slack, Pipedrive, Help Scout and MailChimp.\n- Get quick insights into your performance through chat ratings, feedback and built-in surveys.\n- Guide your visitors to the right website page with co-browsing.\n- Track the performance of your chat team with advanced analytics.\n- Help customers from other countries with the auto-translation feature.\n- See what your customer is typing and respond at lightning speed with canned messages.\n- And all the features you'd expect from a modern messaging solution: in-app video, file exchange, image and URL previews, voice messaging and more."}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":158435,"bookingKey":"usrl733866787956","bookingText":"Userlike","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvXbF7h","preview":true,"priority":0,"id":38409},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1O3ZQj","preview":false,"priority":0,"id":38410},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkUfY4j","preview":false,"priority":0,"id":38411},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM9AW9j","preview":false,"priority":0,"id":38412},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOKRG5j","preview":false,"priority":0,"id":38413},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiZ0oTk","preview":false,"priority":0,"id":38414},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPqongs","preview":false,"priority":0,"id":50176}],"comments":[{"authorName":"Peggy Reichelt","text":"Bis jetzt waren wir sehr zufrieden mit dem Plugin doch leider gibt es seit Wochen kein Update für die neue Shopware Version was für uns jetzt bedeutet, dass wir das Plugin aktuell nicht nutzen können da es sich nicht mehr aktivieren lässt. \nWann ist denn vielleicht ein Update für die Shopware-Version 6.5 geplant?","headline":"Nicht für SW 6.5.2.1","creationDate":{"date":"2023-06-30 15:11:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Sven Rösner","text":"Auch meine Installation war etwas holperig. Jedoch habe ich von Userlike (Christina) einen schnelle und funktionierenden Support erhalten. Jetzt läuft es! \n\nAls deutscher Shopbetreiber kann man eigentlich nur auf Userlike bauen. Alle US-Amerikanischen Anbieter halte ich für zu kompliziert. Kein schneller (oft auch kein guter) Support. Datenschutzangelegenheiten sind oft nicht gut zu durchschauen. Anders ist das bei Userlike. Es ist sinnvoll deutsche Anwendungen zu nutzen... Also Userlike eine Chance geben!","headline":"Ernstgemeinter Chat-Service NUR mit Userlike","creationDate":{"date":"2022-03-28 11:25:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marcel Zimmer","text":"Leider fehlt noch die Sprachsop / Subshop möglichkeit. Wird diese noch nachgereicht?","headline":"Leider fehlt noch die Sprachsop / Subshop Möglichkeit","creationDate":{"date":"2021-08-08 16:15:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Florian","text":"Leider für einen mehrsprachigen Shop absolut unbrauchbar... Ein spanischer oder italiensicher Kunde sieht einen Chat, in dem Texte wie \"Chatten Sie mit uns\" , oder \"Wir sind nicht online und können daher keine Chats annehmen\" oder \"Hinterlassen Sie uns eine Mitteilung und wir melden uns bei Ihnen zurück.\"  verwendet werden. \nDas hilft einem nicht-deutschprachigen Kunden leider in keinster Weise weiter und wirkt schon fast unseriös.","headline":"An sich gut, leider nicht mehrsprachig","creationDate":{"date":"2020-06-22 12:43:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6}],"ratingAverage":7,"label":"Userlike","description":"<p></p><ul><li><b>Generieren Sie Leads wie niemals zuvor.</b> Ihre wertvollsten Leads sind die Leute, die Sie direkt kontaktieren. Userlike ist ein Messaging-CRM, um Leads zu generieren und sich auf natürlichem Weg wieder bei ihnen zu melden.</li><li><b>Steigern Sie Ihre Conversion Rate.</b> Eine <a target=\"_blank\" href=\"https://www.userlike.com/de/blog/vorteile-live-chat\" rel=\"noreferrer noopener\">Case-Study</a> mit Virgin Airlines zeigte eine 3,5-fach höhere Conversion Rate sowie einen durchschnittlich 15% höheren  Bestellwert für Kunden, die gechattet hatten im Vergleich zu Nicht-Chattern.</li><li><b>Erhöhen Sie die Kundenzufriedenheit und -loyalität. </b>Live-Chat ist für die Mehrheit der Online-Shopper der bevorzugte Kontaktkanal, da sie hier schnelle Antworten erhalten. </li></ul><p><br /></p><p>Tausende Unternehmen setzen bereits auf Userlike, um mit ihren Kunden zu chatten. Von kleinen Unternehmen und Mittelständlern bis zu internationalen DAX-Konzernen wie Lufthansa, BMW, BASF und vielen weiteren.</p>","installationManual":"<p>Das Userlike-Plugin ermöglicht Ihnen, direkt mit Ihren Shop-Besuchern in Kontakt zu treten. Werfen Sie einen Blick auf <a target=\"_blank\" href=\"https://www.userlike.com/de/public/tutorial/um/website/shopware\" rel=\"noreferrer noopener\">unser Tutorial</a> für eine detaillierte Installationsanleitung oder schauen Sie sich unsere <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=9QQOlpomsRM&amp;t=99s\" rel=\"noreferrer noopener\">Video-Anleitung auf YouTube</a> an.</p>","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<p>Compatibility update for Shopware 6.4</p>","creationDate":{"date":"2021-05-27 14:43:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release for Shopware 6.</p>","creationDate":{"date":"2020-01-30 15:49:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=usrl733866787956","redirectToStore":false,"lowestPriceValue":0}