{"id":10662,"name":"CbaxModulThemeMars","code":"cbax110924727418","lastChange":{"date":"2023-07-18 11:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpa2oniA","examplePageUrl":"","moduleKey":"CbaxModulThemeMars","creationDate":{"date":"2020-01-08 09:47:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-07-21 08:35:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-07-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-13 11:34:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":429,"prefix":"cbax","name":"coolbax","website":"//www.coolbax.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpff89q3"},"infos":[{"id":16650,"name":"Theme Mars | Pro | Flat Responsive Template SW6","description":"<h3>Theme Mars | Pro | Flat Responsive Template SW6</h3><p>Sie suchen ein modernes ansprechendes Template, welches ihren Shop sofort ins perfekte Licht rückt? Dann sollten Sie sich dieses Template genauer ansehen!\n\n<br>\n\nMit der Version 2.1.7 wurde das komplette Theme noch einmal neu überarbeitet und eine Fülle an Einstellungsmöglichkeiten sind hinzugekommen und nicht nur das, auch eine Vielzahl an neuen Erlebnisweltenkomponenten erweitern das Theme und lassen Ihren Shop im besten Licht erscheinen.</p><p>Vom Grundlayout über den Header zum Footer und den Kategorie- sowie Detailseiten können Sie alles individuell einstellen und benötigen dafür keine Kenntnisse in der Programmierung und Entwicklung. Alle unsere Themes sind so aufgebaut das Sie verständlich, übersichtlich und intuitiv genutzt werden können. Eine ausführliche Dokumentation unterstütz Sie zudem bei der Einrichtung. Sollten sonst noch Fragen und Unklarheiten bestehen, können Sie sich gerne an uns wenden.</p><hr><h3>Live Version</h3><p>Was Sie alles aus diesen&nbsp; Theme herausholen können, zeigen wir Ihnen in unserer Demo-Ausstellung. Diese Ausstellung soll Ihnen als kleine Anregung dienen und darstellen, was man aus einem Theme alles machen kann:</p><h4><a target=\"_blank\" href=\"https://www.coolbax.de/theme-demoshop\" rel=\"noopener nofollow\">➤➤ Zur Demos-Ausstellung</a></h4><hr><h3>Funktionen &amp; Einstellungen im Überblick&nbsp;</h3><p>Was können Sie ohne großen Aufwand und ohne Programmierkenntnisse alles verändern? Die Antwort: Vieles! Eine komplette Auflistung der Einstellungen würde hier den Rahmen sprengen, daher möchten wir Ihnen jetzt einen Auszug der wichtigsten Funktionen und Einstellungen geben:</p><ul><li><i><strong>Allgemeine Einstellungen für Kategorie- &amp; Detailseite:</strong></i><br>Für die Kategorie- &amp; Detailseiten gibt es eine Vielzahl an Konfigurationsmöglichkeiten. Nicht nur Farbanpassungen sind möglich auch können diverse Elemente oder Produktinformationen angezeigt oder ausgeblendet werden.</li><li><i><strong>Farben &amp; Farbverlauf:</strong></i><br>Sie können über 130 Farbeinstellungen vornehmen, zusätzlich haben Sie die Möglichkeit Farbverläufe zu integrieren um eine plastische Optik zu erreichen.</li><li><i><strong>Footer Template:</strong></i><br>Erweitern Sie den Footer um bis zu vier Zeilen. Für jede Zeile stehen Ihnen unterschiedlichen Spaltenlayouts zur Verfügung.</li><li><i><strong>Formular:</strong></i><br>Wählen Sie zwischen zwei Layouts für die Eingabefelder zudem sind diverse Farbanpassungen für Eingabefelder und Labels möglich.</li><li><i><strong>Grundlayout:</strong></i><br>\n\nUmfangreiche Einstellungsmöglichkeiten wie z.B. Layout (Full Width, Boxed, Full Width Header Boxed oder Full Width Boxed), Layout Breite, Abstände, Farben, Rahmen und Schatten können&nbsp; Sie hier festlegen.</li><li><i><strong>Header Layout:</strong></i><br>Wählen Sie aus 5 unterschiedlichen Layoutvorlagen das passende aus und stellen diverse Farbeinstellungen ein. Zusätzlich können Sie den Service-, Account- und Warenkorbbutton konfigurieren.</li><li><i><strong>Hintergrundbilder:</strong></i><br>In den Bereichen: Header, Body und Footer haben Sie die Möglichkeit Hintergrundbilder zu integrieren zudem können Sie diese skalieren, positionieren, fixen und wiederhohlen lassen.</li><li><i><strong>Navigation Layout:</strong></i><br>Hier stehen Ihnen 3 Layouts zur Verfügung zusätzlich können Sie die Position und diverse Farb- und Rahmeneinstellungen vornehmen.</li><li><i><strong>Produkt Box:</strong></i><br>\n\nKonfigurieren Sie die Produkt Box komplett anders. Sie können Abstände, Ausrichtung der Texte, Hover-Effekte, diverse Ausgabe von Produktinformationen, Kurzbeschreibung, Darstellung der Aktion Buttons und Farbeinstellungen sowie vieles mehr verändern. </li><li><i><strong>Produkt Layout im Listing:</strong></i><br> Zum Standardlayout von Shopware (3 Boxen) kommen mit diesem Theme noch zwei zusätzlichen Layouts hinzu: 2 Boxen und Liste. Sie können für jede Kategorie ein anderes Layout definieren.</li><li><i><strong>Rahmen &amp; Schatten:</strong></i><br>Für viele Bereiche im Shop sowie den integrierten&nbsp; Plugins und Apps haben Sie die Möglichkeit, Rahmen und/oder Schatten einzeln&nbsp; hinzuzufügen, zusätzlich können Sie Abrundung der Rahmen und Rahmenfarbe bestimmen.</li><li><i><strong>Schriftgröße:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n&nbsp; Sie können nun auch für alle Überschriftgrößen (H1 - H6) sowie für Texte die Schriftgröße einzeln zu bestimmen.</li><li><i><strong>Tabellen:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n&nbsp; Sie haben jetzt&nbsp; die Möglichkeit das Aussehen von Tabellen in ihrem Shop zu verändern. Rahmen, Rahmenfarbe, Hintergrund und Schriftfarbe können definiert werden</li><li><i><strong>Taps Detailseite:</strong></i><br>Für die Taps auf der Detailseiten stehen Ihnen drei Layouts, mehrere Farbangaben und das definieren von Rahmen zur Verfügung.</li><li><i><strong>Top Bar Service-Leiste:</strong></i><br>Entscheiden Sie ob und wann ja, wo die Service Leiste (für Sprach- und Währungseinstellung) angezeigt werden soll.</li><li><i><strong>und vieles mehr ...</strong></i></li></ul><hr><h3>Verkaufsfördernde Plugins &amp; Apps inklusive</h3><p>Hier finden Sie eine Zusammenstellung aller enthaltenden Plugins &amp; Apps die Sie kostenlos mitgeliefert bekommen. Vorteile für Sie: Sie müssen diese nicht mehr im Store erwerben, zusätzliche Kosten fallen nicht an, Erweiterungen sind immer zu 100% kompatibel zum Theme.</p><h4>GLOBALER BEREICH:</h4><ul><li><b>Eigener Code</b> → Erweitern Sie die umpfangreichen Einstellungen mit eigenen CSS und/oder Javascript Code oder Dateien.</li><li><b>Globale Benachrichtigung</b> → Stellen Sie zeitgesteuert am oberen oder unteren Bildschirmrand wichtige Ankündigungen ein&nbsp; (z.B. Werbeaktionen).</li><li><b>Schriften einbinden</b> → Auswahl der Schriftart für Texte und Überschriften. Es können Google Fonds ebenso wie eigener Schriften integriert werden.</li><li><b>Seitliche Information Box</b> → Heften Sie am linken oder rechten Bildschirmrand eine Box für z. B. Informationen oder Werbeaktionen.</li><li><b>Webmaster-Tools Code</b> → Behalten Sie ihre Werbeaktionen mit Hilfe von Google, Alexa, Bing oder Pinterest im Blick.</li></ul><h4>HEADER BEREICH</h4><ul><li><b>Breadcrumb Erweiterung</b> → Eine zusätzliche Navigation für ihren Shop. Bei Mouseover, werden die Unterkategorien in einem Layer eingeblendet.</li><li><b>Information Box </b> → Fixieren Sie ihre Telefonnummer oder Email Adresse am unteren Bildschirmrand.</li><li><b>Logo Größe</b> → Passen Sie die Logo Größe im Header Bereich für Mobil-, Tablet- und Desktop-Geräte an.</li><li><b>Top Bar USP-Leiste</b> → Präsentieren Sie ihre 3-4 wichtigsten Vorteile prominent über den Header, mit Icon und Text.</li><li><b>Sticky Menü</b> → Lassen Sie einen minimierten Header am oberen Bildschirmrand fixieren. Aussehen und Inhalt können Sie selbst bestimmen.</li></ul><h4>FOOTER BEREICH</h4><ul><li><b>Footer USP-Leiste</b> → Stellen Sie ihre Alleinstellungsmerkmale im Footer mittels Icon und Text sichtbar dar.</li><li><b>Newsletter Anmeldung </b> → Anzeige der Newsletter Anmeldung an verschiedenen Positionen im Footer möglich.</li><li><b>Social Media</b> → Verlinken Sie ihre Social Media Accounts von Facebook, Instagram &amp; Co. im Footer als extra Spalte oder Zeile.</li><li><b>Zahlung und Versandarten</b> → Lassen Sie ihre Zahlungs- und Versanddienstleister in unterschiedlichen Designs und Anordnungen präsentieren.</li></ul><h4>KATEGORIE BEREICH</h4><ul><li><b>Sidebar Kontakt Box</b> → Zeigt Ihren Kunden in der Sidebar an, wo man Sie findet oder wie man Sie erreichen kann.</li><li><b>Quickview</b> → Quickview ist eine Schnellansicht des Produkts im Listing und/oder Slider.</li><li><b>Filter in Sidebar</b> → Bestimmen Sie, wie viel Ihre Kunden von den Filtern auf der linken Seite (Sidebar) dargestellt bekommen sollen.</li><li><b>Artikelbild Wechsel/Zoom</b> → Bei Mouseover können Sie die Artikelbilder per Animation hervorheben lassen.</li></ul><h4>DETAIL BEREICH</h4><ul><li><b>Bewertungen neben der Produktbeschreibung</b> → Präsentieren Sie Ihre Kundenbewertungen, auf der rechten Seite, neben der Produktbeschreibung.</li><li><b>Detail USP-Leiste</b> → Nutzen Sie die Möglichkeit und bewerben Sie ihren Service mit Hilfe von 4 USP unter oder über den Warenkorb.</li><li><b>Erweiterung der Tabs</b> → Fügen Sie neue Tabs mit den Eigenschaften ihrer Produkte oder Videos von YouTube hinzu.</li><li><b>Galerie</b> → wechseln Sie vom Shopware Standard Slider zum frei wählbaren Raster-Layout. Hier werden alle Bilder auf einem Blick präsentiert.</li><li><b>Informationen unter dem Warenkorb Button</b> → Lassen Sie nützliche Informationen wie z.B. EAN, Höhe, Breite, Länge usw. unter dem Warenkorb erscheinen</li><li><b>Kurzbeschreibung</b> → Hinterlegte Texte in dem Zusatzfeld oder der Meta-Beschreibung können, mit Link zur Beschreibung, über den Preis ausgegeben werden</li><li><b>Warenkorb Button fixieren</b> → Fixierter Warenkorb am unteren Bildschirmrand. Vorteil: Kunden können zu jeder Zeit das Produkt in den Warenkorb legen. </li></ul><h4>CHECKOUT BEREICH</h4><ul><li><b>Banner im Offcanvas Warenkorb </b> → Stellen Sie zeitgesteuert, verkaufsfördernder Banner für den Offcanvas Warenkorb ein.</li></ul><hr><h3>Professionelle Elemente für die Erlebniswelten </h3><p>Dieses Theme bietet nicht nur ein umfangreiches Spektrum an Einstellungen und Plugins sondern erweitert auch die Auswahl an Elementen für die Erlebniswelten</p><ul><li>Vier professionelle Bannerdarstellungen (Bild Zoom, Bild Teaser, Bild Message, Bild Overlay)</li><li>Anzeige der Kontaktbox mit individuellen Angaben</li><li>zwei weitere Produktdarstellungen (2 Boxen und 1 Box)</li><li>10 unterschiedliche Spalten Layouts </li></ul><hr><p><strong>Fragen: </strong>Sie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/template/?p=1&sFilterAuthor=Shopware%2B6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p><h2>Weitere Templates:</h2><p><a href=\"https://store.shopware.com/cbax922579105919/theme-merkur-young-modern-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Merkur | Pro | Young Modern Template SW6\n</strong></a><br /><a href=\"https://store.shopware.com/cbax319518677813/theme-pluto-responsive-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Pluto | Pro | Fashion Responsive Template SW6\n</strong></a><br /><a href=\"https://store.shopware.com/cbax325922524768/theme-saturn-responsive-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Saturn | Pro | Responsive Template SW6\n</strong></a></p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/template/plugin-theme-mars-responsive-template-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","shortDescription":"Theme mit einer Vielzahl an Einstellungen, kostenlosen Plugins & Apps sowie neuer Erlebniswelten Elementen für Ihren professionellen Onlineshop. Keine Programmierkenntnisse erforderlich","highlights":"<b>Umfangreiche Konfigurationsmöglichkeiten</b> → Die Einstellungen sind so vielseitig, dass Sie all unsere Demoshops mit jedem Themen nachbauen können.\n<b>30 Tage kostenlos testen</b> → Testen Sie das Theme als Vollversion. Sie können dann selbst entscheiden, ob Sie mieten, kaufen oder weitersuchen möchten.\n<b>Plugins & Addons inklusive</b> → Sparen Sie bares Geld mit den umfangreichen Erweiterungen, die Sie nicht mehr im Store kaufen müssen.\n<b>Neue Einkaufswelten-Komponenten</b> → Erweitern Sie Ihre Einkaufswelten um zusätzliche professionelle Elemente.\n<b>Layout-Einstellungsoptionen</b> → Zur Individualisierung stehen u. a. diverse Layouts im Bereich: Grundlayout, Header, Main Menü und Footer zur Verfügung.","features":"<b>Anwendbar für eine breite Palette</b> → Egal, welche Produktpalette Sie bewerben und verkaufen, dieses Thema kann für alle Bereiche verwendet werden.\n<b>Boxed, Full Width Boxed oder Full Width Layout</b> → Sie können das Grundlayout im Handumdrehen ändern.\n<b>Designanpassungen</b> → Umfangreiche Anpassungen mit Hilfe von: Farbe & Farbverläufen, Hintergrundbildern, Rahmen, Schatten und Schriften möglich\n<b>Erweiterbar mit individuellem Code</b> → Eigene CSS- und Javascript-Anweisungen können in den Theme-Einstellungen implementiert werden.\n<b>Kein Branding erforderlich</b> → Sie können alle Branding- und Copyright-Vermerke über Textbausteine ​​entfernen. Es fallen keine zusätzlichen Gebühren an.\n<b>Kompatibel mit Apps & Plugins</b> → Das Theme wurde nach Shopware-Vorgaben entwickelt und kann einfach mit anderen Plugins & Apps erweitert werden.\n<b>SEO und Pagespeed optimiert</b> → Das gesamte Theme wurde hinsichtlich Suchmaschinenoptimierung und Performance getestet und angepasst.\n<b>Social Media Integration</b> → Verknüpfen Sie die immer wichtiger werdenden Social Media Kanäle mit Ihrem Shop.\n<b>Ständige Weiterentwicklung und Optimierung</b> → Wir stehen nicht still! Unser Theme wird ständig angepasst und weiterentwickelt.\n<b>Umfangreiche Dokumentation</b> → Eine ausführliche und verständliche Anleitung hilft Ihnen bei der Einrichtung und zeigt Ihnen Ihre Möglichkeiten auf.\n<b>Verkaufsfördernde Maßnahmen</b> → Zur gezielten Optimierung der Conversion Rate wurden viele Elemente und Funktionen integriert.\n<b>Zusatzfelder</b> → Für Produkt-Layouts in den Kategorien, Videos, Kurzbeschreibungen, Vorteile und Galerie Layout für die Artikelseite"},{"id":16658,"name":"Theme Mars | Pro | Flat Responsive Template SW6","description":"<h3>Theme Mars | Pro | Flat Responsive Template SW6</h3><p>Are you looking for a modern, attractive template that immediately puts your shop in the perfect light? Then you should take a closer look at this template!<br>\n\nWith version 2.1.7, the entire theme has been revised again and a wealth of setting options have been added and not only that, a large number of new experience world components expand the theme and let your shop appear in the best light.</p><p>From the basic layout to the header to the footer and the category and detail pages, you can set everything individually and do not need any knowledge of programming and development. All of our themes are structured in such a way that they can be used in an understandable, clear and intuitive manner. Detailed documentation also supports you during setup. If there are any other questions or ambiguities, please feel free to contact us.</p><hr><h3>Live version</h3><p>In our demo exhibition we will show you what you can get out of this theme. This exhibition should serve as a small suggestion and show you what you can do with a theme:</p><h4><a target=\"_blank\" href=\"https://www.coolbax.de/theme-demoshop\" rel=\"noopener nofollow\">➤➤ To the Demos exhibition</a></h4><hr><h3>Functions &amp; settings at a glance</h3><p>What can you change without much effort and without programming knowledge? The answer: a lot! A complete listing of the settings would go beyond the scope here, so we would now like to give you an excerpt of the most important functions and settings:</p><ul><li><i><strong>General settings for category &amp; detail page:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nThere are a variety of configuration options for the category and detail pages. Not only color adjustments are possible, various elements or product information can be displayed or hidden.</li><li><i><strong>Colors &amp; gradient:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou can make over 130 color settings, you also have the option of integrating color gradients to achieve a plastic look.</li><li><i><strong>Footer Template:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nExtend the footer by up to four lines. Different column layouts are available for each row.</li><li><i><strong>Form:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose between two layouts for the input fields, various color adjustments for input fields and labels are also possible.</li><li><i><strong>Basic layout:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou can define extensive setting options such as layout (full width, boxed, full width header boxed or full width boxed), layout width, spacing, colors, frames and shadows here.</li><li><i><strong>Header layout:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose the right one from 5 different layout templates and set various color settings. In addition, you can configure the service, account and shopping cart button.</li><li><i><strong>Wallpapers:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nIn the areas: header, body and footer you have the possibility to integrate background images, you can also scale, position, fix and repeat them.</li><li><i><strong>Navigation layout:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nHere you have 3 layouts available, you can also adjust the position and various color and frame settings.</li><li><i><strong>Product Box:</strong></i><br>\n\nConfigure the product box completely differently. You can change spacing, text alignment, hover effects, various output of product information, short description, display of action buttons and color settings and much more. </li><li><i><strong>Product layout in the listing:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n&nbsp;This theme adds two additional layouts to the standard Shopware layout (3 boxes): 2 boxes and a list. You can define a different layout for each category.</li><li><i><strong>Frame &amp; Shadow:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor many areas in the shop as well as the integrated plugins and apps, you have the option of adding frames and/or shadows individually, you can also determine the rounding of the frame and frame color.</li><li><i><strong>Font size:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n&nbsp; You can now determine the font size individually for all heading sizes (H1 - H6) and for texts.</li><li><i><strong>Tables:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n&nbsp; You now have the option to change the appearance of tables in your shop. Frame, frame color, background and font color can be defined</li><li><i><strong>Taps detail page:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor the taps on the detail pages, you have three layouts, several color specifications and the definition of frames.</li><li><i><strong>Top Bar Service Bar:</strong></i><br>\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecide if and when yes, where the service bar (for language and currency settings) should be displayed.</li><li><i><strong>and much more ...</strong></i></li></ul><hr><h3>Sales-promoting plugins &amp; apps included</h3><p>Here you will find a compilation of all included plugins &amp; apps that you will receive free of charge. Advantages for you: You no longer have to purchase them in the store, there are no additional costs, extensions are always 100% compatible with the theme.</p><h4>GLOBAL AREA:</h4><ul><li><b>Own code</b> → Expand the extensive settings with your own CSS and/or Javascript code or files.</li><li><b>Global notification</b> → Schedule important announcements (e.g. promotions) at the top or bottom of the screen.</li><li><b>Integrate fonts</b> → Selection of the font for texts and headings. Google funds as well as your own fonts can be integrated.</li><li><b>Side information box</b> → Attach a box to the left or right edge of the screen for e.g. B. Information or promotions.</li><li><b>Webmaster Tools Code</b> → Keep track of your promotions using Google, Alexa, Bing or Pinterest.</li></ul><h4>HEADER AREA</h4><ul><li><b>Breadcrumb extension</b> → An additional navigation for your shop. With mouseover, the subcategories are shown in a layer.</li><li><b>Information Box</b> → Fix your phone number or email address at the bottom of the screen.</li><li><b>Logo Size</b> → Adjust the logo size in the header area for mobile, tablet and desktop devices.</li><li><b>Top Bar USP bar</b> → Present your 3-4 most important advantages prominently via the header, with an icon and text.</li><li><b>Sticky Menu</b> → Pin a minimized header to the top of the screen. You can determine the appearance and content yourself.</li></ul><h4>FOOTER AREA</h4><ul><li><b>Footer USP bar</b> → Present your unique selling points in the footer using an icon and text.</li><li><b>Newsletter registration </b> → The newsletter registration can be displayed in different positions in the footer.</li><li><b>Social Media</b> → Link your social media accounts from Facebook, Instagram &amp; Co. in the footer as an extra column or row.</li><li><b>Payment and shipping methods</b> → Have your payment and shipping service providers presented in different designs and arrangements.</li></ul><h4>CATEGORY AREA</h4><ul><li><b>Sidebar contact box</b> → Shows your customers in the sidebar where you can be found or how you can be reached.</li><li><b>Quickview</b> → Quickview is a quick view of the product in the listing and/or slider.</li><li><b>Filter in Sidebar</b> → Determine how much of the filters on the left side (sidebar) should be displayed to your customers.</li><li><b>Change article picture/zoom</b> → With mouseover, you can have the article pictures highlighted by animation.</li></ul><h4>DETAIL AREA</h4><ul><li><b>Reviews next to the product description</b> → Present your customer reviews on the right side, next to the product description.</li><li><b>Detailed USP bar</b> → Take the opportunity and advertise your service with the help of 4 USPs below or above the shopping cart.</li><li><b>Tab expansion</b> → Add new tabs with the properties of your products or videos from YouTube.</li><li><b>Gallery</b> → switch from the Shopware standard slider to the freely selectable grid layout. All images are presented here at a glance.</li><li><b>Information under the shopping cart button</b> → Display useful information such as EAN, height, width, length, etc. under the shopping cart</li><li><b>Short description</b> → Text stored in the additional field or the meta description can be output via the price with a link to the description</li><li><b>Fix shopping cart button</b> → Fixed shopping cart at the bottom of the screen. Advantage: Customers can add the product to their shopping cart at any time. </li></ul><h4>CHECKOUT AREA</h4><ul><li><b>Banner in the offcanvas shopping cart</b> → Set time-controlled, sales-promoting banners for the offcanvas shopping cart.</li></ul><hr><h3>Professional elements for the worlds of experience </h3><p>This theme not only offers a wide range of settings and plugins, but also expands the selection of elements for the worlds of experience</p><ul><li>Four professional banner displays (image zoom, image teaser, image message, image overlay)</li><li>Display of the contact box with individual information</li><li>two more product presentations (2 boxes and 1 box)</li><li>10 different column layouts</li></ul><hr><p><strong>Questions: </strong>Do you have any questions about the plugin or the setup? Then take a look at our <a href=\"https://www.coolbax.de/handbuecher/template/?p=1&amp;sFilterAuthor=Shopware%2B6\" target=\"_blank\" rel=\"noreferrer noopener\">manual (in German)</a> or write to us directly: info@coolbax.de</p><h2>Other templates:</h2><p><a href=\"https://store.shopware.com/en/cbax922579105919/theme-merkur-young-modern-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Theme Merkur | Pro | Young Modern Template SW6\n\n</strong></a><br><a href=\"https://store.shopware.com/en/cbax319518677813/theme-pluto-responsive-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Pluto | Pro | Fashion Responsive Template SW6\n</strong></a><br><a href=\"https://store.shopware.com/en/cbax325922524768/theme-saturn-responsive-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Saturn | Pro | Responsive Template SW6\n</strong></a></p>","installationManual":"<p>The installation is done via the Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/template/plugin-theme-mars-responsive-template-sw6\"><strong>View the manual (in German)</strong></a></p>","shortDescription":"Theme with a variety of settings, free plugins & apps and new experience elements for your professional online shop. No programming knowledge required","highlights":"<b>Extensive configuration options</b> → The settings are so versatile that you can recreate all of our demo shops with any theme.\n<b>Try it free for 30 days</b> → Test the theme in the full version. You can then decide for yourself whether you want to rent, buy or continue your search.\n<b>Plugins & addons included</b> → Save money with the extensive extensions, which you no longer have to purchase in the store.\n<b>New shopping world components</b> → Expand your shopping worlds with additional professional elements.\n<b>Layout setting options</b> → Individualization options include Layouts in the area: basic layout, header, main menu and footer are available.","features":"<b>Applicable to a wide range</b> → No matter what range of products you are promoting and selling, this theme can be used for all areas.\n<b>Boxed, Full Width Boxed or Full Width layout</b> → You can change the basic layout in no time at all.\n<b>Design adjustments</b> → Extensive adjustments with the help of: color & color gradients, background images, frames, shadows and fonts possible\n<b>Extensible with individual code</b> → You can implement your own CSS and Javascript instructions in the theme settings.\n<b>No branding necessary</b> → You may remove all branding and copyright notices via text modules. There are no extra fees.\n<b>Compatible with apps & plugins</b> → The theme was developed according to Shopware specifications and can easily be expanded with other plugins & apps.\n<b>SEO and page speed optimized</b> → The entire theme has been tested and adjusted in terms of search engine optimization and performance.\n<b>Social Media Integration</b> → Link the increasingly important social media channels to your shop.\n<b>Constant further development and optimization</b> → We don't stand still! Our theme is constantly being adapted and further developed.\n<b>Extensive documentation</b> → A detailed and understandable manual will help you with the setup and show you your options.\n<b>Sales promotion measures</b> → Many elements and functions have been integrated for the targeted optimization of conversion rates.\n<b>Additional fields</b> → For product layouts in the categories, videos, short descriptions, advantages and galleries Layout for the article page."}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160573,"bookingKey":"cbax110924727418","bookingText":"Theme Mars - Flat Responsive Template SW6","price":299,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160572,"bookingKey":"cbax110924727418_M","bookingText":"Theme Mars - Flat Responsive Template SW6","price":25.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169033,"bookingKey":"cbax110924727418_M12","bookingText":"Theme Mars | Pro | Flat Responsive Template SW6","price":250,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHOQQx0","preview":true,"priority":0,"id":104450},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUngZMh","preview":false,"priority":8,"id":104451},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8d8pWx","preview":false,"priority":7,"id":104454},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprFmwPB","preview":false,"priority":6,"id":102175},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1vLOOL","preview":false,"priority":5,"id":104455},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplgklIK","preview":false,"priority":4,"id":104488},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOf5Vzb","preview":false,"priority":3,"id":102865},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgHzhlP","preview":false,"priority":2,"id":102864},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphGfHwT","preview":false,"priority":1,"id":102863}],"comments":[{"authorName":"Janine","text":"Ich bin ziemlich blutige Anfängerin in Sachen Onlineshop Erstellung. In meinem Marketing-Job hatte ich Berührungspunkte mit SW5: Produkte und Blogartikel einstellen - jetzt baue ich mit SW6 und diesem Theme meinen eigenen Shop und ich liebe ihn! Das Theme ist wirklich schön und bringt von Haus aus viele tolle Features mit, für die sonst weitere Plugins notwendig wären. \n\nBei den Footer-Einstellungen kam ich nicht weiter und habe daher coolbax kontaktiert. Ich bekam super schnelle und kompetente Hilfe. Gewusst wie war es dann auch total einfach :-) DANKE dafür!\n\nIch habe den Eindruck, dass coolbax sich um die kontinuierliche Weiterentwicklung kümmert. Sieht man auch an der Änderungen-Historie.\n\nKann es also nur empfehlen :-)","headline":"Mega tolles Theme + super Support","creationDate":{"date":"2021-08-31 09:52:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Theme Mars | Pro | Flat Responsive Template SW6","description":"<h3>Theme Mars | Pro | Flat Responsive Template SW6</h3><p>Sie suchen ein modernes ansprechendes Template, welches ihren Shop sofort ins perfekte Licht rückt? Dann sollten Sie sich dieses Template genauer ansehen!\n\n<br />\n\nMit der Version 2.1.7 wurde das komplette Theme noch einmal neu überarbeitet und eine Fülle an Einstellungsmöglichkeiten sind hinzugekommen und nicht nur das, auch eine Vielzahl an neuen Erlebnisweltenkomponenten erweitern das Theme und lassen Ihren Shop im besten Licht erscheinen.</p><p>Vom Grundlayout über den Header zum Footer und den Kategorie- sowie Detailseiten können Sie alles individuell einstellen und benötigen dafür keine Kenntnisse in der Programmierung und Entwicklung. Alle unsere Themes sind so aufgebaut das Sie verständlich, übersichtlich und intuitiv genutzt werden können. Eine ausführliche Dokumentation unterstütz Sie zudem bei der Einrichtung. Sollten sonst noch Fragen und Unklarheiten bestehen, können Sie sich gerne an uns wenden.</p><hr /><h3>Live Version</h3><p>Was Sie alles aus diesen  Theme herausholen können, zeigen wir Ihnen in unserer Demo-Ausstellung. Diese Ausstellung soll Ihnen als kleine Anregung dienen und darstellen, was man aus einem Theme alles machen kann:</p><h4><a target=\"_blank\" href=\"https://www.coolbax.de/theme-demoshop\" rel=\"noreferrer noopener\">➤➤ Zur Demos-Ausstellung</a></h4><hr /><h3>Funktionen &amp; Einstellungen im Überblick </h3><p>Was können Sie ohne großen Aufwand und ohne Programmierkenntnisse alles verändern? Die Antwort: Vieles! Eine komplette Auflistung der Einstellungen würde hier den Rahmen sprengen, daher möchten wir Ihnen jetzt einen Auszug der wichtigsten Funktionen und Einstellungen geben:</p><ul><li><i><strong>Allgemeine Einstellungen für Kategorie- &amp; Detailseite:</strong></i><br />Für die Kategorie- &amp; Detailseiten gibt es eine Vielzahl an Konfigurationsmöglichkeiten. Nicht nur Farbanpassungen sind möglich auch können diverse Elemente oder Produktinformationen angezeigt oder ausgeblendet werden.</li><li><i><strong>Farben &amp; Farbverlauf:</strong></i><br />Sie können über 130 Farbeinstellungen vornehmen, zusätzlich haben Sie die Möglichkeit Farbverläufe zu integrieren um eine plastische Optik zu erreichen.</li><li><i><strong>Footer Template:</strong></i><br />Erweitern Sie den Footer um bis zu vier Zeilen. Für jede Zeile stehen Ihnen unterschiedlichen Spaltenlayouts zur Verfügung.</li><li><i><strong>Formular:</strong></i><br />Wählen Sie zwischen zwei Layouts für die Eingabefelder zudem sind diverse Farbanpassungen für Eingabefelder und Labels möglich.</li><li><i><strong>Grundlayout:</strong></i><br />\n\nUmfangreiche Einstellungsmöglichkeiten wie z.B. Layout (Full Width, Boxed, Full Width Header Boxed oder Full Width Boxed), Layout Breite, Abstände, Farben, Rahmen und Schatten können  Sie hier festlegen.</li><li><i><strong>Header Layout:</strong></i><br />Wählen Sie aus 5 unterschiedlichen Layoutvorlagen das passende aus und stellen diverse Farbeinstellungen ein. Zusätzlich können Sie den Service-, Account- und Warenkorbbutton konfigurieren.</li><li><i><strong>Hintergrundbilder:</strong></i><br />In den Bereichen: Header, Body und Footer haben Sie die Möglichkeit Hintergrundbilder zu integrieren zudem können Sie diese skalieren, positionieren, fixen und wiederhohlen lassen.</li><li><i><strong>Navigation Layout:</strong></i><br />Hier stehen Ihnen 3 Layouts zur Verfügung zusätzlich können Sie die Position und diverse Farb- und Rahmeneinstellungen vornehmen.</li><li><i><strong>Produkt Box:</strong></i><br />\n\nKonfigurieren Sie die Produkt Box komplett anders. Sie können Abstände, Ausrichtung der Texte, Hover-Effekte, diverse Ausgabe von Produktinformationen, Kurzbeschreibung, Darstellung der Aktion Buttons und Farbeinstellungen sowie vieles mehr verändern. </li><li><i><strong>Produkt Layout im Listing:</strong></i><br /> Zum Standardlayout von Shopware (3 Boxen) kommen mit diesem Theme noch zwei zusätzlichen Layouts hinzu: 2 Boxen und Liste. Sie können für jede Kategorie ein anderes Layout definieren.</li><li><i><strong>Rahmen &amp; Schatten:</strong></i><br />Für viele Bereiche im Shop sowie den integrierten  Plugins und Apps haben Sie die Möglichkeit, Rahmen und/oder Schatten einzeln  hinzuzufügen, zusätzlich können Sie Abrundung der Rahmen und Rahmenfarbe bestimmen.</li><li><i><strong>Schriftgröße:</strong></i><br />\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Sie können nun auch für alle Überschriftgrößen (H1 - H6) sowie für Texte die Schriftgröße einzeln zu bestimmen.</li><li><i><strong>Tabellen:</strong></i><br />\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Sie haben jetzt  die Möglichkeit das Aussehen von Tabellen in ihrem Shop zu verändern. Rahmen, Rahmenfarbe, Hintergrund und Schriftfarbe können definiert werden</li><li><i><strong>Taps Detailseite:</strong></i><br />Für die Taps auf der Detailseiten stehen Ihnen drei Layouts, mehrere Farbangaben und das definieren von Rahmen zur Verfügung.</li><li><i><strong>Top Bar Service-Leiste:</strong></i><br />Entscheiden Sie ob und wann ja, wo die Service Leiste (für Sprach- und Währungseinstellung) angezeigt werden soll.</li><li><i><strong>und vieles mehr ...</strong></i></li></ul><hr /><h3>Verkaufsfördernde Plugins &amp; Apps inklusive</h3><p>Hier finden Sie eine Zusammenstellung aller enthaltenden Plugins &amp; Apps die Sie kostenlos mitgeliefert bekommen. Vorteile für Sie: Sie müssen diese nicht mehr im Store erwerben, zusätzliche Kosten fallen nicht an, Erweiterungen sind immer zu 100% kompatibel zum Theme.</p><h4>GLOBALER BEREICH:</h4><ul><li><b>Eigener Code</b> → Erweitern Sie die umpfangreichen Einstellungen mit eigenen CSS und/oder Javascript Code oder Dateien.</li><li><b>Globale Benachrichtigung</b> → Stellen Sie zeitgesteuert am oberen oder unteren Bildschirmrand wichtige Ankündigungen ein  (z.B. Werbeaktionen).</li><li><b>Schriften einbinden</b> → Auswahl der Schriftart für Texte und Überschriften. Es können Google Fonds ebenso wie eigener Schriften integriert werden.</li><li><b>Seitliche Information Box</b> → Heften Sie am linken oder rechten Bildschirmrand eine Box für z. B. Informationen oder Werbeaktionen.</li><li><b>Webmaster-Tools Code</b> → Behalten Sie ihre Werbeaktionen mit Hilfe von Google, Alexa, Bing oder Pinterest im Blick.</li></ul><h4>HEADER BEREICH</h4><ul><li><b>Breadcrumb Erweiterung</b> → Eine zusätzliche Navigation für ihren Shop. Bei Mouseover, werden die Unterkategorien in einem Layer eingeblendet.</li><li><b>Information Box </b> → Fixieren Sie ihre Telefonnummer oder Email Adresse am unteren Bildschirmrand.</li><li><b>Logo Größe</b> → Passen Sie die Logo Größe im Header Bereich für Mobil-, Tablet- und Desktop-Geräte an.</li><li><b>Top Bar USP-Leiste</b> → Präsentieren Sie ihre 3-4 wichtigsten Vorteile prominent über den Header, mit Icon und Text.</li><li><b>Sticky Menü</b> → Lassen Sie einen minimierten Header am oberen Bildschirmrand fixieren. Aussehen und Inhalt können Sie selbst bestimmen.</li></ul><h4>FOOTER BEREICH</h4><ul><li><b>Footer USP-Leiste</b> → Stellen Sie ihre Alleinstellungsmerkmale im Footer mittels Icon und Text sichtbar dar.</li><li><b>Newsletter Anmeldung </b> → Anzeige der Newsletter Anmeldung an verschiedenen Positionen im Footer möglich.</li><li><b>Social Media</b> → Verlinken Sie ihre Social Media Accounts von Facebook, Instagram &amp; Co. im Footer als extra Spalte oder Zeile.</li><li><b>Zahlung und Versandarten</b> → Lassen Sie ihre Zahlungs- und Versanddienstleister in unterschiedlichen Designs und Anordnungen präsentieren.</li></ul><h4>KATEGORIE BEREICH</h4><ul><li><b>Sidebar Kontakt Box</b> → Zeigt Ihren Kunden in der Sidebar an, wo man Sie findet oder wie man Sie erreichen kann.</li><li><b>Quickview</b> → Quickview ist eine Schnellansicht des Produkts im Listing und/oder Slider.</li><li><b>Filter in Sidebar</b> → Bestimmen Sie, wie viel Ihre Kunden von den Filtern auf der linken Seite (Sidebar) dargestellt bekommen sollen.</li><li><b>Artikelbild Wechsel/Zoom</b> → Bei Mouseover können Sie die Artikelbilder per Animation hervorheben lassen.</li></ul><h4>DETAIL BEREICH</h4><ul><li><b>Bewertungen neben der Produktbeschreibung</b> → Präsentieren Sie Ihre Kundenbewertungen, auf der rechten Seite, neben der Produktbeschreibung.</li><li><b>Detail USP-Leiste</b> → Nutzen Sie die Möglichkeit und bewerben Sie ihren Service mit Hilfe von 4 USP unter oder über den Warenkorb.</li><li><b>Erweiterung der Tabs</b> → Fügen Sie neue Tabs mit den Eigenschaften ihrer Produkte oder Videos von YouTube hinzu.</li><li><b>Galerie</b> → wechseln Sie vom Shopware Standard Slider zum frei wählbaren Raster-Layout. Hier werden alle Bilder auf einem Blick präsentiert.</li><li><b>Informationen unter dem Warenkorb Button</b> → Lassen Sie nützliche Informationen wie z.B. EAN, Höhe, Breite, Länge usw. unter dem Warenkorb erscheinen</li><li><b>Kurzbeschreibung</b> → Hinterlegte Texte in dem Zusatzfeld oder der Meta-Beschreibung können, mit Link zur Beschreibung, über den Preis ausgegeben werden</li><li><b>Warenkorb Button fixieren</b> → Fixierter Warenkorb am unteren Bildschirmrand. Vorteil: Kunden können zu jeder Zeit das Produkt in den Warenkorb legen. </li></ul><h4>CHECKOUT BEREICH</h4><ul><li><b>Banner im Offcanvas Warenkorb </b> → Stellen Sie zeitgesteuert, verkaufsfördernder Banner für den Offcanvas Warenkorb ein.</li></ul><hr /><h3>Professionelle Elemente für die Erlebniswelten </h3><p>Dieses Theme bietet nicht nur ein umfangreiches Spektrum an Einstellungen und Plugins sondern erweitert auch die Auswahl an Elementen für die Erlebniswelten</p><ul><li>Vier professionelle Bannerdarstellungen (Bild Zoom, Bild Teaser, Bild Message, Bild Overlay)</li><li>Anzeige der Kontaktbox mit individuellen Angaben</li><li>zwei weitere Produktdarstellungen (2 Boxen und 1 Box)</li><li>10 unterschiedliche Spalten Layouts </li></ul><hr /><p><strong>Fragen: </strong>Sie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/template/?p=1&amp;sFilterAuthor=Shopware%2B6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p><h2>Weitere Templates:</h2><p><a href=\"https://store.shopware.com/cbax922579105919/theme-merkur-young-modern-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Merkur | Pro | Young Modern Template SW6\n</strong></a><br /><a href=\"https://store.shopware.com/cbax319518677813/theme-pluto-responsive-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Pluto | Pro | Fashion Responsive Template SW6\n</strong></a><br /><a href=\"https://store.shopware.com/cbax325922524768/theme-saturn-responsive-template-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>\nTheme Saturn | Pro | Responsive Template SW6\n</strong></a></p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/template/plugin-theme-mars-responsive-template-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","version":"3.0.1","changelog":[{"version":"3.0.1","text":"<p></p><ul><li>Fix: Javascript corrected in the footer of the newsletter registration</li><li>Fix: Javascript corrected the filter in the sidebar</li></ul>","creationDate":{"date":"2023-06-13 15:07:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p></p><ul><li>Fix: Adaptation to Shopware 6.5.x</li><li>New: Moved the rest of the plugin settings to the appropriate elements in the theme configuration. Please check and save again if necessary.<br /></li></ul>","creationDate":{"date":"2023-04-18 12:19:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.4","text":"<p></p><ul><li>Fix: Javascript corrected in the footer of the newsletter registration</li><li>Fix: Javascript corrected the filter in the sidebar</li></ul>","creationDate":{"date":"2023-06-13 14:32:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.3","text":"<p></p><ul><li>New: Added shopping world element for the USP</li><li>Fix: Corrected counter for rating tab</li><li>Fix: CSS adjustments in the footer</li></ul>","creationDate":{"date":"2023-03-31 08:43:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"<p>Fix: Fixed bug with color gradient of shopping cart button</p>","creationDate":{"date":"2023-01-30 08:47:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p></p><ul><li>New: Button addons configurable in the forms</li><li>Fix: Error in the display of the action buttons (notepad, shopping cart, quick view, etc.) in the categories fixed</li><li>Fix: Fixed bug showing badges on details page</li></ul>","creationDate":{"date":"2023-01-09 11:18:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<ul><li>New: Display of the action buttons (notepad, shopping cart, quick view, etc.) in the categories via mouseover as an overlay</li><li>New: Short description in the categories can be displayed from the meta description or an additional field</li><li>New: Display of the short description on the product detail page above the buy box</li><li>New: Short description on the product detail page can be displayed from the meta description or an additional field</li><li>New: Discount badges can now also be displayed as a percentage or absolute sum and/or rounded</li><li>Fix: Error in newsletter registration corrected</li></ul>","creationDate":{"date":"2022-12-22 12:40:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.9","text":"<ul><li>New: Added another shop layout \"Full Width Header Boxed\".</li><li>New: Videos can now be integrated per product in an extra tab or under the description</li><li>New: Added additional display options for the gallery slider (different grid layouts) on the product page</li></ul>","creationDate":{"date":"2022-12-02 12:03:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.8","text":"<p>- Errors in CMS banner components fixed</p>","creationDate":{"date":"2022-11-17 21:39:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.7","text":"<p></p><ul><li>Complete revision of the theme settings - New clear structure of the tabs</li><li>New: Global layout settings (Full Width, Full Width Boxed, Boxed)</li><li>New: Global settings - Border border radius, color gradient</li><li>New: Configuration of the forms</li><li>New: Configuration of tables</li><li>New: Configuration of different font sizes</li><li>New: Product layout individually configurable - different product layouts selectable</li><li>New: Fixed shopping cart on the detail page</li><li>New: Tabs individually configurable - different tab layouts selectable</li><li>Tweaked: Top Bar USP bar and Top Bar Service bar completely revised</li><li>Optimized: Header completely revised - different layouts and many new settings</li><li>Tweaked: Main Navigation completely revised - different layouts and many new settings</li><li>Hundreds of new settings and features</li><li>Lots of small and big improvements</li><li>Improved performance</li></ul>","creationDate":{"date":"2022-11-15 15:00:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.6","text":"<p>Corrected integration of the new Shopping worlds</p>","creationDate":{"date":"2022-11-11 14:58:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"<p>- Shopping worlds components adapted, which could lead to errors in older Shopware versions</p>","creationDate":{"date":"2022-10-26 15:03:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"<p></p><ul><li>The automatic loading of Google Fonts can now be switched off (to avoid a warning)</li><li>Local fonts can now be integrated</li><li><b>Important: After the update, it is essential to enter - 'Inter', sans-serif - in the Text and Heading Font fields</b></li></ul>","creationDate":{"date":"2022-10-25 11:22:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"<p>Added several new snippets</p>","creationDate":{"date":"2022-10-17 09:14:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p></p><ul><li>Added new shopping world elements</li><li>Many more improvements</li></ul><p><br /></p>","creationDate":{"date":"2022-10-13 11:40:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p>Corrected various snippets</p>","creationDate":{"date":"2022-07-19 14:15:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p></p><ul><li>Reduction of the data volume for included images</li><li>Added hint texts in the theme settings</li><li>Removal of !important statement in less files</li><li>Fixed styling issues in the modal box confirmed by the newsletter</li></ul>","creationDate":{"date":"2022-07-12 11:54:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p>Corrected various snippets</p>","creationDate":{"date":"2022-03-08 15:46:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p></p><ul><li>Corrected the output of the manufacturer name on the detail page</li><li>New field for the color of the USP icons integrated on the detail page</li></ul>","creationDate":{"date":"2021-10-25 09:38:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p>Image paths for Shopware 6.4.5.x adapted</p>","creationDate":{"date":"2021-10-15 14:55:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p></p><ul><li>Fixed a bug with the display of the Offcanvas shopping cart banner</li><li>Choice of external or internal link in the global notification and banner added in the Offcanvas shopping cart</li></ul>","creationDate":{"date":"2021-09-29 08:51:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p></p><ul><li>Corrected top bar display</li><li>Fixed bug in text modules</li></ul>","creationDate":{"date":"2021-09-24 13:45:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p>Corrected rich snippets and added HTML output to individual footers</p>","creationDate":{"date":"2021-09-06 11:29:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>New fields to easily insert your own CSS code / files and Javascript code / files in the theme</p>","creationDate":{"date":"2021-08-25 14:37:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>- New notation of the template variables</p><p>- Wishlist integrated</p>","creationDate":{"date":"2021-07-14 09:52:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>Image paths in the template files adjusted</p>","creationDate":{"date":"2021-06-18 09:01:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Compatibility with Shopware 6.4.x</p>","creationDate":{"date":"2021-06-02 11:27:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Corrected order for own developments. These are now the last to be loaded. </p>","creationDate":{"date":"2021-06-02 12:25:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Fixed a bug when inheriting the theme</p>","creationDate":{"date":"2021-04-01 10:15:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>- New adventure worlds component added (contact box), maintain your contact data centrally in the theme or individually for each contact box</p><p>- Corrected the icon view in the header and sticky menu for Safari</p>","creationDate":{"date":"2021-03-17 14:44:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>- Fixed a bug in the sticky menu</p><p>- Standard settings for footer widget adjusted</p><p>- Quickview added to listing </p><p><br /></p>","creationDate":{"date":"2021-03-10 12:33:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>CSS adapted in the categories</p>","creationDate":{"date":"2020-11-30 11:32:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- New Shopping Experiences components added</p><p>- Individual category layout (3 columns, 2 columns, list)</p>","creationDate":{"date":"2020-11-26 10:31:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"New configuration added for the filters<br /><p><br /></p>","creationDate":{"date":"2020-10-26 12:22:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Icon paths adjusted - small template adjustments</p>","creationDate":{"date":"2020-10-14 12:56:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Adjustment if the theme is installed in a subdirectory</p>","creationDate":{"date":"2020-09-21 12:41:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Adjustments to Shopware 6.3.0</p>","creationDate":{"date":"2020-08-26 15:58:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Various small design adjustments</p>","creationDate":{"date":"2020-08-19 16:18:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First version of the Plugin for Shopware 6</p>","creationDate":{"date":"2020-07-16 16:14:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=cbax110924727418","redirectToStore":true,"lowestPriceValue":25.99}