{"id":10674,"name":"CbaxModulLexicon","code":"cbax547914511276","lastChange":{"date":"2023-07-18 11:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnktwIu","examplePageUrl":"","moduleKey":"CbaxModulLexicon","creationDate":{"date":"2020-01-08 10:25:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-04-24 15:14:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-04-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-13 11:07:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":429,"prefix":"cbax","name":"coolbax","website":"//www.coolbax.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpff89q3"},"infos":[{"id":16675,"name":"Lexikon / Glossar Professionell | Pro","description":"<h3>Lexikon / Glossar Professionell | Pro</h3><p>Wer kennt es nicht. In vielen Texten sind Fachbegriffe oder Bezeichnungen enthalten, welche nicht für alle Kunden immer klar verständlich sind. Um das Interesse am Produkt nicht zu verlieren, ist es wichtig, eine klare und eindeutige Artikelbeschreibung zu verfassen. Zählt man unter seinen Kunden Profis und Laien, steckt man als Shop Betreiber oft in der Zwickmühle. Einerseits möchte man professionell wirken, andererseits sollen so viel Kunden wie möglich den Text verstehen, damit der Support nicht unnötige Verständnisfragen beantworten muss. Mit unserem Plugin können Sie beide Zielgruppen gleichzeitig bedienen. Fachbegriffe können per klick einfach und schnell erklärt werden. Dafür muss der Kunde die Seite nicht verlassen. Der Begriff wird in einem modalen Fenster erklärt.</p><p><strong>Auf der Startseite des Lexikons</strong> werden ihre Kunden mit den neusten und/oder meist gelesenen Einträgen begrüßt. Sie als Shop Betreiber entscheiden, wie viele Einträge und mit welchem Template diese dargestellt werden sollen. Über diesen Einträgen können Sie einen informativen Einleitungstext und ein allgemeines Banner darstellen lassen. Das Banner wird auf allen Seiten des Lexikons angezeigt. Zwischen Banner und Einleitungstext befindet sich die Legende. Mit ihr können sich Ihre Kunden durch die Lexikonkategorien navigieren. In der Legende werden alle Buchstaben und Zahlen + Sonderzeichen aktive geschalten, sobald ein Eintrag mit ihnen beginnt. Wie das Banner zieht sich die Legende auf jeder Seite des Lexikons durch.</p><p><strong>Die Kategorie Seiten</strong> listen alle Einträge des gewählten Buchstabens, der gewählten Zahl oder des gewählten Sonderzeichens auf. Hier bekommen Ihre Kunden einen Überblick und können einfach nach bestimmten Lexikoneinträgen suchen. Mit Klick auf den Button \"Mehr lesen\" gelangen Sie dann in den eigentlichen Lexikoneintrag.</p><p><strong>Der Lexikoneintrag</strong> ist der wichtigste Teil am Lexikon. Hier kann, in aller Ausführlichkeit, einen Begriff oder eine Wortgruppe erklärt werden. Sie können mithilfe von z. B. Tabellen, Bilder und Aufzählungen alles anschaulich ausführlich. Besonders wertvoll, für Sie als Shop Betreiber, wird die Zuordnung von Produkten sein. Sie können somit nicht nur den Begriff erklären, sondern auch Produkte präsentieren die mit diesem Eintrag in Verbindung stehen.</p><p><strong>Ein Inhaltsverzeichnis</strong> darf bei keinem Lexikon fehlen. Ihre Kunden gelangen über den Link \"Inhaltsverzeichnis\" dorthin. Der Link wird unterhalb der Legende, neben dem Link \"Startseite\", angezeigt und ist auf allen Seiten des Lexikons sichtbar. Einfach und übersichtlich werden all ihre Einträge im Inhaltsverzeichnis alphabetisch sortiert und nach Anfangsbuchstaben gegliedert. Hier erlangen ihre Kunden den schnellsten Überblick über alle angelegten Einträge.</p><p><a href=\"https://demo-6.coolbax.com/lexicon/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Demoshop testen</strong></a><br /><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p><h3>Funktionsumfang &amp; Vorteile</h3><ul><li>Schnelle Erklärung von Wörtern oder Wortgruppen ohne den eigentlichen Text verlassen zu müssen</li><li>NEU: Kurze Erklärungstexte können im modalen Fester oder im Tooltip angezeigt werden</li><li>Profis und Laien können Texte und Artikelbeschreibungen verstehen</li><li>Supportanfragen können verringert werden</li><li>Erzeugung von Content für die Suchmaschinen</li><li>SEO relevanten Daten können für jeder Seite gepflegt werden( Meta-Keywords, Meta-Titel, Meta-Description)</li><li>Lexikoneinträge können mit Produkten aus ihrem Shop aufgewertet werden <br /></li></ul><p>ALLGEMEINE EINSTELLUNGEN:</p><ul><li>Pfad zum Lexikon und zum Inhaltsverzeichnis festlegen</li><li>NEU: Verlinkung im Tooltip oder modalem Fenster darstellen</li><li>Sollen im Text Wörter mehrmals übersetzt werden</li><li>Sollen nur ganze Wörter übersetzt werden</li><li>Soll eine Paginierung anzeigen werden</li><li>Slash am Ende der URL setzen</li></ul><p>EINSTELLUNGEN ZUR ANZEIGE:</p><ul><li>Legen Sie hier fest, wo die Begriffe übersetzt werden sollen\n        <ul><li>Artikelbeschreibung</li><li>Lexikonbeschreibung</li><li>Bezeichnung  und Wert der Eigenschaften</li><li>Alle Typen der Erlebniswelten</li></ul></li></ul><p>EINSTELLUNGEN LINKE SIEDEBAR:</p><ul><li>Was soll angezeigt werden\n        <ul><li>Kategorien</li><li>Linke Navigation</li></ul></li></ul><p>EINSTELLUNGEN STARTSEITE:</p><ul><li>Banner URL, Banner Position (Standard oder Vollflächig) und Banner Modus (Standard oder Strecken)</li><li>Text auf Startseite</li><li>Template Auswahl für Einträge auf Startseite (zwei-, drei-, vierspaltig oder Liste)</li><li>Neuste Einträge anzeigen, Headline und Anzahl der Einträge</li><li>Meist gelesene Einträge anzeigen, Headline und Anzahl der Einträge</li></ul><p>EINSTELLUNGEN KATEGORIEN:</p><ul><li>Template Auswahl für Einträge auf Kategorie Seiten (zwei-, drei-, vierspaltig oder Liste)</li></ul><p>EINSTELLUNGEN MODALES FENSTER:</p><ul><li>Die Headline des modalen Fenster</li><li>Footer anzeigen (Link zum Lexikon)</li></ul><p>EINSTELLUNGEN FÜR JEDEN EINZELNEN LEXIKON EINTRÄGE:</p><ul><li>Für welchen Shop der Eintrag sichtbar ist</li><li>Titel, Kurzbeschreibung, Langbeschreibung, Einstelldatum</li><li>Suchbegriffe (mehre Suchbegriffe können angegeben werden)</li><li>Meta-Titel, Meta-Beschreibung, Meta-Keywords</li><li>Produktzuweisung\n<ul><li>Ausgewählte Produkte oder Dynamische Produktgruppen</li><li>Überschrift</li><li>Layout-Typ (Standard, großes Bild, minimaler Inhalt oder Slider)</li><li>Sortierung</li><li>Maximale Produktanzahl</li><li>Produktgruppe auswählen</li></ul></li><li>Link Bezeichnung, Link Pfad und Link Ziel des modalen Fensters</li><li>6 Zusatzfelder um eigenes Template zu erweitern</li></ul><p>SEO technisch erzeugen Sie nicht nur mit jedem Eintrag einen einmaligen Content, sondern können für jeden Eintrag und jede Seite im Lexikon einen Meta-Titel, eine Meta-Description und Meta-Keywords hinterlegen. Sie pflegen diese in den Einträgen bzw. in den Textbausteinen.</p><h3>Präsentation Ihrer Artikel im Lexikon</h3><p>Nutzen Sie die Möglichkeit und präsentieren Sie auch hier ihre Produkte. Oftmals werden Begriffe für mehrere Ihrer Produkte verwendet. Warum sollte man diese dann nicht auch in den Einträgen präsentieren. Schaffen Sie eine Verbindung zwischen Lexikon Einträgen und Artikeln und bewerben gleichzeitig Ihr vielfältiges Sortiment.</p><h3>Unterschiedliche Begriffe eine Bedeutung</h3><p>Wer kennt das nicht. Oftmals werden unterschiedliche Wörter für einen Begriff genutzt. In solchen Fällen müssen Sie nicht jeden Begriff einzeln anlegen. Sie haben die Möglichkeit, einen Eintrag mit mehreren Suchbegriffen zu versehen. Erscheint eines dieser Begriffe dann im Text, wird der Eintrag ausgespielt.</p><h3>Neues Erlebniswelten Element für alle Erlebnisweltenseiten</h3><p>Mit diesem Plugin erweitern Sie automatisch Ihre Erlebniswelten um ein Element, das „Coolbax Lexikon, Text“ - Element. Hiermit können Sie auf jeder Erlebnisweltenseite das neue Element zum Einsatz kommen lassen.  Alle Wörter die Sie in dem Textfeld eintragen, werden automatisch übersetzt und mit dem Lexikon verlinkt. Vorausgesetzt die entsprechenden Wörter sind im Lexikon angelegt.  \n\n</p><p><strong>Fragen</strong><br />\nSie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","shortDescription":"Begriffserklärung direkt im Text + weiterführenden Link zum Lexikon mit Startseite, Inhaltsverzeichnis, Kategorien und Lexikoneinträgen + Artikeldarstellung. Alle Seiten SEO optimiert!","highlights":"Schnelle Erklärung von Wörtern oder Wortgruppen ohne den eigentlichen Text verlassen zu müssen\nKunde kann sich die Erklärung sofort anzeigen lassen (mit Hilfe eines: modalen Fenster oder ToolTip )\nSEO relevanten Daten können für jeder Seite gepflegt werden (Meta-Keywords, Meta-Titel, Meta-Description)\nLexikoneinträge können mit Produkten aus ihrem Shop aufgewertet werden \nProfis und Laien können Texte und Artikelbeschreibungen verstehen","features":"Entscheiden Sie, wie der Pfad zum Lexikon und zum Inhaltsverzeichnis benannt werden sollen\nStellen Sie ein, ob nur ganze Wörter oder auch Teile von Wörtern erklärt werden dürfen\nLegen Sie fest, wo die Begriffe übersetzt werden sollen ( Artikelbeschreibung, Lexikon Beschreibung, Bezeichnung und Wert der Eigenschaften, Erlebniswelten)\nBestimmen Sie ob die Übersetzungen im modalen fester oder im Tooltip dargestellt werden sollen\nWerten Sie das Lexikon mit einem eigenen Banner auf\nEmpfangen Sie Ihre Kunden auf der Lexikon Startseite mit einem Einleitungstext und den neuste bzw. meist gelesene Einträge\nWählen Sie Ihr Template für die Startseite und Kategorie Seite aus  (zwei-, drei-, vierspaltig oder Liste)\nEntscheiden Sie welcher Shop welchen Eintrag präsentieren darf\nHinterlegen Sie für jeden Eintrag einen Titel, eine Kurz- und Langbeschreibung sowie Einstelldatum\nGeben Sie alle Wörter an unter den der Eintrag angezeigt werden soll\nWerten Sie jeden Lexikon Eintrag SEO technisch auf (Meta-Titel, Meta-Beschreibung, Meta-Keywords)\nWeisen Sie jeden Artikel die passenden Produkte zu (Ausgewählte Produkte oder Dynamische Produktgruppen) \nLegen Sie fest wie diese Produkte Dargestellt werden (Standard, großes Bild, minimaler Inhalt oder Slider)\nVerändern Sie das modale Fenster (Änderung des: Links, Link Pfad, Titel oder Ausblendung des Footer)\nErweitern Sie Ihr Layout für die Einträge nach Ihren wünschen mit 6 Zusatzfelder (pro Eintrag)"},{"id":16983,"name":"Lexicon / Glossary Professional | Pro","description":"<h3>Lexicon / Glossary Professional | Pro</h3><p>Who does not know it. Many texts contain technical terms or designations which are not always clearly understandable for all customers. In order not to lose interest in the product, it is important to write a clear and unambiguous article description. If you count professionals and amateurs among your customers, you as a shop owner are often in a dilemma. On the one hand you want to look professional, on the other hand you want as many customers as possible to understand the text so that the support does not have to answer unnecessary questions. With our plugin you can serve both target groups at the same time. Technical terms can be explained quickly and easily with just a click. The customer does not have to leave the page for this. The term is explained in a modal window.</p><p><strong>On the homepage of the dictionary</strong>, their customers are greeted with the latest and / or most read entries. You as the shop operator decide how many entries and with which template they should be displayed. You can use this entry to display an informative introductory text and a general banner. The banner is displayed on all pages of the dictionary. The legend is located between the banner and the introductory text. It enables your customers to navigate through the lexicon categories. In the legend, all letters and numbers + special characters are activated as soon as an entry begins with them. Like the banner, the legend runs through every page of the dictionary.</p><p><strong>The Pages category</strong> lists all entries for the selected letter, number or special character. Here your customers get an overview and can easily search for certain lexicon entries. By clicking on the \"Read more\" button you will get to the actual dictionary entry.</p><p><strong>The lexicon entry</strong> is the most important part of the lexicon. A term or a group of words can be explained here in great detail. You can use e.g. B. Tables, pictures and enumerations all clearly in detail. The assignment of products will be particularly valuable for you as a shop operator. You can not only explain the term, but also present products related to this entry.</p><p><strong>A table of contents</strong> should not be missing from any lexicon. Your customers can get there using the \"Table of Contents\" link. The link is displayed below the legend next to the \"Home\" link and is visible on all pages of the dictionary. All of their entries in the table of contents are sorted alphabetically and organized by initial letters in a simple and clear manner. Here your customers get the quickest overview of all entries.</p><p><a href=\"https://demo-6.coolbax.com/en/cbax/lexicon/index\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Test in the demo shop</strong></a><br /><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>View the manual (in German)</strong></a></p><h3>Features &amp; benefits</h3><ul><li>Quick explanation of words or groups of words without having to leave the actual text</li><li>NEW: Short explanatory texts can be displayed in the modal window or in the tooltip<br /></li><li>Professionals and laypersons can understand texts and article descriptions</li><li>Support requests can be reduced</li><li>Creation of content for the search engines</li><li>SEO-relevant data can be maintained for every page (meta keywords, meta title, meta description)</li><li>Lexicon entries can be upgraded with products from their shop</li></ul><p>GENERAL SETTINGS:</p><ul><li> Set the path to the dictionary and table of contents </li><li>NEW: Show link in tooltip or modal window<br /></li><li> Should words be translated several times in the text </li><li> Should only whole words be translated </li><li> Should show a pagination </li><li> Put slash at the end of the url </li></ul><p>DISPLAY SETTINGS:</p><ul><li> Specify here where the terms should be translated\n\n        <ul><li> Item description </li><li> Lexicon description </li><li> Name and value of the properties </li><li>All types of worlds of experience<br /></li></ul></li></ul><p> SETTINGS LEFT Settable: </p><ul><li> What should be displayed\n\n        <ul><li> Categories </li><li> Left navigation </li></ul></li></ul><p> SETTINGS HOME: </p><ul><li> Banner URL, banner position (standard or full area) and banner mode (standard or stretch) </li><li> Text on homepage </li><li> Template selection for entries on the start page (two, three, four columns or list) </li><li> Show latest entries, headline and number of entries </li><li> Show most read entries, headline and number of entries </li></ul><p> SETTINGS CATEGORIES: </p><ul><li> Template selection for entries on category pages (two, three, four columns or list) </li></ul><p> MODAL WINDOW SETTINGS: </p><ul><li> The headline of the modal window </li><li> Show footer (link to lexicon) </li></ul><p> SETTINGS FOR EVERY SINGLE LEXICON ENTRIES: </p><ul><li> For which shop the entry is visible </li><li> Title, short description, long description, posting date </li><li> Search terms (more search terms can be specified) </li><li> Meta title, meta description, meta keywords </li><li> product assignment\n\n<ul><li>selected products or dynamic product groups </li><li> heading </li><li> Layout type (standard, large image, minimal content or slider) </li><li> sorting </li><li> Maximum number of products </li><li>product group </li></ul></li><li> Link designation, link path and link destination of the modal window </li><li> 6 additional fields to expand your own template </li></ul><p>SEO technically, you not only generate unique content with every entry, but can also store a meta title, a meta description and meta keywords for each entry and page in the lexicon. You maintain these in the entries or in the text modules.</p><h3>Presentation of your articles in the lexicon</h3><p>Use the opportunity and present your products here too. Terms are often used for several of your products. Then why shouldn't you present them in the entries? Create a connection between lexicon entries and articles and at the same time advertise your diverse range.</p><h3>Different terms mean one</h3><p>Who does not know that. Different words are often used for a term. In such cases, you do not have to create each term individually. You have the option of adding several search terms to an entry. If one of these terms then appears in the text, the entry is played out.</p><h3>New adventure world element for all adventure world sites</h3><p>With this plugin you automatically expand your worlds of experience by one element, the \"Coolbax Lexicon, Text\" element. You can use this to use the new element on every world of experience. All words you enter in the text field are automatically translated and linked to the lexicon. Provided the corresponding words are in the lexicon.</p><p><strong>Ask questions</strong><br />\nDo you have questions about the plugin or the setup? Then take a look at our <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">manual (in German)</a> or write us directly at: info@coolbax.de</p>","installationManual":"<p>Installation is done using the Plugin Manager</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>View the manual (in German)</strong></a></p>","shortDescription":"Explanation of terms directly in the text + further link to the lexicon with start page, table of contents, categories and lexicon entries + article display. All pages SEO optimized!","highlights":"Quick explanation of words or groups of words without having to leave the actual text\nThe customer can have the explanation displayed immediately (using a: modal window or ToolTip)\nSEO-relevant data can be maintained for every page (meta keywords, meta title, meta description)\nLexicon entries can be upgraded with products from their shop\nProfessionals and laypersons can understand texts and article descriptions","features":"Decide how to name the path to the dictionary and table of contents\nWords in the text should be translated several times\nSet whether only whole words or parts of words may be explained\nDetermine where the terms should be translated (item description, lexicon description, description and value of the properties, Worlds of experience)\nUpgrade the lexicon with your own banner\nReceive your customers on the lexicon homepage with an introductory text and the latest or most read entries\nSelect your template for the homepage and category page (two, three, four columns or list)\nDecide which shop may present which entry\nEnter a title, a short and long description and the posting date for each entry\nEnter all words under which the entry should be displayed\nTechnically upgrade each lexicon entry SEO (meta title, meta description, meta keywords)\nAssign the right products to each article (selected products or dynamic product groups)\nDetermine how these products are displayed (standard, large image, minimal content or slider)\nChange the modal window (changing the: link, link path, title or hiding the footer)\nExtend your lexicon according to your wishes with 6 additional fields per entry"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":158270,"bookingKey":"cbax547914511276","bookingText":"Lexicon / Glossary Professional SW6","price":159.9,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160702,"bookingKey":"cbax547914511276_M","bookingText":"Lexicon / Glossary Professional SW6","price":15.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169007,"bookingKey":"cbax547914511276_M12","bookingText":"Lexicon / Glossary Professional | Pro","price":159,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiRgRiZ","preview":true,"priority":0,"id":41410},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpc1cczl","preview":false,"priority":16,"id":82897},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfNw9c2","preview":false,"priority":14,"id":82900},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpicCtIV","preview":false,"priority":13,"id":82904},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdGQiln","preview":false,"priority":12,"id":82898},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1PKiV1","preview":false,"priority":10,"id":82903},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2yCgrf","preview":false,"priority":9,"id":82902},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWtRmxV","preview":false,"priority":8,"id":82907},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9B7HpZ","preview":false,"priority":7,"id":82905},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpobDnSR","preview":false,"priority":6,"id":82906},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpINv0wE","preview":false,"priority":5,"id":82908},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkeJdvV","preview":false,"priority":4,"id":82911},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqpPWFc","preview":false,"priority":3,"id":82910},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXlZ9Vf","preview":false,"priority":2,"id":82909},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLrf8Qv","preview":false,"priority":1,"id":82913},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4DKrKQ","preview":false,"priority":0,"id":82899},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptUsqj7","preview":false,"priority":0,"id":82901}],"comments":[{"authorName":"Martin","text":"Ein absolut empfehlenswertes Plugin, denn es er bietet 2 Funktionen. Zum einen, seinen Kunden Fachbegriffe zu erklären, zum anderen diesen Content gezielt zu schreiben für ein besseres Google Ranking.\n\nDazu, erstklassiger Support, hatte ein kleines technisches Problem was innerhalb kürzester Zeit beseitigt worden ist. An dieser Stelle nochmals vielen lieben Dank, macht weiter so.","headline":"Perfektes Plugin","creationDate":{"date":"2023-04-26 10:20:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Art von ELS-Licht","text":"Das  Plugin läuft perfekt und macht was es soll.\nDer Support hat schnell und kompetent auf unsere Wünsche reagiert.","headline":"Das Lexikon ist eine Bereicherung für unseren Shop","creationDate":{"date":"2020-08-06 10:46:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Benjamin Beloch","text":"Wir haben für unser Tochterunternehmen bereits das Lexikon / Glossar für Shopware 5 im Einsatz. Daher haben wir uns auch für unseren Shopware 6 Shop für dieses Plugin entschieden.\n\nMeiner Meinung nach ist dies das beste Lexikon für Shopware mit einem erstklassigen (!) Support!\n\nDas Plugin lief zuerst nicht in unserer Installation, da es ein paar \"technische \" Probleme gab. Der Support hat sich intensiv um die Lösung des Problems gekümmert und mit einer neuen Version funktionierte dann das Plugin auch ohne Probleme in unserem Shop.\n\nWir - aber auch unsere Kunden - sind absolut zufrieden mit dem Plugin.","headline":"Bestes Lexikon für Shopware!","creationDate":{"date":"2020-06-20 14:16:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Lexikon / Glossar Professionell | Pro","description":"<h3>Lexikon / Glossar Professionell | Pro</h3><p>Wer kennt es nicht. In vielen Texten sind Fachbegriffe oder Bezeichnungen enthalten, welche nicht für alle Kunden immer klar verständlich sind. Um das Interesse am Produkt nicht zu verlieren, ist es wichtig, eine klare und eindeutige Artikelbeschreibung zu verfassen. Zählt man unter seinen Kunden Profis und Laien, steckt man als Shop Betreiber oft in der Zwickmühle. Einerseits möchte man professionell wirken, andererseits sollen so viel Kunden wie möglich den Text verstehen, damit der Support nicht unnötige Verständnisfragen beantworten muss. Mit unserem Plugin können Sie beide Zielgruppen gleichzeitig bedienen. Fachbegriffe können per klick einfach und schnell erklärt werden. Dafür muss der Kunde die Seite nicht verlassen. Der Begriff wird in einem modalen Fenster erklärt.</p><p><strong>Auf der Startseite des Lexikons</strong> werden ihre Kunden mit den neusten und/oder meist gelesenen Einträgen begrüßt. Sie als Shop Betreiber entscheiden, wie viele Einträge und mit welchem Template diese dargestellt werden sollen. Über diesen Einträgen können Sie einen informativen Einleitungstext und ein allgemeines Banner darstellen lassen. Das Banner wird auf allen Seiten des Lexikons angezeigt. Zwischen Banner und Einleitungstext befindet sich die Legende. Mit ihr können sich Ihre Kunden durch die Lexikonkategorien navigieren. In der Legende werden alle Buchstaben und Zahlen + Sonderzeichen aktive geschalten, sobald ein Eintrag mit ihnen beginnt. Wie das Banner zieht sich die Legende auf jeder Seite des Lexikons durch.</p><p><strong>Die Kategorie Seiten</strong> listen alle Einträge des gewählten Buchstabens, der gewählten Zahl oder des gewählten Sonderzeichens auf. Hier bekommen Ihre Kunden einen Überblick und können einfach nach bestimmten Lexikoneinträgen suchen. Mit Klick auf den Button \"Mehr lesen\" gelangen Sie dann in den eigentlichen Lexikoneintrag.</p><p><strong>Der Lexikoneintrag</strong> ist der wichtigste Teil am Lexikon. Hier kann, in aller Ausführlichkeit, einen Begriff oder eine Wortgruppe erklärt werden. Sie können mithilfe von z. B. Tabellen, Bilder und Aufzählungen alles anschaulich ausführlich. Besonders wertvoll, für Sie als Shop Betreiber, wird die Zuordnung von Produkten sein. Sie können somit nicht nur den Begriff erklären, sondern auch Produkte präsentieren die mit diesem Eintrag in Verbindung stehen.</p><p><strong>Ein Inhaltsverzeichnis</strong> darf bei keinem Lexikon fehlen. Ihre Kunden gelangen über den Link \"Inhaltsverzeichnis\" dorthin. Der Link wird unterhalb der Legende, neben dem Link \"Startseite\", angezeigt und ist auf allen Seiten des Lexikons sichtbar. Einfach und übersichtlich werden all ihre Einträge im Inhaltsverzeichnis alphabetisch sortiert und nach Anfangsbuchstaben gegliedert. Hier erlangen ihre Kunden den schnellsten Überblick über alle angelegten Einträge.</p><p><a href=\"https://demo-6.coolbax.com/lexicon/\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Demoshop testen</strong></a><br /><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p><h3>Funktionsumfang &amp; Vorteile</h3><ul><li>Schnelle Erklärung von Wörtern oder Wortgruppen ohne den eigentlichen Text verlassen zu müssen</li><li>NEU: Kurze Erklärungstexte können im modalen Fester oder im Tooltip angezeigt werden</li><li>Profis und Laien können Texte und Artikelbeschreibungen verstehen</li><li>Supportanfragen können verringert werden</li><li>Erzeugung von Content für die Suchmaschinen</li><li>SEO relevanten Daten können für jeder Seite gepflegt werden( Meta-Keywords, Meta-Titel, Meta-Description)</li><li>Lexikoneinträge können mit Produkten aus ihrem Shop aufgewertet werden <br /></li></ul><p>ALLGEMEINE EINSTELLUNGEN:</p><ul><li>Pfad zum Lexikon und zum Inhaltsverzeichnis festlegen</li><li>NEU: Verlinkung im Tooltip oder modalem Fenster darstellen</li><li>Sollen im Text Wörter mehrmals übersetzt werden</li><li>Sollen nur ganze Wörter übersetzt werden</li><li>Soll eine Paginierung anzeigen werden</li><li>Slash am Ende der URL setzen</li></ul><p>EINSTELLUNGEN ZUR ANZEIGE:</p><ul><li>Legen Sie hier fest, wo die Begriffe übersetzt werden sollen\n        <ul><li>Artikelbeschreibung</li><li>Lexikonbeschreibung</li><li>Bezeichnung  und Wert der Eigenschaften</li><li>Alle Typen der Erlebniswelten</li></ul></li></ul><p>EINSTELLUNGEN LINKE SIEDEBAR:</p><ul><li>Was soll angezeigt werden\n        <ul><li>Kategorien</li><li>Linke Navigation</li></ul></li></ul><p>EINSTELLUNGEN STARTSEITE:</p><ul><li>Banner URL, Banner Position (Standard oder Vollflächig) und Banner Modus (Standard oder Strecken)</li><li>Text auf Startseite</li><li>Template Auswahl für Einträge auf Startseite (zwei-, drei-, vierspaltig oder Liste)</li><li>Neuste Einträge anzeigen, Headline und Anzahl der Einträge</li><li>Meist gelesene Einträge anzeigen, Headline und Anzahl der Einträge</li></ul><p>EINSTELLUNGEN KATEGORIEN:</p><ul><li>Template Auswahl für Einträge auf Kategorie Seiten (zwei-, drei-, vierspaltig oder Liste)</li></ul><p>EINSTELLUNGEN MODALES FENSTER:</p><ul><li>Die Headline des modalen Fenster</li><li>Footer anzeigen (Link zum Lexikon)</li></ul><p>EINSTELLUNGEN FÜR JEDEN EINZELNEN LEXIKON EINTRÄGE:</p><ul><li>Für welchen Shop der Eintrag sichtbar ist</li><li>Titel, Kurzbeschreibung, Langbeschreibung, Einstelldatum</li><li>Suchbegriffe (mehre Suchbegriffe können angegeben werden)</li><li>Meta-Titel, Meta-Beschreibung, Meta-Keywords</li><li>Produktzuweisung\n<ul><li>Ausgewählte Produkte oder Dynamische Produktgruppen</li><li>Überschrift</li><li>Layout-Typ (Standard, großes Bild, minimaler Inhalt oder Slider)</li><li>Sortierung</li><li>Maximale Produktanzahl</li><li>Produktgruppe auswählen</li></ul></li><li>Link Bezeichnung, Link Pfad und Link Ziel des modalen Fensters</li><li>6 Zusatzfelder um eigenes Template zu erweitern</li></ul><p>SEO technisch erzeugen Sie nicht nur mit jedem Eintrag einen einmaligen Content, sondern können für jeden Eintrag und jede Seite im Lexikon einen Meta-Titel, eine Meta-Description und Meta-Keywords hinterlegen. Sie pflegen diese in den Einträgen bzw. in den Textbausteinen.</p><h3>Präsentation Ihrer Artikel im Lexikon</h3><p>Nutzen Sie die Möglichkeit und präsentieren Sie auch hier ihre Produkte. Oftmals werden Begriffe für mehrere Ihrer Produkte verwendet. Warum sollte man diese dann nicht auch in den Einträgen präsentieren. Schaffen Sie eine Verbindung zwischen Lexikon Einträgen und Artikeln und bewerben gleichzeitig Ihr vielfältiges Sortiment.</p><h3>Unterschiedliche Begriffe eine Bedeutung</h3><p>Wer kennt das nicht. Oftmals werden unterschiedliche Wörter für einen Begriff genutzt. In solchen Fällen müssen Sie nicht jeden Begriff einzeln anlegen. Sie haben die Möglichkeit, einen Eintrag mit mehreren Suchbegriffen zu versehen. Erscheint eines dieser Begriffe dann im Text, wird der Eintrag ausgespielt.</p><h3>Neues Erlebniswelten Element für alle Erlebnisweltenseiten</h3><p>Mit diesem Plugin erweitern Sie automatisch Ihre Erlebniswelten um ein Element, das „Coolbax Lexikon, Text“ - Element. Hiermit können Sie auf jeder Erlebnisweltenseite das neue Element zum Einsatz kommen lassen.  Alle Wörter die Sie in dem Textfeld eintragen, werden automatisch übersetzt und mit dem Lexikon verlinkt. Vorausgesetzt die entsprechenden Wörter sind im Lexikon angelegt.  \n\n</p><p><strong>Fragen</strong><br />\nSie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-lexikon/glossar-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","version":"3.0.1","changelog":[{"version":"3.0.1","text":"<p>Bug fixes for the Shopware 6.5 adaption</p>","creationDate":{"date":"2023-07-04 09:18:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>* Adaptation to Shopware 6.5</p>","creationDate":{"date":"2023-04-19 11:39:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p></p><ul><li>Adjusted FrontendController</li><li>fixed a small error when logging the error when generating the SEO Url's</li><li>fixed a small error when generating the SEO url's</li><li>Added info about SEO-Url's in the plugin settings</li></ul>","creationDate":{"date":"2023-05-08 15:27:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p>Lexicon SEO URLs for the overview and table of contents are now translatable</p>","creationDate":{"date":"2022-10-27 08:43:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p></p><ul><li>Improvement in lexicon replacements in product pages with CMS layout</li><li>New Twig filter cbax_lexicon_replace for lexicon replacements, can be used anywhere in the storefront template {{ text|cbax_lexicon_replace|raw }}</li></ul><p><br /></p>","creationDate":{"date":"2022-08-10 14:10:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p>Fixed an error with the scheduled task</p>","creationDate":{"date":"2022-08-04 09:58:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>Fixed an error that occurs when creating a new entry in the frontend if you leave the description empty</p>","creationDate":{"date":"2022-07-06 11:36:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p></p><ul><li>Improvement for saving new lexicon entries including testing the keywords for already existing ones</li><li>Performance Improvement</li><li>Sorting of the lexicon entries within a letter</li><li>New function in the lexicon table for duplicating an entry</li><li>Lexicon urls for sitemap now optional</li><li>Improvements in Seo Url creation</li><li>Adjustments to the modal functionality for SW 6.4.11</li><li>Lexicon replacements also in product pages with cms layout</li><li>Lexicon replacements also in Quickview Modal product description</li><li>Lexicon replacements also in selectable product customfields</li></ul>","creationDate":{"date":"2022-06-14 09:00:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p></p><ul><li>Bugs in the lexicon entities fixed</li><li>Performance Improvement</li></ul>","creationDate":{"date":"2022-03-25 12:14:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Custom fields display adjusted to Shopware 6.4</p>","creationDate":{"date":"2021-09-01 10:46:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>Sitemap url generation adjusted to Shopware 6.4</p>","creationDate":{"date":"2021-07-08 13:58:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Adjustments for Shopware 6.4 Update</p>","creationDate":{"date":"2021-05-20 09:16:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>* 2 unnecessary columns in the link table product - lexicon entry removed</p>","creationDate":{"date":"2021-04-19 09:03:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>* Error with lexicon tooltips in offcanvas fixed</p>","creationDate":{"date":"2021-03-18 11:29:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Problems with subdomain shops solved</p>","creationDate":{"date":"2021-03-15 09:18:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>* Lexicon tooltips now working in off-canvas</p><p>* Classification of umlauts changed</p><p><br /></p>","creationDate":{"date":"2021-03-11 15:01:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>When the date is compared to determine whether an entry should only be released in the future, it is now checked directly by timestamp</p>","creationDate":{"date":"2020-11-09 15:02:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>Performance improvement for scheduled task</p>","creationDate":{"date":"2020-09-17 12:51:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>Corrected small error with empty set date</p>","creationDate":{"date":"2020-08-25 12:28:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>Adjustments to the compatibility to Shopware 6.3 made<br /></p>","creationDate":{"date":"2020-08-13 14:49:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>Fixed error when using subdirectories for routing</p>","creationDate":{"date":"2020-07-08 15:23:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Fixed error when assigning the default config</p>","creationDate":{"date":"2020-06-08 15:58:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>New option: Tooltip instead of modal window</p><p>Error correction with https protocol</p>","creationDate":{"date":"2020-06-05 11:32:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>New adventure world component added for all adventure world types</p>","creationDate":{"date":"2020-05-08 10:33:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Small bug in the event category corrected</p>","creationDate":{"date":"2020-04-27 12:51:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First version of the Lexicon / Glossary Professional SW6 for Shopware 6</p>","creationDate":{"date":"2020-03-27 12:57:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=cbax547914511276","redirectToStore":true,"lowestPriceValue":15.99}