{"id":10689,"name":"SwkwebContentManager","code":"swkwe16440165527","lastChange":{"date":"2023-07-18 11:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVzvoqK","examplePageUrl":"","moduleKey":"SwkwebContentManager","creationDate":{"date":"2020-01-08 14:20:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-07-28 10:29:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-07-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-07-16 12:01:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":418,"prefix":"swkwe","name":"swkweb","website":"//swk-web.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpDXy4qp"},"infos":[{"id":16693,"name":"Content Manager | CMS | Blog | Wiki","description":"<p>Erweitern Sie Ihren Online-Shop (Shopware 6) um <strong>informative Darstellungen mit Texten und Bildern</strong>, um Ihre Kunden über relevante Themen zu informieren und neue Kunden zu gewinnen! Dieses Content Manager Plugin macht es Ihnen leicht, diese zu erstellen, zu kategorisieren, zu organisieren und später zeitsparend zu pflegen und weiterzuentwickeln.</p>\n<h2>Die Artikel</h2>\n<h3>Die Ansicht im Storefront</h3>\n<p>Die Benutzer:innen Ihrer Webseite sehen dazu die Artikel-Boxen. Diese sind ähnlich zu den Produkt-Boxen, in denen Ihre Produkte normalerweise präsentiert werden. Eine typische Artikel-Box besteht aus einem Bild, einer Überschrift, einem kurzen Text und einem Link. Sie ist eine Vorschau auf einen Artikel, den Sie dann über den Link erreichen.</p>\n<p>Die Artikel-Detail Seite können Sie anhand der Erlebniswelten-Elemente, die Sie kennen, in ihrem Online-Shop erstellen.</p>\n<p>Mit unserer Erweiterung können Sie all diese Bestandteile übersichtlich einpflegen und gliedern.</p>\n<h3>Übersicht über die Artikel</h3>\n<p>Eine Übersicht über Ihre Artikel können Sie in der Menüleiste der Administration in einem zusätzlichen Unterpunkt &quot;Content Manager&quot; des Punktes &quot;Inhalte&quot; sehen und durchsuchen.</p>\n<h3>Suchmaschinenoptimierung</h3>\n<p>Damit Sie über die Artikel neue Kunden gewinnen können, bietet das Plugin auch die Möglichkeit, die Artikel für Suchmaschinen zu optimieren (SEO für Meta-Title, Meta-Description, Meta-Keywords, und die im folgenden beschriebene Kategorisierung).</p>\n<h2>Die Kategorien</h2>\n<p>Die Erweiterung erlaubt Ihnen, diese inhaltlichen Artikel einer oder mehreren Kategorien zuzuweisen.</p>\n<p>Dies hilft Ihren Kund:innen, schneller zu relevanten Artikeln zu navigieren und es hilft Ihnen, die Artikel übersichtlich zu verwalten. Es ist auch ein wichtiges Werkzeug für Ihre Suchmaschinenoptimierung (Link-Struktur).</p>\n<h2>Die Navigationen</h2>\n<p>Sie können für Ihre Benutzer:innen an beliebigen Stellen Navigationselemente für die Artikel einrichten:</p>\n<h3>A-Z Navigation</h3>\n<p>Mit dem Erlebniswelten-Element &quot;Artikel A-Z Navigation&quot; können Sie eine A-Z (Wiki) Navigation anzeigen lassen. Dort sieht man, wenn man auf die Buchstaben klickt, die dazu passenden Artikel in einem Dropdown.</p>\n<h3>Navigation über Kategorien</h3>\n<p>Das &quot;Kategorie Navigation&quot; Element erlaubt Ihren Benutzern leichten Zugang zu den Artikeln über die Kategorien, die Sie zugewiesen haben. Somit können Sie sehr viele Beiträge übersichtlich darstellen. Dies funktioniert analog zu den normalen Shopware Produkt-Kategorien.</p>\n<h2>Roadmap – mögliche Weiterentwicklungen</h2>\n<ul>\n<li>Den Zeitraum der Anzeige eines Artikels einstellen</li>\n<li>Die Anzeige von inhaltlichen Artikeln in der Suchfunktion der Shopware</li>\n<li>Automatische Keyword-Verlinkung von Artikeln in Texten der Produktbeschreibung</li>\n<li>Kommentar-Funktion für Artikel</li>\n<li>Erlebniswelten-Element: Artikel Box</li>\n<li>Erlebniswelten-Element: Artikel Slider</li>\n<li>Erlebniswelten-Element: Inhaltsverzeichnis</li>\n</ul>\n<p>Wir nehmen auch gerne Aufträge für die Umsetzung einzelner Punkte entgegen.</p>\n<p>Schreiben Sie uns auch gerne, wenn Sie Vorschläge zur Erweiterung des Plugins haben.</p>\n","installationManual":"<h2>tl;dr</h2>\n<ul>\n<li>Kategorie &quot;Content-Manager-Kategorie&quot; Layout zuweisen.</li>\n<li>Unter &quot;Inhalte -&gt; Content-Manager&quot; Artikel anlegen, Titel vergeben, Erlebniswelten Layout anwählen, Inhalte pflegen und sonstige erwünschte Felder befüllen.</li>\n<li>Artikel einer Kategorie zuweisen - entweder vom Artikel aus oder aus der Kategorie heraus.</li>\n</ul>\n<h2>Content-Manager Kategorien</h2>\n<p>Um eine Content-Manager-Kategorie zu definieren, können Sie ganz einfach einer normalen Kategorie ein Erlebniswelten-Layout mit dem Element &quot;Content Manager Kategorie&quot; zuordnen. Sobald Sie dies gemacht haben, können Sie dieser Kategorie die gewünschten Content-Manager-Artikel zuweisen.</p>\n<p>Das Layout können Sie dabei auch duplizieren und nach Ihren Wünschen anpassen. Alternativ können Sie auch ein neues Layout erstellen von dem Typ &quot;Content Manager Kategorie&quot;.</p>\n<p>Sie können auch Unterkategorien anlegen, welchen dasselbe Layout zugewiesen werden kann.</p>\n<h2>Content Manager Artikel</h2>\n<ol>\n<li>Unter &quot;Inhalte -&gt; Content Manager&quot; können Sie über den Button &quot;Neuen Artikel anlegen&quot; einen neuen Content Manager Artikel anlegen.</li>\n<li>In der Box &quot;Allgemeine Einstellungen&quot;, vergeben Sie einen passenden &quot;Titel&quot; für den Beitrag, befüllen wenn erwünscht das Feld &quot;Inhalte&quot;, stellen ein, wann der Beitrag veröffentlicht werden soll und setzen diesen auf &quot;Aktiv&quot;.\n<ul>\n<li>Das Feld &quot;Inhalt&quot; wird ausgegraut, wenn Sie ein Erlebniswelten-Layout ausgewählt haben, welches keine Datenzuordnung mit swkweb_content_manager_article.content hat.</li>\n</ul>\n</li>\n<li>In der Box &quot;Layout&quot; können Sie das Standard-Layout &quot;Content-Manager-Artikel&quot; auswählen. Sie können es auch duplizieren und nach Ihren Wünschen anpassen. Sie können auch ein ganz normales Erlebniswelten-Layout auswählen.</li>\n<li>In der Box &quot;Zuweisung&quot; können Sie eine oder mehrere Kategorien zuweisen und Verkaufskanäle auswählen. Sofern Sie die &quot;Sichtbarkeit&quot;-Einstellung leer lassen, wird der Beitrag nicht ausgegeben.</li>\n<li>In der Box &quot;Zusätzliche Einstellungen&quot; können Sie ein Hauptbild auswählen, welches in der Content-Manager-Kategorie (Listing) gezeigt wird. An dieser Stelle gibt es auch das Feld &quot;Kurzbeschreibung&quot;, welches für die Content-Manager-Kategorien verwendet wird.</li>\n<li>Bei &quot;SEO&quot; können Sie für die Suchmaschinenoptimierung die SEO-Standardeinstellungen &quot;Meta-Titel&quot;, &quot;Meta-Beschreibung&quot; und &quot;Meta-Keywords&quot; vornehmen.</li>\n<li>Unter &quot;SEO URLs&quot; können Sie Hauptkategorien für die URL-Struktur bestimmen.</li>\n</ol>\n<p>In dem Tab &quot;Inhalte&quot; können Sie wie gewohnt, analog zu den normalen Kategorien, die Inhalte des Content Manager Artikels eintragen.</p>\n<h2>Content Manager SEO URL Struktur</h2>\n<p>Bei &quot;Einstellungen -&gt; Shop -&gt; SEO&quot; können Sie die URL-Struktur der Artikel bestimmen. Nach dem Ändern der URL-Struktur sollten Sie die Indizes neu generieren und den Cache leeren.</p>\n","shortDescription":"Zentrales verwalten von zusätzlichen Shop-Inhalten über Erlebniswelten. Aufbauend auf den Shopware-Kategorien und zentraler Inhalts-Verwaltung aus der Administration.","highlights":"Einpflegen von Info-Artikeln mit Erlebniswelten-Layouts\nEinfache und übersichtliche Verwaltung von Shop-Inhalten\nKategorisierung der Info-Artikel für einfacheren Zugang\nA-Z (Wiki) Navigation unter den Artikeln über ein Erlebniswelten-Element\nNavigation der Artikel nach Kategorien in einem Erlebniswelten-Element analog zu den Shopware-Produkt-Kategorien","features":"Content Manager Artikel\nContent Manager Übersicht\nContent Manager A-Z (Wiki)\nContent Manager Kategorie Navigation"},{"id":21541,"name":"Content Manager | CMS | Blog | Wiki","description":"<p>Exrich your online-shop (Shopware 6) with informative articles composed of text and pictures! Inform your customers about relevant topics and attract new customers! This content manager plugin makes it easy for you to create these, to categorize and to organize them. Later on, it will help you with updating and developing them efficiently.</p>\n<h2>The articles</h2>\n<h3>The appearance in the storefront</h3>\n<p>The users of your website will see article boxes. These are similar to the product boxes in which your products are normally presented. An article box will typically include a picture, a headline, a short text and a link. It is a preview of the article that one can reach with the link.</p>\n<p>You can create the detailed article with Shopping Experiences elements that you know in your online shop.</p>\n<p>With our plugin, you can integrate and structure all these components in a straightforward way.</p>\n<h3>Overview of the articles</h3>\n<p>The plugin provides you with a searchable overview of your articles. You reach this in the menu bar of the administration through an additional item &quot;Content Manager&quot; of the &quot;Content&quot; menu.</p>\n<h3>Search engine optimization</h3>\n<p>For attracting new customers, the plugin allows you to optimize the articles for search engines (SEO for meta-title, meta-description and meta-keywords and the categorization described in the following).</p>\n<h2>The categories</h2>\n<p>The plugin allows you to assign an article to one or more categories.</p>\n<p>This helps your customers navigate the articles and it helps you effectively administer them. It is also an important part of the search engine optimization (structure of the links).</p>\n<h2>The navigations</h2>\n<p>You can install the display of navigations of the articles for your users. You choose where these navigations occur.</p>\n<h3>A-Z navigation</h3>\n<p>With the Shopping Experiences element &quot;Article A-Z Navigation&quot; you can offer the user an A-Z (Wiki) navigation. A click on one of the letters opens a dropdown menu with the corresponding articles.</p>\n<h3>Category navigation</h3>\n<p>The &quot;Category Navigation&quot; element allows your users easy access to the articles via the categories that you assigned and, if you want, the subcategories that you assigned. This is parallel to the regular Shopware product categories.</p>\n<h2>Roadmap – possible developments</h2>\n<ul>\n<li>Select a display period of an article</li>\n<li>Include articles in the Shopware search function.</li>\n<li>Automatic keyword linking to articles in product descriptions.</li>\n<li>Comment function for article writing.</li>\n<li>Shopping Experiences element: Article Box</li>\n<li>Shopping Experiences Element: Article Slider</li>\n<li>Shopping Experiences Element: Table of Contents</li>\n</ul>\n<p>We are also glad to negotiate orders for implementing one of these right away.</p>\n<p>If you have any suggestions regarding the functionality of the plugin, please feel free to contact us.</p>\n","installationManual":"<h2>tl;dr</h2>\n<ul>\n<li>Assign layout to category &quot;Content Manager Category&quot;.</li>\n<li>In &quot;Content -&gt; Content Manager&quot; create article, assign title, select experience layout, maintain content and fill other desired fields.</li>\n<li>Assign articles to a category - either from the article or from the category.</li>\n</ul>\n<h2>Content Manager Categories</h2>\n<p>In order to define a Content Manager Category, you can go into your Shopware categories and assign the Shopping Experiences layout &quot;Content Manager Category&quot; to a desired category. You can then assign Content Manager articles to this category.</p>\n<p>You can also duplicate the layout and customize it to your liking. Alternatively, you can create a new layout of the type &quot;Content Manager Category&quot;.</p>\n<p>You can also create subcategories to which the same layout can be assigned.</p>\n<h2>Content Manager Article</h2>\n<ol>\n<li>In &quot;Content -&gt; Content Manager&quot; you can create a new article by clicking the button &quot;Create new article&quot;.</li>\n<li>In the &quot;General Settings&quot; box, enter a suitable &quot;Title&quot; for the article, fill in the &quot;Content&quot; field if desired, set when the article should be published and set it to &quot;Active&quot;.\n<ul>\n<li>The &quot;Content&quot; box will be grayed out if you have selected a world of experience layout that does not have data association with swkweb_content_manager_article.content.</li>\n</ul>\n</li>\n<li>In the &quot;Layout&quot; box, select the default &quot;Content Manager Article&quot; layout; or duplicate it and customize it to your liking; or select a normal Shopping Experiences layout.</li>\n<li>In the box &quot;Assignment&quot;, you can assign the article to one or more categories and select sales channels. If you leave the visibility setting empty, the article won't be shown in the storefront.</li>\n<li>In the box &quot;Additional settings&quot;, you can select a main image, which is responsible for the display in the content manager category. At this point there is also the field &quot;Short description&quot;, which is used for the Content Manager category.</li>\n<li>Under the point &quot;SEO&quot;, you can configure search engine optimization for &quot;Meta Title&quot;, &quot;Meta Description&quot; and &quot;Meta Keywords&quot;.</li>\n<li>Under &quot;SEO URLs&quot;, you can prioritize the categories for entering into the URLs.</li>\n</ol>\n<p>In the tab &quot;Content&quot; you can enter the content of the Content Manager article as usual, analogous to the normal categories.</p>\n<h2>Content Manager SEO URL Structure</h2>\n<p>Under &quot;Settings -&gt; Shop -&gt; SEO&quot;, you can determine the &quot;Content Manager Article&quot; URL structure. After changing this, you should regenerate the indexes and clear the cache.</p>\n","shortDescription":"Easy and effective management of additional content for your online shop using Shopping Experiences. Based on Shopware categories and central content management in the administration.","highlights":"Building and maintaining of content articles with Shopping Experiences layouts\nSimple and clear administration of these content articles\nAssignment of categories to the content articles for easy access to the articles\nA-Z (Wiki) navigation as a Shopping Experiences element\nNavigation by the categories you assigned, in a Shopping Experiences element","features":"Content Articles\nContent Article Overview\nContent Article Categories\nContent Article Navigation A-Z (Wiki)\nContent Article Navigation by Category"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163710,"bookingKey":"swkwe16440165527","bookingText":"Content Manager | CMS | Blog | Wiki | Magazin | Zentrale Verwaltung aller Inhalte","price":349.99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":163709,"bookingKey":"swkwe16440165527_M","bookingText":"Content Manager | CMS | Blog | Wiki | Magazin | Zentrale Verwaltung aller Inhalte","price":34.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbAPwy1","preview":true,"priority":0,"id":69508},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpckK7Jj","preview":false,"priority":8,"id":69468},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpD1UIZg","preview":false,"priority":7,"id":69518},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2j4t6a","preview":false,"priority":6,"id":69514},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFH7ms3","preview":false,"priority":5,"id":69511},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbFjJl4","preview":false,"priority":5,"id":69513},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcWqdrq","preview":false,"priority":4,"id":69510},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOxICcX","preview":false,"priority":3,"id":69509},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppolIpV","preview":false,"priority":0,"id":69512}],"comments":[{"authorName":"Stephan Franck","text":"Im Shopware 6 Standard fehlt leider die Möglichkeit eine Art blog oder ähnlichen mit eigenem Listing aufzubauen. Dieses plugin schließt diese Lücke und ist zusätzlich auch sehr flexibel. Ob man hier einen Blog oder ein Downloadarchiv oder etwas ganz anderes machen möchte, mit dem Content Manager gar kein Problem. Der Support ist sehr kompetent und reagiert schnell und sehr kompetent.\n\nDanke dafür und weiter so","headline":"Eine Super erweiterung des Shopware standard Content","creationDate":{"date":"2021-08-13 11:58:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Victoria Stelter","text":"Für unseren neu erstellten Ratgeberbereich (Infoartikel für unsere Kunden) fehlte uns Shopware seitig eine vollumfängliche Funktion. Zwar kann man einzelne Landingpages erstellen, diese konnten wir aber nicht als Blogbereich / Ratgeberbereich dynamisch zusammenfassen. \n\nMit dem Content Manager Plugin konnten wir nun einen kompletten Ratgeberbereich samt eigenständiger Navigation aufbauen. So können wir die Artikel in verschiedene Themenbereiche clustern (Definitionen, Materialien und Tipps &amp; Tricks) und ansehnlich mit Snippets und Vorschaubilder für die Kunden anteasern. \nDie Anwendung im Backend ist deutlich übersichtlicher, als die regulären Erlebniswelten von Shopware selbst. \n\nSupportanfragen wurden schnell beantwortet und effizient gelöst. \nAlso eine klare Empfehlung für alle die mehr Struktur und Übersichtlichkeit im Shop benötigen :)","headline":"Top Content Manager für einen Ratgeberbereich","creationDate":{"date":"2021-07-29 13:24:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Content Manager | CMS | Blog | Wiki","description":"<p>Erweitern Sie Ihren Online-Shop (Shopware 6) um <strong>informative Darstellungen mit Texten und Bildern</strong>, um Ihre Kunden über relevante Themen zu informieren und neue Kunden zu gewinnen! Dieses Content Manager Plugin macht es Ihnen leicht, diese zu erstellen, zu kategorisieren, zu organisieren und später zeitsparend zu pflegen und weiterzuentwickeln.</p>\n<h2>Die Artikel</h2>\n<h3>Die Ansicht im Storefront</h3>\n<p>Die Benutzer:innen Ihrer Webseite sehen dazu die Artikel-Boxen. Diese sind ähnlich zu den Produkt-Boxen, in denen Ihre Produkte normalerweise präsentiert werden. Eine typische Artikel-Box besteht aus einem Bild, einer Überschrift, einem kurzen Text und einem Link. Sie ist eine Vorschau auf einen Artikel, den Sie dann über den Link erreichen.</p>\n<p>Die Artikel-Detail Seite können Sie anhand der Erlebniswelten-Elemente, die Sie kennen, in ihrem Online-Shop erstellen.</p>\n<p>Mit unserer Erweiterung können Sie all diese Bestandteile übersichtlich einpflegen und gliedern.</p>\n<h3>Übersicht über die Artikel</h3>\n<p>Eine Übersicht über Ihre Artikel können Sie in der Menüleiste der Administration in einem zusätzlichen Unterpunkt \"Content Manager\" des Punktes \"Inhalte\" sehen und durchsuchen.</p>\n<h3>Suchmaschinenoptimierung</h3>\n<p>Damit Sie über die Artikel neue Kunden gewinnen können, bietet das Plugin auch die Möglichkeit, die Artikel für Suchmaschinen zu optimieren (SEO für Meta-Title, Meta-Description, Meta-Keywords, und die im folgenden beschriebene Kategorisierung).</p>\n<h2>Die Kategorien</h2>\n<p>Die Erweiterung erlaubt Ihnen, diese inhaltlichen Artikel einer oder mehreren Kategorien zuzuweisen.</p>\n<p>Dies hilft Ihren Kund:innen, schneller zu relevanten Artikeln zu navigieren und es hilft Ihnen, die Artikel übersichtlich zu verwalten. Es ist auch ein wichtiges Werkzeug für Ihre Suchmaschinenoptimierung (Link-Struktur).</p>\n<h2>Die Navigationen</h2>\n<p>Sie können für Ihre Benutzer:innen an beliebigen Stellen Navigationselemente für die Artikel einrichten:</p>\n<h3>A-Z Navigation</h3>\n<p>Mit dem Erlebniswelten-Element \"Artikel A-Z Navigation\" können Sie eine A-Z (Wiki) Navigation anzeigen lassen. Dort sieht man, wenn man auf die Buchstaben klickt, die dazu passenden Artikel in einem Dropdown.</p>\n<h3>Navigation über Kategorien</h3>\n<p>Das \"Kategorie Navigation\" Element erlaubt Ihren Benutzern leichten Zugang zu den Artikeln über die Kategorien, die Sie zugewiesen haben. Somit können Sie sehr viele Beiträge übersichtlich darstellen. Dies funktioniert analog zu den normalen Shopware Produkt-Kategorien.</p>\n<h2>Roadmap – mögliche Weiterentwicklungen</h2>\n<ul>\n<li>Den Zeitraum der Anzeige eines Artikels einstellen</li>\n<li>Die Anzeige von inhaltlichen Artikeln in der Suchfunktion der Shopware</li>\n<li>Automatische Keyword-Verlinkung von Artikeln in Texten der Produktbeschreibung</li>\n<li>Kommentar-Funktion für Artikel</li>\n<li>Erlebniswelten-Element: Artikel Box</li>\n<li>Erlebniswelten-Element: Artikel Slider</li>\n<li>Erlebniswelten-Element: Inhaltsverzeichnis</li>\n</ul>\n<p>Wir nehmen auch gerne Aufträge für die Umsetzung einzelner Punkte entgegen.</p>\n<p>Schreiben Sie uns auch gerne, wenn Sie Vorschläge zur Erweiterung des Plugins haben.</p>","installationManual":"<h2>tl;dr</h2>\n<ul>\n<li>Kategorie \"Content-Manager-Kategorie\" Layout zuweisen.</li>\n<li>Unter \"Inhalte -&gt; Content-Manager\" Artikel anlegen, Titel vergeben, Erlebniswelten Layout anwählen, Inhalte pflegen und sonstige erwünschte Felder befüllen.</li>\n<li>Artikel einer Kategorie zuweisen - entweder vom Artikel aus oder aus der Kategorie heraus.</li>\n</ul>\n<h2>Content-Manager Kategorien</h2>\n<p>Um eine Content-Manager-Kategorie zu definieren, können Sie ganz einfach einer normalen Kategorie ein Erlebniswelten-Layout mit dem Element \"Content Manager Kategorie\" zuordnen. Sobald Sie dies gemacht haben, können Sie dieser Kategorie die gewünschten Content-Manager-Artikel zuweisen.</p>\n<p>Das Layout können Sie dabei auch duplizieren und nach Ihren Wünschen anpassen. Alternativ können Sie auch ein neues Layout erstellen von dem Typ \"Content Manager Kategorie\".</p>\n<p>Sie können auch Unterkategorien anlegen, welchen dasselbe Layout zugewiesen werden kann.</p>\n<h2>Content Manager Artikel</h2>\n<ol>\n<li>Unter \"Inhalte -&gt; Content Manager\" können Sie über den Button \"Neuen Artikel anlegen\" einen neuen Content Manager Artikel anlegen.</li>\n<li>In der Box \"Allgemeine Einstellungen\", vergeben Sie einen passenden \"Titel\" für den Beitrag, befüllen wenn erwünscht das Feld \"Inhalte\", stellen ein, wann der Beitrag veröffentlicht werden soll und setzen diesen auf \"Aktiv\".\n<ul>\n<li>Das Feld \"Inhalt\" wird ausgegraut, wenn Sie ein Erlebniswelten-Layout ausgewählt haben, welches keine Datenzuordnung mit swkweb_content_manager_article.content hat.</li>\n</ul>\n</li>\n<li>In der Box \"Layout\" können Sie das Standard-Layout \"Content-Manager-Artikel\" auswählen. Sie können es auch duplizieren und nach Ihren Wünschen anpassen. Sie können auch ein ganz normales Erlebniswelten-Layout auswählen.</li>\n<li>In der Box \"Zuweisung\" können Sie eine oder mehrere Kategorien zuweisen und Verkaufskanäle auswählen. Sofern Sie die \"Sichtbarkeit\"-Einstellung leer lassen, wird der Beitrag nicht ausgegeben.</li>\n<li>In der Box \"Zusätzliche Einstellungen\" können Sie ein Hauptbild auswählen, welches in der Content-Manager-Kategorie (Listing) gezeigt wird. An dieser Stelle gibt es auch das Feld \"Kurzbeschreibung\", welches für die Content-Manager-Kategorien verwendet wird.</li>\n<li>Bei \"SEO\" können Sie für die Suchmaschinenoptimierung die SEO-Standardeinstellungen \"Meta-Titel\", \"Meta-Beschreibung\" und \"Meta-Keywords\" vornehmen.</li>\n<li>Unter \"SEO URLs\" können Sie Hauptkategorien für die URL-Struktur bestimmen.</li>\n</ol>\n<p>In dem Tab \"Inhalte\" können Sie wie gewohnt, analog zu den normalen Kategorien, die Inhalte des Content Manager Artikels eintragen.</p>\n<h2>Content Manager SEO URL Struktur</h2>\n<p>Bei \"Einstellungen -&gt; Shop -&gt; SEO\" können Sie die URL-Struktur der Artikel bestimmen. Nach dem Ändern der URL-Struktur sollten Sie die Indizes neu generieren und den Cache leeren.</p>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"<p>- Compatibility: Shopware 6.5.3</p><p>- Bugfix: Sort articles for each letter alphabetically in glossary and alphabet navigation</p>","creationDate":{"date":"2023-07-07 10:41:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>- Compatibility: Shopware 6.5</p>","creationDate":{"date":"2023-06-20 15:25:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>- Bugfix: Sort articles for each letter alphabetically in glossary and alphabet navigation</p>","creationDate":{"date":"2023-07-07 10:39:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>- Feature: Add glossary shopping experience element</p><p>- Feature: Allow to sort the articles in the category listing element</p><p>- Feature: Allow to define an alternative letter for the alphabet navigation and glossary element</p><p>- Bugfix: Correct deactivation of shopping experience elements in the administration</p><p>- Bugfix: The input of the linkwords filter may be `null`</p>","creationDate":{"date":"2023-06-07 20:40:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p>- Bugfix: Add missing snippet for `base.link.swkweb_content_manager_article`</p><p>- Bugfix: JavaScript error which prevented the change of the layout type starting Shopware 6.4.18</p>","creationDate":{"date":"2023-05-16 16:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>- Feature: Add possibility to specify linkwords using a TWIG filter</p><p>- Feature: Add possibility to enable the linkwords for the product description</p><p>- Feature: Add Shopware 5 migration</p><p>- Feature: Allow to link to content manager articles from the text editor</p><p>- Feature: Add possibility to link to a content manager article from an internal category link</p><p>- Feature: Add controller action for loading articles using XHR, e.g. for modals</p><p>- Compatibility: Show content manager articles in the preview of SwagPublisher of the listing element</p><p>- Bugfix: Remove article product assignment tables on uninstall</p><p>- Bugfix: Only generate SEO URLs for articles which are active and for assigned sales channels</p><p>- Bugfix: Set the active category id on the article detail page</p><p>- Bugfix: Show content manager navigation if not all parent categories are of the type content manager listing</p>","creationDate":{"date":"2023-03-30 22:42:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>- Bugfix: Administration article listing without assigned layout</p>","creationDate":{"date":"2022-05-12 14:50:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- Feature: Added the possibility to assign content manager articles to products and vice versa and display them using slider elements in custom layouts</p><p>- Feature: Added \"Content Manager articles\" as source for the product slider if used in a content manager layout</p><p>- Feature: Added new CMS element \"Article slider\" which can be used to display articles on a product page</p><p>- Feature: Add \"Layout\"-column in content manger article overview</p><p>- Feature: Added events `Swkweb\\ContentManager\\Storefront\\Page\\ContentManager\\Article\\ArticlePageCriteriaEvent` and `Swkweb\\ContentManager\\Storefront\\Page\\ContentManager\\Article\\ArticlePageLoadedEvent`</p><p></p><p>- Compatibility: Rebuild JavaScript for Shopware 6.4.10 compatibility</p>","creationDate":{"date":"2022-05-02 20:04:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- Bugfix: Correct format in administration of default publication date</p>","creationDate":{"date":"2022-03-05 15:38:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Feature: Display full category path of articles in the administration listing</p><p>- Feature: Add noindex option for content manager articles</p><p>- Bugfix: Correct offset calculation of the sitemap URL provider</p>","creationDate":{"date":"2022-02-02 16:07:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Feature: Make Content Manager articles available in the storefront API</p><p>- Bugfix: Correct handling of listing pagination in combination with the cached route</p><p>- Bugfix: Allow configuring the thumbnails for the default Content Manager media folder</p><p>- Bugfix: Remove \"size\"-attribute of listing thumbnails of Content Manager articles, for compatibility with full width shopping experiences layouts</p>","creationDate":{"date":"2021-12-05 12:22:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First Shopware 6 release</p>","creationDate":{"date":"2021-07-18 13:48:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=swkwe16440165527","redirectToStore":false,"lowestPriceValue":34.99}