{"id":10715,"name":"EnnoTabsAdvanced","code":"Enno460187619677","lastChange":{"date":"2023-07-18 11:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRxF54h","examplePageUrl":"","moduleKey":"EnnoTabsAdvanced","creationDate":{"date":"2020-01-10 12:14:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-05-25 15:59:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-05-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-11-16 17:11:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":113,"prefix":"Enno","name":"enno.digital","website":"//www.enno.digital","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod113_ennodigital-e.png"},"infos":[{"id":16726,"name":"Tabs Advanced - Alle Tabs zentral verwalten","description":"<p><b>Die ultimative Detailseiten-Tab-App - Geballte Power in einer einzigen App vereint:</b>&nbsp;Mit Hilfe dieser App können sie die Tabs, die auf der Artikeldetailseite angezeigt werden, komplett bearbeiten. Sie können die Standard Tabs verändern oder auch zusätzliche hinzufügen. Nach der Installation werden im Frontend die Standard Tabs von Shopware angezeigt. Weitere Details finden Sie in den Highlights, den Features und in der Installationsanleitung.</p><p>Nutzen Sie bspw. die Bewertungen der Trusted Shops Integration? Sollten Sie Tabs anderer Apps verwalten wollen, dann können Sie die Template-Datei ab Version 1.1.0&nbsp;ganz einfach mit einem relativen Pfad integrieren. Mehr dazu in der Installationsanleitung!</p><p><b>Neue Tabs Advanced Erweiterung: Produkt-Detailseite Layout-Zuweisung:</b>&nbsp;<a href=\"https://store.shopware.com/enno762260454564/tabs-advanced-erweiterung-produkt-detailseite-layout-zuweisung.html\" target=\"_blank\" rel=\"noreferrer\">https://store.shopware.com/enno762260454564/tabs-advanced-erweiterung-produkt-detailseite-layout-zuweisung.html</a></p><p><b>Neue&nbsp;Tabs Advanced Erweiterung: Anker Tabs mit Sprungmarken:</b>&nbsp;<a href=\"https://store.shopware.com/enno910204610972/tabs-advanced-erweiterung-anker-tabs-mit-sprungmarken.html\" target=\"_blank\" rel=\"noreferrer\">https://store.shopware.com/enno910204610972/tabs-advanced-erweiterung-anker-tabs-mit-sprungmarken.html</a></p><h3>Kontakt und Support<br></h3><p>Bei Fragen und Problemen besuchen Sie&nbsp;<a href=\"https://enno.help/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://enno.help/</a></p>","installationManual":"<p>Informationen zur Installation und Einrichtungen finden sie auf&nbsp;<a href=\"https://enno.help/docs/tabs-advanced-alle-tabs-zentral-verwalten/installationsanleitung-2/\" target=\"_blank\" rel=\"noreferrer\">enno.help</a></p>","shortDescription":"Alle Tabs zentral verwalten. Ausgabe von Zusatzfeldern, Herstellerinfos oder Eigenschaften. Alle Tabs frei benennbar inkl. Tab-Sortierung und Blacklist/Whitelist für Kategorien/Artikel","highlights":"Zentrale Verwaltung von Tabs: Bei 1000 Artikeln eine zentrale Änderung statt 1000 Änderungen\nTab für Millionen von Artikeln in unter 30 Sekunden anlegen\nAlle Tabs beliebig sortierbar bzw. beliebig ein- und ausblendbar\nHerstellerausgabe inkl. Herstellerbeschreibung und Herstellerbild sowie Benennung des Tabs mit einheitlicher Beschriftung oder dem Namen des Herstellers\nBlacklist/Whitelist System: Zeigen Sie Tabs nur für bestimmte Kategorien oder Artikel an","features":"Aktivieren/Deaktivieren von Tabs\nTabs nur für bestimmte Verkaufskanäle/Storefronts anzeigen lassen\nNeue Tabs hinzufügen und vorhandene Tabs löschen \nJeder Tab kann frei benannt und sortiert werden\nStandard Shopware Inhalte (Artikelbeschreibung, Eigenschaften und Bewertungen) in einzelne Tabs auslagern oder auch gruppiert in Tabs anzeigen lassen\nStatischen Text plus Überschrift für alle (oder per Auswahl begrenzt bei) Artikeln anzeigen oder ausblenden\nAusgabe von Zusatzfeldern als Text oder Tabelle\nZusatzfelder Sortierbar innerhalb eines Tabs\nLeere Zusatzfelder können versteckt werden\nJeder Tab kann für sich auf Kategorien/Artikel beschränkt oder aber auch nur für bestimmte Kategorien/Artikel ausgeblendet werden (Blacklist / Whitelist)\nTemplate Dateien angeben, um den Inhalt bzw. die Ausgabe komplett selbst zu gestalten\nHerstellerausgabe inkl. Herstellerbeschreibung und Herstellerbild sowie Benennung des Tabs mit einheitlicher Beschriftung oder dem Namen des Herstellers\nAusgabe der Cross-Sellings rechts neben den anderen Tabs\nApp Konfiguration hinzugefügt um Template Kompatibilität mit anderen Apps zu ermöglichen - bspw. \"Trusted Shops Produktbewertungen\"\nKompatibilitätsmodus für \"Shopware Blöcke\" - die Einstellung sorgt nur dafür, dass man sich an die Shopware Standard-Blöcke wieder anhängen kann und Fremd-Apps mit Tabs Advanced koexistieren können"},{"id":18178,"name":"Tabs Advanced - Manage all tabs in one place","description":"<p><b>The ultimate detail page tab app- Concentrated power combined in a single app:</b>&nbsp;With the help of this app you can completely edit the tabs that are displayed on the item detail page. You can change the default tabs or add additional ones. After installation, Shopware's default tabs will be displayed in the frontend. More details can be found in the highlights, features and installation instructions.</p><p>For example, do you use the ratings of the Trusted Shops integration? Should you want to manage tabs of other apps, then you can easily integrate the template file from version 1.1.0&nbsp;with a relative path. More about this in the installation instructions!</p><p><b>New Tabs Advanced extension: product detail page layout assignment:</b>&nbsp;<a href=\"https://store.shopware.com/en/enno762260454564/tabs-advanced-extension-product-detail-page-layout-assignment.html\" target=\"_blank\" rel=\"noreferrer\">https://store.shopware.com/en/enno762260454564/tabs-advanced-extension-product-detail-page-layout-assignment.html</a></p><p><b>New&nbsp;Tabs Advanced Extension: Anchor Tabs with Jump Marks:</b>&nbsp;<a href=\"https://store.shopware.com/en/enno910204610972/tabs-advanced-extension-anchor-tabs-with-jump-marks.html\" target=\"_blank\" rel=\"noreferrer\">https://store.shopware.com/en/enno910204610972/tabs-advanced-extension-anchor-tabs-with-jump-marks.html</a></p><h3>Contact and Support<br></h3><p>If you against expectation have problems with the installation then please contact us immediately. If you have any questions, change requests, criticism or suggestions, then please do not hesitate to contact us. We are happy to help you: service@enno.digital</p>","installationManual":"<p>The app can be installed quickly and easily via the extension manager.</p><p>In the frontend, the two default tabs \"Description\" and \"Ratings\" should be displayed after installation (tabs added by other apps should not be displayed now)</p><p>In the section \"Extensions\" -&gt; \"My extensions\" -&gt; \"Tabs Advanced\" ... \"Configuration\" (before 6.4 under: \"Settings -&gt; \"System\" -&gt; \"Plugins\" -&gt; \"Tabs Advanced\" ... \"Configuration\") -&gt; you have to activate the app for one or all sales channels (stores). There you will also find further settings (among others. the option for compatibility with other apps / \"Shopware blocks\")<br /></p><p>About \"Settings\" -&gt; \"Plugins\" -&gt; \"Tabs Advanced\" -&gt; you can then manage their tabs</p><p><b>Should you want to manage tabs of other apps, then you can easily integrate the template file with a relative path: </b></p><p>For the app \"Articlequestions for Shopware 6\" from Nimbits you have to enter<br /> the following. ./articlequestions/articlequestions.html.twig</p><p>For the reviews of the Trusted Shops integration the following must be entered<br />../review/ts-review.html.twig<br /></p><h3>From v1.1.0: New option \"Shopware Blocks\"</h3><p></p><p></p><p>This option is meant for app compatibilities. When this option is enabled, the default Shopware Tabs blocks will be included as empty blocks, allowing other apps to use them. Please note that this app must be in the loading order before the other apps. See https://docs.shopware.com/en/shopware-platform-dev-en/theme-guide/configuration#theme-template-inheritance</p><p><b>For explanation:</b> In the code for the Shopware template are so-called blocks built. Now some apps that want to append only one tab go and say \"append something behind this block\". But our app wants to manage all tabs and prevents that. The setting in our app just makes sure that you can still append back to these default blocks. So third party app tabs should be displayed again. The only downside to this option is that this unknown and diverse plethora of \"third-party tabs\" cannot be managed by our app, but are simply appended and displayed at the back. Everything that is added and/or managed by our app will then show up in the front of the tabs.</p>","shortDescription":"Manage all tabs centrally. Output of additional fields, manufacturer info or properties. All tabs freely nameable incl. tab sorting and blacklist/whitelist for categories/articles.","highlights":"Central management of tabs: For 1000 articles one central change instead of 1000 changes\nCreate tabs for millions of articles in less than 30 seconds\nAll tabs arbitrarily sortable or arbitrarily showable and hideable\nManufacturer output incl. manufacturer description and manufacturer picture as well as naming of the tab with uniform labeling or the name of the manufacturer\nBlacklist/Whitelist system: show tabs only for certain categories or articles","features":"Enable/disable tabs\nShow tabs only for specific sales channels/storefronts\nAdd new tabs\nDelete existing tabs \nEach tab can be freely named and sorted\nMove standard Shopware content (item description, properties, and ratings) to individual tabs or display it grouped in tabs\nShow or hide static text plus headline for all (or limited by selection for) articles\nOutput of additional fields as text or table\nAdditional fields can be sorted within a tab\nEmpty additional fields can be hidden\nEach tab can be limited to categories/articles or hidden only for certain categories/articles (blacklist/whitelist)\nSpecify template files to design the content or output completely by yourself\nManufacturer output incl. manufacturer description and manufacturer picture as well as naming of the tab with uniform labeling or the name of the manufacturer\napp configuration added to enable template compatibility with other apps - e.g. \"Trusted Shops Product Reviews\".\nCompatibility mode for \"Shopware blocks\" - the setting only ensures that you can reattach to the Shopware standard blocks and foreign apps can coexist with Tabs Advanced"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":159728,"bookingKey":"Enno460187619677","bookingText":"Tabs Advanced - Manage all tabs in one place","price":499,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":161923,"bookingKey":"Enno460187619677_M","bookingText":"Tabs Advanced - Manage all tabs in one place","price":49,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEDTGrY","preview":true,"priority":10,"id":53234},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvGU4oY","preview":false,"priority":8,"id":53235},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIdlF45","preview":false,"priority":6,"id":53237},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVFdJBW","preview":false,"priority":4,"id":53232},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4XkqkY","preview":false,"priority":0,"id":53233},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpl7Y2TB","preview":false,"priority":0,"id":73705}],"comments":[{"authorName":"Carsten Raukohl","text":"Super umfangreiches Plugin mit vielen Einstellungsmöglichkeiten. Wie hier schon oft geschrieben gibt es kein Plugin für Tabs, das mehr kann. Auch der Support ist sehr hilfreich und es werden immer wieder neue Funktionen implementiert oder alte verbessert.","headline":"Sehr umfangreich und flexibles Tab Plugin","creationDate":{"date":"2022-01-11 12:21:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sebastian","text":"Dieses Plugin wurde vom Anbieter selbst in unserem Web-Shop installiert. Seit mehreren Monaten erfüllt es zuverlässig seine Aufgabe. Auch die Einstellung der Erweiterung im Backend bereitet uns keinerlei Probleme.","headline":"Funktioniert einwandfrei!","creationDate":{"date":"2021-12-16 10:05:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marc M.","text":"SW6 Plugins für Tabs gibt es mittlerweile einige. Meist günstiger, lassen sich mit diesen Plugins aber immer nur Teilbereiche der Tabs steuern. Irgendwas fehlt immer. \n\nAus meiner Sicht ist Tabs Advanced absolut seinen Preis wert. Denn hier wird die bislang umfassendste Lösung geboten, man kann wirklich Dinge anstellen, die woanders nicht annähernd möglich wären.  \n\nFür uns auch sehr wichtig: Bei langen Artikelbeschreibungen ist der Shopware-Standard mit den unter der Beschreibung befindlichen Cross-Selling-Artikeln nicht zu gebrauchen. Über Tabs Advanced lassen sich auch die Cross-Selling-Artikel mühelos und sauber über die Tabs darstellen.\n\nHinzu kommt die ultraschnelle Anlagemöglichkeit von Tabs für eine Vielzahl von Artikeln sowie der schnelle und freundliche Support.\n\nAlso: Am besten mal testen ;-)","headline":"Bestes Plugin für Tab Steuerung","creationDate":{"date":"2021-10-19 23:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Energyvital Naturprodukte","text":"Das Tab ist extrem universell einsetzbar. Besonders genial: Jede Information kann nach Kategorie in eigenen Zusatzfeldern gespeichert werden, die dann auch für die Datenanbindung z.B. an Amazon oder Ebaytemplates genutzt werden können.\nMan kann jede beliebige Info in jeder beliebigen Reihenfolge anzeigen lassen.\nGleichzeitig kann man weiterhin alles Infos in der hergebrachten Weise im Hauptbeschreibungsfeld belassen, z.B. für Plugins, die nur dieses nutzen können, wie z.B. für PDFs. Dieser Tab wird dann unsichtbar geschaltet und ist in der Front nicht mehr zu sehen.\nDer Hersteller ist sehr offen für Verbesserungsvorschläge und setzt die sehr schnell um.\nFür unser Shopdesign absolut unentbehrlich geworden. Und falls doch mal was schief geht z.B. bei einem Update und es mal ein paar Tage nicht funktioniert, können wir mit einem Klick das Plugin deaktivieren, dann wird sofort wieder das normale Haupttab sichtbar. Auch bei Deinstallation z.B. wegen größeren Arbeiten am Shop gehen die Daten nicht verloren, da sie nicht wie bei anderen Plugins in Plugininternen Feldern gespeichert sind, sondern in Shopwareeigenen Zusatzfeldern.\nWir haben etliche Plugins für Tabs ausprobiert in den letzten Jahren, sowohl für SW5 als auch SW6 und kommen zu dem Schluß, dass dies das beste Plugin ist, und zwar nicht mit kleinem Abstand zum zweitbesten, sondern mit sehr großem.","headline":"Bestes Tab-Plugin ever!","creationDate":{"date":"2020-12-15 23:51:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sebastian","text":"Das Tabs Plugin hat mich wirklich überrascht, denn es ist nicht nur flexibel einsetzbar, sondern vereinfacht mir die Arbeit um ein Vielfaches. Wenn die Zusatzfelder einmal angelegt und zugewiesen sind, dann kann ich diese entweder einzeln oder gesammelt bei meinen Artikeln ausgeben und diese dann auch noch sortieren. Durch das neuste Update ist jetzt auch noch eine Unterstützung für Plugins von anderen Herstellern dazu gekommen, bspw. Trusted Shops Produktbewertungen. Ich bin begeistert!","headline":"Preis-Leistung sehr gut - stetige Weiterentwicklung","creationDate":{"date":"2020-10-16 15:43:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Tabs Advanced - Alle Tabs zentral verwalten","description":"<p><b>Die ultimative Detailseiten-Tab-App - Geballte Power in einer einzigen App vereint:</b> Mit Hilfe dieser App können sie die Tabs, die auf der Artikeldetailseite angezeigt werden, komplett bearbeiten. Sie können die Standard Tabs verändern oder auch zusätzliche hinzufügen. Nach der Installation werden im Frontend die Standard Tabs von Shopware angezeigt. Weitere Details finden Sie in den Highlights, den Features und in der Installationsanleitung.</p><p>Nutzen Sie bspw. die Bewertungen der Trusted Shops Integration? Sollten Sie Tabs anderer Apps verwalten wollen, dann können Sie die Template-Datei ab Version 1.1.0 ganz einfach mit einem relativen Pfad integrieren. Mehr dazu in der Installationsanleitung!</p><p><b>Neue Tabs Advanced Erweiterung: Produkt-Detailseite Layout-Zuweisung:</b> <a href=\"https://store.shopware.com/enno762260454564/tabs-advanced-erweiterung-produkt-detailseite-layout-zuweisung.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://store.shopware.com/enno762260454564/tabs-advanced-erweiterung-produkt-detailseite-layout-zuweisung.html</a></p><p><b>Neue Tabs Advanced Erweiterung: Anker Tabs mit Sprungmarken:</b> <a href=\"https://store.shopware.com/enno910204610972/tabs-advanced-erweiterung-anker-tabs-mit-sprungmarken.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://store.shopware.com/enno910204610972/tabs-advanced-erweiterung-anker-tabs-mit-sprungmarken.html</a></p><h3>Kontakt und Support<br /></h3><p>Bei Fragen und Problemen besuchen Sie <a href=\"https://enno.help/\" target=\"_blank\" rel=\"noreferrer noopener\">https://enno.help/</a></p>","installationManual":"<p>Informationen zur Installation und Einrichtungen finden sie auf <a href=\"https://enno.help/docs/tabs-advanced-alle-tabs-zentral-verwalten/installationsanleitung-2/\" target=\"_blank\" rel=\"noreferrer noopener\">enno.help</a></p>","version":"1.4.0","changelog":[{"version":"1.4.0","text":"<p>- Compatibility adjustment for Shopware 6.5.0</p>","creationDate":{"date":"2023-05-11 16:05:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.8","text":"<p>- Improvements in the product selection</p><p>- Bug fixed: Memory limit overrun in storefront when product selection is too large</p>","creationDate":{"date":"2022-08-02 12:01:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"<p> - Template improvements</p>","creationDate":{"date":"2022-04-25 13:26:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"<p>- Compatibility adjustment for Shopware 6.4.10</p>","creationDate":{"date":"2022-04-06 13:37:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"<p> - Compatibility adjustment for custom fields of type select / entity</p>","creationDate":{"date":"2022-03-14 14:14:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<p>- Bug fixed: Display of cross-selling in the mobile view corrected</p>","creationDate":{"date":"2021-10-14 11:59:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<p>- Compatibility adjustment for PHP 8</p><p>- New feature: Added option to show the cross-sellings beside the other tabs</p>","creationDate":{"date":"2021-10-13 09:47:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>- Adjustments for \"Tabs extension product layout\"</p>","creationDate":{"date":"2021-08-31 13:05:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p>- Bug fixed: In Shopware 6.4 development environments the \"executeQuery\" error no longer appears</p>","creationDate":{"date":"2021-06-08 09:45:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>- Compatibility adjustment for Shopware 6.4.0</p>","creationDate":{"date":"2021-05-06 12:20:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>- Bug fixed (concerns only dev environments): No more errors are thrown for untranslated custom fields</p>","creationDate":{"date":"2021-03-01 10:23:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- New feature: Tabs can now be assigned to individual articles or also excluded from them</p>","creationDate":{"date":"2020-12-14 14:00:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>- Bug fixed: Empty custom fields of type Media do not generate errors in tables anymore<br /></p>","creationDate":{"date":"2020-12-07 13:19:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- New feature: Additional fields of type Media are now supported as downloads<br /></p><p>- Bug fixed: Deleted additional fields caused an error if they were still assigned to the tab</p><p>- Bug fixed: Disabled tabs are no longer displayed in the storefront</p>","creationDate":{"date":"2020-10-06 14:05:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- New feature: Template files can now be stored with relative path</p><p>- New feature: Added plugin configuration to enable template compatibility with other plugins</p>","creationDate":{"date":"2020-09-28 13:25:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>- Bug fixed: Manufacturer tabs for products without manufacturer no longer throw an error message</p><p>- Bug fixed: Plugin configuration for single subshops are supported correctly again</p>","creationDate":{"date":"2020-09-28 11:23:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>- New feature: The field \"Product custom fields\" now only lists custom fields that belong to products</p><p>- Bug fixed: Now more than 25 custom fields are loaded in the selection (maximum is 500 due to Shopware limitation)</p>","creationDate":{"date":"2020-09-11 11:21:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- New feature: Custom fields are now displayed alphabetically in the administration area</p>","creationDate":{"date":"2020-09-08 11:35:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- Compatibility adjustment for Shopware 6.3.0</p>","creationDate":{"date":"2020-08-10 11:51:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- Bug fixed: Error in language shops fixed</p>","creationDate":{"date":"2020-08-03 11:06:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- Bug fixed: HTML elements in the \"Content\" field are now saved correctly again</p>","creationDate":{"date":"2020-07-23 10:42:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- New feature: Manufacturer information can now be displayed</p><p>- New feature: Added Option to hide the headlines of description properties and custom fields</p><p>- New feature: Show empty custom fields in table</p><p>- New feature: Possibility to change the default sorting of the areas within a tab</p>","creationDate":{"date":"2020-07-21 09:17:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- New Feature: Custom fields in tabs are now sorted by their position value</p>","creationDate":{"date":"2020-07-16 14:53:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Bug fixed: Output of HTML from custom fields is now poss</p>","creationDate":{"date":"2020-06-15 13:43:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First release to Shopware Community Store</p>","creationDate":{"date":"2020-04-29 17:14:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Enno460187619677","redirectToStore":false,"lowestPriceValue":49}