{"id":11294,"name":"AcrisSeoProfessionalCS","code":"acris64942382445","lastChange":{"date":"2023-07-18 19:10:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplaSt71","examplePageUrl":"","moduleKey":"AcrisSeoProfessionalCS","creationDate":{"date":"2020-03-20 10:03:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-05-25 08:15:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-03-24 10:36:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":17684,"name":"SEO Tools für SEO Professionals","description":"<p>SEO Tools ist eine Sammlung von Tools für Profi für Ihren Shopware Shop. Durch automatisierte Einstellungen erhöhen Sie Ranking, Sichtbarkeit und CTR sowohl bei den Artikeln wie auch bei den Kategorien.</p><p><br></p><h2>Anleitung:</h2><p><a href=\"https://www.acris-ecommerce.at/shopware_6_plugins/acris_seo_tool/Doku-SW6-ACRIS-SEO-Tool-V01_DE.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Benutzerdokumentation (PDF)</a></p><h2><br></h2><h2>Funktionen:</h2><p><br></p><h2>Snippets</h2><p>Als Snippet bezeichnet man die Vorschau des Inhalts einer Webseite in den Suchergebnissen. Die Snippets werden aus dem Title und der Description entnommen und in der Suchergebnisliste (SERP) dargestellt. Je mehr Informationen Title und Description enthalten, desto besser kann Google auf diese Informationen zugreifen. Die CTR (Click-Through-Rate) auf einen Artikel oder eine Kategorie wird erhöht, wenn ein <b>Call to Action</b> und <b>Sonderzeichen</b> in den Snippets enthalten ist. Beides kann Title und Description automatisch zugewiesen werden. <br></p><p><br></p><ul><li><strong>Call to Action</strong><br>Ein Call to Action ist eine Aufforderung eine bestimmte Handlung zu setzen. Bei Onlineshops sind dies meist Kaufimpulse (z.B.: jetzt günstig kaufen / sofort preiswert bestellen / versandkostenfrei kaufen /usw.). Ein „Call to Action“ erhöht bei potenziellen Kunden nachweislich die Bereitschaft auf ein Suchergebnis zu klicken. </li></ul><p></p><ul><li><strong>Sonderzeichen</strong><br>Sie haben bestimmt schon öfter die großen Pfeile oder Häkchen in den Suchergebnissen gesehen. Diese Sonderzeichen erregen mehr Aufmerksamkeit als reiner Text und zwingen den Suchenden sich darauf zu fokussieren.</li></ul><p></p><ul><li><strong>Variable</strong><br>In Title und Description lassen sich weitere Shopvariablen wie z.B. Lagerstand, Preis oder Hersteller implementieren.</li></ul><p></p><ul><li><strong>Vorlagen</strong><br>Nach der Installation befinden sich schon jeweils zehn vorgefertigte Snippet Vorlagen für Artikel und Kategorien in der Administration. Dort können dann neue Vorlagen erstellt oder die bestehenden verändert werden. Für jeden Artikel und jede Kategorie lassen sich dann auch noch individuelle Snippets erstellen. </li></ul><p></p><ul><li><strong>Vorschau</strong><br>Eine Vorschau, die den Ergebnissen bei Google gleicht, erleichtert das Anlegen der Snippets.</li></ul><p></p><h3><br></h3><h3>Redirect URL inkl. Zähler, wie oft dir Redirects genutzt wurden<br></h3><p>Mit diesem Plugin können Sie SEO konforme URL Weiterleitungen mit 301 oder 302 Statuscode in der Shopware Administration einfach anlegen und verwalten.</p><p>Ab sofort werden die genutzten Redirects gezählt. (Die Anzahl der Weiterleitungen, die Zeit der letzten Weiterleitung und \nder letzte Referer wurden zur Acris SEO Weiterleitungstabelle \nhinzugefügt. (ab Version 3.2.x))<br><br></p><h3>Import / Export Funktion</h3><p>Ein Import / Export von Redirects ist möglich - dazu liefern wir ein entsprechendes Profil für den Shopware Import / Export.<br></p><p><br></p><h3>SEO-Redirects über Regular Expressions zu definieren.</h3><p>Eine Regular Expression (oder Regex) ist eine Gruppe von Zeichen, die verwendet wird, um ein Muster innerhalb eines Textstücks zu finden.<br>Im Zusammenhang mit der Umleitung wird eine einfache URL-Übereinstimmung genau einer URL entsprechen. Eine Regex-URL kann mit vielen URLs übereinstimmen. <br>Zusätzlich zur Übereinstimmung mit vielen URLs kann ein regulärer Ausdruck Informationen aus der Quell-URL extrahieren und in die Ziel-URL kopieren.</p><p>Ein Beispiel zum besseren Verständnis:</p><p> Eine Weiterleitung mit der Quell-URL /meine-url wird immer nur mit Anfragen für /meine-url übereinstimmen.<br>Eine Weiterleitung mit der Quell-URL /meine-url/.* passt zu Anfragen für:<br>&nbsp;&nbsp;&nbsp; /meine-url/a<br>&nbsp;&nbsp;&nbsp; /meine-url/b<br>Und so weiter.<br><br>Der wichtige Teil von /meine-url/.* ist .*. Dies ist der Teil des regulären Ausdrucks der URL und ist gleichbedeutend mit der Aufforderung \"nimm /meine-url/ gefolgt von einer beliebigen Zeichenfolge\".<br>Auch wenn dies für eine Viezahl an Weiterleitungen sehr hilfreich ist, ist dieses Feature eher für Fortgeschrittene gedacht, da die Erstellung dieser Regular Expressions weitere Kenntnisse voraussetzt. Es müssen aber keine Regular Expressions für die Weiterleitungen genutzt werden, es können weiterhin Redirects mit genauer Übereinstimmng der URL verwendet werden. Falls beide Varianten für eine URL hinterlegt sind, wird immer zuerst nach genauen Übereinstimmungen für eine \nWeiterleitungen gesucht. Wird keine genaue Übereinstimmung gefunden, \nwerden im zweiten Schritt Regular Expressions geprüft. <br></p><p>Eine Hilfestellung zu den Regular Expressions inkl. Link zu einer Anleitung und einem Cheat-Sheet ist im Shopware Admin Bereich bei den Redirects zu finden. </p><p><br></p><p></p><h3><br></h3><h3>JSON LD Rich Snippets</h3><p>Rich Snippets im JSON-LD Format an Google übergeben. Rich Snippets sind eine besondere Form der Snippet. Mit ihnen werden relevante Informationen an Google übergeben. Wenn Sie in den Suchergebnisse den Lagerstand und den Preis eines Produktes sehen, dann wurden diese Daten mit Rich Snippets übergeben. In Shopware 6 ist diese Funktion implementiert und die Rich Snippets werden mit Mikrodaten übergeben. W3C und Google empfehlen jedoch die Verwendung von JSON-LD. Mit dem Plugin ACRIS SEO Tools werden die Daten im JSON-LD Format übergeben. Sie sind daher für die Zukunft gerüstet.</p><p><br></p><p>Das Plugin SEO Tools von ACRIS bietet aber noch weitere Möglichkeiten. Durch Eingabe spezifischer Informationen über Ihre Branche und über Ihr Unternehmen lassen sich die Suchergebnisse bei Google noch weiter verfeinern. <br></p><p><br></p><p>Mit der Aktivierung der „Sitelinks Search Box“ geben Sie Google die Möglichkeit eine eigene Suche in der Suche anzuzeigen. Bei der „Sitelinks Search Box“ handelt es sich um eine Suchbox, die innerhalb eines Snippets in den Google SERPs erscheint. Nutzer können auf diese Weise direkt in der Suchergebnisliste auf der gewünschten Seite nach Inhalten suchen.</p><p><br></p><p>Natürlich gibt es keine Garantie, dass Google die Suchbox auch anzeigt. Sie schaffen lediglich die Möglichkeiten. Die letzte Entscheidung trägt immer der Algorithmus von Google. <br></p><p><br></p><h3>Robots Einstellungen<br></h3><p>Mit den Robots Einstellungen können Sie die \"Sichtbarkeit für Suchmaschinen\" definieren. So können Sie festlegen, ob Google einzelne Artikel oder einzelne Kategorien in den Index aufnehmen soll. Über den Bereich JSON LD Rich Snippets ist es auch möglich, den kompletten Shop für Google nicht indexierbar zu machen. <br></p><p><br></p><p></p><p></p>","installationManual":"<ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins\naufrufen</li><li>Das Plugin hochladen, installieren und aktivieren</li><li><p>Nach dem Aktivieren erreichen Sie das Plugin über: Einstellungen\n&gt; Plugins &gt; SEO Tools</p></li></ul>","shortDescription":"SEO Tools ist eine Sammlung für SEO-Profis ✔️ Durch automatisierte Einstellungen erhöhen Sie Ranking, Sichtbarkeit und CTR ✔️ sowohl bei den Artikeln als auch bei den Kategorien","highlights":"Wichtige SEO Grundlagen ganz einfach konfigurieren und auch Robots.txt Erstellung in der Plugin Konfiguration möglich\nErstellung von Produkt und Kategorie Snippets mit Vorlagen inkl Vorschau \nJSON LD Rich Snippets anlegen \nWeiterleitungen mit genauer Übereinstimmung der URL´s einrichten /AB VERSION 1.4.1: SEO-Redirects über Regular Expressions definierbar\nAnzahl der Weiterleitungen, die Zeit der letzten Weiterleitung und der letzte Referer wurden hinzugefügt.","features":"Erstellung einer Robots.txt (in den Plugineinstellungen)\nVorschau des Snippets\nVorgefertigte Snippet zur sofortigen Verwendung \nLeichte individuelle Anpassung der Snippets\nRedirect URL mit intuitiver Handhabung\nSEO-Redirects über Regular Expressions definieren (Ab Version 1.4.1)\nDie Anzahl der Weiterleitungen, die Zeit der letzten Weiterleitung und der letzte Referer wurden zur Acris SEO Weiterleitungstabelle hinzugefügt. (ab Version 3.2.x)\n\nAutomatische Ausgabe der JSON LD Rich Snippets\nRobots.txt erstellen (in der Plugin Konfiguration)\nEinfache umschalten zwischen \"NoIndex,NoFollow\" / \"Index,Follow\" - speziell wichtig, beim Aufbau des Webshops (in der Plugin Konfiguration)"},{"id":17685,"name":"SEO Tools","description":"<p>SEO Tools is your professional SEO tool for your Shopware shop. Automated settings increase the ranking, visibility and CTR for both the articles and the categories.</p><p><br /></p><h2>User guide</h2><p><a href=\"https://www.acris-ecommerce.at/shopware_6_plugins/acris_seo_tool/Doku-SW6-ACRIS-SEO-Tool-V01_EN.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Manual (PDF)</a></p><h2><br /></h2><h2>Functions</h2><p><br /></p><h2>Snippets</h2><p>A snippet is the preview of the content of a website in the search results. The snippets are taken from the title and description and displayed in the search result list (SERP). The more information contained in the title and description, the better Google can access this information. The CTR (click-through rate) on an article or category is increased if a call to action and special characters are included in the snippets. Both title and description can be assigned automatically.<br /></p><p><br /></p><ul><li><strong>Call to Action</strong><br />A call to action is a request to take a certain action. In the case of online shops, these are usually buying impulses (e.g. buy cheap now / order cheaply immediately / buy free of shipping costs / etc.). A “call to action” demonstrably increases the willingness of potential customers to click on a search result.<br /></li></ul><p> </p><ul><li><strong>Special Character</strong><br />You have probably seen the large arrows or ticks in the search results several times. These special characters attract more attention than plain text and force the searcher to focus on them.<br /></li></ul><p> </p><ul><li><strong>Variable</strong><br />Further shop variables such as Implement stock level, price or manufacturer.</li></ul><p> </p><ul><li><strong>Templates </strong><br />After installation, ten pre-made snippet templates for articles and categories are already in the administration. There new templates can be created or existing ones can be changed. Individual snippets can then be created for each article and each category.<br /></li></ul><p> </p><ul><li><strong>Preview</strong><br />A preview, which is similar to the results on Google, makes it easier to create the snippets.</li></ul><p> </p><h3>Redirect URL</h3><p>With this plugin you can easily create and manage SEO-compliant URL redirects with 301 or 302 status code in Shopware Administration.</p><p><b>NEW FEATURE FROM VERSION 1.4.1</b><br />As of version 1.4.1, this plugin allows you to define SEO redirects using Regular Expressions.<br /><br />A Regular Expression (or Regex) is a group of characters used to find a pattern within a piece of text.<br />In the context of redirects, a simple URL match will correspond to exactly one URL. A regex URL can match many URLs.<br />In addition to matching many URLs, a regular expression can extract information from the source URL and copy it into the destination URL.<br />An example for better understanding:<br />A redirect with the source URL /my-url will only ever match requests for /my-url.<br />A redirect with the source URL /meine-url/.* will match requests for:<br />    /meine-url/a<br />    /my-url/b<br />And so on.<br /><br />The important part of /my-url/.* is .*. This is the regular expression part of the URL and is equivalent to saying \"take /my-url/ followed by any string\".<br />Although this is very useful for a lot of redirects, this feature is more for advanced users, as creating these regular expressions requires further knowledge. But you don't have to use regular expressions for the redirects, you can still use redirects with an exact match of the URL. If both variants are stored for a URL, exact matches for a redirect are always searched for first. If no exact match is found, regular expressions are checked in the second step.<br />A guide to the regular expressions including a link to a manual and a cheat sheet can be found in the Shopware admin area at the redirects.<br /></p><p> </p><h3>JSON LD Rich Snippets</h3><p>Pass rich snippets to Google in JSON-LD format. Rich snippets are a special form of snippet. They are used to transfer relevant information to Google. If you see the stock level and the price of a product in the search results, then these data were passed with rich snippets. This function is implemented in Shopware 6 and the rich snippets are transferred with microdata. However, W3C and Google recommend using JSON-LD. With the ACRIS SEO Tools plugin, the data is transferred in JSON-LD format. You are therefore prepared for the future.<br /></p><p><br /></p><p>The SEO Tools plugin from ACRIS offers even more options. The search results on Google can be further refined by entering specific information about your industry and your company.</p><p><br /></p><p>By activating the \"Sitelinks Search Box\" you give Google the option of displaying your own search in the search. The \"Sitelinks Search Box\" is a search box that appears within a snippet in the Google SERPs. In this way, users can search for content directly in the search result list on the desired page.</p><p><br /></p><p>Of course, there is no guarantee that Google will also display the search box. You just create the possibilities. The final decision is always made by Google's algorithm.</p><p><br /></p><h3>Robots settings</h3><p>With the robots settings you can define the visibility for search engines. In this way, you can determine whether Google should include individual articles or individual categories in the index. With the JSON LD Rich Snippets section it is also possible to make the entire shop not indexable for Google.<br /></p><p> </p><p> </p>","installationManual":"<ul><li>Open the “Plugin Manager” via <b>Settings &gt; System &gt; Plugins</b></li></ul><ul><li><p>Upload the plugin install and activate</p></li><li><p>After\nactivation, you can reach the plugin via: Settings&gt; Plugins&gt; SEO Tools</p></li></ul>","shortDescription":"SEO Tools from ACRIS is your new professional SEO tool. Automated settings increase the ranking, visibility and CTR for both the articles and the categories.","highlights":"Configure important SEO basics easily\nLow effort due to automation\nCreate product and category snippets with templates incl. preview \nCreate JSON LD Rich Snippets \nSet up redirects with exact match of URLs /AB VERSION 1.4.1: SEO redirects definable via Regular Expressions","features":"Preview the snippet\nPre-made snippet for immediate use\nEasy customization of the snippets\nRedirect URL with intuitive handling\nDefine SEO redirects via Regular Expressions (From version 1.4.1)\nAutomatic output of the JSON LD Rich Snippets\nCreate Robots.txt (in the plugin configuration)\nEasily switch between \"NoIndex,NoFollow\" / \"Index,Follow\" - especially important when setting up the webshop (in the plugin configuration)"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":159154,"bookingKey":"acris64942382445","bookingText":"SEO Tools","price":189.9,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":159153,"bookingKey":"acris64942382445_M","bookingText":"SEO Tools","price":29.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDRpmAM","preview":true,"priority":0,"id":67874},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXIJLHW","preview":false,"priority":0,"id":41663},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHtfDlP","preview":false,"priority":0,"id":44019},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjzNKFS","preview":false,"priority":0,"id":44021},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbuZjRS","preview":false,"priority":0,"id":44022},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpk7OOgU","preview":false,"priority":0,"id":44024},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsISDu4","preview":false,"priority":0,"id":44026},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwQgMil","preview":false,"priority":0,"id":44027},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1zRi9q","preview":false,"priority":0,"id":62426},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQrTXQq","preview":false,"priority":0,"id":62427},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2KA76v","preview":false,"priority":0,"id":62428},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIrjDeX","preview":false,"priority":0,"id":86477}],"comments":[],"ratingAverage":0,"label":"SEO Tools für SEO Professionals","description":"<p>SEO Tools ist eine Sammlung von Tools für Profi für Ihren Shopware Shop. Durch automatisierte Einstellungen erhöhen Sie Ranking, Sichtbarkeit und CTR sowohl bei den Artikeln wie auch bei den Kategorien.</p><p><br /></p><h2>Anleitung:</h2><p><a href=\"https://www.acris-ecommerce.at/shopware_6_plugins/acris_seo_tool/Doku-SW6-ACRIS-SEO-Tool-V01_DE.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Benutzerdokumentation (PDF)</a></p><h2><br /></h2><h2>Funktionen:</h2><p><br /></p><h2>Snippets</h2><p>Als Snippet bezeichnet man die Vorschau des Inhalts einer Webseite in den Suchergebnissen. Die Snippets werden aus dem Title und der Description entnommen und in der Suchergebnisliste (SERP) dargestellt. Je mehr Informationen Title und Description enthalten, desto besser kann Google auf diese Informationen zugreifen. Die CTR (Click-Through-Rate) auf einen Artikel oder eine Kategorie wird erhöht, wenn ein <b>Call to Action</b> und <b>Sonderzeichen</b> in den Snippets enthalten ist. Beides kann Title und Description automatisch zugewiesen werden. <br /></p><p><br /></p><ul><li><strong>Call to Action</strong><br />Ein Call to Action ist eine Aufforderung eine bestimmte Handlung zu setzen. Bei Onlineshops sind dies meist Kaufimpulse (z.B.: jetzt günstig kaufen / sofort preiswert bestellen / versandkostenfrei kaufen /usw.). Ein „Call to Action“ erhöht bei potenziellen Kunden nachweislich die Bereitschaft auf ein Suchergebnis zu klicken. </li></ul><p></p><ul><li><strong>Sonderzeichen</strong><br />Sie haben bestimmt schon öfter die großen Pfeile oder Häkchen in den Suchergebnissen gesehen. Diese Sonderzeichen erregen mehr Aufmerksamkeit als reiner Text und zwingen den Suchenden sich darauf zu fokussieren.</li></ul><p></p><ul><li><strong>Variable</strong><br />In Title und Description lassen sich weitere Shopvariablen wie z.B. Lagerstand, Preis oder Hersteller implementieren.</li></ul><p></p><ul><li><strong>Vorlagen</strong><br />Nach der Installation befinden sich schon jeweils zehn vorgefertigte Snippet Vorlagen für Artikel und Kategorien in der Administration. Dort können dann neue Vorlagen erstellt oder die bestehenden verändert werden. Für jeden Artikel und jede Kategorie lassen sich dann auch noch individuelle Snippets erstellen. </li></ul><p></p><ul><li><strong>Vorschau</strong><br />Eine Vorschau, die den Ergebnissen bei Google gleicht, erleichtert das Anlegen der Snippets.</li></ul><p></p><h3><br /></h3><h3>Redirect URL inkl. Zähler, wie oft dir Redirects genutzt wurden<br /></h3><p>Mit diesem Plugin können Sie SEO konforme URL Weiterleitungen mit 301 oder 302 Statuscode in der Shopware Administration einfach anlegen und verwalten.</p><p>Ab sofort werden die genutzten Redirects gezählt. (Die Anzahl der Weiterleitungen, die Zeit der letzten Weiterleitung und \nder letzte Referer wurden zur Acris SEO Weiterleitungstabelle \nhinzugefügt. (ab Version 3.2.x))<br /><br /></p><h3>Import / Export Funktion</h3><p>Ein Import / Export von Redirects ist möglich - dazu liefern wir ein entsprechendes Profil für den Shopware Import / Export.<br /></p><p><br /></p><h3>SEO-Redirects über Regular Expressions zu definieren.</h3><p>Eine Regular Expression (oder Regex) ist eine Gruppe von Zeichen, die verwendet wird, um ein Muster innerhalb eines Textstücks zu finden.<br />Im Zusammenhang mit der Umleitung wird eine einfache URL-Übereinstimmung genau einer URL entsprechen. Eine Regex-URL kann mit vielen URLs übereinstimmen. <br />Zusätzlich zur Übereinstimmung mit vielen URLs kann ein regulärer Ausdruck Informationen aus der Quell-URL extrahieren und in die Ziel-URL kopieren.</p><p>Ein Beispiel zum besseren Verständnis:</p><p> Eine Weiterleitung mit der Quell-URL /meine-url wird immer nur mit Anfragen für /meine-url übereinstimmen.<br />Eine Weiterleitung mit der Quell-URL /meine-url/.* passt zu Anfragen für:<br />    /meine-url/a<br />    /meine-url/b<br />Und so weiter.<br /><br />Der wichtige Teil von /meine-url/.* ist .*. Dies ist der Teil des regulären Ausdrucks der URL und ist gleichbedeutend mit der Aufforderung \"nimm /meine-url/ gefolgt von einer beliebigen Zeichenfolge\".<br />Auch wenn dies für eine Viezahl an Weiterleitungen sehr hilfreich ist, ist dieses Feature eher für Fortgeschrittene gedacht, da die Erstellung dieser Regular Expressions weitere Kenntnisse voraussetzt. Es müssen aber keine Regular Expressions für die Weiterleitungen genutzt werden, es können weiterhin Redirects mit genauer Übereinstimmng der URL verwendet werden. Falls beide Varianten für eine URL hinterlegt sind, wird immer zuerst nach genauen Übereinstimmungen für eine \nWeiterleitungen gesucht. Wird keine genaue Übereinstimmung gefunden, \nwerden im zweiten Schritt Regular Expressions geprüft. <br /></p><p>Eine Hilfestellung zu den Regular Expressions inkl. Link zu einer Anleitung und einem Cheat-Sheet ist im Shopware Admin Bereich bei den Redirects zu finden. </p><p><br /></p><p></p><h3><br /></h3><h3>JSON LD Rich Snippets</h3><p>Rich Snippets im JSON-LD Format an Google übergeben. Rich Snippets sind eine besondere Form der Snippet. Mit ihnen werden relevante Informationen an Google übergeben. Wenn Sie in den Suchergebnisse den Lagerstand und den Preis eines Produktes sehen, dann wurden diese Daten mit Rich Snippets übergeben. In Shopware 6 ist diese Funktion implementiert und die Rich Snippets werden mit Mikrodaten übergeben. W3C und Google empfehlen jedoch die Verwendung von JSON-LD. Mit dem Plugin ACRIS SEO Tools werden die Daten im JSON-LD Format übergeben. Sie sind daher für die Zukunft gerüstet.</p><p><br /></p><p>Das Plugin SEO Tools von ACRIS bietet aber noch weitere Möglichkeiten. Durch Eingabe spezifischer Informationen über Ihre Branche und über Ihr Unternehmen lassen sich die Suchergebnisse bei Google noch weiter verfeinern. <br /></p><p><br /></p><p>Mit der Aktivierung der „Sitelinks Search Box“ geben Sie Google die Möglichkeit eine eigene Suche in der Suche anzuzeigen. Bei der „Sitelinks Search Box“ handelt es sich um eine Suchbox, die innerhalb eines Snippets in den Google SERPs erscheint. Nutzer können auf diese Weise direkt in der Suchergebnisliste auf der gewünschten Seite nach Inhalten suchen.</p><p><br /></p><p>Natürlich gibt es keine Garantie, dass Google die Suchbox auch anzeigt. Sie schaffen lediglich die Möglichkeiten. Die letzte Entscheidung trägt immer der Algorithmus von Google. <br /></p><p><br /></p><h3>Robots Einstellungen<br /></h3><p>Mit den Robots Einstellungen können Sie die \"Sichtbarkeit für Suchmaschinen\" definieren. So können Sie festlegen, ob Google einzelne Artikel oder einzelne Kategorien in den Index aufnehmen soll. Über den Bereich JSON LD Rich Snippets ist es auch möglich, den kompletten Shop für Google nicht indexierbar zu machen. <br /></p><p><br /></p><p></p><p></p>","installationManual":"<ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins\naufrufen</li><li>Das Plugin hochladen, installieren und aktivieren</li><li><p>Nach dem Aktivieren erreichen Sie das Plugin über: Einstellungen\n&gt; Plugins &gt; SEO Tools</p></li></ul>","version":"3.0.2","changelog":[{"version":"3.0.2","text":"<p>Optimization of the lowest and highest price calculation on the detail page.</p>","creationDate":{"date":"2023-05-08 11:35:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>Optimized calculated price view in the json-ld.</p>","creationDate":{"date":"2023-05-08 10:49:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>Compatibility established with SW 6.5</p>","creationDate":{"date":"2023-04-19 15:15:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.9","text":"<p>Optimization of the lowest and highest price calculation on the detail page.</p>","creationDate":{"date":"2023-05-08 11:35:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.8","text":"<p>Optimized calculated price view in the json-ld.</p>","creationDate":{"date":"2023-05-08 10:48:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.6","text":"<p>Optimized calculated price view in the json-ld when multiple advanced price rules are available.</p>","creationDate":{"date":"2023-04-19 11:26:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.5","text":"<p>Automatic evaluation of the gtin length added.</p>","creationDate":{"date":"2023-04-13 15:19:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.4","text":"<p>Optimizes redirect on 404 exceptions.</p>","creationDate":{"date":"2023-04-07 09:30:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.3","text":"<ul><li>Improves plugin performance<br /></li></ul>","creationDate":{"date":"2023-03-27 15:02:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.0","text":"<p>- Adds ability to redirect from 404 Exceptions</p>","creationDate":{"date":"2023-01-25 17:11:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.4","text":"<p>Optimizes assigning of the category snippet templates in the Administration.</p>","creationDate":{"date":"2022-12-20 09:16:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.2","text":"<p>Optimizes saving of the redirect data.</p>","creationDate":{"date":"2022-11-07 10:46:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.1","text":"<p>Optimizes saving of the SEO URLs for the products and the categories in the Administration.</p>","creationDate":{"date":"2022-07-13 14:21:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"<p>Adds possibility to assign multiple SEO URLs to the products and to the categories in the Administration.</p>","creationDate":{"date":"2022-06-30 10:18:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.8","text":"<p>Improves compatibility with Shopware &gt;= 6.4.12.0.</p>","creationDate":{"date":"2022-06-21 07:33:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.7","text":"<ul><li>Optimizes plugin image.</li><li>Improves compatibility with Shopware &gt;= 6.4.10.0.</li><li>Optimizes plugin color in administration.</li></ul>","creationDate":{"date":"2022-04-25 12:36:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.6","text":"<ul><li>Fixes a problem in connection with older MySQL versions.</li><li>Admin improvements on redirect list in admin</li></ul>","creationDate":{"date":"2022-03-17 13:49:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.4","text":"<p>Optimises assigning of the meta title.</p>","creationDate":{"date":"2022-03-11 10:27:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.3","text":"<p>Added redirect count, last redirect time and last referer to the Acris SEO Redirect Table.</p>","creationDate":{"date":"2022-03-07 15:51:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p>Optimizes decorated priority of the redirect service.</p>","creationDate":{"date":"2022-02-02 12:59:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p>Optimizes sending of the redirect response.</p>","creationDate":{"date":"2022-02-01 16:41:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>Adds a robots.txt file which is customizable in the plugin configuration.</p>","creationDate":{"date":"2022-01-14 11:59:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p>Optimizes display of the SEO title and description at product and category page.</p>","creationDate":{"date":"2022-01-03 08:29:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p>Fixes a problem where an error page was displayed for some products since plugin version 2.0.6.</p>","creationDate":{"date":"2021-12-06 11:44:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>Optimization of the required fields at product / category snippet detail page in Administration.</p>","creationDate":{"date":"2021-10-04 09:18:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p>Change url provider parent class in constructor.</p>","creationDate":{"date":"2021-07-06 07:06:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>Optimize extending of the url provider classes.</p>","creationDate":{"date":"2021-07-05 14:27:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Optimisation of SEO redirects when entering relative URLs.</p>","creationDate":{"date":"2021-06-07 08:06:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"- Performance optimisation for SEO redirects<br /><p>- Allows relative URLs to be specified in 4 ways - i.e. also additionally with preceding / and en</p>","creationDate":{"date":"2021-06-04 08:41:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Fixed plugin compatibility for Shopware version 6.4.</p>","creationDate":{"date":"2021-05-17 09:11:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<p>Optimisation of SEO redirects when entering relative URLs.</p>","creationDate":{"date":"2021-06-07 08:05:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"- Performance optimisation for SEO redirects<br /><p>- Allows relative URLs to be specified in 4 ways - i.e. also additionally with preceding / and en</p>","creationDate":{"date":"2021-06-04 08:40:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<p>Allows text longer than 255 characters to be specified as product and category snippet templates.</p>","creationDate":{"date":"2021-04-22 15:58:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Compatibility with the plugin \"ACRIS prevent product order, price display and export\".</p>","creationDate":{"date":"2021-04-22 14:53:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Added JSON-LD text area field at category and product SEO tab page.</li><li>Checked availableStock for product JSON-LD data at product detail page</li></ul>","creationDate":{"date":"2021-03-31 07:48:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>Optimize loading of category snippets.</p>","creationDate":{"date":"2021-03-29 10:36:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>Fixes possible problems for the output as JSON-LD if product data contains special characters.</p>","creationDate":{"date":"2021-03-25 07:31:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>- Enables SEO redirects to be defined via regular expressions.</p><p>- Optimisation in the matching and substitution of URL parameters</p>","creationDate":{"date":"2021-03-17 13:55:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>Corrects products snippets on language change at detail page.</p>","creationDate":{"date":"2020-12-15 23:34:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>Corrects the dynamic loading of the product nippets according to priority.</li><li>If a snippet is manually stored for a product, this overwrites the configurations of the dynamic snippets.</li><li>Corrects the display of the meta title for products.</li></ul>","creationDate":{"date":"2020-12-14 09:44:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>Add dynamically assigning snippets to the product.</p>","creationDate":{"date":"2020-12-07 09:21:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"<p>Fixes a problem with path info for SEO Redirect.</p>","creationDate":{"date":"2020-11-10 13:11:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"<p>Checked existing of snippets for custom fields.</p>","creationDate":{"date":"2020-10-13 12:13:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"<p>Fixes a problem with encoded URLs.</p>","creationDate":{"date":"2020-09-22 14:33:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<p>Fixes a problem with the URLs query string on redirect.</p>","creationDate":{"date":"2020-09-22 10:32:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p>Change entity listing for all modules.</p>","creationDate":{"date":"2020-07-16 08:20:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>Inserts the Import / Export profile also during the update.</p>","creationDate":{"date":"2020-06-29 08:32:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>added Import/Export-Profil for SEO .</li></ul>","creationDate":{"date":"2020-06-17 15:27:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>Changed sitemap provider for product and category.</p>","creationDate":{"date":"2020-05-25 11:07:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>Changes the way the redirect is performed.</li></ul><ul><li>Optimizations in the admin area.</li></ul><br /><p><b>Info / Known Bugs:</b></p><ul><li><p>Plugin first compatible &gt;= Shopware 6.2.0</p></li><li><p>The backend icon in plugin settings only works from Shopware 6.2.1 on</p></li></ul><p>    -&gt; Bug has been fixed by ACRIS with a pull request at Shopware The plugin is tdm ready for 6.2.0 - despite the little flaw.</p>","creationDate":{"date":"2020-05-22 12:03:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<ul><li>changed Plugin name to SEO Tools<br /></li></ul>","creationDate":{"date":"2020-05-14 10:15:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>Replacing in Admin Menue.</li></ul>","creationDate":{"date":"2020-04-28 10:27:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Fixes a possible problem when no sales channel is found for a redirect.</p>","creationDate":{"date":"2020-04-24 06:22:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>SEO Redirect now also works if no sales channel was found.</li><li>SEO Redirect now works independently of the cache.</li><li>Fixes a possible problem in connection with the SEO Redirect module and Symfony PHP unit tests.</li><li>Optimizes snippets in the admin area.</li></ul>","creationDate":{"date":"2020-04-23 13:20:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First version release<br /></p>","creationDate":{"date":"2020-03-24 08:41:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris64942382445","redirectToStore":false,"lowestPriceValue":29.9}