{"id":11430,"name":"NetzpPowerPack6","code":"Netzp43539541675","lastChange":{"date":"2023-07-18 15:58:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpE3r2mx","examplePageUrl":"","moduleKey":"NetzpPowerPack6","creationDate":{"date":"2020-04-13 15:46:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-04-17 16:00:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-04-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-04-13 15:50:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":41,"prefix":"Netzp","name":"netzperfekt","website":"//netzperfekt.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpZAJJJq"},"infos":[{"id":17981,"name":"CMS Powerpack","description":"<p></p><h2><b>Diese App erweitert die Einkaufserlebnisse um zahlreiche neue Blöcke und Elemente - sozusagen das Schweizer-Armee-Messer für das CMS!</b></h2><h3><b>Unzählige CMS - Blöcke | CMS-Elemente im Header/Footer | Snippets in Artikeln und Kategorien verwenden.</b></h3><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp43539541675\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p><p>Warum zig unterschiedliche Apps für Einkaufswelten installieren? Diese All-in-one App bietet eine Vielzahl von neuen Gestaltungselemente für verkaufsstarke Einkaufswelten:</p><p><b style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; color: rgb(61, 66, 92); font-size: 16px;\">Wir haben das PowerPack stark überarbeitet und erweitert. Ab der Version 1.2.0 stehen folgende neue Elemente zur Verfügung:</b></p><p></p><ul><li>Neu: das <b>CTA Flex-Element</b>&nbsp;wurde grundlegend neu entwickelt und basiert jetzt auf der bekannten und flexiblen CSS-Flexbox-Technologie. Mit durchdachten und sinnvollen Konfigurationsmöglichkeiten können mit diesem Element im Handumdrehen alle Arten von Buttons und Call-to-Action-Banner erstellt werden. Natürlich können auch Bilder integriert werden.</li><li>Neu: das neue Element <b>Aktionskarte</b>&nbsp;bietet Effekte wie Flip (Umdrehen), Enthüllen, Unschärfe und auch einen Popup-Modus. Es eignet sich hervorragend, um Ihre Shopkunden neugierig auf weitere Informationen zu machen und zur Interaktion zu animieren.</li><li>Neu: der&nbsp;<b>Bildvergleich-Slider</b> bietet die Ihren Nutzern die Möglichkeit, zwei Bilder mit einem Slider zu überblenden. So können Vorher-Nachher-Vergleiche auf eine intuitive und emotionale Art und Weise dargestellt werden.</li><li>Neu: der beliebte <b>animierte Zähler</b>&nbsp;zählt von einer Startzahl bis zu einem Endwert. Die Animation wird erst gestartet, wenn der Zähler durch Scrollen der Seite ins Blickfeld gelangt.</li><li>Neu: alle Elemente, bei denen dies sinnvoll ist, unterstützen ab sofort das <b>Shopware Daten-Mapping</b> (Text und Bild) für Kategorieseiten. So können noch dynamischere Buttons und Informationen erstellt werden!</li><li>Neu: <b>Hintergrund-Farbverläufe</b> lassen sich für jedes Einkaufswelten-Element (also auch die Shopware-Standard-Elemente) definiert werden. Bequemer geht es nicht!</li></ul><p></p><p><i style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\"><b>Entdecken Sie die Möglichkeiten auf unserer <a href=\"https://sw6demo.netzperfekt.de/Plugin-Demo/CMS-PowerPack/\" target=\"_blank\">Demoseite zum Plugin!</a></b></i></p><p></p><ul><li><b>Grid/Spalten</b>: unterschiedliche Spalten-Kombinationen zur übersichtlicheren Gestaltung der CMS-Seiten</li><li><b>Call-to-action (CTA)</b> / Button-Element: Sehr vielseitige Gestaltung von ansprechenden Buttons/CTA-Elementen mit Titel, Text, Button, Bild und optionalem Hintergrundbild. Viele Konfigurationsmöglichkeiten!</li><li><b>Alert</b>: Darstellung von kurzen Hinweisen.</li><li><b>Testimonial</b>: Kundenstimmen und -Zitate schnell gestaltet.</li><li><b>Tab</b>: bis zu 10 Tabs können mit HTML-Inhalten blitzschnell integriert werden.</li><li><b>Akkordion</b>-Element mit ebenfalls bis zu 10 Einträgen</li><li><b>HTML / CSS</b>: einfügen von freiem HTML/CSS-Code</li><li><b>Google Maps</b>: erstellen einer Karte mit optionalem Popup</li><li><b>Countdown</b>: Verkaufsaktionen und Neuerscheinungen aufmerksamkeitsstark ankündigen</li></ul><p>Für jedes CMS-Element steht ein entsprechender Block zur Verfügung, der das Einfügen in die Einkaufswelt stark vereinfacht. Natürlich können bestehende Blöcke jederzeit mit den neuen Elementen ausgetauscht werden.</p><p>Weiterhin kann ein beliebiges CMS-Layout optional als <b>Header und/oder im Footer</b> verwendet werden. So sind Hinweise, Nachrichten im Header und Abbinder/zusätzliche Angaben im Footer für den gesamten Shop blitzschnell umsetzbar.</p><p><b>Snippets</b> (und andere Twig-Ausdrücke) können in Artikeln (Name + Beschreibung) sowie Kategorien (nur Beschreibung) verwendet werden. So können immer wiederkehrende Beschreibungstexte an einer zentralen Stelle kinderleicht verändert werden!&nbsp;</p><p><i><b>Entdecken Sie die Möglichkeiten auf unserer&nbsp;<a href=\"https://sw6demo.netzperfekt.de/Plugin-Demo/CMS-PowerPack/\" target=\"_blank\" rel=\"noreferrer\">Demo-Seite zum Plugin</a>!</b></i></p><p><b>Bitte beachten Sie</b>: <i>prüfen Sie die App bitte ausführlich vor dem Kauf mit der kostenfreien 30tägigen Testversion</i>.</p><p>Sollte die App nicht vollständig Ihren Vorstellungen entsprechen, können Sie uns gerne Ihre Idee zur Weiterentwicklung <a href=\"https://plugins.netzperfekt.de/support\" target=\"_blank\" rel=\"noreferrer noopener\">mitteilen</a>. Wir können Ihnen jedoch eine Umsetzung nicht immer garantieren - in diesem Fall sehen Sie bitte von einem Kauf der App ab.</p><p></p>","installationManual":"<ul><li>Wie gewohnt im App-Manager installieren</li><li>In den Einkaufserlebnissen gibt es zahlreiche neue Elemente</li><li>Die Blöcke sind über die eigene Kategorie&nbsp;<i>PowerPack</i>&nbsp;erreichbar</li><li>Beliebige CMS-Layouts lassen sich im Sales-Channel (Storefront) für den Header und/oder Footer zuweisen</li><li>Snippets und andere Twig-Ausdrücke können in Artikeln (Beschreibung und Name) und Kategorien (Beschreibung) eingefügt werden: <i>{{ \"snippetname\" | trans}} </i>oder falls HTML-Ausdrücke im Snippet verwendet werden sollen:&nbsp;<i>{{ \"snippetname\" | trans | raw }}</i></li><li><b style=\"\">Hinweis: </b>Ab der Version 1.2.0 steht ein neues CTA/Button-Element zur Verfügung. Das alte CTA-Element ist aus Kompatibilitätsgründen auch weiterhin enthalten. Ab sofort sollte jedoch nur noch das neue CTA/Flex-Element verwendet werden - es ist zukunftssicherer und bietet mehr Möglichkeiten.<br></li><li><b>!!!Wichtig!!! </b>Der Auswahlschalter für die responsive Darstellung wurde mittlerweile direkt in den Shopware 6-Standard integriert. Daher werden die responsiven <b>Darstellungsoptionen im PowerPack in der nächsten Plugin-Version entfallen</b>. Bitte migrieren Sie Ihre Einstellungen schnellstmöglich und verwenden ausschließlich den Shopware-Standard unter <i>Sichtbarkeit / Anzeigegeräte</i>. (Eine automatische Migration ist leider technisch nicht möglich.)</li></ul><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp43539541675\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p>","shortDescription":"Umfangreiche Komponenten für die Einkaufserlebnisse/CMS: Spalten-Layouts, Button/CTA, TABs, Akkordion uvm. Snippets in Artikeln und Kategorien, Layouts in Header/Footer einbinden.","highlights":"Sehr umfangreiche Sammlung von CMS-Blöcken und Elementen\nFlexibles CTA/Button-Element auf Basis von CSS-Flexbox\nElemente/Sektionen für jede responsive Auflösung ausblendbar \nInhalte im Shop-Header/Footer pflegen\nSnippets in Artikeln + Kategorien verwenden","features":"Neu: komplett überarbeitetes CTA/Button-Element\nNeu: Aktionskarte (Effekte Flip/Enthüllen/Unschärfe/Popup)\nNeu: Vorher/Nachher Bildvergleich/Slider\nNeu: Animierter Zähler\nNeu: Unterstützung des Shopware Daten-Mapping für Kategorieseiten\nGrids / Spalten-Layouts\nüberarbeitetes CTA/Button-Element auf Basis von CSS-Flexbox\nTestimonial-Element, Alert-Element\nTab-Element, Akkordion-Element\nGoogle Map-Element, Countdown-Element\nHTML/CSS-Element\nResponsive Gestaltung: Elemente und Sektionen in unterschiedlichen Geräte-Auflösungen ein- oder ausschalten, Hintergrund-Farbverläufe für CMS-Elemente\nCMS-Seite im Shop-Header und/oder Footer sowie auf der Bestellzusammenfassung einbinden\nSnippets + Twig-Ausdrücke in Artikeln + Kategorien verwenden"},{"id":17982,"name":"CMS Powerpack","description":"<h2><b>This app adds numerous new blocks and elements to the shopping experience - the Swiss Army Knife for the CMS!</b></h2><h3><b>Numerous CMS blocks | Use CMS elements in header/footer | use snippets in articles and categories</b></h3><p>Why install many different apps for shopping experiences? This all-in-one app offers the following new design elements for the shopping worlds in one package:</p><p><b>We have greatly revised and expanded the PowerPack. As of version 1.2.0, the following new elements are available:</b><br></p><ul><li>New: the <b>CTA Flex </b>element has been fundamentally redeveloped and is now based on the well-known and flexible CSS Flexbox technology. With many configuration options, all kinds of buttons and call-to-action banners can be created with this element in no time at all. Of course, images can also be integrated.</li><li>New: the new <b>action card </b>element offers effects such as flip, reveal, blur and also a pop-up mode. It is ideal for making your shop customers curious about further information and encouraging them to interact.</li><li>New: the <b>image comparison slider</b> offers your users the possibility to cross-fade two images using a slider. This way, before and after comparisons can be presented in an intuitive and emotional way.</li><li>New: the&nbsp;<b>animated counter</b> counts from a start number to a final value. The animation is only started when the counter comes into view by scrolling the page.</li><li>New: all elements where this makes sense now support <b>Shopware data mapping</b> (text and image) for category pages. This means that even more dynamic buttons and information can be created!</li><li>New: <b>background colour gradients</b> can be defined for each shopping world element (i.e. also the Shopware standard elements).&nbsp;</li></ul><p><b>Discover the possibilities on our&nbsp;</b><a href=\"https://sw6demo.netzperfekt.de/en/Plugin-Demo/CMS-PowerPack/\" target=\"_blank\" rel=\"noreferrer\">https://sw6demo.netzperfekt.de/en/Plugin-Demo/CMS-PowerPack/</a><b>&nbsp;for the plugin!</b></p><ul><li><b>Grid/columns</b>: different column combinations for a clearer design of the CMS pages</li><li><b>Call-to-action (CTA) / Button element</b>: Very versatile design of attractive buttons/CTA elements with title, text, button, image and optional background image. Many configuration possibilities!</li><li><b>Alert</b>: Display of short notes.</li><li><b>Testimonial</b>: Customer voices and quotes quickly designed.</li><li><b>Tab</b>: up to 20 tabs can be integrated with HTML content at lightning speed.</li><li><b>Accordion</b> element with also up to 20 entries</li><li><b>HTML / CSS: </b>insert free HTML/CSS code<br></li><li><b>Google Maps</b>: insert a map element and set a location</li><li><b>Countdown</b>: build a timer for promotions.</li></ul><p></p><p>A <b>corresponding block</b> is available for each CMS element, which greatly simplifies insertion into the shopping world. Of course, existing blocks can be exchanged with the new elements at any time.</p><p>Furthermore, any <b>CMS layout can optionally be used as header and/or footer </b>for the shop. Thus, notes or messages in the header and additional information in the footer can be implemented for the entire shop in a snap.</p><p><b>Snippets</b> (and other Twig expressions) can be used in <b>articles</b> (name + description) as well as <b>categories</b> (description only). <b>This way, recurring description texts can be changed easily at a central place!&nbsp;</b><br></p><p>Furthermore, any CMS layout can optionally be used as a <b>header and/or in the footer</b>. This makes it possible to implement notices, messages in the header and binders/additional information in the footer for the entire shop in a flash.<br></p><p><b>Snippets</b> (and other Twig expressions) can be used in articles (name + description) and categories (description only). This way, recurring description texts can be easily changed in one central place!&nbsp;&nbsp;</p><p><b>Discover the possibilities on our&nbsp;</b><a href=\"https://sw6demo.netzperfekt.de/en/Plugin-Demo/CMS-PowerPack/\" target=\"_blank\" rel=\"noreferrer\">https://sw6demo.netzperfekt.de/en/Plugin-Demo/CMS-PowerPack/</a><b>&nbsp;for the plugin!&nbsp;</b></p><p><b>Please note:</b><i>please test the app in detail with the free 30-day trial version before purchasing.</i>&nbsp;</p><p>If the app does not completely meet your expectations, you are welcome to&nbsp;<a href=\"https://plugins.netzperfekt.de/support\" target=\"_blank\" rel=\"noreferrer\">https://plugins.netzperfekt.de/support</a>&nbsp;for further development. However, we cannot always guarantee implementation - in this case, please refrain from purchasing the app.</p><p><b><br></b></p><b></b>\n","installationManual":"<ul><li>Install as usual in the app manager</li><li>There are many new elements in the shopping experience</li><li>The blocks can be accessed via their own PowerPack category</li><li>Any CMS layout can be assigned in the sales channel (storefront) for the header and/or footer</li><li>Snippets and other twig expressions can be used in article names, article descriptions and category descriptions: Just type <i>{{ \"snippetname\" | trans}}</i>&nbsp;or if you want HTML in your snippets use <i>{{ \"snippetname\" | trans | raw }}</i></li><li><i><b>Note</b>: As of version 1.2.0, a new CTA/Button element is available. The old CTA element is still included for compatibility reasons. However, from now on only the new CTA/Flex element should be used - it is more future-proof and offers more possibilities.<br></i></li><li><i><b>!!!Attention!!!&nbsp;</b>the responsive display selector has now been integrated directly into the Shopware 6 standard. Therefore, the responsive display options in PowerPack will be dropped in the next plugin version. Please migrate your settings as soon as possible and use only the Shopware standard under Visibility / Display Devices. (Unfortunately, an automatic migration is not technically possible).</i></li></ul><p></p><p>\nDetailed documentation and FAQ (in German language, pls. use deepl.com for translation):&nbsp;<a href=\"https://plugins.netzperfekt.de/doc/Netzp43539541675\" target=\"_blank\">https://plugins.netzperfekt.de/doc/Netzp43539541675</a></p>","shortDescription":"Extensive components for the shopping experience/CMS: column layouts, button/CTA, TABs, accordion + many more. Snippets in articles/categories. CMS layouts can be used in  header/footer","highlights":"Very extensive collection of CMS blocks and elements.\nFlexible CTA/button element based on CSS flexbox\nElements/sections can be hidden for each responsive resolution \nMaintain content in store header/footer\nUse snippets in articles + categories","features":"New: completely reworked CTA/button element\nNew: Action card (flip/unhide/blur/popup effects)\nNew: Before/after image comparison/slider\nNew: Animated counter\nNew: Shopware data mapping support for category pages\nGrids / column layouts\nreworked CTA/button element based on CSS flexbox\nTestimonial element, Alert element\nTab element, Chordion element\nGoogle Map element, Countdown element\nHTML/CSS element\nResponsive design: turn elements and sections on or off in different device resolutions, background color gradients for CMS elements\nInclude CMS page in store header and/or footer as well as order summary\nUse snippets + Twig expressions in articles + categories"}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":159473,"bookingKey":"Netzp43539541675","bookingText":"CMS Powerpack","price":99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":159472,"bookingKey":"Netzp43539541675_T","bookingText":"CMS Powerpack","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfSh59y","preview":true,"priority":97,"id":42188},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpymHCT4","preview":false,"priority":950,"id":42187},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4dlS44","preview":false,"priority":940,"id":42186},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDXj7aJ","preview":false,"priority":930,"id":42189},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php335agR","preview":false,"priority":800,"id":42191},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVWMd1P","preview":false,"priority":790,"id":42190},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppbRfwR","preview":false,"priority":780,"id":42192},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1Y3vAR","preview":false,"priority":770,"id":42193},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzdotCR","preview":false,"priority":760,"id":42194},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXUT5vR","preview":false,"priority":750,"id":42195}],"comments":[{"authorName":"Anja J.","text":"Als Shopware Neuling wollte ich einfach nur zwei Kategorien nebeneinander stellen. Mit den Bordmitteln bin ich da nicht weiter gekommen. Mit den unterschiedlichen Layouts des Plugins konnte ich das prima lösen, dankeschön! Auch der Support war schnell &amp; freundlich und hat mir bei einer Frage weitergeholfen.","headline":"Klasse!","creationDate":{"date":"2022-05-04 11:12:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Jan J.","text":"Danke für das prima Plugin! Damit habe ich jetzt viel mehr Möglichkeiten, individuelle Einkaufswelten umzusetzen. Das letzte Update bietet noch mal mehr tolle Elemente.","headline":"Sehr hilfreich.","creationDate":{"date":"2022-05-02 13:40:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sven Rösner","text":"… Aber noch sehr ausbaufähig und etwas Buggy. Der Preis ist einfach zu hoch für diese Qualität.","headline":"Gute Idee...","creationDate":{"date":"2022-03-30 00:53:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Benjamin Beloch","text":"Wir haben das Plugin gekauft um ein paar weitere Inhaltselemente nutzen zu können.\nAls wir vor ein paar Wochen das ThemeWare Theme dazu gekauft haben, gab es ein paar \"Inkompatibilitäten\" zwischen dem Plugin und dem Theme, hierzu habe ich das Support Formular bei netzperfekt ausgefüllt und selbst auf einem Sonntag noch ein Feedback inkl. einer neuen Version erhalten, die den \"Fehler\" behoben hat.\n\nIch bin also insgesamt super zufrieden! Wir können unseren Shop mit weiteren Elementen aus dem Powerpack befüllen und haben selbst bei einem kleinen Problem einen erstklassigen Support erhalten!\n\nAbsolute Kaufempfehlung!","headline":"Tolles Plugin - Super Support!","creationDate":{"date":"2020-07-14 17:53:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":9,"label":"CMS Powerpack","description":"<p></p><h2><b>Diese App erweitert die Einkaufserlebnisse um zahlreiche neue Blöcke und Elemente - sozusagen das Schweizer-Armee-Messer für das CMS!</b></h2><h3><b>Unzählige CMS - Blöcke | CMS-Elemente im Header/Footer | Snippets in Artikeln und Kategorien verwenden.</b></h3><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp43539541675\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p><p>Warum zig unterschiedliche Apps für Einkaufswelten installieren? Diese All-in-one App bietet eine Vielzahl von neuen Gestaltungselemente für verkaufsstarke Einkaufswelten:</p><p><b>Wir haben das PowerPack stark überarbeitet und erweitert. Ab der Version 1.2.0 stehen folgende neue Elemente zur Verfügung:</b></p><p></p><ul><li>Neu: das <b>CTA Flex-Element</b> wurde grundlegend neu entwickelt und basiert jetzt auf der bekannten und flexiblen CSS-Flexbox-Technologie. Mit durchdachten und sinnvollen Konfigurationsmöglichkeiten können mit diesem Element im Handumdrehen alle Arten von Buttons und Call-to-Action-Banner erstellt werden. Natürlich können auch Bilder integriert werden.</li><li>Neu: das neue Element <b>Aktionskarte</b> bietet Effekte wie Flip (Umdrehen), Enthüllen, Unschärfe und auch einen Popup-Modus. Es eignet sich hervorragend, um Ihre Shopkunden neugierig auf weitere Informationen zu machen und zur Interaktion zu animieren.</li><li>Neu: der <b>Bildvergleich-Slider</b> bietet die Ihren Nutzern die Möglichkeit, zwei Bilder mit einem Slider zu überblenden. So können Vorher-Nachher-Vergleiche auf eine intuitive und emotionale Art und Weise dargestellt werden.</li><li>Neu: der beliebte <b>animierte Zähler</b> zählt von einer Startzahl bis zu einem Endwert. Die Animation wird erst gestartet, wenn der Zähler durch Scrollen der Seite ins Blickfeld gelangt.</li><li>Neu: alle Elemente, bei denen dies sinnvoll ist, unterstützen ab sofort das <b>Shopware Daten-Mapping</b> (Text und Bild) für Kategorieseiten. So können noch dynamischere Buttons und Informationen erstellt werden!</li><li>Neu: <b>Hintergrund-Farbverläufe</b> lassen sich für jedes Einkaufswelten-Element (also auch die Shopware-Standard-Elemente) definiert werden. Bequemer geht es nicht!</li></ul><p></p><p><i><b>Entdecken Sie die Möglichkeiten auf unserer <a href=\"https://sw6demo.netzperfekt.de/Plugin-Demo/CMS-PowerPack/\" target=\"_blank\" rel=\"noreferrer noopener\">Demoseite zum Plugin!</a></b></i></p><p></p><ul><li><b>Grid/Spalten</b>: unterschiedliche Spalten-Kombinationen zur übersichtlicheren Gestaltung der CMS-Seiten</li><li><b>Call-to-action (CTA)</b> / Button-Element: Sehr vielseitige Gestaltung von ansprechenden Buttons/CTA-Elementen mit Titel, Text, Button, Bild und optionalem Hintergrundbild. Viele Konfigurationsmöglichkeiten!</li><li><b>Alert</b>: Darstellung von kurzen Hinweisen.</li><li><b>Testimonial</b>: Kundenstimmen und -Zitate schnell gestaltet.</li><li><b>Tab</b>: bis zu 10 Tabs können mit HTML-Inhalten blitzschnell integriert werden.</li><li><b>Akkordion</b>-Element mit ebenfalls bis zu 10 Einträgen</li><li><b>HTML / CSS</b>: einfügen von freiem HTML/CSS-Code</li><li><b>Google Maps</b>: erstellen einer Karte mit optionalem Popup</li><li><b>Countdown</b>: Verkaufsaktionen und Neuerscheinungen aufmerksamkeitsstark ankündigen</li></ul><p>Für jedes CMS-Element steht ein entsprechender Block zur Verfügung, der das Einfügen in die Einkaufswelt stark vereinfacht. Natürlich können bestehende Blöcke jederzeit mit den neuen Elementen ausgetauscht werden.</p><p>Weiterhin kann ein beliebiges CMS-Layout optional als <b>Header und/oder im Footer</b> verwendet werden. So sind Hinweise, Nachrichten im Header und Abbinder/zusätzliche Angaben im Footer für den gesamten Shop blitzschnell umsetzbar.</p><p><b>Snippets</b> (und andere Twig-Ausdrücke) können in Artikeln (Name + Beschreibung) sowie Kategorien (nur Beschreibung) verwendet werden. So können immer wiederkehrende Beschreibungstexte an einer zentralen Stelle kinderleicht verändert werden! </p><p><i><b>Entdecken Sie die Möglichkeiten auf unserer <a href=\"https://sw6demo.netzperfekt.de/Plugin-Demo/CMS-PowerPack/\" target=\"_blank\" rel=\"noreferrer noopener\">Demo-Seite zum Plugin</a>!</b></i></p><p><b>Bitte beachten Sie</b>: <i>prüfen Sie die App bitte ausführlich vor dem Kauf mit der kostenfreien 30tägigen Testversion</i>.</p><p>Sollte die App nicht vollständig Ihren Vorstellungen entsprechen, können Sie uns gerne Ihre Idee zur Weiterentwicklung <a href=\"https://plugins.netzperfekt.de/support\" target=\"_blank\" rel=\"noreferrer noopener\">mitteilen</a>. Wir können Ihnen jedoch eine Umsetzung nicht immer garantieren - in diesem Fall sehen Sie bitte von einem Kauf der App ab.</p><p></p>","installationManual":"<ul><li>Wie gewohnt im App-Manager installieren</li><li>In den Einkaufserlebnissen gibt es zahlreiche neue Elemente</li><li>Die Blöcke sind über die eigene Kategorie <i>PowerPack</i> erreichbar</li><li>Beliebige CMS-Layouts lassen sich im Sales-Channel (Storefront) für den Header und/oder Footer zuweisen</li><li>Snippets und andere Twig-Ausdrücke können in Artikeln (Beschreibung und Name) und Kategorien (Beschreibung) eingefügt werden: <i>{{ \"snippetname\" | trans}} </i>oder falls HTML-Ausdrücke im Snippet verwendet werden sollen: <i>{{ \"snippetname\" | trans | raw }}</i></li><li><b>Hinweis: </b>Ab der Version 1.2.0 steht ein neues CTA/Button-Element zur Verfügung. Das alte CTA-Element ist aus Kompatibilitätsgründen auch weiterhin enthalten. Ab sofort sollte jedoch nur noch das neue CTA/Flex-Element verwendet werden - es ist zukunftssicherer und bietet mehr Möglichkeiten.<br /></li><li><b>!!!Wichtig!!! </b>Der Auswahlschalter für die responsive Darstellung wurde mittlerweile direkt in den Shopware 6-Standard integriert. Daher werden die responsiven <b>Darstellungsoptionen im PowerPack in der nächsten Plugin-Version entfallen</b>. Bitte migrieren Sie Ihre Einstellungen schnellstmöglich und verwenden ausschließlich den Shopware-Standard unter <i>Sichtbarkeit / Anzeigegeräte</i>. (Eine automatische Migration ist leider technisch nicht möglich.)</li></ul><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp43539541675\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p>","version":"2.1.0","changelog":[{"version":"2.1.0","text":"<ul>\n<li>Change: Images / responsive thumbnail sizes optimized</li>\n</ul>","creationDate":{"date":"2023-06-08 11:20:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul>\n<li>Support for SW 6.5</li>\n<li>!!!Important!!! The responsive display selector has now been integrated directly into the Shopware 6 standard. Therefore, the responsive display options in PowerPack will be dropped in the next plugin version. Please migrate your settings as soon as possible and use only the Shopware standard under Visibility / Devices.</li>\n</ul>\n<ul>\n<li>+++ ATTENTION +++ <strong>Update to SW 6.5</strong></li>\n<li>First deactivate all plugins (do not uninstall them!).</li>\n<li>Then update the store to SW 6.5</li>\n<li>Then update the plugins to the compatible version for SW 6.5</li>\n<li>Activate all plugins again</li>\n<li>Perform the update for each single plugin (click on the version number of each plugin)</li>\n<li>Shopware has made significant changes in version 6.5. The adaptation of our plugins here was very complex and took a lot of time.</li>\n<li>If something does not work as expected, please contact our plugin support at <a href=\"https://plugins.netzperfekt.de/support\">https://plugins.netzperfekt.de/support</a>.</li>\n</ul>","creationDate":{"date":"2023-05-08 10:38:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<ul><li>Component \"Google maps\": Opt-In / the maps are optionally loaded only after consent.</li></ul>","creationDate":{"date":"2023-03-06 15:13:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<ul><li>\"Google maps\" component: added callback to prevent google api error</li></ul>","creationDate":{"date":"2023-02-06 11:52:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<ul><li>\"Infobar\" component: CSS styles corrected</li></ul>","creationDate":{"date":"2023-02-02 15:04:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<ul><li>For images the smaller resolutions of the Shopware media standard are used.</li></ul>","creationDate":{"date":"2022-12-09 11:54:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<ul><li>The parallax element is unfortunately not supported on mobile devices for technical reasons, but the images are now scaled correctly there.</li></ul>","creationDate":{"date":"2022-11-05 12:54:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Change: the counter element can be used with placeholders ({counter} {start} {end})</li><li>Fix: The slots are shown in the correct order in categories/tab layout</li></ul>","creationDate":{"date":"2022-07-13 10:15:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<ul><li>Fix: The slots are shown in the correct order in categories/tab layout</li></ul>","creationDate":{"date":"2022-06-22 09:39:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Change: CMS blocks and sections: Visibility can be controlled via a Rule Builder rule</li><li>Change: CMS blocks and sections: Visibility can be controlled by date (show from - to)</li></ul>","creationDate":{"date":"2022-06-14 10:30:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>Change: action card / new type \"static\": fully clickable element</li><li>Change: Grid element 2-columns 4/8: responsive layout for tablets has been changed to col-md-6/6 (instead of col-md-4/8)</li><li>Fix: Admin / HTML/CSS element: minimum height to allow editing of settings for empty elements.</li><li>Fix: font awesome / removed facebook icon (interference with our plugin NetzpShariff6)</li></ul>","creationDate":{"date":"2022-05-12 15:05:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>Fix: admin / small display problems fixed</li><li>Fix: support for installation via composer</li><li>Fix: action card / open link in new window now working correctly</li><li>Change: action card / blur: text can be excluded from blur effect</li></ul>","creationDate":{"date":"2022-04-22 10:17:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>*This is a really big update with lots of new features and elements as well as some minor bug fixes.</li><li>Change: new element \"CTA Flex\" - fundamentally revised button and call-to-action element based on CSS Flexbox</li><li>Change: new element \"Action card with flip/reveal/blur/popup</li><li>Change: new element \"Before/after image comparison/slider</li><li>Change: new element \"Animated counter\"</li><li>Change: analog to the standard Shopware element \"3 columns, image &amp; text\" there are two elements with 2 and 4 columns, image &amp; text (under \"PowerPack - Layouts\")</li><li>Change: Shopware data mapping is supported for images and text where it makes sense (Alert, Card, CTA / CTA2, ImageCompare, Parallax, Testimonial)</li><li>Change: Color gradients can be defined for all elements (also for Showpare standard elements) (in block settings and also section settings)</li><li>Change: Admin / block categories split into \"PowerPack Layouts\" and \"PowerPack Elements\" for better overview</li><li>Fix: Admin / Tab element: editing many tabs has been improved, maximum number of tabs has been increased to 20</li><li>Fix: Admin / Collapse element: the maximum number of collapsible entries has been increased to 20</li><li>Fix: admin / Testimonial element: display was optimized if no name was entered</li><li>Fix: display for category filters inserted in grid layouts has been optimized, the filter popup is no longer cut</li></ul>","creationDate":{"date":"2022-04-13 12:01:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Version: compatibility with SW 6.4.7</li></ul>","creationDate":{"date":"2021-12-10 10:58:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p></p><ul><li>ESLint problems fixed when building assets / compiling</li></ul>","creationDate":{"date":"2021-10-12 18:09:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p></p><ul><li>Version: compatibility with SW 6.4</li></ul>","creationDate":{"date":"2021-05-04 13:43:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p></p><ul><li>Change: toggle responsive state for cms sections and blocks</li><li>Fix: admin / CTA element: media handling fixed for images</li></ul><p><br /></p>","creationDate":{"date":"2021-02-25 10:49:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Fix: Error message on reinstallation fixed<br /></li></ul>","creationDate":{"date":"2020-10-23 10:26:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p></p><ul><li>Fix: CTA / Optimized button display on mobile devices</li><li>Change: Collapse-Element: minimum entries set to 1</li></ul><p><br /></p>","creationDate":{"date":"2020-08-31 16:22:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>Fix: on some systems there was an error message during installation (ThemeCompiler) in connection with FontAwesome. This has been - now really ;-) fixed</p>","creationDate":{"date":"2020-07-14 08:48:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Bugfix: on some systems there was an error message during installation (ThemeCompiler) in connection with FontAwesome. </p>","creationDate":{"date":"2020-05-22 16:06:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>snippets and other twig expressions can be used in article names, article descriptions and category descriptions, just type<i> {{ \"snippetname\" | trans}} </i>or {{ 40+2 }} or something<br />(if you want html in your snippets use <i>{{ \"snippetname\" | trans | raw }}</i>)</li></ul>","creationDate":{"date":"2020-05-15 14:48:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><ul><li>Change: sales channel: header cms block can be \"sticky\"</li><li>Change: new cms element: infobar/icon bar with 2 layouts</li><li>Change: new cms element: parallax image</li><li>Change: element counter: new layout \"boxes\"</li><li>Change: new cms grids 2 columns (4/8 and 8/4)</li></ul>","creationDate":{"date":"2020-05-05 15:33:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>Change: assignable CMS layout on order finish page</li><li>Change: new CMS elements: google map</li><li>Change: new CMS elements: countdown</li></ul><p><br /></p>","creationDate":{"date":"2020-04-23 15:47:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial plugin version</p>","creationDate":{"date":"2020-04-14 16:32:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Netzp43539541675","redirectToStore":false,"lowestPriceValue":99}