{"id":11471,"name":"TopdataTopFeedSW6","code":"topda23759958621","lastChange":{"date":"2023-07-18 11:16:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpySKGG6","examplePageUrl":"","moduleKey":"TopdataTopFeedSW6","creationDate":{"date":"2020-04-20 12:53:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-01-28 09:09:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-01-22 09:38:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1339,"prefix":"topdata","name":"TopData Software GmbH","website":"//www.topdata.de","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod1339_topdata.png"},"infos":[{"id":18056,"name":"TopFEED (Kompa- und Produktdaten)","description":"<h2>Hochwertige Produktdaten für ein erfolgreiches eCommerce</h2><p>„TopFEED“ ist ein Plug-in, das Ihre Artikelstammdaten mit wertvollen Zusatzinformationen veredelt\nund erstklassige, konsistente Produktdaten wie Drucker, Warengruppen und Artikel-Spezifikationen\nfür Ihren Shopware-Shop liefert.\n</p><p>\n\"TopFEED\" besteht aus zwei Komponenten, dem kostenpflichtigen \"TopFEED-Content\" der TopData Software GmbH sowie dem entsprechenden kostenlosen Shopware-Plug-in. Um die Funktionalität von \"TopFEED\" in Ihrem Shopware-Shop zu gewährleisten, ist das Zusammenspiel beider Komponenten nötig.\n</p><p>\nMit „TopFEED“ rüsten Sie Ihren Webshop optimal für den Onlinehandel\nund maximieren so die Verkaufschancen für Ihre Produkte.\n</p><h2>Sie verkaufen die Produkte - wir liefern die Informationen</h2><p>„TopFEED“ verbessert Qualität sowie Umfang Ihrer Produktdaten und wertet diese mit ergänzenden\nArtikeleigenschaften auf. Dazu gehören Spezifikationen (z.B. Marke, Farbe,\nFüllmenge, Kapazität, EAN-Nr., u.v.m.) ebenso wie detaillierte Artikelbeschreibungen,\noder die Anzeige qualitativ hochwertiger Produktbilder.\n</p><p>\nDank intelligenter Verknüpfungen nutzen Sie mit „TopFEED“ bewährte\nMarketinginstrumente, wie z.B. Cross- bzw. Up-Selling und können so die\nAbsatzchancen Ihrer angebotenen Produkte signifikant erhöhen.\n</p><h3>Präsentieren Sie Ihren Kunden zu jedem Artikel weitere Versionen (Up-Selling):</h3><ul><li>Produkte mit höherer Reichweite</li><li> Bundles, Doppel, Multi- und Vorteilspacks</li><li>zeitlich limitierte Aktionsware</li><li>Artikel mit größeren Füllmengen</li></ul><h3>Oder lassen Sie zu jedem Artikel weitere Produkte anzeigen (Cross-Selling):</h3><ul><li>Alternativen von Drittherstellern</li><li>Geräte, denen der Artikel zugeordnet ist</li><li>Artikel, denen die Geräte zugeordnet sind</li><li>Produkte mit anderen Farben</li></ul><p>\nDas Plug-in ist mehrsprachig konzipiert und eignet sich perfekt für Ihr\ninternationales Business. Folgende Sprachen stehen zur Auswahl: DE, EN, FR, IT,\nES, NL, SV, PL und mehr.\n</p><p>\n„TopFEED“ lässt sich nicht nur für Webshops, sondern und/oder für elektronische\nProduktkataloge, Internet-Applikationen, Warenwirtschaftssysteme u.v.m. nutzen.\n</p><h2>Mit „TopFEED“ wird Online-Shopping zum Erlebnis</h2><p>\nOrdentlich strukturierte und gut gepflegte Produktdaten sind einer der entscheidenden Faktoren im E-Commerce.\n</p><p>\nStets aktuell gehaltene Artikelformationen stellen sicher, dass Ihren Kunden nur\ndiejenigen Produkte angezeigt werden, die auch tatsächlich kaufbar sind. Ausführliche\nund detaillierte Produktbeschreibungen sorgen dafür, dass potentielle Käufer\nihr gewünschtes Produkt tatsächlich finden und bestellen können.\n</p><h2>„TopFEED“ – ein Blick hinter die Kulissen</h2><p>„TopFEED“ kommuniziert mit unserem Datenwebservice und basiert auf der Verknüpfung Ihrer\nArtikel mit unserer Produktdatenbank. Wir pflegen die Daten und erfassen dafür standardmäßig\nsämtliche Originalprodukte, sowie optional auch Alternativmarken bzw.\nEigenmarken.\n</p><p>\nEin zusätzliches Plug-in, der „TopCONNECTOR“, sorgt für den bequemen und reibungslosen Import unserer Daten in Ihr Shopware-Shopsystem und hält Ihren „TopFEED“\nstets aktuell.\n</p><p>\nStandardmäßig erfolgt die Verknüpfung der Daten über Herstellernummern sowie EAN-Codes der\nerfassten Originalprodukte. Eine Verknüpfung der Produktdaten mit weiteren\nParametern - z.B. den Artikelnummern Ihrer Distributoren, oder Ihren eigenen\nArtikelnummern - ist optional ebenfalls möglich.\n</p><h3><i>Standard-Mapping</i></h3><p>\nHier enthält „TopFEED“ die Herstellernummern sowie EAN-Codes der von uns erfassten\nOriginalprodukte. Das Mapping erfolgt somit ausschließlich über Hersteller-Nr.\nund/oder EAN-Codes.\n</p><p>\nBei dieser Variante ist uns Ihr Produktsortiment unbekannt und es werden generell\nalle Drucker angezeigt, auch wenn Sie für das Gerät kein Zubehör anbieten. Es\nbesteht auch keine Gewährleistung, dass alle Produkte zu dem gesuchten Drucker im\nShop angezeigt werden.\n</p><h3><i>Distributoren-Mapping</i></h3><p>\nUm bessere Ergebnisse zu erzielen, verknüpfen wir die Artikelnummern Ihrer\nLieferanten mit unserer Produktdatenbank und liefern Ihrem Shop die\nentsprechenden Artikelnummern aus.\n</p><p>\nSomit werden nur diejenigen Geräte angezeigt, zu denen Produkte des Lieferanten\ngemappt worden sind. Für diese Variante benötigen wir eine Liste mit Ihren\nLieferanten.\n</p><h3><i>Artikel-Mapping</i></h3><p>Wir legen Ihre Artikelnummern in unserem System an und Ihr Shop erhält ausschließlich\ndie passenden Artikelnummern von uns zurück. Wir kennen Ihr Produktsortiment\nund sind somit in der Lage, nur jene Geräte anzuzeigen, zu denen auch\ntatsächlich Produkte gemappt worden sind.\n</p><p>\nUm ein optimales Artikel-Mapping zu gewährleisten, benötigen wir für diese\nVariante eine Liste mit Ihren Artikelnummern, Hersteller- sowie EAN-Nummern.\n</p><h2>Qualität zu einem unschlagbaren Preis</h2><p>Die Bereitstellung der für „TopFEED“ notwendigen Daten ist mit einer\nkostenpflichtigen Bestellung auf unserer Webseite verbunden. „TopFEED“ besteht\naus vier Versionen, die den Umfang der angebotenen Leistungen bestimmen.\n</p><p>\nDie Preise für die einzelnen Versionen variieren in Abhängigkeit des gebotenen\nLeistungsspektrums. Nach dem Kauf eines der Pakete, erhalten Sie die\nZugangsdaten für den Webshop.\n</p><p>\nFür ausführliche Informationen besuchen Sie bitte unsere Webseite:<a href=\"https://www.topdata.de/shopware/seite/topfeed\" target=\"_blank\" rel=\"noreferrer noopener\">www.topdata.de/shopware</a><br />\nTesten Sie „TopFEED“: <a href=\"https://shopware6.topdata.de\">Demo</a><br />\nBestellen Sie „TopFEED“ kostenpflichtig: <a href=\"https://www.topdata.de/topfeed/seite/preise\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.topdata.de/topfeed/seite/preise</a></p><h4>Gerne sind wir auch persönlich für Sie da: +49 (030) 27.87.41-0</h4><h2>Komfortabel und bequem – die Verbindung zu unserem Webservice</h2><h3><i>„TopCONNECTOR“</i></h3><p>Um „TopFEED“ optimal nutzen zu können, ist die Installation eines weiteren Plug-ins\nnotwendig. Der „TopCONNECTOR“ ermöglicht den Zugriff auf unseren Webservice und\nsorgt im Admin-Bereich Ihres Shopware-Shops für die Verknüpfung Ihrer Artikel\nmit unserer Produktdatenbank.\n\n\n</p><p>Dafür\n\ngeben Sie im „TopCONNECTOR“ lediglich die Zugangsdaten zu unserem Webservice\nein.</p><p>\nFür einen reibungslosen Import der Produktdaten in Ihren Webshop sind somit\nkeinerlei Programmierkenntnisse vonnöten und Ihr „TopFEED“ bleibt stets\nautomatisch auf dem neuesten Stand.\n</p><p><b>Das kostenlose Plug-in finden Sie unter: </b><a href=\"https://store.shopware.com/topda52154801356f/topconnector-dateninterface.html\" target=\"_blank\" rel=\"noreferrer noopener\">Shopware-Community-Store</a></p><p>\nAlternativ können Sie „TopFEED“ nach Absprache auch in Dateiform (per FTP oder eMail) beziehen.\n</p><h2>Wir haben noch mehr </h2><h3><i>„TopFINDER“</i></h3><p>\nNutzen Sie die intelligente Produktsuche „TopFINDER“ und präsentieren Sie Ihren Kunden die gesuchten Produkte innerhalb von Sekunden.\n</p><p>\nDas flexible Plug-in lässt sich auf einfache Weise in Ihren bestehenden Shopware-Shop einbinden und bietet dem Anwender die Möglichkeit, diegewünschten Produkte anhand der ausgewählten Drucker-Modelle, über ein komfortables Dropdown-Menü anzeigen zu lassen.\n</p><p>Eine ultraschnelle Volltextsuche mit Produktvorschlägen rundet das Plug-in ab.\n</p><p>Mit „TopFINDER“ lassen Sie Ihre Kunden jeden gewünschten Artikel intuitiv, schnell und zuverlässig finden.\n</p><p><b>Das kostenlose Plug-in finden Sie unter:  </b><a href=\"https://store.shopware.com/topda20811684518f/topfinder-tinte-und-toner-finder.html\" target=\"_blank\" rel=\"noreferrer noopener\">Shopware-Community-Store</a></p>","installationManual":"<b>Kurzanleitung zur Installation:</b><br /><br /><ul><li>Um „TopFEED“ nutzen zu können, muss zunächst das Plug-in „TopCONNECTOR“ installiert werden.\nDas Plug-in steht kostenlos zum Download für Sie bereit: <a href=\"https://store.shopware.com/topda52154801356f/topconnector-dateninterface.html\" target=\"_blank\" rel=\"noreferrer noopener\">Download TopCONNECTOR</a></li><li>\nBei der Installation von „TopCONNECTOR“ hinterlegen Sie die nach dem Kauf von uns erhaltenen Zugangsdaten für den Webservice\n</li><li>\nFür Demonstrationszwecke benutzen Sie bitte folgende Zugangsdaten:<br />\nAPI-User-ID: 6<br />\nAPI-Key: nTI9kbsniVWT13Ns<br />\nAPI-Salt: oateouq974fpby5t6ldf8glzo85mr9t6aebozrox<br /></li><li>\nJetzt können Sie mit der Installation von „TopFEED“ beginnen\n</li><li>\nStarten Sie den Import über die Kommandozeile  <i>php bin/console topdata:connector:import --all</i></li><li>\nEine detaillierte Installationsanweisung, inklusive Systemvoraussetzungen und Einstellungsmöglichkeiten für \"TopFEED\" finden Sie auf unserer  Dokumentations-Webseite:\n<a href=\"https://topdata.de/documentations/\" target=\"_blank\" rel=\"noreferrer noopener\">Zum Manual</a></li><li>\nFür ausführliche Informationen besuchen Sie bitte unsere Webseite: <a href=\"https://www.topdata.de/shopware/seite/topfeed\">www.topdata.de/shopware</a></li><li>\nTesten Sie „TopFEED“: <a href=\"https://shopware6.topdata.de\">Demo</a></li><li>\nBestellen Sie „TopFEED“ kostenpflichtig: <a href=\"https://www.topdata.de/topfeed/seite/preise\">https://www.topdata.de/topfeed/seite/preise</a></li><li>\nUnter der Telefon-Nr.: <b>+49 (030) 27.87.41-0 </b>stehen wir Ihnen für Fragen gerne zur Verfügung\n</li></ul>","shortDescription":"Mit unseren erstklassigen, konsistenten Produktdaten rüsten Sie Ihren Shopware-Shop für einen erfolgreichen Onlinehandel und maximieren die Verkaufschancen Ihrer Artikel.","highlights":"Cross- &amp; Up-Selling durch intelligente Verknüpfungen (Anzeige von Alternativen, verwandten Artikeln, Zubehör, Varianten, Bundles)\nArtikelbilder in hoher Qualität\nArtikelwarengruppen aus eigener Pflege\nArtikeleigenschaften (z.B. Name, Beschreibung, u.v.m.)\nSpezifikationen (z.B. Marke, Farbe, Füllmenge, Kapazität, EAN-Nr., u.v.m.)","features":"Automatische Updates, wahlweise täglich oder wöchentlich\nMultilingual - in 19 Sprachen verfügbar\nCrossing – sofortige Erfassung und Verknüpfung neuer auf dem Markt erscheinender Produkte"},{"id":21749,"name":"TopFEED (Compa- and product data)","description":"<h2>High quality product data for successful eCommerce</h2><p>\n“TopFEED” is a plug-in that refines your article master data with valuable additional information and delivers first-class, consistent product data such as printers, product groups and article specifications for your Shopware shop.\n\n\n</p><p>\n\n\"TopFEED\" consists of two components, the chargeable \"TopFEED-Content\" from TopData Software GmbH and the corresponding Shopware plug-in (for free). In order to guarantee the functionality of \"TopFEED\" in your Shopware shop, the interaction of both components is necessary.\n</p><p>\nWith “TopFEED” you can equip your web shop optimally for online trading and thus maximize the sales opportunities for your products.\n</p><h2>You sell the products - we provide the information</h2><p>\n”TopFEED” improves the quality and scope of your product data and enhances them with additional article properties. This includes specifications (e.g. brand, color, filling quantity, capacity, EAN number, etc.) as well as detailed article descriptions or the display of high-quality product images.\n</p><p>\nThanks to intelligent links, you can use proven marketing instruments with “TopFEED”, such as cross- or up-selling and can thus significantly increase the sales opportunities of your offered products.\n</p><h3>Present your customers with additional versions of each item (up-selling):</h3><ul><li>Products with higher capacities</li><li>Bundles, doubles, multi and value packs</li><li>Time-limited promotional articles</li><li>Articles with larger quantities</li></ul><h3>Or display other products for each item (cross-selling):</h3><ul><li>Third party alternatives</li><li>Devices to which the article is assigned</li><li>Articles to which the devices are assigned</li><li>Products with different colors</li></ul><p>\nThe plug-in is designed in several languages and is perfect for your international business. The following languages are available: DE, EN, FR, IT, ES, NL, SV, PL and more.\n</p><p>\n“TopFEED” can be used not only for web shops, but and/or for electronic product catalogs, internet applications, merchandise management systems and much more. use.\n</p><h2>With ”TopFEED” online shopping becomes an experience</h2><p>\nWell-structured and well-maintained product data is one of the decisive factors in e-commerce.\n</p><p>\nArticle information that is always up-to-date ensures that your customers only see those products that can actually be bought. Extensive and detailed product descriptions ensure that potential buyers can actually find and order the product they want.\n</p><h2>“TopFEED” - a look behind the scenes</h2><p>\n”TopFEED” communicates with our data web service and is based on the link between your articles and our product database. We maintain the data and record all original products as standard, as well as optionally alternative brands or own brands.\n</p><p>\nAn additional plug-in, the ”TopCONNECTOR”, ensures that our data is conveniently and smoothly imported into your Shopware shop system and keeps your ”TopFEED” up to date at all times.\n</p><p>\nBy default, the data are linked via manufacturer numbers and EAN codes of the original products recorded. Linking the product data with other parameters - e.g. the article numbers of your distributors, or your own article numbers - is also optionally possible.\n</p><h3><i>Standard Mapping</i></h3><p>\n”TopFEED” contains the manufacturer numbers and EAN codes of the original products we have recorded. The mapping is therefore carried out exclusively using manufacturer no. and/or EAN codes.\n</p><p>\nWith this variant, your product range is unknown to us and all printers are generally displayed, even if you do not offer any accessories for the device. There is also no guarantee that all products for the printer you are looking for will be displayed in the shop.\n</p><h3><i>Distributor Mapping</i></h3><p>\nIn order to achieve better results, we link the article numbers of your suppliers with our product database and deliver the corresponding article numbers to your shop.\n</p><p>\nThis means that only those devices are displayed to which the supplier's products have been mapped. For this variant we need a list of your suppliers.\n</p><h3><i>Article Mapping</i></h3><p>\nWe create your article numbers in our system and your shop only receives the appropriate article numbers back from us. We know your product range and are therefore able to only display those devices for which products have actually been mapped.\n</p><p>\nIn order to ensure optimal article mapping, we need a list with your article numbers, manufacturer and EAN numbers for this variant.\n</p><h2>Quality at an unbeatable price</h2><p>\nThe provision of the data necessary for \"TopFEED\" is linked to an order on our website that is subject to a fee. \"TopFEED\" consists of four versions that determine the scope of the services offered.\n</p><p>\nThe prices for the individual versions vary depending on the range of services offered. After purchasing one of the packages, you will receive the access data for the web shop.\n</p><p>\nFor detailed information, please visit our website:\n<a href=\"https://www.topdata.de/shopware/seite/topfeed\" target=\"_blank\" rel=\"noreferrer noopener\">www.topdata.de/shopware</a><br />\nTest „TopFEED“:\n<a href=\"https://shopware6.topdata.de\" target=\"_blank\" rel=\"noreferrer noopener\">Demo</a><br />\n Order „TopFEED“ chargeable:\n<a href=\"https://www.topdata.de/topfeed/seite/preise\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.topdata.de/topfeed/seite/preise</a></p><h4>We are also happy to help you personally: +49 (030) 27.87.41-0</h4><h2>Comfortable and convenient - the connection to our web service</h2><h3><i>„TopCONNECTOR“</i></h3><p>\nIn order to be able to use ”TopFEED” optimally, an additional plug-in must be installed. The \"TopCONNECTOR\" enables access to our web service and ensures that your articles are linked to our product database in the admin area of your Shopware shop.\n</p><p>\nTo do this, simply enter the access data for our web service in “TopCONNECTOR”.</p><p>\nNo programming knowledge is required for a smooth import of the product data into your web shop and your “TopFEED” is always automatically up to date.\n</p><p><b>You can find the free plug-in at: </b><a href=\"https://store.shopware.com/topda52154801356f/topconnector-dateninterface.html\" target=\"_blank\" rel=\"noreferrer noopener\">Shopware-Community-Store</a></p><p>\nAlternatively, you can also obtain “TopFEED” in file form (via FTP or email) by arrangement.\n</p><h2>We have more</h2><h3><i>„TopFINDER“</i></h3><p>\nUse the intelligent product search \"TopFINDER\" and present your customers with the products they are looking for within seconds.\n</p><p>\nThe flexible plugin can be easily integrated into your existing Shopware shop and offers the user the option of displaying the desired products using the selected printer models via a convenient drop-down menu.\n</p><p>An ultra-fast full-text search with product suggestions rounds off the plug-in.\n</p><p>With \"TopFINDER\" you let your customers find every desired article intuitively, quickly and reliably.\n</p><p><b>You can find the free plug-in at: </b><a href=\"https://store.shopware.com/topda20811684518f/topfinder-tinte-und-toner-finder.html\" target=\"_blank\" rel=\"noreferrer noopener\">Shopware-Community-Store</a></p>","installationManual":"<b>Quick installation guide:</b><br /><br /><ul><li>For using „TopFEED“ you have to install the plugin „TopCONNECTOR“ first. This plugin is available for you to download free of charge: <a href=\"https://store.shopware.com/en/topda52154801356f/topconnector.html\" target=\"_blank\" rel=\"noreferrer noopener\">Download TopCONNECTOR</a><br /></li><li>\nDuring the installation of „TopCONNECTOR“ you have to deposit the access data you got from us after purchasing\n</li><li>\nFor demonstration purposes please use the following access data:<br />\nAPI-User-ID: 6<br />\nAPI-Key: nTI9kbsniVWT13Ns<br />\nAPI-Salt: oateouq974fpby5t6ldf8glzo85mr9t6aebozrox<br /></li><li>\nNow you can start the installation of „TopFEED“\n</li><li>\nStart the import via command line <i>php bin/console topdata:connector:import --all</i></li><li>\nA detailed installation guide, including system requirements and settings for \"TopFEED\" you will find in our manual: <a href=\"https://www.topdata.de/documentations\" target=\"_blank\" rel=\"noreferrer noopener\">To our manual</a></li><li>\nFor detailed information visit our website: <a href=\"https://www.topdata.de/shopware/seite/topfeed\" target=\"_blank\" rel=\"noreferrer noopener\">www.topdata.de/shopware</a></li><li>\nTest „TopFEED“: <a href=\"https://shopware6.topdata.de\" target=\"_blank\" rel=\"noreferrer noopener\">Demo</a></li><li>\nOrder \"TopFEED\" chargeable: <a href=\"https://www.topdata.de/topfeed/seite/preise\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.topdata.de/topfeed/seite/preise</a></li><li>\nWe are also personally there for you. Please call: <b>+49 (030) 27.87.41-0 </b></li></ul>","shortDescription":"TopData Software Data for your Shopware system.\nInsert our printers, waregroups and specifications for your Shopware.\nTo refine your articles and maximize your sale.","highlights":"Cross- &amp; up-selling through intelligent links (Display of alternatives, related articles, accessories, variants, product bundles)\nHigh quality item images\nArticle groups from own maintenance\nItem properties (e.g. name, description, etc.)\nSpecifications (e.g. brand, color, capacity, capacity, EAN number, and much more)","features":"Automatic updates, either daily or weekly\nMultilingual - available in 19 languages\nCrossing - instantly capturing and linking new products appearing on the market"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":162409,"bookingKey":"topda23759958621","bookingText":"TopFEED (TopData product data)","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwGHa3i","preview":true,"priority":0,"id":59501},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVlnGit","preview":false,"priority":0,"id":59502},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8bKItr","preview":false,"priority":0,"id":59503},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM13ePU","preview":false,"priority":0,"id":59504}],"comments":[],"ratingAverage":0,"label":"TopFEED (Kompa- und Produktdaten)","description":"<h2>Hochwertige Produktdaten für ein erfolgreiches eCommerce</h2><p>„TopFEED“ ist ein Plug-in, das Ihre Artikelstammdaten mit wertvollen Zusatzinformationen veredelt\nund erstklassige, konsistente Produktdaten wie Drucker, Warengruppen und Artikel-Spezifikationen\nfür Ihren Shopware-Shop liefert.\n</p><p>\n\"TopFEED\" besteht aus zwei Komponenten, dem kostenpflichtigen \"TopFEED-Content\" der TopData Software GmbH sowie dem entsprechenden kostenlosen Shopware-Plug-in. Um die Funktionalität von \"TopFEED\" in Ihrem Shopware-Shop zu gewährleisten, ist das Zusammenspiel beider Komponenten nötig.\n</p><p>\nMit „TopFEED“ rüsten Sie Ihren Webshop optimal für den Onlinehandel\nund maximieren so die Verkaufschancen für Ihre Produkte.\n</p><h2>Sie verkaufen die Produkte - wir liefern die Informationen</h2><p>„TopFEED“ verbessert Qualität sowie Umfang Ihrer Produktdaten und wertet diese mit ergänzenden\nArtikeleigenschaften auf. Dazu gehören Spezifikationen (z.B. Marke, Farbe,\nFüllmenge, Kapazität, EAN-Nr., u.v.m.) ebenso wie detaillierte Artikelbeschreibungen,\noder die Anzeige qualitativ hochwertiger Produktbilder.\n</p><p>\nDank intelligenter Verknüpfungen nutzen Sie mit „TopFEED“ bewährte\nMarketinginstrumente, wie z.B. Cross- bzw. Up-Selling und können so die\nAbsatzchancen Ihrer angebotenen Produkte signifikant erhöhen.\n</p><h3>Präsentieren Sie Ihren Kunden zu jedem Artikel weitere Versionen (Up-Selling):</h3><ul><li>Produkte mit höherer Reichweite</li><li> Bundles, Doppel, Multi- und Vorteilspacks</li><li>zeitlich limitierte Aktionsware</li><li>Artikel mit größeren Füllmengen</li></ul><h3>Oder lassen Sie zu jedem Artikel weitere Produkte anzeigen (Cross-Selling):</h3><ul><li>Alternativen von Drittherstellern</li><li>Geräte, denen der Artikel zugeordnet ist</li><li>Artikel, denen die Geräte zugeordnet sind</li><li>Produkte mit anderen Farben</li></ul><p>\nDas Plug-in ist mehrsprachig konzipiert und eignet sich perfekt für Ihr\ninternationales Business. Folgende Sprachen stehen zur Auswahl: DE, EN, FR, IT,\nES, NL, SV, PL und mehr.\n</p><p>\n„TopFEED“ lässt sich nicht nur für Webshops, sondern und/oder für elektronische\nProduktkataloge, Internet-Applikationen, Warenwirtschaftssysteme u.v.m. nutzen.\n</p><h2>Mit „TopFEED“ wird Online-Shopping zum Erlebnis</h2><p>\nOrdentlich strukturierte und gut gepflegte Produktdaten sind einer der entscheidenden Faktoren im E-Commerce.\n</p><p>\nStets aktuell gehaltene Artikelformationen stellen sicher, dass Ihren Kunden nur\ndiejenigen Produkte angezeigt werden, die auch tatsächlich kaufbar sind. Ausführliche\nund detaillierte Produktbeschreibungen sorgen dafür, dass potentielle Käufer\nihr gewünschtes Produkt tatsächlich finden und bestellen können.\n</p><h2>„TopFEED“ – ein Blick hinter die Kulissen</h2><p>„TopFEED“ kommuniziert mit unserem Datenwebservice und basiert auf der Verknüpfung Ihrer\nArtikel mit unserer Produktdatenbank. Wir pflegen die Daten und erfassen dafür standardmäßig\nsämtliche Originalprodukte, sowie optional auch Alternativmarken bzw.\nEigenmarken.\n</p><p>\nEin zusätzliches Plug-in, der „TopCONNECTOR“, sorgt für den bequemen und reibungslosen Import unserer Daten in Ihr Shopware-Shopsystem und hält Ihren „TopFEED“\nstets aktuell.\n</p><p>\nStandardmäßig erfolgt die Verknüpfung der Daten über Herstellernummern sowie EAN-Codes der\nerfassten Originalprodukte. Eine Verknüpfung der Produktdaten mit weiteren\nParametern - z.B. den Artikelnummern Ihrer Distributoren, oder Ihren eigenen\nArtikelnummern - ist optional ebenfalls möglich.\n</p><h3><i>Standard-Mapping</i></h3><p>\nHier enthält „TopFEED“ die Herstellernummern sowie EAN-Codes der von uns erfassten\nOriginalprodukte. Das Mapping erfolgt somit ausschließlich über Hersteller-Nr.\nund/oder EAN-Codes.\n</p><p>\nBei dieser Variante ist uns Ihr Produktsortiment unbekannt und es werden generell\nalle Drucker angezeigt, auch wenn Sie für das Gerät kein Zubehör anbieten. Es\nbesteht auch keine Gewährleistung, dass alle Produkte zu dem gesuchten Drucker im\nShop angezeigt werden.\n</p><h3><i>Distributoren-Mapping</i></h3><p>\nUm bessere Ergebnisse zu erzielen, verknüpfen wir die Artikelnummern Ihrer\nLieferanten mit unserer Produktdatenbank und liefern Ihrem Shop die\nentsprechenden Artikelnummern aus.\n</p><p>\nSomit werden nur diejenigen Geräte angezeigt, zu denen Produkte des Lieferanten\ngemappt worden sind. Für diese Variante benötigen wir eine Liste mit Ihren\nLieferanten.\n</p><h3><i>Artikel-Mapping</i></h3><p>Wir legen Ihre Artikelnummern in unserem System an und Ihr Shop erhält ausschließlich\ndie passenden Artikelnummern von uns zurück. Wir kennen Ihr Produktsortiment\nund sind somit in der Lage, nur jene Geräte anzuzeigen, zu denen auch\ntatsächlich Produkte gemappt worden sind.\n</p><p>\nUm ein optimales Artikel-Mapping zu gewährleisten, benötigen wir für diese\nVariante eine Liste mit Ihren Artikelnummern, Hersteller- sowie EAN-Nummern.\n</p><h2>Qualität zu einem unschlagbaren Preis</h2><p>Die Bereitstellung der für „TopFEED“ notwendigen Daten ist mit einer\nkostenpflichtigen Bestellung auf unserer Webseite verbunden. „TopFEED“ besteht\naus vier Versionen, die den Umfang der angebotenen Leistungen bestimmen.\n</p><p>\nDie Preise für die einzelnen Versionen variieren in Abhängigkeit des gebotenen\nLeistungsspektrums. Nach dem Kauf eines der Pakete, erhalten Sie die\nZugangsdaten für den Webshop.\n</p><p>\nFür ausführliche Informationen besuchen Sie bitte unsere Webseite:<a href=\"https://www.topdata.de/shopware/seite/topfeed\" target=\"_blank\" rel=\"noreferrer noopener\">www.topdata.de/shopware</a><br />\nTesten Sie „TopFEED“: <a href=\"https://shopware6.topdata.de\">Demo</a><br />\nBestellen Sie „TopFEED“ kostenpflichtig: <a href=\"https://www.topdata.de/topfeed/seite/preise\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.topdata.de/topfeed/seite/preise</a></p><h4>Gerne sind wir auch persönlich für Sie da: +49 (030) 27.87.41-0</h4><h2>Komfortabel und bequem – die Verbindung zu unserem Webservice</h2><h3><i>„TopCONNECTOR“</i></h3><p>Um „TopFEED“ optimal nutzen zu können, ist die Installation eines weiteren Plug-ins\nnotwendig. Der „TopCONNECTOR“ ermöglicht den Zugriff auf unseren Webservice und\nsorgt im Admin-Bereich Ihres Shopware-Shops für die Verknüpfung Ihrer Artikel\nmit unserer Produktdatenbank.\n\n\n</p><p>Dafür\n\ngeben Sie im „TopCONNECTOR“ lediglich die Zugangsdaten zu unserem Webservice\nein.</p><p>\nFür einen reibungslosen Import der Produktdaten in Ihren Webshop sind somit\nkeinerlei Programmierkenntnisse vonnöten und Ihr „TopFEED“ bleibt stets\nautomatisch auf dem neuesten Stand.\n</p><p><b>Das kostenlose Plug-in finden Sie unter: </b><a href=\"https://store.shopware.com/topda52154801356f/topconnector-dateninterface.html\" target=\"_blank\" rel=\"noreferrer noopener\">Shopware-Community-Store</a></p><p>\nAlternativ können Sie „TopFEED“ nach Absprache auch in Dateiform (per FTP oder eMail) beziehen.\n</p><h2>Wir haben noch mehr </h2><h3><i>„TopFINDER“</i></h3><p>\nNutzen Sie die intelligente Produktsuche „TopFINDER“ und präsentieren Sie Ihren Kunden die gesuchten Produkte innerhalb von Sekunden.\n</p><p>\nDas flexible Plug-in lässt sich auf einfache Weise in Ihren bestehenden Shopware-Shop einbinden und bietet dem Anwender die Möglichkeit, diegewünschten Produkte anhand der ausgewählten Drucker-Modelle, über ein komfortables Dropdown-Menü anzeigen zu lassen.\n</p><p>Eine ultraschnelle Volltextsuche mit Produktvorschlägen rundet das Plug-in ab.\n</p><p>Mit „TopFINDER“ lassen Sie Ihre Kunden jeden gewünschten Artikel intuitiv, schnell und zuverlässig finden.\n</p><p><b>Das kostenlose Plug-in finden Sie unter:  </b><a href=\"https://store.shopware.com/topda20811684518f/topfinder-tinte-und-toner-finder.html\" target=\"_blank\" rel=\"noreferrer noopener\">Shopware-Community-Store</a></p>","installationManual":"<b>Kurzanleitung zur Installation:</b><br /><br /><ul><li>Um „TopFEED“ nutzen zu können, muss zunächst das Plug-in „TopCONNECTOR“ installiert werden.\nDas Plug-in steht kostenlos zum Download für Sie bereit: <a href=\"https://store.shopware.com/topda52154801356f/topconnector-dateninterface.html\" target=\"_blank\" rel=\"noreferrer noopener\">Download TopCONNECTOR</a></li><li>\nBei der Installation von „TopCONNECTOR“ hinterlegen Sie die nach dem Kauf von uns erhaltenen Zugangsdaten für den Webservice\n</li><li>\nFür Demonstrationszwecke benutzen Sie bitte folgende Zugangsdaten:<br />\nAPI-User-ID: 6<br />\nAPI-Key: nTI9kbsniVWT13Ns<br />\nAPI-Salt: oateouq974fpby5t6ldf8glzo85mr9t6aebozrox<br /></li><li>\nJetzt können Sie mit der Installation von „TopFEED“ beginnen\n</li><li>\nStarten Sie den Import über die Kommandozeile  <i>php bin/console topdata:connector:import --all</i></li><li>\nEine detaillierte Installationsanweisung, inklusive Systemvoraussetzungen und Einstellungsmöglichkeiten für \"TopFEED\" finden Sie auf unserer  Dokumentations-Webseite:\n<a href=\"https://topdata.de/documentations/\" target=\"_blank\" rel=\"noreferrer noopener\">Zum Manual</a></li><li>\nFür ausführliche Informationen besuchen Sie bitte unsere Webseite: <a href=\"https://www.topdata.de/shopware/seite/topfeed\">www.topdata.de/shopware</a></li><li>\nTesten Sie „TopFEED“: <a href=\"https://shopware6.topdata.de\">Demo</a></li><li>\nBestellen Sie „TopFEED“ kostenpflichtig: <a href=\"https://www.topdata.de/topfeed/seite/preise\">https://www.topdata.de/topfeed/seite/preise</a></li><li>\nUnter der Telefon-Nr.: <b>+49 (030) 27.87.41-0 </b>stehen wir Ihnen für Fragen gerne zur Verfügung\n</li></ul>","version":"6.5.1","changelog":[{"version":"6.5.1","text":"<p>Update for Shopware 6.5</p>","creationDate":{"date":"2023-06-10 20:43:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<p>fix getProductIdsWithOtherDevices</p>","creationDate":{"date":"2022-09-26 13:19:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p>add manufacturer support for linked products</p>","creationDate":{"date":"2022-08-05 14:06:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>fix german language settings<br /></p>","creationDate":{"date":"2022-01-31 16:16:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>add topfeed category settings support</p>","creationDate":{"date":"2022-01-31 13:56:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>optimization. devices for detail tab</p>","creationDate":{"date":"2021-06-07 12:39:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Update for Shopware 6.4</p>","creationDate":{"date":"2021-05-17 14:20:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>last SW6.3 Update before SW6.4</p>","creationDate":{"date":"2021-05-17 13:49:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Support Shopware Variants</p>","creationDate":{"date":"2021-04-20 16:27:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"optimize config languages","creationDate":{"date":"2021-02-08 14:46:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>first version of topfeed</p>","creationDate":{"date":"2021-01-22 09:52:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=topda23759958621","redirectToStore":false,"lowestPriceValue":0}