{"id":11668,"name":"AcrisShopSwitchCS","code":"acris89265454439","lastChange":{"date":"2023-07-24 13:38:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpy2mqRj","examplePageUrl":"","moduleKey":"AcrisShopSwitchCS","creationDate":{"date":"2020-06-02 12:29:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-07-23 10:28:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-01-31 09:06:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":18431,"name":"IP Targeting für Verkaufskanal, Land oder Sprache","description":"<h2>Konfiguration / Nutzung des Plugins</h2><p>Es wir im Shopware Admin ein neuer Eintrag hinzugefügt: </p><p>Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung <br></p><p><br></p><h3>Targeting / Umleitungs-Regel anlegen<br></h3><p>Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung-&gt; hinzufügen.</p><p><br></p><h3>Testmodus zur Simulation eines Landes</h3><p><i>NEU: ab Version 4.6.0 <br></i>In den Plugin Einstellungen ist es jetzt möglich, ein Land zu simulieren - folgende Einstellungen sind möglich:<br><br><b>Land / IP Adresse simulieren für</b>: Hier kann ausgewählt werden, ob die Simulation nur für die eigene IP Adresse oder das ausgewählte Land simuliert werden soll.</p><p><i>Achtung: Wenn diese Simulation im LIVE System durchgeführt wird, \nempfiehlt es sich, dass die Simulation nur für die eigene IP Adresse \ndurchgeführt wird.<br></i><b>Land / IP Adresse simulieren für</b>: Im Frontend wird Auswahl des Land oder eine definierte IP Adresse simulieren - Browser Sprachen müssen nach wie vor im Browser entsprechend eingestellt werden.<br><br></p><h3>BEISPIELKONFIGURATION<br></h3><h4>Anforderung:</h4><ul><li>myshop.de - Nur Land Deutschland</li><li>myshop.at - Nur Land Österreich</li><li>myshop.ch - Nur Land Schweiz</li><li>myshop.en - Alle anderen Länder der Welt<br></li></ul><p><br></p><h4>Konfiguration im Modul (Zugeordnete Domains):</h4><ul><li>myshop.de - Land Deutschland freigeben</li><li>myshop.at - Land Österreich freigeben</li><li>myshop.ch - Land Schweiz freigeben</li><li>myshop.en - <b>Länder Deutschland, Österreich und Schweiz sperren</b><br></li></ul><p><br><b>Wichtig:</b> Es MUSS immer auch wie in dem Fall die Domain myshop.en eingetragen wereden, wo die Länder DE, AT und CH gesperrt werden. Ansonsten erfolgt kein Modalfenster und auch keine Umleitung!<br></p><p><br></p><h3>GRUNDEINSTELLUNGEN</h3><ul><li><b>Interner Name</b> (wird in der Übersicht angezeigt). <br>Es ist möglich mehrere Umleitungsregeln anzulegen - dies ist bei verschiedenen Domains / Verkaufskanäle sinnvoll.</li><li><b>Aktiv:</b> aktiv oder nicht aktiv</li><li><b>Definition der Umleitungsregel über Landerkennung (IP-Targeting) und/oder Spracherkennung (Browsersprache)</b><br><ol><li><b>Landerkennung (IP Targeting)&nbsp; (bevorzugte Nutzung)</b><br>Wir haben eine IP Adressdatenbank von MaxMind integriert, aufgrund dieser Tabelle werden IP Adressen abgeglichen. Diese IP-Datenbank wird von uns mehrmals im Jahr im Zuge der Pluginupdates aktualisiert.<br>Eine IP Adresse wird einem Land zugeordnet, sollte keine Zuordnung möglich sein, so wird auf das Default Land zurückgegriffen.<br></li><li><i>Spracherkennung (Browsersprache)</i><br>Wir haben eine Browserspracherkennung integriert, aufgrund der Sprache kann eine Umleitung gesteuert werden<br>Dies ist sinnvoll, wenn anhand der Sprache eine Verkaufskanal Umleitung durchgeführt werden soll (z.B. Sprache italienisch -&gt; Webshop.it)<br></li><li><i>Landerkennung (IP Targeting) und Spracherkennung (Browsersprache)</i><br>Die Kombination des IP Targetings und der Browser-Spracherkennung macht nur sinn, wenn unter einer Domain mehrere Sprachen existieren.<br></li></ol></li><li><b>Typ der Umleitung</b><br><ol><li>Direkte Umleitung ohne Rückfrage<br></li><li><b>Rückfrage über Modalfenster (empfohlen)</b></li><li><b>Nur Lieferland setzten und nicht umleiten (Ab Version 2.3.0) <br></b></li></ol></li></ul><ul><li><b>Verhalten beim Schließen des Modalfensters (Klicken auf 'X')\n</b><br><ol><li>Schließen nicht ermöglichen und (\"X\") verstecken<br>diese Einstellung zwingt den User das Lieferland zu wählen.<br></li><li>Schließen und bei neuem Seitenaufruf erneut fragen<br>ermöglicht weitere Seitenaufrufe, bis sich der User für ein Lieferland entschieden hat, erst dann kommt das Fenster nicht mehr.<br></li><li>Gleiches Verhalten wie beim Bestätigen der Auswahl über den Button <br>wenn der User das Modalfenster ohne Auswahl schließt, wird trotzdem die angezeigte Auswahl für den Shop verwendet.<br></li><li>Schließen und nicht wieder nachfragen<br>Modal Fenster schließt sich und es wird keine Umleitung oder sonstige Aktion ausgeführt.<br></li></ol></li></ul><ul><li><b>Modalfenster anzeigen, auch wenn sich der Kunde bereits in einer passenden Domain befindet\n<br></b>Die Domain ist dann passend, wenn die Konfiguration mit\ndem erkannten Land und / oder der erkannten Sprache übereinstimmt.</li></ul><p><br></p><h4>ZUGEORDNETE DOMAINS&nbsp; (Domain hinzufügen)</h4><ul><li>Basis Einstellungen<br><ol><li>Umleiten nach (ab Plugin Version 3.5.x)<br>Eigene Domain oder Externe URL<br></li><li>Domain (=Zieldomain)<br>auf diese Domain treffen die nachfolgenden Bedingungen zu und findet somit eine Umleitung statt.<br></li><li>Standard Lieferland (=Fallback)<br>Das Standard Lieferland bestimmt das Lieferland der Domain sofern keine alternative Auswahl im Modalfenster getätigt wurde <br>oder kein Land vom IP-Targeting erkannt wurde. (Relevant für Steuerregeln und Preisregeln auf Länderebene.)<br></li></ol></li><li>Zuordnung der Länder (Erkennung über IP-Adresse, Geo Targeting)&nbsp; <b>ODER nicht UND<br></b><ol><li>Folgende Länder auf diese Domain weiterleiten\n<br><i>Es werden die hier zugeordneten Länder zur Auswahl im Frontend gestellt.<br>Dieses Feature ist dann sinnvoll, wenn einer Domain einige, wenige Länder&nbsp; </i><i><i>(z.B. Deutschland, Schweiz, Östereich) zuzuordnen sind.<br></i></i><b>ODER</b></li><li>Folgende Länder für diese Domain sperren\n<br><i>Es werden alle Länder zur Auswahl gestellt, die dem Verkaufskanal zugeordnet sind, ausgenommen der hier ausgewählten Länder.<br>Dieses Feature ist dann sinnvoll, wenn einige Länder (z.B. Deutschland, Schweiz, Östereich) bereits einer anderen Domain zugeordnet sind und alle anderen dann dieser Domain zugeordnet werden sollen.<br></i></li></ol></li></ul><p><br></p><h2>Datenschutz</h2><p></p><h3>Cookies</h3><p></p><p>Das Plugin setzt ein Cookie \"acris_shop_switch_checked\". Dieses Cookie speichert in welchen Domains des Verkaufskanales bereits eine IP-Abfrage statt gefunden hat. Da das Plugin für die korrekte Funktionalität des Plugins erforderlich ist, wird das Cookie vom Plugin in die funktionalen Cookies eingefügt.<br></p><h3>IP-Datenbank<br></h3><p></p><p>Die Datenbank zur IP-Abfrage liegt direkt beim Plugin, also auf dem Server wo sich auch das Shopsystem befindet. Es findet kein Datenaustausch mit einem anderen Server statt und es werden auch keine IP-Adressen oder IP-Abfragen im Zuge der Abfrage gespeichert. Das Plugin kann deshalb datenschutzrechtlich ohne Bedenken eingesetzt werden.<br></p><p><br></p><h2>Tipps &amp; Tricks</h2><h3>Bei der Umstellung der Erkennungsmethoden -&gt; IP-Targeting und Browser Erkennung <br></h3><p>Wenn nachträglich die Erkennungsmethode umgestellt wird, bitte unbedingt die Einstellungen der Domains prüfen. Die IP-Adressen Erkennung bzw. die Spracherkennung erfordert unterschiedliche Pflichtfelder (Länder vs. Sprachen).<br></p><h3><br></h3><h3>Aufruf der Domain produziert 500er Fehler <br></h3>Aufgrund von komplexen Situationen (zum Beispiel mehrere Sprachen unter einer Domain) ist es sinnvoll, dass die Domains mit einem Pfad aufgerufen wird wie z.B.<br>https://sw6.acris.at/de-de |&nbsp; https://sw6.acris.at/en-gb | https://sw6.acris.at/it-it<br>Dies führt im Shopware Standard zu einem 500er Fehler, da die Hauptdomain ohne Pfad https://sw6.acris.at nicht angelegt wird. <br><p><b>Eine mögliche Lösung </b>ist eine Umleitung von https://sw6.acris.at auf https://sw6.acris.at/de-de und danach funktioniert das IP Targeting Plugin einwandfrei.<br>Dazu können sie auch gerne unsere <a href=\"https://store.shopware.com/acris64942382445/seo-tools.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://store.shopware.com/acris64942382445/seo-tools.html</a> nutzen, dort ist auch ein entsprechendes Redircet Modul integriert. <br></p><h3><br></h3><h3>Anpassungen der Texte im Modal Fenster<br></h3><p>Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung&nbsp; -&gt; eine neue Umleitungsregel anlegen oder eine bestehende bearbeiten -&gt; <br>im Bereich Layout sind Änderungen möglich. Bitte ganz oben die Sprache umschalten (=Shopware Standard) wenn sie verschiedene Sprachen bearbeiten möchten.<br></p><p><br></p><p><b>Ab Version 3.4.0:</b> Die Sprache im Modalfenster richtet sich nach der Browsersprache des Kunden. Diese Konfiguration kann in den Plugineinstellungen angepasst werden.</p><p><br></p><h2>IP-Targeting Modalfenster nachträglich öffnen</h2><p></p><p><b>Voraussetzung: </b>Um die Funktion nutzen zu können, muss eine valide und für die aktuelle Domain gültige Umleitungsregel konfiguriert worden sein (siehe oben).<b><br></b></p><p><b>1. Plugineinstellungen</b><br></p><p>In den Plugineinstellungen (Erweiterungen &gt; Meine Erweiterungen &gt; \"IP Targeting für Verkaufskanal, Land oder Sprache“ &gt; Konfigurieren) muss die Einstellung \"IP-Targeting Modalfenster über JavaScript Kommando nachträglich aufrufbar“ aktiviert werden.<br><b>2. Link konfigurieren</b><br></p><p>Nun ist es möglich über den JavaScript Konsolen Aufruf „window.openShopSwitchModal();“ das Modalfenster, auch nachdem es vom Benutzer bestätigt wurde, zu öffnen.<br>Der Link kann auch als externer Link bei einer Kategorie (z.B. im Footer) platziert werden: \"javascript:openShopSwitchModal()\"<br>Alternativ kann im Theme auch der HTML-Link eingefügt werden. Beispiel: &lt;a href=\"javascript:openShopSwitchModal()\" title=\"Ip targeting settings\"&gt;Ip targeting settings&lt;/a&gt;<br></p><p><br></p><h2>IP-Targeting Modul Headless nutzen</h2><p></p><p>Gleich wie bei der Implementierung über AJAX, ist es möglich die zentrale Storefront API-Route \"Acris\\ShopSwitch\\Components\\ShopSwitch\\ShopSwitchRoute\" über Headless aufzurufen.<br>Die URL lautet /store-api/acris-shop-switch-rules/{activeDomainId}. Der Aufruf kann über GET oder POST durchgeführt werden. Die aktive Domain-ID (aus Datenbank Tabelle sales_channel_domain) ist als Parameter verpflichtend anzugeben.<br>Darin sind alle relevanten Informationen zum IP-Targeting enthalten. Über die jeweilige Storefront Technologie kann dann das Modalfenster angezeigt und auf das Ergebnis von der Route reagiert werden.<br>Sollte die Funktionalität unklar sein oder Bausteine für eine Implementierung fehlen, kann gerne mit dem Support Team über den Shopware Account Kontakt aufgenommen werden.<br></p><p><br></p><h2>Support</h2><p>Die Konfigurationsmöglichkeiten des Plugins sind vielfältig. <br>Deshalb bieten wir gegen einen Aufpreis auch gerne ein Einrichtungsservice an - bitte fragen Sie bei uns an: office@acris.at<br><br></p>","installationManual":"<p>\nDie Installation des Plugins geht sehr schnell und ist unkompliziert.</p><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren</li><li>Es wird im Shopware Admin ein neuer Eintrag hinzugefügt: <br />Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung </li></ul>","shortDescription":"Mittels IP Targeting oder Browser Spracherkennung ist eine Umleitung in den entsprechenden Verkaufskanal mit (default) Land und der richtigen Sprache möglich.","highlights":"Mittels IP Targeting in den richtigen Verkaufskanal weiterleiten\nMittels Browser Spracherkennung in den richtigen Verkaufskanal / der richtigen Sprache weiterleiten\nEntweder direkte Weiterleitung oder Modalfenster für User zur Auswahl\nIndividuell konfigurierbar - auch komplexe Konstellationen abbildbar\nSetzt automatisch Lieferland ohne Seitenumleitung, Ab Version 3.5.0: Umleitung auch zu externer URL möglich","features":"Mittels IP Targeting wird das Land des Users erkannt und eine konfigurierbare Weiterleitung kann durchgeführt werden\nZuordnung zum richtigen Verkaufskana mittels der eingestellten Browser Sprache\nDirekte Umleitung zum richtigen Verkaufskanal oder zuerst über ein Modalfenster\nIndividuell konfigurierbar - auch komplexe Konstellationen abbildbar\nTexte für Modalfenster einfach anpassbar\nMehrsprachenfähig\nSetzt automatisch Lieferland ohne Seitenumleitung\nTestmode / Land Simulierung"},{"id":18433,"name":"IP targeting for sales channel, country or language","description":"<h2>Configuration / Use of the plugin</h2>A new entry will be added in the Shopware Admin:<br>Settings -&gt; Plugins -&gt;IP-Targeting and speech recognition<br><p><br></p><h2>Create targeting / redirection rule</h2><p>Settings -&gt; Plugins -&gt;IP-Targeting and Voice Recognition-&gt; add.</p><p><br></p><h2>Test mode to simulate a country</h2><p><i>NEW: from version 4.6.0<br></i>In the plugin settings it is now possible to simulate a country - the following settings are possible:<br><br><b>Simulate country / IP address for:</b> Here you can select whether the simulation should be simulated only for your own IP address or for the selected country.<br>Attention: If this simulation is performed in the LIVE system, it is recommended that the simulation is performed only for the own IP address.<br><b>Simulate country / IP address for:</b> In the frontend, selection of the country or a defined IP address will simulate - browser languages must still be set accordingly in the browser.<br><br></p><h3>EXAMPLE CONFIGURATION<br></h3><h4>Requirement:</h4><ul><li>myshop.de - Only country Germany<br></li><li>myshop.at - Only country Austria<br></li><li>myshop.ch - Only country Switzerland<br></li><li>myshop.en - All other countries of the world<br></li></ul><p><br></p><h4>Configuration in the module (Assigned domains):</h4><ul><li>myshop.de - Unblock country Deutschland<br></li><li>myshop.at - Unblock country Austria</li><li>myshop.ch - Unblock country Switzerland<br></li><li>myshop.en - <b>Block countries Germany, Austria and Switzerland</b><br></li></ul><p><br></p><p><b>Important:</b> The domain myshop.en MUST always be entered, as in this case, where the countries DE, AT and CH are blocked. Otherwise there will be no modal window and no redirection!</p><p></p><p><br></p><h3>BASIC SETTINGS</h3><h4>&nbsp;&nbsp;&nbsp; Internal name (displayed in the overview).</h4><p>&nbsp;&nbsp;&nbsp; It is possible to create multiple redirection rules - this is useful for different domains / sales channels.<br></p><h4>&nbsp;&nbsp;&nbsp; Definition of the redirection rule via country detection (IP-Targeting) and/or language detection (browser language)</h4><p><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Landing detection (IP targeting) (preferred use)<br></b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have integrated an IP address database from MaxMind; IP addresses are matched on the basis of this table. We update this IP database several times a year in the course of plug-in updates.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; An IP address is assigned to a country. If no assignment is possible, the default country is used.<br><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Language recognition (browser language)<br></b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We have integrated a browser language recognition, due to the language a redirection can be controlled<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This is useful if a sales channel redirection is to be carried out based on the language (e.g. language Italian -&gt; Webshop.it)<br><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Country detection (IP targeting) and language detection (browser language)<br></b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The combination of IP targeting and browser speech recognition only makes sense if several languages exist under one domain.<br></p><h4>&nbsp;&nbsp;&nbsp; Type of redirection</h4><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Direct call forwarding without consultation<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Consultation via modal window (recommended)<br><br></p><h4>&nbsp;&nbsp;&nbsp; Behavior when closing the modal window (click on 'X')</h4><p><b>Do not enable closing and hide (\"X\")</b><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; this setting forces the user to select the delivery country.<br><b>Close and ask again on new page view</b><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; allows further page views until the user has decided on a delivery country, only then the window no longer appears.<br><b>Same behavior as when confirming the selection using the button</b><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; if the user closes the modal window without selection, the displayed selection is still used for the shop.<br><b>&nbsp; Close and do not ask again</b><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Modal window closes and no redirection or other action is performed.<br></p><h4>&nbsp;&nbsp;&nbsp; Show modal window, even if the customer is already in a matching domain</h4><p>&nbsp;&nbsp;&nbsp; The domain is suitable if the configuration matches the recognized country and / or the recognized language.<br><br></p><h3>ASSIGNED DOMAINS (Add Domain)</h3><h4>&nbsp;&nbsp;&nbsp; Basic settings</h4><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Domain (= target domain)<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The following conditions apply to this domain and therefore a redirection takes place.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Standard delivery country (=fallback)<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The default delivery country determines the delivery country of the domain if no alternative selection was made in the modal window<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; or no country has been detected by IP-Targeting. (Relevant for tax rules and pricing rules at country level).<br></p><h4>&nbsp;&nbsp;&nbsp; Assignment of countries (detection via IP address, geo targeting) OR not AND</h4><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Forward the following countries to this domain<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The countries assigned here are made available for selection in the front end.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This feature is useful if a domain has a few countries (e.g. Germany, Switzerland, Austria) to assign to it.<br><b> OR</b><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Block the following countries for this domain<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; All countries that are assigned to the sales channel are available for selection, except for the countries selected here.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This feature is useful if some countries (e.g. Germany, Switzerland, Austria) are already assigned to another domain and all others should then be assigned to this domain.<br></p><p><br></p><h2>Data privacy<br></h2><p></p><h3>Cookies</h3><p>The plugin sets a cookie \"acris_shop_switch_checked\". This cookie stores in which domains of the sales channel an IP query has already taken place. Since the plugin is required for the correct functionality of the plugin, the cookie is inserted by the plugin in the functional cookies.<br></p><h3>IP database<br></h3><p></p><p>The database for the IP query is located directly at the plug-in, i.e. on the server where the shop system is also located. There is no data exchange with another server and no IP addresses or IP queries are stored in the course of the query. The plugin can therefore be used without any concerns regarding data protection.<br></p><p></p><p><br></p><h2>Tips &amp; tricks</h2><br><h2>Adjustments of the texts in the modal window</h2>Settings -&gt; Plugins -&gt;IP-Targeting and speech recognition -&gt; create a new redirection rule or edit an existing one -&gt;in the layout area, changes are possible.&nbsp; Please change the language at the top (=Shopware Standard) if you want to work with different languages.<br><p><br></p><p><b>From version 3.4.0:</b> The language in the modal window is based on the customer's browser language. This configuration can be customized in the plugin settings.</p><p><br></p><h2>Open IP targeting modal window afterwards</h2><p></p><p><b>Requirement: </b>In order to be able to use the function, a valid redirection rule that is valid for the current domain must have been configured (see above).<b><br></b></p><p><b>1. Plugin Settings</b><br>In the plugin settings (Extensions &gt; My Extensions &gt; \"IP targeting for sales channel, country or language\" &gt; Configure) the setting \"IP targeting modal window can be called later via JavaScript command\" must be activated.<br><b>2. Configure link</b><br>It is now possible to open the modal window via the JavaScript console call \"window.openShopSwitchModal();\" even after it has been confirmed by the user.<br>The link can also be placed as an external link in a category (e.g. in the footer): \"javascript:openShopSwitchModal()\"<br>Alternatively, the HTML link can also be inserted in the theme. Example: &lt;a href=\"javascript:openShopSwitchModal()\" title=\"Ip targeting settings\"&gt;Ip targeting settings&lt;/a&gt;<br></p><p><br></p><h2>Using the IP Targeting Module Headless</h2><p></p><p>As with the implementation via AJAX, it is possible to call the central storefront API route \"Acris\\ShopSwitch\\Components\\ShopSwitch\\ShopSwitchRoute\" via Headless.<br>The URL is /store-api/acris-shop-switch-rules/{activeDomainId}. The call can be made via GET or POST. The active domain ID (from database table sales_channel_domain) is mandatory as a parameter.<br>This contains all relevant information on IP targeting. The modal window can then be displayed via the respective storefront technology and the result can be reacted to by the route.<br>If the functionality is unclear or components for an implementation are missing, please feel free to contact the support team via the Shopware account.<br></p><p><br></p><h2>Support</h2><p>The configuration possibilities of the plugin are manifold. <br>That's why we are happy to offer a setup service for an additional fee - please ask us: office@acris.at<br></p>","installationManual":"<h2>The installation of the plugin is very fast and uncomplicated.</h2><ul><li>Plugin Manager via Settings &gt; System &gt; Plugins</li></ul><ul><li><p>Upload, install and activate the plugin</p></li><li>A new entry will be added in the Shopware Admin: <br />Settings -&gt; Plugins -&gt;IP-Targeting and speech recognition <br /></li></ul>","shortDescription":"Using IP targeting or browser speech recognition, redirection to the appropriate sales channel with (default) country and the correct language is possible.","highlights":"Using IP targeting to route to the right sales channel\nForwarding speech recognition to the right sales channel / the right language via browser\nEither direct forwarding or modal window for user selection\nIndividually configurable - even complex constellations can be mapped \nFrom version 3.5.0: Redirection to external URL also possible","features":"IP targeting is used to identify the country of the user and to perform configurable forwarding\nAssignment to the correct sales channel by means of the set browser language\nDirect redirection to the correct sales channel or first via a modal window\nIndividually configurable - even complex constellations can be mapped\nTexts for modal windows easily customizable\nMultilingual\nTestmode / Country Simulation"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":172236,"bookingKey":"acris89265454439","bookingText":"IP targeting for sales channel, country or language","price":299,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":172235,"bookingKey":"acris89265454439_M","bookingText":"IP targeting for sales channel, country or language","price":49.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAygmVw","preview":true,"priority":0,"id":67859},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuxpjF5","preview":false,"priority":30,"id":46019},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeuA6ZE","preview":false,"priority":20,"id":46008},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz0vUaq","preview":false,"priority":0,"id":44347},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoH9UrD","preview":false,"priority":0,"id":44348},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDCOvgR","preview":false,"priority":0,"id":44349},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT0ViiQ","preview":false,"priority":0,"id":44350},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpl36JWz","preview":false,"priority":0,"id":44351},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9yymYG","preview":false,"priority":0,"id":46009},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmUbYEP","preview":false,"priority":0,"id":63601},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3ZHGF2","preview":false,"priority":0,"id":112932},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMzq8Jc","preview":false,"priority":0,"id":121022}],"comments":[{"authorName":"Basic care BV","text":"An open minded and proactive support of top quality level. Quick and competent response to our questions and requests. Prepared to devise and implement solutions that make the plugin even better and more complete.","headline":"Professional Plugin with responsive support","creationDate":{"date":"2023-05-17 10:03:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"wazzl GmbH","text":"Super Erfahrung mit dem Support gemacht und die Funktionalität ist auch sehr durchdacht und ausgereift.","headline":"Support und Funktion überragend","creationDate":{"date":"2023-04-19 10:58:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Henning Vielitz","text":"Wir nutzen diese Erweiterung um für OSS alles sauber zu gestalten. Wir sind sehr zufrieden und können die Erweiterung so empfehlen.","headline":"erleichtert OSS","creationDate":{"date":"2023-03-13 16:01:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Uwe Raabe","text":"Das PlugIn macht ordentlich was es soll, vor Allem in Kombination mit OSS Steuern (Mehrwertsteuer) je Land ist es sehr nützlich.\nSupport bei Implementierung in ein Custom Theme war schnell und zielführend!","headline":"Schneller kompetenter Support","creationDate":{"date":"2022-05-04 10:11:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Alexander Noll","text":"Im Zusammenspiel mit den Plugins \"Steuern (Mehrwertsteuer) je Land in Preis berücksichtigen (Netto + Mwst des Landes)\" und \"Versandsart / Zahlungsart Vorauswahl (Priorisierung und automatische Umschaltung)\" spielt dieses Plugin eine wunderbare Rolle und definiert im Voraus je nach Sprache oder Land die Voraussetzungen für einen reibungslosen Einkauf auf unserer mehrsprachigen Webseite. 5*","headline":"Funktioniert wie es soll!","creationDate":{"date":"2021-07-20 12:01:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"IP Targeting für Verkaufskanal, Land oder Sprache","description":"<h2>Konfiguration / Nutzung des Plugins</h2><p>Es wir im Shopware Admin ein neuer Eintrag hinzugefügt: </p><p>Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung <br /></p><p><br /></p><h3>Targeting / Umleitungs-Regel anlegen<br /></h3><p>Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung-&gt; hinzufügen.</p><p><br /></p><h3>Testmodus zur Simulation eines Landes</h3><p><i>NEU: ab Version 4.6.0 <br /></i>In den Plugin Einstellungen ist es jetzt möglich, ein Land zu simulieren - folgende Einstellungen sind möglich:<br /><br /><b>Land / IP Adresse simulieren für</b>: Hier kann ausgewählt werden, ob die Simulation nur für die eigene IP Adresse oder das ausgewählte Land simuliert werden soll.</p><p><i>Achtung: Wenn diese Simulation im LIVE System durchgeführt wird, \nempfiehlt es sich, dass die Simulation nur für die eigene IP Adresse \ndurchgeführt wird.<br /></i><b>Land / IP Adresse simulieren für</b>: Im Frontend wird Auswahl des Land oder eine definierte IP Adresse simulieren - Browser Sprachen müssen nach wie vor im Browser entsprechend eingestellt werden.<br /><br /></p><h3>BEISPIELKONFIGURATION<br /></h3><h4>Anforderung:</h4><ul><li>myshop.de - Nur Land Deutschland</li><li>myshop.at - Nur Land Österreich</li><li>myshop.ch - Nur Land Schweiz</li><li>myshop.en - Alle anderen Länder der Welt<br /></li></ul><p><br /></p><h4>Konfiguration im Modul (Zugeordnete Domains):</h4><ul><li>myshop.de - Land Deutschland freigeben</li><li>myshop.at - Land Österreich freigeben</li><li>myshop.ch - Land Schweiz freigeben</li><li>myshop.en - <b>Länder Deutschland, Österreich und Schweiz sperren</b><br /></li></ul><p><br /><b>Wichtig:</b> Es MUSS immer auch wie in dem Fall die Domain myshop.en eingetragen wereden, wo die Länder DE, AT und CH gesperrt werden. Ansonsten erfolgt kein Modalfenster und auch keine Umleitung!<br /></p><p><br /></p><h3>GRUNDEINSTELLUNGEN</h3><ul><li><b>Interner Name</b> (wird in der Übersicht angezeigt). <br />Es ist möglich mehrere Umleitungsregeln anzulegen - dies ist bei verschiedenen Domains / Verkaufskanäle sinnvoll.</li><li><b>Aktiv:</b> aktiv oder nicht aktiv</li><li><b>Definition der Umleitungsregel über Landerkennung (IP-Targeting) und/oder Spracherkennung (Browsersprache)</b><br /><ol><li><b>Landerkennung (IP Targeting)  (bevorzugte Nutzung)</b><br />Wir haben eine IP Adressdatenbank von MaxMind integriert, aufgrund dieser Tabelle werden IP Adressen abgeglichen. Diese IP-Datenbank wird von uns mehrmals im Jahr im Zuge der Pluginupdates aktualisiert.<br />Eine IP Adresse wird einem Land zugeordnet, sollte keine Zuordnung möglich sein, so wird auf das Default Land zurückgegriffen.<br /></li><li><i>Spracherkennung (Browsersprache)</i><br />Wir haben eine Browserspracherkennung integriert, aufgrund der Sprache kann eine Umleitung gesteuert werden<br />Dies ist sinnvoll, wenn anhand der Sprache eine Verkaufskanal Umleitung durchgeführt werden soll (z.B. Sprache italienisch -&gt; Webshop.it)<br /></li><li><i>Landerkennung (IP Targeting) und Spracherkennung (Browsersprache)</i><br />Die Kombination des IP Targetings und der Browser-Spracherkennung macht nur sinn, wenn unter einer Domain mehrere Sprachen existieren.<br /></li></ol></li><li><b>Typ der Umleitung</b><br /><ol><li>Direkte Umleitung ohne Rückfrage<br /></li><li><b>Rückfrage über Modalfenster (empfohlen)</b></li><li><b>Nur Lieferland setzten und nicht umleiten (Ab Version 2.3.0) <br /></b></li></ol></li></ul><ul><li><b>Verhalten beim Schließen des Modalfensters (Klicken auf 'X')\n</b><br /><ol><li>Schließen nicht ermöglichen und (\"X\") verstecken<br />diese Einstellung zwingt den User das Lieferland zu wählen.<br /></li><li>Schließen und bei neuem Seitenaufruf erneut fragen<br />ermöglicht weitere Seitenaufrufe, bis sich der User für ein Lieferland entschieden hat, erst dann kommt das Fenster nicht mehr.<br /></li><li>Gleiches Verhalten wie beim Bestätigen der Auswahl über den Button <br />wenn der User das Modalfenster ohne Auswahl schließt, wird trotzdem die angezeigte Auswahl für den Shop verwendet.<br /></li><li>Schließen und nicht wieder nachfragen<br />Modal Fenster schließt sich und es wird keine Umleitung oder sonstige Aktion ausgeführt.<br /></li></ol></li></ul><ul><li><b>Modalfenster anzeigen, auch wenn sich der Kunde bereits in einer passenden Domain befindet\n<br /></b>Die Domain ist dann passend, wenn die Konfiguration mit\ndem erkannten Land und / oder der erkannten Sprache übereinstimmt.</li></ul><p><br /></p><h4>ZUGEORDNETE DOMAINS  (Domain hinzufügen)</h4><ul><li>Basis Einstellungen<br /><ol><li>Umleiten nach (ab Plugin Version 3.5.x)<br />Eigene Domain oder Externe URL<br /></li><li>Domain (=Zieldomain)<br />auf diese Domain treffen die nachfolgenden Bedingungen zu und findet somit eine Umleitung statt.<br /></li><li>Standard Lieferland (=Fallback)<br />Das Standard Lieferland bestimmt das Lieferland der Domain sofern keine alternative Auswahl im Modalfenster getätigt wurde <br />oder kein Land vom IP-Targeting erkannt wurde. (Relevant für Steuerregeln und Preisregeln auf Länderebene.)<br /></li></ol></li><li>Zuordnung der Länder (Erkennung über IP-Adresse, Geo Targeting)  <b>ODER nicht UND<br /></b><ol><li>Folgende Länder auf diese Domain weiterleiten\n<br /><i>Es werden die hier zugeordneten Länder zur Auswahl im Frontend gestellt.<br />Dieses Feature ist dann sinnvoll, wenn einer Domain einige, wenige Länder  </i><i><i>(z.B. Deutschland, Schweiz, Östereich) zuzuordnen sind.<br /></i></i><b>ODER</b></li><li>Folgende Länder für diese Domain sperren\n<br /><i>Es werden alle Länder zur Auswahl gestellt, die dem Verkaufskanal zugeordnet sind, ausgenommen der hier ausgewählten Länder.<br />Dieses Feature ist dann sinnvoll, wenn einige Länder (z.B. Deutschland, Schweiz, Östereich) bereits einer anderen Domain zugeordnet sind und alle anderen dann dieser Domain zugeordnet werden sollen.<br /></i></li></ol></li></ul><p><br /></p><h2>Datenschutz</h2><p></p><h3>Cookies</h3><p></p><p>Das Plugin setzt ein Cookie \"acris_shop_switch_checked\". Dieses Cookie speichert in welchen Domains des Verkaufskanales bereits eine IP-Abfrage statt gefunden hat. Da das Plugin für die korrekte Funktionalität des Plugins erforderlich ist, wird das Cookie vom Plugin in die funktionalen Cookies eingefügt.<br /></p><h3>IP-Datenbank<br /></h3><p></p><p>Die Datenbank zur IP-Abfrage liegt direkt beim Plugin, also auf dem Server wo sich auch das Shopsystem befindet. Es findet kein Datenaustausch mit einem anderen Server statt und es werden auch keine IP-Adressen oder IP-Abfragen im Zuge der Abfrage gespeichert. Das Plugin kann deshalb datenschutzrechtlich ohne Bedenken eingesetzt werden.<br /></p><p><br /></p><h2>Tipps &amp; Tricks</h2><h3>Bei der Umstellung der Erkennungsmethoden -&gt; IP-Targeting und Browser Erkennung <br /></h3><p>Wenn nachträglich die Erkennungsmethode umgestellt wird, bitte unbedingt die Einstellungen der Domains prüfen. Die IP-Adressen Erkennung bzw. die Spracherkennung erfordert unterschiedliche Pflichtfelder (Länder vs. Sprachen).<br /></p><h3><br /></h3><h3>Aufruf der Domain produziert 500er Fehler <br /></h3>Aufgrund von komplexen Situationen (zum Beispiel mehrere Sprachen unter einer Domain) ist es sinnvoll, dass die Domains mit einem Pfad aufgerufen wird wie z.B.<br />https://sw6.acris.at/de-de |  https://sw6.acris.at/en-gb | https://sw6.acris.at/it-it<br />Dies führt im Shopware Standard zu einem 500er Fehler, da die Hauptdomain ohne Pfad https://sw6.acris.at nicht angelegt wird. <br /><p><b>Eine mögliche Lösung </b>ist eine Umleitung von https://sw6.acris.at auf https://sw6.acris.at/de-de und danach funktioniert das IP Targeting Plugin einwandfrei.<br />Dazu können sie auch gerne unsere <a href=\"https://store.shopware.com/acris64942382445/seo-tools.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://store.shopware.com/acris64942382445/seo-tools.html</a> nutzen, dort ist auch ein entsprechendes Redircet Modul integriert. <br /></p><h3><br /></h3><h3>Anpassungen der Texte im Modal Fenster<br /></h3><p>Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung  -&gt; eine neue Umleitungsregel anlegen oder eine bestehende bearbeiten -&gt; <br />im Bereich Layout sind Änderungen möglich. Bitte ganz oben die Sprache umschalten (=Shopware Standard) wenn sie verschiedene Sprachen bearbeiten möchten.<br /></p><p><br /></p><p><b>Ab Version 3.4.0:</b> Die Sprache im Modalfenster richtet sich nach der Browsersprache des Kunden. Diese Konfiguration kann in den Plugineinstellungen angepasst werden.</p><p><br /></p><h2>IP-Targeting Modalfenster nachträglich öffnen</h2><p></p><p><b>Voraussetzung: </b>Um die Funktion nutzen zu können, muss eine valide und für die aktuelle Domain gültige Umleitungsregel konfiguriert worden sein (siehe oben).<b><br /></b></p><p><b>1. Plugineinstellungen</b><br /></p><p>In den Plugineinstellungen (Erweiterungen &gt; Meine Erweiterungen &gt; \"IP Targeting für Verkaufskanal, Land oder Sprache“ &gt; Konfigurieren) muss die Einstellung \"IP-Targeting Modalfenster über JavaScript Kommando nachträglich aufrufbar“ aktiviert werden.<br /><b>2. Link konfigurieren</b><br /></p><p>Nun ist es möglich über den JavaScript Konsolen Aufruf „window.openShopSwitchModal();“ das Modalfenster, auch nachdem es vom Benutzer bestätigt wurde, zu öffnen.<br />Der Link kann auch als externer Link bei einer Kategorie (z.B. im Footer) platziert werden: \"javascript:openShopSwitchModal()\"<br />Alternativ kann im Theme auch der HTML-Link eingefügt werden. Beispiel: &lt;a href=\"javascript:openShopSwitchModal()\" title=\"Ip targeting settings\"&gt;Ip targeting settings&lt;/a&gt;<br /></p><p><br /></p><h2>IP-Targeting Modul Headless nutzen</h2><p></p><p>Gleich wie bei der Implementierung über AJAX, ist es möglich die zentrale Storefront API-Route \"Acris\\ShopSwitch\\Components\\ShopSwitch\\ShopSwitchRoute\" über Headless aufzurufen.<br />Die URL lautet /store-api/acris-shop-switch-rules/{activeDomainId}. Der Aufruf kann über GET oder POST durchgeführt werden. Die aktive Domain-ID (aus Datenbank Tabelle sales_channel_domain) ist als Parameter verpflichtend anzugeben.<br />Darin sind alle relevanten Informationen zum IP-Targeting enthalten. Über die jeweilige Storefront Technologie kann dann das Modalfenster angezeigt und auf das Ergebnis von der Route reagiert werden.<br />Sollte die Funktionalität unklar sein oder Bausteine für eine Implementierung fehlen, kann gerne mit dem Support Team über den Shopware Account Kontakt aufgenommen werden.<br /></p><p><br /></p><h2>Support</h2><p>Die Konfigurationsmöglichkeiten des Plugins sind vielfältig. <br />Deshalb bieten wir gegen einen Aufpreis auch gerne ein Einrichtungsservice an - bitte fragen Sie bei uns an: office@acris.at<br /><br /></p>","installationManual":"<p>\nDie Installation des Plugins geht sehr schnell und ist unkompliziert.</p><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren</li><li>Es wird im Shopware Admin ein neuer Eintrag hinzugefügt: <br />Einstellungen -&gt; Plugins -&gt;IP-Targeting und Spracherkennung </li></ul>","version":"5.1.0","changelog":[{"version":"5.1.0","text":"<p>The IP targeting modal window can now be called up subsequently via a JavaScript command, if this has been activated in the plugin settings.</p>","creationDate":{"date":"2023-07-24 13:08:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.4","text":"<ul><li>Improved storefront compatibility with other plugins.</li></ul>","creationDate":{"date":"2023-06-19 07:40:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.3","text":"<p>Prevention of error messages due to redirects.</p>","creationDate":{"date":"2023-06-05 09:08:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.2","text":"<ul><li>Fixed country flags display in storefront topbar.</li></ul>","creationDate":{"date":"2023-05-19 10:56:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.1","text":"<p>Optimisation of the plugin for headless use. The result of the IP targeting / speech recognition can now be retrieved via the store API URL /store-api/acris-shop-switch-rules/{activeDomainId} and processed further in a headless environment.</p>","creationDate":{"date":"2023-05-10 12:05:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.0","text":"<p>Compatibility established for SW 6.5</p>","creationDate":{"date":"2023-05-02 09:22:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.6","text":"<p>Optimizes loading of the shipping country from the cache.</p>","creationDate":{"date":"2023-07-07 09:43:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.5","text":"<p>Prevention of error messages due to redirects.</p>","creationDate":{"date":"2023-06-02 12:27:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.4","text":"<ul><li>Fixed country flags display in storefront topbar.</li></ul>","creationDate":{"date":"2023-05-19 12:04:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.3","text":"<p>Optimisation of the plugin for headless use. The result of the IP targeting / speech recognition can now be retrieved via the store API URL /store-api/acris-shop-switch-rules/{activeDomainId} and processed further in a headless environment.</p>","creationDate":{"date":"2023-05-10 11:30:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.2","text":"<p>Correction of the cookie ID of the registered cookie of the plugin.</p>","creationDate":{"date":"2023-04-27 07:16:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.1","text":"<p>Fixes a problem where the modal window for country / language selection reappears after redirecting to the selected shop.</p>","creationDate":{"date":"2023-04-21 12:00:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.0","text":"- Allows you to simulate an IP address or an IP country. This makes it easy for the shop operator to test the configurations.<br /><p>- Solves a possible problem where the wrong country is shown in the country header selection.</p>","creationDate":{"date":"2023-03-29 13:45:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.9","text":"<p>Update of the supplied IP database (10.03.2023).</p>","creationDate":{"date":"2023-03-13 06:25:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.7","text":"- Optimisation of url finding from other domains when reloading the IP targeting module via Ajax.<br /><p>- Removes the url parameter \"lang\" which is not needed.</p>","creationDate":{"date":"2023-02-20 16:07:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.6","text":"<p>Improved compatibility with Shopware smaller 6.4.11.0.</p>","creationDate":{"date":"2023-02-16 10:08:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.5","text":"- Fixes a problem where the delivery country was not permanently changed by the plugin.<br /><p>- Optimisation of the country switching in the header.</p>","creationDate":{"date":"2023-02-15 12:43:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.4","text":"<p>Fixes a problem where redirects were made to URls that no longer exist.</p>","creationDate":{"date":"2023-02-13 18:13:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.2","text":"<p>Fixes a possible problem with the assignment of possible countries if they do not have an ISO code.</p>","creationDate":{"date":"2023-02-09 14:01:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.1","text":"<ul><li>From now on, inactive countries will no longer be offered for selection.</li><li>Adds header selector to select current country.</li><li>Code optimisations. Fixes a problem with country switching in the header.</li></ul>","creationDate":{"date":"2023-02-06 13:39:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.10","text":"<p>Adds the reload page option for reloading the page after confirming the modal.</p>","creationDate":{"date":"2023-01-17 08:58:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.9","text":"<p>Adds the Slovenian language as a standard language.</p>","creationDate":{"date":"2022-12-09 06:41:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.8","text":"<p>- Fixes the language selector on modal when the previous selection is disabled.</p>","creationDate":{"date":"2022-11-11 10:42:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.7","text":"<p>Optimizes default values for the shop switch rule in the Administration.</p>","creationDate":{"date":"2022-11-07 15:23:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.6","text":"<p>Fixes problems with redirection for products with variants and URL parameters.</p>","creationDate":{"date":"2022-10-25 20:57:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.5","text":"<p>- Optimized the required state check on Checkout Registration.</p>","creationDate":{"date":"2022-10-17 10:09:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.4","text":"<p>The fallback language in the plugin settings is now used for language-based redirection as well as for the text content of the modal window.</p>","creationDate":{"date":"2022-10-17 08:17:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.3","text":"<p>- Optimized the required state check on registration.</p>","creationDate":{"date":"2022-10-13 11:47:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.2","text":"<p>- Fixes the registration problem when state is required.</p>","creationDate":{"date":"2022-10-13 11:15:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.1","text":"<p>Optimized the snippets.<br /></p>","creationDate":{"date":"2022-09-28 11:40:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.0","text":"<p>The names of the languages in the shop are now loaded by the \nlocalisation. The name of the localisation can be adapted in different \nlanguages via the IP targeting module.</p>","creationDate":{"date":"2022-09-28 11:26:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.1","text":"<p>Optimierung bei der Erkennung der Browsersprache bei Länderspezifischen Lokalisierungen (z.B. de-DE und de-CH).</p>","creationDate":{"date":"2022-09-27 08:54:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.0","text":"<p>Allows you to define an alternative fallback language for the texts in the modal window if the browser language cannot be found in the shop.</p>","creationDate":{"date":"2022-09-08 13:24:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.3","text":"<p>Fixes a problem where the URL parameters were not taken over correctly during a redirect.</p>","creationDate":{"date":"2022-09-08 08:04:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.2","text":"<ul><li> Optimizes automatic update of the IP database.</li></ul>\n                                                                                                            <ul><li> Optimizes default IP database.</li></ul>","creationDate":{"date":"2022-09-05 14:33:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.1","text":"<p>Fixes problems where the delivery country was not set correctly when the page was first opened.</p>","creationDate":{"date":"2022-08-17 08:13:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.0","text":"<p>Allows you to check in advance if products are available when redirecting them and to react differently based on that.</p>","creationDate":{"date":"2022-08-12 08:45:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<p>Fixes problems with the automatic update of the IP database.</p>","creationDate":{"date":"2022-08-08 07:31:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>Allows the IP targeting functionality to be reloaded via Ajax. This improves page performance, but also brings disadvantages.</p>","creationDate":{"date":"2022-07-29 14:36:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.9.5","text":"<p>From now on, for languages in the modal window, the name from the language is used and no longer the name of the localisation.</p>","creationDate":{"date":"2022-07-21 14:57:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.9.4","text":"- Optimisation of URL finding during redirection.<br /><p>- Fixes problems where the forwarding did not work correctly.</p>","creationDate":{"date":"2022-07-13 14:44:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.9.3","text":"<p>Optimizes loading of the URL for active domain.</p>","creationDate":{"date":"2022-07-11 18:52:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.9.2","text":"<p>Fixes the problem on the checking if the path info exists.</p>","creationDate":{"date":"2022-07-11 16:51:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.9.1","text":"<p>Improved compatibility with Shopware &gt;= 6.4.11.0.</p>","creationDate":{"date":"2022-07-07 13:40:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.9.0","text":"<p>Optimisation of the search for the URL for redirection. Current routing options are merged.</p>","creationDate":{"date":"2022-07-06 10:23:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.8.6","text":"<p>Fixes an issue when the \"Only set shipping country and don't switch\" mode was selected in the redirect rule.</p>","creationDate":{"date":"2022-04-29 05:57:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.8.4","text":"<p>Adds validation on checking the exclusion.</p>","creationDate":{"date":"2022-04-19 23:36:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.8.3","text":"<p>Fixes a problem where the modal window was displayed again after switching to another domain.</p>","creationDate":{"date":"2022-04-05 12:53:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.8.2","text":"<p>- Improve compatibility with Stripe.<br /></p><p>- Adds new module for exclusion from IP targeting and language detection.</p><p>- Adds import / export profile for exclusions.</p>","creationDate":{"date":"2022-04-04 13:55:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.7.0","text":"<p>- Adds new option for routing configuration.</p>\n                                                                                                            <p>- Adds functionality for redirecting if the same URL exists in other domain with different category tree.</p>","creationDate":{"date":"2022-03-07 08:57:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.6.3","text":"- Removal of the \"unattractive\" URL parameter of the determined delivery country after forwarding.<br /><p>- Also with an external forwarding in the modal window, from now on the determined country of delivery is no longer inserted as a URL parameter.</p>","creationDate":{"date":"2022-02-21 07:36:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.6.2","text":"- When forwarding to an external domain, this is only carried out if the current domain is also in the forwarding rule.<br />- When forwarding to an external domain, the determined country of delivery is no longer inserted as a URL parameter.<br /><p>- Cache optimisations in connection with other plugins.</p>","creationDate":{"date":"2022-02-08 06:34:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.6.1","text":"<p>Improved compatibility with other plugins.</p>","creationDate":{"date":"2022-02-01 07:44:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.6.0","text":"<p>- Automatic pre-selection of the country during registration depending on the selection via the IP targeting module.</p>","creationDate":{"date":"2022-01-24 07:54:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.1","text":"- Fixes a problem when setting the shipping country after a redirect.<br /><p>- Fixes an issue where the modal window was not displayed in the language of the browser when the languages were configured on different sales channels.</p>","creationDate":{"date":"2022-01-21 13:01:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"<p>- Adds new possibility for direct redirect with external URL.</p>\n                                                                                                            <p>- Optimizes templates in Administration.</p>","creationDate":{"date":"2021-12-13 09:19:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.1","text":"- Fixes a possible problem when the browser language was not found.<br /><p>- Fixes a possible problem in connection with Stripe Payment.</p>","creationDate":{"date":"2021-11-22 17:49:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"- Display of the language of the texts in the modal window is configurable depending on the browser language of the customer or depending on the language of the domain of the sales channel via the plugin settings.<br />- Additional texts in the modal window are now adjustable with the redirection rule<br /><p>- Fixes problems with loading the correct translations for the texts in the modal window</p>","creationDate":{"date":"2021-10-25 15:51:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"<p>Updating the GeoLite2 IP database.</p>","creationDate":{"date":"2021-10-25 09:53:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"<p>Allows to make additional cookie configurations via the plugin settings.</p>","creationDate":{"date":"2021-10-21 11:15:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<p>Detects crawlers (e.g. Google, Bing, Facebook) based on the list of user agents provided by https://github.com/monperrus/crawler-user-agents.</p>","creationDate":{"date":"2021-10-21 06:46:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.8","text":"<p>Fixes a problem with reading the IP address in connection with CDN systems (e.g. Cloudflare) or proxy servers</p>","creationDate":{"date":"2021-10-14 16:42:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.7","text":"<p>Fixes an issue where a critical PHP error occurs after a while.</p>","creationDate":{"date":"2021-09-20 19:08:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.6","text":"<p>Fixes an issue where IP forwarding was cached with the context on newer Shopware versions and therefore no longer worked reliably.</p>","creationDate":{"date":"2021-08-25 17:39:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.5","text":"<p>Fixes problems when changing the currency that it was still displayed incorrectly on pages saved in the Http cache.</p>","creationDate":{"date":"2021-08-19 08:27:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"<p>Optimisation in connection with the Shopware Http Cache</p>","creationDate":{"date":"2021-08-09 14:46:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<p>Fix problem on creating sales channel context.</p>","creationDate":{"date":"2021-06-10 14:02:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>Fix problem on plugin installation for default language.</p>","creationDate":{"date":"2021-05-20 12:50:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>Fixes a problem where the delivery country is not set correctly in some constellations.</p>","creationDate":{"date":"2021-05-19 12:28:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>Improved compatibility with Shopware 6.4*.</p>","creationDate":{"date":"2021-05-17 12:40:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.1","text":"<p>Fixes an issue related to the Shopware Social Shopping plugin and Shopware &lt; 6.4.0.0.</p>","creationDate":{"date":"2021-10-21 08:28:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"<p>Detects crawlers (e.g. Google, Bing, Facebook) based on the list of user agents provided by https://github.com/monperrus/crawler-user-agents.</p>","creationDate":{"date":"2021-10-21 07:28:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.3","text":"<p>Fix problem on plugin installation for default language.</p>","creationDate":{"date":"2021-05-20 13:04:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.2","text":"<p>Fixes a problem where the delivery country is not set correctly in some constellations.</p>","creationDate":{"date":"2021-05-19 12:24:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.1","text":"<p>Optimization of direct URL forwarding in connection with other plugins</p>","creationDate":{"date":"2021-04-15 12:05:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<p>Added new switch type.</p>\n                                                                                                            <p>New switch only set shipping country without page redirect.</p>","creationDate":{"date":"2021-04-13 13:56:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p>Change Shopware required minimum version.</p>","creationDate":{"date":"2021-04-13 10:32:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p>Allows the same content page to be accessed when redirecting, rather than always redirecting to the new domain's home page.</p>","creationDate":{"date":"2021-04-12 18:07:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p>Fixed setting next execution time for scheduled task.</p>","creationDate":{"date":"2021-03-23 13:28:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>Added schedule task for updating IP targeting database automatically.</p>","creationDate":{"date":"2021-03-15 13:08:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Fixes a problem where the modal window reappears after a successful \nswitch if the domains concerned belong to different sales channels.</p>","creationDate":{"date":"2021-02-10 11:53:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<ul><li>Improvement in automatic country detection when multiple countries are appropriate for a domain.</li><li>Improved handling in connection with the Http cache.</li><li>Redirects and the modal window are now executed without delay directly when the page is called.</li><li>Automatically sets the desired delivery country also on the first call to the page.</li><li>Fixes an issue where a redirect or a request to redirect on an incorrect entry page no longer happens once the request has been saved.</li><li>If the origin page (referrer) corresponds to a different domain of the same sales channel (e.g. due to manual language change), a modal window query and redirection no longer happens.</li><li>Fixes a problem when setting the country of delivery after a direct redirect.</li><li>GeoIp database update.</li></ul>","creationDate":{"date":"2021-02-04 11:08:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Display of the texts in the modal window in the browser language of the user.</li><li>Solves problems saving HTML text in the admin area of Shopware 6.3.x.</li><li>Updating the IP database<br /></li></ul>","creationDate":{"date":"2020-08-17 13:54:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<ul><li>Compatibility with Shopware 6.3.x.<br /></li></ul>","creationDate":{"date":"2020-08-04 12:10:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<ul><li>Corrects the sorting of countries and languages in the modal window in the storefront.</li></ul><ul><li>If the same configurations are set for several domains, the current domain is preferred, if applicable.</li></ul>","creationDate":{"date":"2020-07-22 14:29:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<p>Solves a problem when deleting redirection rules.</p>","creationDate":{"date":"2020-07-22 12:25:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<ul><li> Changed the shop switch cookie to not required.</li></ul>","creationDate":{"date":"2020-07-13 13:09:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<ul><li>IP Targeting Cookie is now marked as technical required</li><li>Fixed Backend Snippet <br /></li></ul>","creationDate":{"date":"2020-06-24 08:59:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>Change the way the ip address is read. Security improvements.</li><li>Required sign changed to snippet<br /></li></ul>","creationDate":{"date":"2020-06-04 07:36:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>Fixed snippets at module detail page in administration.</li><li>Fix show modal duplicate in footer.</li><li>Adds the possibility to define what should happen on closing the modal window.</li><li>Fixes a problem when no redirection rule was found.<strong></strong></li><li><strong></strong>Release.</li></ul>","creationDate":{"date":"2020-06-02 13:56:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris89265454439","redirectToStore":false,"lowestPriceValue":49.99}