{"id":11828,"name":"SpnoNewsletterEconomy","code":"Spno671636854217","lastChange":{"date":"2023-07-25 15:48:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpO27s07","examplePageUrl":"","moduleKey":"SpnoNewsletterEconomy","creationDate":{"date":"2020-06-16 15:52:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-07-01 13:41:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-07-25 13:58:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":603,"prefix":"Spno","name":"webpiloten","website":"//web-piloten.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod603_webpiloten_WANTED_Vorlage-2023_128x128.jpg"},"infos":[{"id":18687,"name":"Newsletter","description":"<h3>Kein Intelligenter Newsletter für Shopware 6? Wir sind der Hyperintelligente Newsletter!</h3><p>Das<b>&nbsp;Newslettersystem</b>&nbsp;der&nbsp;<b>webpiloten.</b>&nbsp;hat die Funktionen des \"<b>Intelligenten Newsletters</b>\" aus&nbsp;<b>Shopware 5&nbsp;</b>integriert.&nbsp;Das Newsletter Plugin ist direkt in Deinem Shopware 6 Onlineshop als Plugin installierbar. Jetzt kannst Du auf externe Newsletterservices verzichten.&nbsp;Das Plugin \"Newslettersystem • Economy\" vereint moderne Newsletter relevante Funktionen in nur einem Plugin. Hierbei setzt das Plugin da an, wo Shopware 6 aufhört und unterstützt Dich <b>gewinnbringend </b>bei deinen Online Marketing Maßnahmen. Dabei unterstützt Dich das Plugin bei der Einhaltung der <b>DSGVO</b>, indem es keine Newsletter an Empfänger sendet, die als Opt-Out gekennzeichnet sind.</p><h3>Features im Überblick:</h3><h4>Shopware Rulebuilder Integration</h4><p>Nutze für die Erstellung der Empfängergruppen den in Shopware 6 integrierten Rule Builder um Deine Newsletter zielgerichtet zu versenden. Dabei stehen Dir alle wichtigen Informationen zu den Empfängern zur Verfügung.&nbsp;</p><b>Folgende Fallbeispiele sind möglich:</b><p></p><ul><li>Auswahl aller Empfänger eines Verkaufskanals</li><li>Auswahl der Sprache</li><li>Auswahl von Postleitzahl und Stadt</li><li>Geschlecht</li><li>Zugriff auf die Empfänger-Tags</li><li>Status (Opt-In, Direct, notSet)</li></ul><b>Dabei kannst Du alle Möglichkeiten miteinander verknüpfen z.B. :</b><p></p><ul><li>Auswahl aller deutschsprachigen Frauen, die aus Berlin kommen</li><li>Auswahl aller Empfänger, denen der Tag, Schuhe, oder Kleidung zugewiesen wurde</li><li>und viele mehr...</li></ul><h4>Textbausteine / Übersetzungen</h4><p>Wir haben eine Vielzahl an <b>Textbausteinen </b>angelegt, die Du für jeden Deiner Saleschannel und Sprachen <b>übersetzen </b>kannst. So kannst Du Newsletter an Empfänger mit unterschiedlichen <b>Sprachen </b>aus verschiedenen <b>Saleschannels </b>gleichzeitig versenden und kannst das Newsletter-Template und den Content <b>individuell </b>bestimmen.</p><h4>Reports</h4><p>Siehe auf einen Blick die Anzahl der versendeten Newsletter, deren Lese- &amp; Klickrate und alle Abmeldungen.</p><h4>Vorschau/Tests</h4><p>Schaue Dir über die eingebaute <b>Vorschau </b>Funktion den aktuellen Stand des Newsletters an oder sende Dir den Newsletter an deine E-Mail-Adresse.&nbsp;</p><h4>Absender</h4><p>Definiere verschiedene Absender und wähle diese für jeden Newsletter einzeln aus.</p><h4>Variablen</h4><p>Du hast direkt bei der Erstellung des Newsletters in der Administration die Möglichkeit, alle verfügbaren <b>Variablen </b>zu sehen und diese mit nur einem Klick in das Template zu <b>kopieren</b>. Hierbei haben wir das Shopware interne Template-System&nbsp;<a href=\"https://twig.symfony.com/doc/2.x/\" target=\"_blank\" rel=\"noreferrer noopener\">Twig</a>&nbsp;genutzt, um alle bekannten Funktionen des Storefronts in das Newsletter-Template zu integrieren.</p><h4>Erlebniswelten-Element: Newsletter Formular</h4><p>Über das Formular-Element aus den <b>Erlebniswelten </b>ist es möglich, die Registrierung der Empfänger auf jeder Seite zu integrieren.</p><h4>Import/Export</h4><p>Importiere/exportiere Newsletter Empfänger über das Shopware eigene <b>Import/Export Tool</b> oder über die Migration aus Deinem&nbsp;<b>Shopware 5</b> Shop über das Shopware eigene Plugin&nbsp;<a href=\"https://store.shopware.com/swag257162657297f/migrations-assistent.html\" target=\"_blank\" rel=\"noreferrer noopener\">Migrations-Assistent</a>. So kannst Du alle Deine Empfänger aus anderen Systemen in <b>wenigen Minuten</b> aufbereitet für das Newslettersystem importieren.</p><h3>Onboarding-Service:</h3><p>Die webpiloten. bieten gerne Unterstützung beim Erstellen und Versenden deines Newsletters an.<br>Schreibe uns einfach eine E-Mail an:&nbsp;<a href=\"//web-piloten.de\" target=\"_blank\" rel=\"noreferrer noopener\">kontakt@web-piloten.de</a>&nbsp;oder rufe direkt an unter: <a href=\"//tel\" target=\"_blank\" rel=\"noreferrer noopener\">0231 137 52 128</a>.</p><h3>Bitte beachte:</h3><p>Manche Hoster <b>limitieren </b>die Anzahl der Mails pro Stunde. Wenn Du große Empfänger-Listen hast, die Du versenden möchtest, erkundige Dich vorerst bei Deinem Hoster.</p><p>Externe E-Mail-Dienstleister außerhalb der EU sind laut Aufsichtsbehörden entgegen vieler Informationen aus dem Internet nicht DSGVO-konform zu bekommen. Informiere Dich vorher!<br></p>\n","installationManual":"<p>Plugin im Store herunterladen oder direkt in der Shopware 6 Administration einfach über den Plugin-Manager installieren.</p>","shortDescription":"Das Newsletter System ist die Perfektionierung des \"Intelligenten Newsletters\" aus Shopware 5.     >>> Die No. 1 für Shopware 6 <<<      DSGVO-konform.  Jetzt oder nie.","highlights":"Die absolute Nr. 1 und Must-Have für Shopware 6 - wir haben für Dich an alles gedacht\nDSGVO-Konform: alle Daten bleiben in Deinem Shop, Du musst Deine Kundendaten an keinen Drittleister (externen Versender) schicken\nReady-to-takeoff: Du brauchst in Deiner Informationspflicht keinen Drittleister (externen Versender) aufführen!\nNewsletter in Mailserver-freundlichen Chargen bereits vorkonfiguriert, damit Du whitegelistet bleibst und auch große Mengen Newsletter verschicken kannst\nApp des Monats + App der Woche, Gold prämiert","features":"So versendest Du individuelle Newsletter – damit Deine Kunden zum König werden\nEin modernes \"Start Template\" ist bereits integriert, Personalisierungen einfach über Variablen möglich\nDer Newsletter ist bereits Responsive für alle gängigen Devices und Mailprogramme optimiert\nNutzung des Rulebuilder für die Steuerung verschiedener Empfängergruppen\nGestalte Deinen Newsletter im Corporate Design pro Sales Channel\nHTML Editor zur Individualisierung Deines Inhaltes\nUnterstützung von Emojis in der Betreff-Zeile. Beispiele: ✌ ✂ ❎\nMehrere Sprachen gleichzeitig versenden\nNewsletter Reporting (Anzahl der Empfänger, Öffnungsrate, Klick-Rate, Abmeldungs-Rate)\nDu kannst mehrere Absender-Adressen definieren"},{"id":18688,"name":"Newsletter","description":"<h3>The perfect entry-level plugin for your online marketing</h3><p>The webpilots'&nbsp;<b>newslettersystem</b>&nbsp;has integrated the functions of \"<b>Smart Newsletter</b>\" from<b>&nbsp;Shopware 5</b>.&nbsp;The newsletter plugin can be installed directly in your Shopware 6 online shop as a plugin. You can now do without external newsletter services. The \"Newsletter system • Economy\" plugin combines modern newsletter relevant functions in just one plugin. Here, the plugin picks up where Shopware 6 functionality ends and supports you <b>profitably </b>with your online marketing measures. The plugin supports you in complying with the <b>DSGVO </b>by not sending any newsletters to recipients who are marked as opt-out.</p><h3>Overview of features:</h3><h4>Shopware Rulebuilder integration</h4><p>Use the rule builder integrated in Shopware 6 to create your recipient groups to send your newsletter in a targeted manner. All important information about the recipients is available to you.</p><b>The following case studies are possible, for example:</b><ul><li>Selection of all receivers of a saleschannel</li><li>Language selection</li><li>Selection of zip code and city</li><li>Gender</li><li>Access to the recipient tags</li><li>Status (Opt-In, Direct, notSet)</li></ul><b>You can link all the options together, e.g. :</b><ul><li>Selection of all German-speaking women who come from Berlin</li><li>Selection of all recipients to whom the tag shoes or clothes were assigned</li><li>and many more...</li></ul><h4>Snippets / translations</h4><p>We have created a variety of <b>snippets </b>that you can translate for each of your saleschannels and languages. So you can send newsletters to recipients with different <b>languages </b>from different <b>saleschannels </b>at the same time and you can <b>individually </b>determine the newsletter template and the content.</p><h4>Reports</h4><p>See at a glance the number of newsletters sent, their read &amp; click rate and all unsubscriptions.</p><h4>Preview / tests</h4><p>Take a look at the current status of the newsletter via the built-in <b>preview </b>function or send the newsletter to your email address.</p><h4>Sender</h4><p>Define different senders and select them individually for each newsletter.</p><h4>Variables</h4><p>When creating the newsletter in the administration, you have the option of seeing all available variables and copying them into the template with just one click. Here we used the Shopware internal template system&nbsp;<a href=\"https://twig.symfony.com/doc/2.x/\" target=\"_blank\" rel=\"noreferrer noopener\">Twig</a>&nbsp;to integrate all known functions of the storefront into the newsletter template.</p><h4>Experience world element: newsletter form</h4><p>Using the form element from the <b>experience worlds</b>, it is possible to integrate the registration of the recipient on every page.</p><h4>Import / export</h4><p>Import / export newsletter recipients using Shopware's own <b>import / export tool</b> or migrating from your <b>Shopware 5</b> shop using Shopware's own plug-in&nbsp;<a href=\"https://store.shopware.com/en/swag257162657297f/migration-assistant.html\" target=\"_blank\" rel=\"noreferrer noopener\">Migration Assistant</a>. In this way you can import all of your recipients from other systems in just a <b>few minutes</b> for the newsletter system.</p><h3>Onboarding-Service:<br></h3><p>You have a question? Contact us directly.<br><a href=\"https://web-piloten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">kontakt@web-piloten.de</a>&nbsp;or by phone:&nbsp;<a href=\"https://tel/\" target=\"_blank\" rel=\"noreferrer noopener\">+49231 137 52 128</a>.</p><h3>Please note:</h3><p>Some hosts <b>limit </b>the number of emails per hour. If you have large recipient lists that you want to send, inquire with your hoster for the time being.<br></p>","installationManual":"<p>Download the plugin in the store or simply install it directly in Shopware 6 Administration using the plugin manager.</p>","shortDescription":"The newsletter system is perfection to the \"Smart Newsletter\" of Shopware 5. DSGVO-valid. The newsletter plugin is integrated directly into your Shopware 6 shop.","highlights":"A modern \"start template\" is already integrated\nPersonalization easily possible via variables\nThe newsletter is already responsive optimized for all common devices and mail programs\nUse the already integrated \"Preview\" to assess your changes directly live\nThis is how you send individual newsletters - so that your customers become king","features":"Use of the Rulebuilder to control different recipient groups\nDesign your newsletter in the corporate design per saleschannel\nHTML editor for customizing your content\nEmojis support in the subject line. Examples: ✌ ✂ ❎\nSend multiple languages ​​at the same time\nNewsletter reporting (number of recipients, opening rate, click rate, unsubscription rate)\nYou can define multiple sender addresses"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":172558,"bookingKey":"Spno671636854217","bookingText":"Newsletter","price":399,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":172556,"bookingKey":"Spno671636854217_M","bookingText":"Newsletter","price":39.95,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":172557,"bookingKey":"Spno671636854217_M12","bookingText":"Newsletter","price":399,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQUQt4e","preview":true,"priority":0,"id":85012},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkzxzCf","preview":false,"priority":999,"id":45740},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptCJwzZ","preview":false,"priority":50,"id":45913},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe8jVOc","preview":false,"priority":40,"id":45914},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0L3qzY","preview":false,"priority":37,"id":45917},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpu7WE4K","preview":false,"priority":31,"id":45915},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php14ZAsG","preview":false,"priority":11,"id":45327},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpctf9BE","preview":false,"priority":9,"id":45322},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5PgwEC","preview":false,"priority":5,"id":45320},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFlhCDA","preview":false,"priority":4,"id":45319},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppmNvrF","preview":false,"priority":3,"id":45326},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0muX3E","preview":false,"priority":2,"id":45325},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPG0TqZ","preview":false,"priority":1,"id":45328},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpym2n1D","preview":false,"priority":0,"id":45323},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpN0asOb","preview":false,"priority":0,"id":45916},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKEgusj","preview":false,"priority":0,"id":93723}],"comments":[{"authorName":"Romas Kellermann","text":"Zu der App will ich gar nicht so viel sagen, ausser das sie gut funktioniert und genau das macht was sie soll. Wir haben damit die Möglichkeit Newsletter zu verschicken ohne das jemand dazwischen hängt und die Hand aufhält. Super!\nDen Support möchte ich noch einmal extra Loben. Wir hatten in den Erlebniswelten ein Darstellungsproblem mit den Hintergrundfarben. Der Support in Form von Herrn Dommasch hat megaschnell und toll geholfen. Das Problem wurde in kürzester Zeit gefixt. Vielen Dank.","headline":"Gute Newsletter App noch besserer Support","creationDate":{"date":"2023-05-16 12:12:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christian Steinmetz","text":"Plugin macht was es soll, sehr schneller Support","headline":"Tolles Plugin - macht was es soll","creationDate":{"date":"2022-11-14 10:06:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Benjamin Melinc","text":"Das Plugin tut was es soll und ist einfach zu bedienen!\nDer Support ist sehr bemüht und antwortet schnell!\n\nSehr zu empfehlen!","headline":"Top Support!","creationDate":{"date":"2022-06-03 14:40:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Nicole Rinas","text":"","headline":"Sehr einfach zu bedienen. Support antwortet schnell und hilft zuverlässig.","creationDate":{"date":"2022-06-03 06:35:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"eHS Der e-Handwerker Shop","text":"Dieses Tool der Firma Webpiloten ist einfach Spitze in der Bedienung sowie in der Erstellung der einzelnen Newsletter. Ich kann es nur empfehlen!","headline":"Super, Newsletter Tool!","creationDate":{"date":"2022-04-21 09:46:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Bettina P.","text":"Wir sind sehr zufrieden, sauberer Code,  schneller Support , verständliche Bedienung und Änderungswünsche werden promt umgesetzt!","headline":"Genau die Funktion die wir gesucht haben!","creationDate":{"date":"2021-10-15 09:19:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Manfred Gabriel","text":"Mit diesem tollen und einfach zu bedienenden Plugin ist der Versand unserer Newsletter bequem möglich ohne Kundendaten an Dritte weitergeben zu müssen. Der Hersteller ist sehr gesprächsbereit für Feature-Wünsche und generell ist deren Support einfach nur perfekt mit schneller Antwortzeit","headline":"Großartiges Tool zum Newsletterversand","creationDate":{"date":"2021-10-14 10:14:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Robert Opitz","text":"","headline":"Absolute Empfehlung, ich kam von einer anderen Shopsoftware und mir wurden sowohl per E-Mail als auch am Telefon sehr schnell alle Fragen beantwortet.","creationDate":{"date":"2021-09-30 10:04:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"TX24","text":"Das Plugin ist direkt im Shopsystem integriert und die Funktionen sind einfach und perfekt zu handeln. Der Support war überragend und es erfolgte sogar eine Rückmeldung telefonisch um eine für uns individuelle Anpassung vorzunehmen.","headline":"Absolute Empfehlung","creationDate":{"date":"2021-09-29 13:36:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Thore Levetzow","text":"Super - Tool und bei Rückfragen reagieren die Webpiloten sofort und sehr kompetent!!! Danke","headline":"Grossartiges Tool","creationDate":{"date":"2021-09-02 10:53:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"K. Garbers/ OrchIDEENgarten.de","text":"Support antwortet sehr schnell! Danke:)","headline":"Support","creationDate":{"date":"2021-08-25 11:25:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"M. K.","text":"Da wir die Adressen unserer Kunden nicht an einen Anbieter weitergeben möchten, war dies die perfekte Lösung für uns. Die Bedienung ist intuitiv, und es funktioniert wie erwartet. Ein paar optisch unterschiedliche Email-Templates zur Auswahl wäre noch schön und ein Editor für den Inhalt des Newsletters, damit man kein HTML schreiben muss. Der Support war schnell und freundlich und hat meine Anregungen für Verbesserungen schon umgesetzt, das hat mich sehr gefreut!","headline":"Plugin funktioniert erwartungsgemäß, Support ist schnell und aufgeschlossen für Änderungswünsche","creationDate":{"date":"2021-08-03 11:43:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Shopware Account Hagius GmbH","text":"Mit diesen PlugIn haben sich die Mitarbeiter der WebPiloten selbst übertroffen. Sehr gutes NewsletterPlugin. Der Support ist ebenfalls sehr lobend zu erwähnen ! Weiter so ! (27.07.2021)","headline":"Sehr guter Newsletter !","creationDate":{"date":"2021-07-27 15:59:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Newsletter","description":"<h3>Kein Intelligenter Newsletter für Shopware 6? Wir sind der Hyperintelligente Newsletter!</h3><p>Das<b> Newslettersystem</b> der <b>webpiloten.</b> hat die Funktionen des \"<b>Intelligenten Newsletters</b>\" aus <b>Shopware 5 </b>integriert. Das Newsletter Plugin ist direkt in Deinem Shopware 6 Onlineshop als Plugin installierbar. Jetzt kannst Du auf externe Newsletterservices verzichten. Das Plugin \"Newslettersystem • Economy\" vereint moderne Newsletter relevante Funktionen in nur einem Plugin. Hierbei setzt das Plugin da an, wo Shopware 6 aufhört und unterstützt Dich <b>gewinnbringend </b>bei deinen Online Marketing Maßnahmen. Dabei unterstützt Dich das Plugin bei der Einhaltung der <b>DSGVO</b>, indem es keine Newsletter an Empfänger sendet, die als Opt-Out gekennzeichnet sind.</p><h3>Features im Überblick:</h3><h4>Shopware Rulebuilder Integration</h4><p>Nutze für die Erstellung der Empfängergruppen den in Shopware 6 integrierten Rule Builder um Deine Newsletter zielgerichtet zu versenden. Dabei stehen Dir alle wichtigen Informationen zu den Empfängern zur Verfügung. </p><b>Folgende Fallbeispiele sind möglich:</b><p></p><ul><li>Auswahl aller Empfänger eines Verkaufskanals</li><li>Auswahl der Sprache</li><li>Auswahl von Postleitzahl und Stadt</li><li>Geschlecht</li><li>Zugriff auf die Empfänger-Tags</li><li>Status (Opt-In, Direct, notSet)</li></ul><b>Dabei kannst Du alle Möglichkeiten miteinander verknüpfen z.B. :</b><p></p><ul><li>Auswahl aller deutschsprachigen Frauen, die aus Berlin kommen</li><li>Auswahl aller Empfänger, denen der Tag, Schuhe, oder Kleidung zugewiesen wurde</li><li>und viele mehr...</li></ul><h4>Textbausteine / Übersetzungen</h4><p>Wir haben eine Vielzahl an <b>Textbausteinen </b>angelegt, die Du für jeden Deiner Saleschannel und Sprachen <b>übersetzen </b>kannst. So kannst Du Newsletter an Empfänger mit unterschiedlichen <b>Sprachen </b>aus verschiedenen <b>Saleschannels </b>gleichzeitig versenden und kannst das Newsletter-Template und den Content <b>individuell </b>bestimmen.</p><h4>Reports</h4><p>Siehe auf einen Blick die Anzahl der versendeten Newsletter, deren Lese- &amp; Klickrate und alle Abmeldungen.</p><h4>Vorschau/Tests</h4><p>Schaue Dir über die eingebaute <b>Vorschau </b>Funktion den aktuellen Stand des Newsletters an oder sende Dir den Newsletter an deine E-Mail-Adresse. </p><h4>Absender</h4><p>Definiere verschiedene Absender und wähle diese für jeden Newsletter einzeln aus.</p><h4>Variablen</h4><p>Du hast direkt bei der Erstellung des Newsletters in der Administration die Möglichkeit, alle verfügbaren <b>Variablen </b>zu sehen und diese mit nur einem Klick in das Template zu <b>kopieren</b>. Hierbei haben wir das Shopware interne Template-System <a href=\"https://twig.symfony.com/doc/2.x/\" target=\"_blank\" rel=\"noreferrer noopener\">Twig</a> genutzt, um alle bekannten Funktionen des Storefronts in das Newsletter-Template zu integrieren.</p><h4>Erlebniswelten-Element: Newsletter Formular</h4><p>Über das Formular-Element aus den <b>Erlebniswelten </b>ist es möglich, die Registrierung der Empfänger auf jeder Seite zu integrieren.</p><h4>Import/Export</h4><p>Importiere/exportiere Newsletter Empfänger über das Shopware eigene <b>Import/Export Tool</b> oder über die Migration aus Deinem <b>Shopware 5</b> Shop über das Shopware eigene Plugin <a href=\"https://store.shopware.com/swag257162657297f/migrations-assistent.html\" target=\"_blank\" rel=\"noreferrer noopener\">Migrations-Assistent</a>. So kannst Du alle Deine Empfänger aus anderen Systemen in <b>wenigen Minuten</b> aufbereitet für das Newslettersystem importieren.</p><h3>Onboarding-Service:</h3><p>Die webpiloten. bieten gerne Unterstützung beim Erstellen und Versenden deines Newsletters an.<br />Schreibe uns einfach eine E-Mail an: <a href=\"//web-piloten.de\" target=\"_blank\" rel=\"noreferrer noopener\">kontakt@web-piloten.de</a> oder rufe direkt an unter: <a href=\"//tel\" target=\"_blank\" rel=\"noreferrer noopener\">0231 137 52 128</a>.</p><h3>Bitte beachte:</h3><p>Manche Hoster <b>limitieren </b>die Anzahl der Mails pro Stunde. Wenn Du große Empfänger-Listen hast, die Du versenden möchtest, erkundige Dich vorerst bei Deinem Hoster.</p><p>Externe E-Mail-Dienstleister außerhalb der EU sind laut Aufsichtsbehörden entgegen vieler Informationen aus dem Internet nicht DSGVO-konform zu bekommen. Informiere Dich vorher!<br /></p>","installationManual":"<p>Plugin im Store herunterladen oder direkt in der Shopware 6 Administration einfach über den Plugin-Manager installieren.</p>","version":"1.5.4","changelog":[{"version":"1.5.4","text":"<ul><li>Fix: Plugin configuration can now be saved again</li></ul>","creationDate":{"date":"2023-07-05 10:01:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<ul><li>Fix: SalesChannelContextService has been replaced by SalesChannelContextServiceInterface for plugin compatibility</li></ul>","creationDate":{"date":"2023-06-27 11:12:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<ul><li>Fix: If a newsletter recipient is linked to a customer account, price rules are now taken into account for the customer.</li></ul>","creationDate":{"date":"2023-05-31 11:10:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<ul><li>Fix: Preview view now has no spacing for headings and paragraph</li></ul>","creationDate":{"date":"2023-05-31 10:41:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Fix: Compatibility with Shopware ^6.5 established.</li></ul>","creationDate":{"date":"2023-04-05 13:37:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.9","text":"<ul><li>Fix: SalesChannelContextService has been replaced by SalesChannelContextServiceInterface for plugin compatibility</li></ul>","creationDate":{"date":"2023-06-27 10:35:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.8","text":"<ul><li>Fix: If a newsletter recipient is linked to a customer account, price rules for the customer are now taken into account.</li></ul>","creationDate":{"date":"2023-05-31 11:01:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.7","text":"<ul><li>Fix: Preview view now has no spacing for headings and paragraphs</li></ul>","creationDate":{"date":"2023-04-20 14:44:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.6","text":"<ul><li>Fix: automatic save for the 1.4.5. Update</li></ul>","creationDate":{"date":"2023-03-28 09:20:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.5","text":"<h2>Breaking changes</h2><p></p><ul><li>Fix: Newsletter rules for recipients can now be nested again, but it is necessary to save them again.</li></ul><p></p>","creationDate":{"date":"2023-01-25 08:18:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<ul><li>Fix: Newsletter links are displayed in plain text email view.</li></ul>","creationDate":{"date":"2022-12-13 14:43:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<ul><li>Fix: Prices for newsletter products are now displayed correctly if price rules are assigned.</li></ul>","creationDate":{"date":"2022-11-24 11:53:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<ul><li>Feat: GDPR conformity show shop owner address in the newsletter footer</li><li>Fix: Newsletter footer category layout is now displayed with correct spacing</li></ul>","creationDate":{"date":"2022-07-18 14:25:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<ul><li>Fix: In the business version, newsletters could not be sent via cronjob.</li></ul>","creationDate":{"date":"2022-07-07 10:20:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Fix: Newsletter sender now allows passwords that contain HTML</li><li>Fix: Newsletter sender can now be derived from the system default language</li></ul>","creationDate":{"date":"2022-07-06 15:46:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.13","text":"<ul><li>Bug fixed with tracking link generation</li></ul>","creationDate":{"date":"2022-05-20 13:42:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.12","text":"<ul><li>Fehler behoben der nur im Docker Testenv auftrat (Bilder laden nicht)</li></ul>","creationDate":{"date":"2022-04-21 10:48:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.11","text":"<ul><li>Newsletter status can be viewed and changed in customer detail</li></ul>","creationDate":{"date":"2022-04-14 13:29:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.10","text":"<ul><li>Error fixed in the Shopware test environment with \"/public\" urls</li><li>The test recipient is now used in the newsletter preview if it is available</li></ul>","creationDate":{"date":"2022-04-13 10:00:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.9","text":"<ul><li>Saleschannel domain urls can now be blacklisted</li></ul>","creationDate":{"date":"2022-04-12 11:50:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.8","text":"<ul><li>It is now possible to disable the advertisment text, header, footer and legal information text when sending newsletters</li><li>Added newsletter footer template editor</li><li>Added newsletter header template editor</li><li>Added newsletter style editor in configuration</li></ul>","creationDate":{"date":"2022-04-07 11:12:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"<ul><li>Removed URL-Encoding on logo image (Compatibility with CDN Parametern)</li></ul>","creationDate":{"date":"2021-12-10 16:33:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"<ul><li>Added ECG-Blocked status to newsletter rulebuilder</li></ul>","creationDate":{"date":"2021-11-04 11:54:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"<ul><li>Compatibility with FroshPlatformMailArchive and other mailer plugins</li><li>Newsletter emails now also contain text/plain content</li></ul>","creationDate":{"date":"2021-10-12 09:41:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<ul><li>Fixed: Newsletters sent via the test send function are marked as completely sent</li></ul>","creationDate":{"date":"2021-10-07 08:28:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<ul><li>Newsletter recipients can also be deleted if they are referenced in newsletter_statistics.</li><li>Performance increased: newsletter overview in the administration</li><li>Newsletter exception events were added to individualize error handling</li><li>A new newsletter statistics status was added \"failed\"</li><li>Newsletter recipients due to an error that did not come about by the e-mail provider are marked as \"failed\" in the statistics. These will not be sent again in the same newsletter.</li></ul>","creationDate":{"date":"2021-10-06 15:06:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<ul><li>Fixed newsletter test send \"getType() on null\"</li></ul>","creationDate":{"date":"2021-09-29 16:38:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>Newsletter recipients can also be deleted if they have interacted with a newsletter</li></ul>","creationDate":{"date":"2021-09-27 16:51:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>Received newsletters that were canceled when they were sent can now be continued</li><li>Performance improvements -- thank you [Digital Loop GmbH](http://www.digital-loop.com/)</li></ul>","creationDate":{"date":"2021-09-24 16:02:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<ul><li>A bug in the URL generation of the newsletter pixel has been fixed</li><li>Exception handling for newsletter statistics service was added</li><li>Added validation for sales channel type</li><li>Errors in the newsletter test dispatch are now displayed</li><li>Newsletter recipients can now be sorted by status in the administration</li><li>en_GB snippets were corrected</li><li>Errors in newsletter detail are displayed now as shopware notification</li><li>Errors in newsletter variables are now displayed in the component</li></ul>","creationDate":{"date":"2021-09-21 15:42:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>The copyright text is now also displayed if no additional information is available</li></ul>","creationDate":{"date":"2021-08-31 12:06:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Preparations for Shopware 6.4.0.0</li><li>Newsletter variables works with customer saleschannel binding</li><li>Removed unused code</li></ul>","creationDate":{"date":"2021-05-21 17:56:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p></p><ul><li>Added Access Control List feature</li><li>Added interfaces for NewsletterDispatcher service in constructor</li></ul>","creationDate":{"date":"2021-04-07 15:26:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<ul><li>Added uninstall process</li></ul>","creationDate":{"date":"2021-03-24 10:44:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<ul><li>Small fixes                 .</li></ul>","creationDate":{"date":"2020-10-08 15:23:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Support of Shopware 6.3.1.0</li></ul>","creationDate":{"date":"2020-09-08 16:06:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<ul><li>Preparations for SpnoNewsletterBusiness</li><li>Improved snippets</li><li>Added MailerInterface</li></ul>","creationDate":{"date":"2020-09-07 14:38:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<ul><li>Added support for Shopware 6.3</li><li>Added rulebuilder pagination</li></ul>","creationDate":{"date":"2020-08-12 12:05:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p></p><ul><li>Preparations for SpnoNewsletterBusiness</li></ul>","creationDate":{"date":"2020-07-24 13:46:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>Plugin Code optimizations</li></ul>","creationDate":{"date":"2020-07-21 15:48:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<ul><li>More accurate newsletter statistics</li><li>Newsletter template optimisation</li><li>Link generation optimized</li><li>Language switch bug fixed</li><li>Sidebar variables are now a component</li><li>Smaller business logic</li></ul>","creationDate":{"date":"2020-07-20 09:56:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>Preparations for SpnoNewsletterBusiness</li><li>Fixed display bug in newsletter listing</li><li>Set default image width</li><li>Changed deprecated functions</li><li>Link generation optimized</li></ul>","creationDate":{"date":"2020-07-09 09:44:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release in store</p>","creationDate":{"date":"2020-06-23 16:16:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Spno671636854217","redirectToStore":true,"lowestPriceValue":39.95}