{"id":11877,"name":"EightworksCookieConsentPlus6","code":"eight21858237480","lastChange":{"date":"2023-07-25 10:24:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpF6Pxxj","examplePageUrl":"","moduleKey":"EightworksCookieConsentPlus6","creationDate":{"date":"2020-06-22 10:06:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-11-25 08:30:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-09-02 09:33:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2615,"prefix":"eightworks","name":"8works","website":"//www.8works.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2615_8works.png"},"infos":[{"id":18795,"name":"Cookie Consent Plus - Erweiterung für den Cookie Consent Manager","description":"<p></p><ul><li><b>Neu seit Version 1.6.0: Viele neue Felder stehen nun zur Verfügung zur Erweiterung der individuellen Cookies so wie einigen System-Cookies um wichtige Informationen wie z.B.&nbsp;Anbieter, Datenschutz-Link etc.</b></li><li><b>Neu: Mit anderen sinnvollen Plugins kostengünstig im \"Conversion Boost Paket\"-Bundle erhältlich:&nbsp;</b><a href=\"https://store.shopware.com/eight21858237480/cookie-consent-plus-erweiterung-fuer-den-cookie-consent-manager.html#bundles\" target=\"_blank\" rel=\"noreferrer\">Zum Bundle Angebot</a></li><li><b>Neu seit Version 1.2.0: Individuelle / Eigene Cookies lassen sich nun bequem über die Plugin-Einstellungen zum Consent Manager hinzufügen. Auf Wunsch wird, sobald ein Nutzer diesen Eintrag akzeptiert ein individuelles Script ausgeführt (Anwendungsbeispiele: Google Tag Manager oder Facebook Pixel). Vorerst sind bis zu 5 individuelle Einträge möglich!</b></li></ul><p></p><p><b><br></b></p><b>Dieses Plugin erweitert die Cookie Consent Core-Funktionalität in Shopware 6 mit dem Ziel höhere Akzeptanzraten zu erhalten. Hierbei werden aktuelle Privacy, TTDSG&nbsp;&amp; DSGVO Verordnungen berücksichtigt.</b><p><b><br></b></p><p>Mit dem Cookie Consent Plus Plugin bieten wir für Ihren Shop die&nbsp;<b>zeitgemäße &amp; günstige Alternative zu eher kostenspieligen Drittanbieter Lösungen</b>. Mit den vielen Optionen können unter anderem die Buttons optisch unterstrichen oder eben herabgesetzt werden. Somit können Sie mit Hilfe dieses Plugins eine&nbsp;<b>Ratio von ca. 90%</b><b>akzeptieren</b>&nbsp;/ 10% lehnen ab bzw. \"individuell\" (Erfahrungswerte aus mehreren Kundenprojekten) problemlos erreichen.</p><p><br></p><p>Da das Plugin auf die Core-Funktion aufbaut, setzt das Plugin dort an, wo Shopware bereits einen wichtigen Meilenstein in Zeiten von<b>&nbsp;DSGVO und ePrivacy</b>&nbsp;gesetzt hat. Mit Version 5.6.3 lieferte nämlich Shopware angepasst an das EuGH Urteil zum Thema die genannte Core-Funktion. Plugins die diese Cookie-Funktion schon Unterstützen sind damit&nbsp;<b>ab Werk auch für diese Lösung optimiert.&nbsp;</b>Hierzu gehört zum Beispiel das offizielle \"Google Integration\" Plugin von Shopware.<b></b>&nbsp;Andere Plugins &amp; Scripte können und sollten von Entwicklern nach der Shopware Anleitung angepasst werden (Verweis:&nbsp;<a href=\"https://developers.shopware.com/developers-guide/cookie-consent-manager/\">https://developers.shopware.com/developers-guide/cookie-consent-manager/</a>). Gerne helfen wir Ihnen hier weiter!</p><p><br></p><p>Für die erste Inbetriebnahme<b>&nbsp;beachten Sie bitte die Installationsanleitung,</b>&nbsp;damit das Plugin wie gewünscht läuft. Sobald das Plugin installiert ist, können Sie sämtliche Einstellung nach Ihren Bedürfnissen konfigurieren. Hierzu gehören zum Beispiel ein \"Schwebender Button\" um die bereits hinterlegten Einstellungen an jeder Position im Shop zu re-konfigurieren. Aber auch die Möglichkeit<b>&nbsp;Ihr Shop Logo oder individuelle Texte&nbsp;</b>im Consent Manager zu platzieren besteht. Highlight des Plugins sind die&nbsp;<b>3 verschiedenen Modis</b>. Sie können hier problemlos zwischen dem&nbsp;<b>\"Hybrid\" </b>(steht aktuell noch nicht zur Verfügung)<b>, \"Keine Auflistung\" &amp; \"Direkte Auflistung\"</b>&nbsp;wählen. Je nach dem werden die einzelnen Cookie-Gruppen inkl. Konfiguration direkt angezeigt oder eben erst nach dem Klick auf \"Konfigurieren\". Auch besteht die Möglichkeit die Auflistung komplett zu entfernen (Nicht empfohlen!).&nbsp;</p><p><br></p><p>Nachfolgend möchten wir noch einmal darauf eingehen, wieso dieses Plugin auch&nbsp;<b>kostentechnisch einen riesen Vorteil&nbsp;</b>bietet. Hierzu nehmen wir als Vergleich einen Durchschnittswert der Drittanbieter Dienste von ca. 50€ / Monat. Diese entfallen hier. Hier entstehen lediglich einmalige Plugin-Kaufkosten sowie eine jährliche Subscription-Verlängerung von nur einem Bruchteil des Kaufpreises.<br><br>Kosten bei&nbsp;<b>Drittanbietern: ca.&nbsp;&nbsp;600€</b>&nbsp;pro Jahr<br>Kosten mit&nbsp;<b>unserem Plugin</b>:&nbsp;<b>Einmalig 149€ +</b>&nbsp;Subscription-Verlängerung nach 12 Monaten (Bruchteil Kaufpreis) oder eine günstige Monatsmiete von unter 15€</p><p><br></p><p>Wichtig: Bei Verwendung des Plugins können wir als Web-Agentur leider keine rechtliche Sicherheit garantieren. Zudem können mit gewissen Einstellungskombinationen ggf. rechtliche Verordnungen umgangen werden. Sollten Sie sich mit Ihrer individuellen Einstellung&nbsp;unsicher sein, erfragen Sie hier bitte eine rechtliche Auskunft bei Ihrem Anwalt des Vertrauens.</p><p><br></p><p>Wir wünschen viel Freude &amp; Erfolg mit dem Plugin!</p>","installationManual":"<p>1. Installieren Sie das Plugin</p><p>2. Aktivieren Sie das Plugin</p><p>3.1 Unter Shopware 6.4: Öffnen Sie die Plugin-Einstellungen des Plugins (Unter \"Einstellungen -&gt; System -&gt; Plugins -&gt; Warenkorb Tooltip -&gt; '••• Menü' -&gt; Konfiguration\")<br>3.2: Über Shopware 6.4: Öffnen Sie die Plugin-Einstellungen des Plugins (Unter \"Erweiterungen -&gt; Meine Erweiterungen -&gt; Warenkorb Tooltip -&gt; '••• Menü' -&gt; Konfiguration\")<br></p><p>4. Aktivieren Sie die Option \"Aktivierung -&gt; Für Verkaufskanal aktivieren\" für den gewünschten Shop / Verkaufskanal</p><p>5. Löschen Sie Ihre Cookies oder stellen Sie sicher, dass Sie diese nicht bereits akzeptiert haben</p><p>6. Leeren Sie ggf. den Cache (Vorsicht: Bei gut besuchten Shops kann es zu erhöhten Ladezeiten kommen!)</p><p><br></p><p>Link zum Handbuch / Dokumentation:&nbsp;<a href=\"https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc</a><br></p>","shortDescription":"Die preiswerte Cookie-Lösung für Shopware 6. Höhere Akzeptanz, eigene Cookies hinzufügen, intuitives Layout & viele Einstellungsmöglichkeiten ganz nach DSGVO, TTDSG & ePrivacy Standards","highlights":"Hinzufügen von bis zu 5 individuellen Cookies / Scripts möglich (seit Version 1.2.0)\nHöhere Akzeptanzrate durch gezielte optische Unterstreichungen\nSchwebender Rekonfigurierungs-Button (Änderung der Cookie-Einstellung) von jeder Seite zugänglich\nOft die preiswertere Lösung im Vergleich zu Drittanbieter-Lösungen\nKnüpft an die aktuelle DSG-VO, TTDSG sowie ePrivacy Standards an","features":"Je Sub-Shop einstellbar\n2 verschiedene Modis: Keine Auflistung: Erst sichtbar durch Klick auf \"Konfiguration\" &amp; Direkte Auflistung mit Auswahl (Konfigurationsbutton fällt weg)\nHeadline individuell einstellbar\nTexte individuell einstellbar\nPlatzierungsmöglichkeit des Logos oberhalb der Headline für mehr Vertrauen\nFarbeinstellung je Button möglich (Bis zu 7 Möglichkeiten)\nOptisch ansprechend durch schlichte Animationen\nHinzufügen von bis zu 5 eigene / individuellen Scripts & Cookies möglich (seit Version 1.2.0)\nFüge Informationen wie Anbieter, Datenschutzlink etc. hinzu zu individuellen Einträgen sowie einigen System-Cookies wie Paypal, Amazon Pay etc. (seit Version 1.6.0)"},{"id":19596,"name":"Cookie Consent Plus - extension for Cookie the Consent Manager","description":"<p></p><ul><li><b>New since version 1.6.0: Many new fields are now available for expanding individual cookies and some system cookies with important information such as provider, data protection link, etc.</b><br></li><li><b>New: With other useful plugins in \"Conversion Boost Paket\"-Bundle sale available:&nbsp;</b><a href=\"https://store.shopware.com/eight21858237480/cookie-consent-plus-erweiterung-fuer-den-cookie-consent-manager.html#bundles\" target=\"_blank\" rel=\"noreferrer\">Zum Bundle Angebot</a></li><li><b>New since version 1.2.0: Individual cookies can now be easily added to the Consent Manager via the plugin settings. Upon request, as soon as a user accepts this entry, an individual script will be executed (application examples: Google Tag Manager or Facebook Pixel). For the time being, up to 5 individual entries are possible!</b><br></li></ul><p></p><p><b><br></b></p><p><b>This plugin extends the cookie consent core functionality in shopware 6 with the goal of obtaining higher acceptance rates. Current Privacy &amp; GDPR regulations are taken into account.</b></p><p><br></p><p>With the Cookie Consent Plus plugin, we offer your shop the&nbsp;<b>contemporary &amp; affordable alternative to more expensive third-party solutions</b>. With the many options, the buttons can be underlined or reduced, among other things. With the help of this plugin you can get a<b>&nbsp;ratio of approx. 90% accept</b>&nbsp;/ 10% reject or achieve \"individual\" (experience from several customer projects) without any problems.</p><p><br></p><p>Since the plugin is based on the core function, the plugin starts where Shopware has already set an important milestone in times of&nbsp;<b>GDPR and ePrivacy</b>. With version 5.6.7, Shopware delivered the core function mentioned in line with the ECJ ruling on the subject. Plugins that already support this cookie function&nbsp;<b>are therefore optimized for this solution at the factory</b>. This includes, for example, the official \"Google Integration\" plugin from Shopware. Other plugins &amp; scripts can and should be adapted by developers according to the Shopware instructions (reference: https://developers.shopware.com/developers-guide/cookie-consent-manager/). We are happy to help you here!</p><p><br></p><p><b>For the first start-up, please follow the installation instructions</b>&nbsp;so that the plugin runs as desired. Once the plugin is installed, you can configure all settings according to your needs. This includes, for example, a \"floating button\" to reconfigure the settings already stored at every position in the shop. But it is also possible to<b>&nbsp;place your shop logo or individual texts&nbsp;</b>in the Consent Manager. The highlight of the plugin are the<b>&nbsp;3 different modes</b>. You can easily choose between&nbsp;<b>\"Hybrid\"</b> (not yet available)<b>, \"No listing\" &amp; \"Direct listing\".</b>&nbsp;Depending on the, the individual cookie groups including configuration are displayed directly or only after clicking on \"Configure\". It is also possible to completely remove the list (not recommended!).</p><p><br></p><p>In the following example we would like to go into again why this plugin offers a huge advantage in terms of costs. For this purpose, we take an average value of third-party services of around € 50 / month as a comparison. These do not apply here. There are only one-time plug-in purchase costs and an annual subscription extension of just a fraction of the purchase price.<br></p><p><br></p><p><b>Third-party costs:</b>&nbsp;approx.&nbsp;<b>€ 600 per year</b></p><p>Costs with&nbsp;<b>our plugin:</b><b>One-off € 129</b>&nbsp;+ subscription extension after 12 months (fraction of the purchase price) or a cheap monthly rent of less than € 15<br><br>Important: As a web agency, we cannot guarantee legal security when using the plugin. In addition, certain combinations of settings can be used to circumvent legal regulations. If you are unsure about your individual attitude, please ask for legal information from your trusted lawyer.<br></p><p><br></p><p>We wish you much success with the plugin!</p>","installationManual":"<p>1. Install the plugin<br></p><p>2. Activate the plugin</p><p>3.1 Shopware 6.3 and below: Open the plugin settings of the plugin (under \"Settings -&gt; System -&gt; Plugins -&gt; Cookie Consent Plus -&gt; '••• Menu' -&gt; Configuration\")<br>3.2 Shopware 6.4: Open the plugin settings of the plugin (under \"Extensions -&gt; My Extensions -&gt; Shopping Cart Tooltip -&gt; '••• Menu' -&gt; Configuration\")</p><p>4. Activate the option \"Activation -&gt; Activate for sales channel\" for the desired shop / sales channel</p><p>5. Delete your cookies or make sure that you have not already accepted them</p><p>6. Empty the cache if necessary (caution: well-visited shops can lead to increased loading times!)</p><p><br></p><p>Link to the manual / documentation:&nbsp;<a href=\"https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc</a>&nbsp;(german)</p>","shortDescription":"Your cheap cookie solution for Shopware 6. Higher acceptance rate, intuitive layout, add your own cookies & many setting options according to GDPR & ePrivacy standards.","highlights":"It is possible to add up to 2 individual scripts / cookies\nHigher acceptance rate through targeted optical underlining\nFloating reconfiguration button (change of cookie setting) accessible from every page\nOften the cheaper solution compared to third-party solutions\nLinks to the current GDPR and e","features":"Adjustable for each sub-shop\n2 different modes: No listing: Only visible by clicking on \"Configuration\" &amp; Direct listing with selection (configuration button is omitted)\nHeadline individually adjustable\nTexts individually adjustable\nPlacement of the logo above the headline for more trust\nColor adjustment possible per button (up to 7 options)\nVisually appealing with simple animations\nIt is possible to add up to 2 individual scripts / cookies"}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161140,"bookingKey":"eight21858237480","bookingText":"Cookie Consent Plus - extension for Cookie the Consent Manager","price":119.2,"subscription":true,"discount":20,"discr":"priceModelBuy"},{"id":161139,"bookingKey":"eight21858237480_M","bookingText":"Cookie Consent Plus - extension for Cookie the Consent Manager","price":14.9,"duration":1,"trialPhaseIncluded":true,"discount":6.7114093959732,"discountAppliesForMonths":6,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppn3ylO","preview":true,"priority":0,"id":52502},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpre0SZ0","preview":false,"priority":3,"id":52504},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJrcuga","preview":false,"priority":3,"id":69528},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8SgMHA","preview":false,"priority":2,"id":52509},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM7fYVY","preview":false,"priority":0,"id":52503}],"comments":[{"authorName":"MZ","text":"Schneller und guter Support","headline":"Schneller und guter Support","creationDate":{"date":"2020-12-07 18:16:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Cookie Consent Plus - Erweiterung für den Cookie Consent Manager","description":"<p></p><ul><li><b>Neu seit Version 1.6.0: Viele neue Felder stehen nun zur Verfügung zur Erweiterung der individuellen Cookies so wie einigen System-Cookies um wichtige Informationen wie z.B. Anbieter, Datenschutz-Link etc.</b></li><li><b>Neu: Mit anderen sinnvollen Plugins kostengünstig im \"Conversion Boost Paket\"-Bundle erhältlich: </b><a href=\"https://store.shopware.com/eight21858237480/cookie-consent-plus-erweiterung-fuer-den-cookie-consent-manager.html#bundles\" target=\"_blank\" rel=\"noreferrer noopener\">Zum Bundle Angebot</a></li><li><b>Neu seit Version 1.2.0: Individuelle / Eigene Cookies lassen sich nun bequem über die Plugin-Einstellungen zum Consent Manager hinzufügen. Auf Wunsch wird, sobald ein Nutzer diesen Eintrag akzeptiert ein individuelles Script ausgeführt (Anwendungsbeispiele: Google Tag Manager oder Facebook Pixel). Vorerst sind bis zu 5 individuelle Einträge möglich!</b></li></ul><p></p><p><b><br /></b></p><b>Dieses Plugin erweitert die Cookie Consent Core-Funktionalität in Shopware 6 mit dem Ziel höhere Akzeptanzraten zu erhalten. Hierbei werden aktuelle Privacy, TTDSG &amp; DSGVO Verordnungen berücksichtigt.</b><p><b><br /></b></p><p>Mit dem Cookie Consent Plus Plugin bieten wir für Ihren Shop die <b>zeitgemäße &amp; günstige Alternative zu eher kostenspieligen Drittanbieter Lösungen</b>. Mit den vielen Optionen können unter anderem die Buttons optisch unterstrichen oder eben herabgesetzt werden. Somit können Sie mit Hilfe dieses Plugins eine <b>Ratio von ca. 90%</b><b>akzeptieren</b> / 10% lehnen ab bzw. \"individuell\" (Erfahrungswerte aus mehreren Kundenprojekten) problemlos erreichen.</p><p><br /></p><p>Da das Plugin auf die Core-Funktion aufbaut, setzt das Plugin dort an, wo Shopware bereits einen wichtigen Meilenstein in Zeiten von<b> DSGVO und ePrivacy</b> gesetzt hat. Mit Version 5.6.3 lieferte nämlich Shopware angepasst an das EuGH Urteil zum Thema die genannte Core-Funktion. Plugins die diese Cookie-Funktion schon Unterstützen sind damit <b>ab Werk auch für diese Lösung optimiert. </b>Hierzu gehört zum Beispiel das offizielle \"Google Integration\" Plugin von Shopware.<b></b> Andere Plugins &amp; Scripte können und sollten von Entwicklern nach der Shopware Anleitung angepasst werden (Verweis: <a href=\"https://developers.shopware.com/developers-guide/cookie-consent-manager/\">https://developers.shopware.com/developers-guide/cookie-consent-manager/</a>). Gerne helfen wir Ihnen hier weiter!</p><p><br /></p><p>Für die erste Inbetriebnahme<b> beachten Sie bitte die Installationsanleitung,</b> damit das Plugin wie gewünscht läuft. Sobald das Plugin installiert ist, können Sie sämtliche Einstellung nach Ihren Bedürfnissen konfigurieren. Hierzu gehören zum Beispiel ein \"Schwebender Button\" um die bereits hinterlegten Einstellungen an jeder Position im Shop zu re-konfigurieren. Aber auch die Möglichkeit<b> Ihr Shop Logo oder individuelle Texte </b>im Consent Manager zu platzieren besteht. Highlight des Plugins sind die <b>3 verschiedenen Modis</b>. Sie können hier problemlos zwischen dem <b>\"Hybrid\" </b>(steht aktuell noch nicht zur Verfügung)<b>, \"Keine Auflistung\" &amp; \"Direkte Auflistung\"</b> wählen. Je nach dem werden die einzelnen Cookie-Gruppen inkl. Konfiguration direkt angezeigt oder eben erst nach dem Klick auf \"Konfigurieren\". Auch besteht die Möglichkeit die Auflistung komplett zu entfernen (Nicht empfohlen!). </p><p><br /></p><p>Nachfolgend möchten wir noch einmal darauf eingehen, wieso dieses Plugin auch <b>kostentechnisch einen riesen Vorteil </b>bietet. Hierzu nehmen wir als Vergleich einen Durchschnittswert der Drittanbieter Dienste von ca. 50€ / Monat. Diese entfallen hier. Hier entstehen lediglich einmalige Plugin-Kaufkosten sowie eine jährliche Subscription-Verlängerung von nur einem Bruchteil des Kaufpreises.<br /><br />Kosten bei <b>Drittanbietern: ca.  600€</b> pro Jahr<br />Kosten mit <b>unserem Plugin</b>: <b>Einmalig 149€ +</b> Subscription-Verlängerung nach 12 Monaten (Bruchteil Kaufpreis) oder eine günstige Monatsmiete von unter 15€</p><p><br /></p><p>Wichtig: Bei Verwendung des Plugins können wir als Web-Agentur leider keine rechtliche Sicherheit garantieren. Zudem können mit gewissen Einstellungskombinationen ggf. rechtliche Verordnungen umgangen werden. Sollten Sie sich mit Ihrer individuellen Einstellung unsicher sein, erfragen Sie hier bitte eine rechtliche Auskunft bei Ihrem Anwalt des Vertrauens.</p><p><br /></p><p>Wir wünschen viel Freude &amp; Erfolg mit dem Plugin!</p>","installationManual":"<p>1. Installieren Sie das Plugin</p><p>2. Aktivieren Sie das Plugin</p><p>3.1 Unter Shopware 6.4: Öffnen Sie die Plugin-Einstellungen des Plugins (Unter \"Einstellungen -&gt; System -&gt; Plugins -&gt; Warenkorb Tooltip -&gt; '••• Menü' -&gt; Konfiguration\")<br />3.2: Über Shopware 6.4: Öffnen Sie die Plugin-Einstellungen des Plugins (Unter \"Erweiterungen -&gt; Meine Erweiterungen -&gt; Warenkorb Tooltip -&gt; '••• Menü' -&gt; Konfiguration\")<br /></p><p>4. Aktivieren Sie die Option \"Aktivierung -&gt; Für Verkaufskanal aktivieren\" für den gewünschten Shop / Verkaufskanal</p><p>5. Löschen Sie Ihre Cookies oder stellen Sie sicher, dass Sie diese nicht bereits akzeptiert haben</p><p>6. Leeren Sie ggf. den Cache (Vorsicht: Bei gut besuchten Shops kann es zu erhöhten Ladezeiten kommen!)</p><p><br /></p><p>Link zum Handbuch / Dokumentation: <a href=\"https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc</a><br /></p>","version":"1.7.4","changelog":[{"version":"1.7.4","text":"<p></p><ul><li>Javascript behavior improved for special subshop setups</li></ul><p><br /></p><p>Before installing the update, please double-check whether the setting `Settings -&gt; Master data -&gt; Use standard cookie notice` is active for the desired subshop!<br /></p>","creationDate":{"date":"2023-07-18 10:40:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.2","text":"<p></p><ul><li>Compatibility update Shopware 6.5+</li></ul><p><br /></p><p>Note: The Shopware 6.5 update includes breaking changes. Testing in a test environment beforehand is recommended!</p>","creationDate":{"date":"2023-06-01 12:26:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.5","text":"<ul><li>Fixes \"privacy links\"</li></ul>","creationDate":{"date":"2022-12-16 14:31:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.4","text":"<ul><li>Fixes amazon pay privacy link</li></ul>","creationDate":{"date":"2022-12-16 10:03:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.3","text":"<p><b>Changes Version 1.6.3<br /><br /></b></p><ul><li>Javascript-Error-Fix in Shopware Versions under 6.4.18.0</li></ul><p><br /></p><p><b>Changes </b><b>Version 1.6.2 (Unreleased)</b><br /><br /></p><ul><li>Typo in Paypal Configuration fixed (Storefront)</li><li>Typo in Plugin Config fixed</li></ul>","creationDate":{"date":"2022-12-15 16:48:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<p><b>⚠️ </b><b>Deep update with many changes</b></p><p>With version 1.6.0 we not only revised the plugin configuration but also added many settings. Accordingly, we strongly recommend making a backup before this update and / or testing it in a test environment.<br /><b>Changes Version 1.6.1</b></p><p></p><p></p><p></p><ul><li>Fix: \"Initiales state of checkboxes\"</li></ul><p><b>Changes Version 1.6.0</b></p><p></p><ul><li>Fix: Removed white space in the footer when the page was called up for the first time</li><li>New fields for individual entries: provider, more details for e.g. purpose of data processing, cookie table, data protection link, Src (Javascript-Src-Url)</li><li>Extension of system cookies with descriptive texts</li><li>Extension for system cookies such as Paypal, Amazon Pay &amp; Google Analytics with name, description, provider, more details for e.g. purpose of data processing, cookie table, data protection link</li><li>Modification plugin configuration</li></ul><p>More in our documentation: <a href=\"https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc?id=ab-version-16-mehr-details-amp-informationen-k%C3%B6nnen-hinterlegt-werden\" target=\"_blank\" rel=\"noreferrer noopener\">Documenation Cookie Consent Plus</a></p><p>Live Demo: <a href=\"https://plugin-demo-sw6.8dev.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugin-demo-sw6.8dev.de/</a></p>","creationDate":{"date":"2022-12-08 11:36:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<p><b>⚠️ </b><b>Deep update with many changes</b></p><p>With version 1.6.0 we not only revised the plugin configuration but also added many settings. Accordingly, we strongly recommend making a backup before this update and / or testing it in a test environment.</p><p><b>Changes Version 1.6.0</b></p><p></p><ul><li>Fix: Removed white space in the footer when the page was called up for the first time</li><li>New fields for individual entries: provider, more details for e.g. purpose of data processing, cookie table, data protection link, Src (Javascript-Src-Url)</li><li>Extension of system cookies with descriptive texts</li><li>Extension for system cookies such as Paypal, Amazon Pay &amp; Google Analytics with name, description, provider, more details for e.g. purpose of data processing, cookie table, data protection link</li><li>Modification plugin configuration</li></ul><p>More in our documentation: <a href=\"https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc?id=ab-version-16-mehr-details-amp-informationen-k%C3%B6nnen-hinterlegt-werden\" target=\"_blank\" rel=\"noreferrer noopener\">Documenation Cookie Consent Plus</a></p><p>Live Demo: <a href=\"https://plugin-demo-sw6.8dev.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugin-demo-sw6.8dev.de/</a></p>","creationDate":{"date":"2022-12-07 16:38:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.5","text":"<ul><li>Bugfix conflict \"Loader\" class at variant change</li><li>Crawler optimization: Search engine &amp; important crawlers can now scroll the page</li></ul>","creationDate":{"date":"2022-06-21 13:02:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<p></p><ul><li>Compatibility with Shopware 6.4.11.0+ established</li><li>Troubleshooting Javascript Error \"AjaxModalExtension\"</li><li>Bug fix custom script query</li></ul>","creationDate":{"date":"2022-05-04 15:38:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<ul><li>Improvements for function \"accept all\"</li></ul>","creationDate":{"date":"2022-04-13 09:27:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<ul><li>Breaking Change: Fixed page refresh after accepting/rejecting the cookies*</li><li>Fix: Cookie 1 Debug Output im Consent Manager</li></ul><p><br /></p><p><i>*If this feature causes problems with other plugins or your individual cookies, we ask you to report this as soon as possible. In this case, we recommend going back to plugin version 1.4 first.</i></p><p><br /></p><p>Please read the changes in the documentation: <a href=\"https://8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc?id=schritt-4-individuelle-eintr%C3%A4ge-zum-consent-manager-hinzuf%C3%BCgen\">Step 4: Add individual entries to the Consent Manager</a></p>","creationDate":{"date":"2022-03-18 12:29:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p><b>ATTENTION: </b>This update contains breaking changes that require the attention of the user.</p><p><br /></p><p>Important changes</p><p>1. The individual cookies can now be translated or maintained in multiple languages. As a side effect, previously maintained names and descriptions of individual cookies are lost. It is therefore essential to save beforehand and add it manually after the update! The scripts remain.</p><p>2. Due to an error, some individual cookies were not executed correctly. This has been fixed. Please read the documentation, step 4 ( https://8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc?id=schritt-4-individuelle-eintr%C3%A4ge-zum-consent-manager-hinzuf%C3%BCgen ).</p><p><br /></p><p><b>All changes </b><br /></p><ul><li>Fixed cache conflicts regarding individual cookies<br /></li><li>Individual cookies can be maintained in multiple languages<br /></li><li>Added 3 more individual cookie slots<br /></li></ul>","creationDate":{"date":"2022-03-08 14:11:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>New feature: Change button arrangement (2 modes)</li><li>New feature: \"Reject cookies\" / \"Deny\" button* </li></ul><p><br /></p><p> *After an examination by the European Court of Justice (ECJ), Federal Court of Justice (BGH) and regional courts (LG), it was decided that according to TTDSG §§ 25 and 26 a reject button is necessary from December 1st, 2021. Note: Unfortunately, we cannot and are not allowed to provide any legal information. If you have any questions in this regard, please contact a lawyer.</p>","creationDate":{"date":"2021-11-23 14:06:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p></p><ul><li>Bugfix: Individual cookie decisions were not correctly triggered by the cache and a script might not be executed despite consent<br /></li><li>Bugfix: SVG logo display optimized<br /></li></ul><p><br /></p>","creationDate":{"date":"2021-10-20 12:34:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- New function: add individual cookies / scripts (max. 2)</p><p>- New function: Add a link to configure cookies to the footer (cookie settings in the footer)</p><p><br /></p><p>Documentation for new Feature: https://www.8works.de/docs/#/eightworks/eightworkscookieconsentplus6/doc?id=extra-einrichtung-google-tag-manager-ab-plugin-version-120<br /></p>","creationDate":{"date":"2021-07-16 13:35:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>- Compatibility update for Shopware 6.4+</p><p><br /></p><p>Minimum requirement: Shopware 6.4</p>","creationDate":{"date":"2021-05-07 12:24:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- Workaround for Issue NEXT-12535 (duplicate modals)<br />- Works with SW6.3.4.0+</p>","creationDate":{"date":"2020-12-07 11:08:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>First release including new functions:</p><p>- New: Alternative icon (fingerprint / fingerprint) incl. Animation for \"reconfiguration button\"</p><p>- New: Optional simple button animation on \"Accept all\" button</p><p>- Currently not included: hybrid mode (list of cookie entries + individual button)</p><p>- Change: Buttons are shown one below the other instead of next to one another</p><p>- Change: Bugfix on small displays / laptops</p>","creationDate":{"date":"2020-11-24 16:46:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=eight21858237480","redirectToStore":false,"lowestPriceValue":14.9}