{"id":11890,"name":"SpnoNewsletterBusiness","code":"Spno437223894231","lastChange":{"date":"2023-07-18 11:16:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLKIpf6","examplePageUrl":"","moduleKey":"SpnoNewsletterBusiness","creationDate":{"date":"2020-06-23 11:24:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-07-31 23:40:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-01-14 12:20:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":603,"prefix":"Spno","name":"webpiloten","website":"//web-piloten.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod603_webpiloten_WANTED_Vorlage-2023_128x128.jpg"},"infos":[{"id":18818,"name":"Newsletter - Business (Upgrade)","description":"<p><b>Dieses Plugin das Upgrade zu unserem&nbsp;<a href=\"https://store.shopware.com/spno671636854217/newsletter-economy.html\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter • Economy</a>&nbsp;Plugin ist (muss vorher installiert werden)</b><b>! Wir empfehlen Ihnen, unser Bundle zu kaufen.&nbsp;</b><b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\"><a href=\"https://store.shopware.com/spno437223894231/newsletter-business-upgrade.html#bundles\">2x Gold prämiert!</a></b></p><h3>Das perfekte Plugin für professionelles Newsletter Marketing</h3><p>Das<b>&nbsp;Newslettersystem</b>&nbsp;der&nbsp;<b>webpiloten.</b>&nbsp;hat die Funktionen des \"<b>Intelligenten Newsletters</b>\" aus&nbsp;<b>Shopware 5 </b>integriert. Das Newsletter Plugin ist direkt in Deinem Shopware 6 Onlineshop als Plugin installierbar. Jetzt kannst Du auf externe Newsletterservices verzichten.&nbsp;Das Plugin \"Newslettersystem • Economy\" vereint moderne Newsletter relevante Funktionen in nur einem Plugin. Hierbei setzt das Plugin da an, wo Shopware 6 aufhört und unterstützt Dich&nbsp;<b>gewinnbringend&nbsp;</b>bei deinen Online Marketing Maßnahmen. Dabei unterstützt Dich das Plugin bei der Einhaltung der&nbsp;<b>DSGVO</b>, indem es keine Newsletter an Empfänger sendet, die als Opt-Out gekennzeichnet sind.&nbsp;</p><h3>Features im Überblick:</h3><h4>Erlebniswelten</h4><p>Mit der Business Version des Newslettersystems werden die <b>Erlebniswelten </b>integriert. Das gibt Dir die Möglichkeit Deine Newsletter über Erlebniswelten-<b>Layouts </b>in kürzester Zeit ohne die Hilfe einer Shopware-Agentur oder fundierteres Wissen über HTML und CSS fertigzustellen. Zusätzlich haben wir Dir die Möglichkeit gegeben, alle <b>Gutscheine </b>und <b>Variablen </b>des Newsletters und der Empfänger in den Erlebniswelten zu nutzen. Über das neue Produktelement in den Erlebniswelten ist es sogar möglich, dynamische Produktgruppen oder Zufallsprodukte auszuwählen.</p><h4>Statistiken / Reports</h4><p>Überprüfe den Erfolg Deiner Newsletter über das neue Reports Module. Hier wählst Du alle zu vergleichenden Newsletter aus und generierst Dir aktuelle <b>Statistiken</b>. Mehrere Diagramm-Arten sowie alle Bestellungen die durch Newsletter-Klicks entstanden sind kannst Du hier sehen.</p><b>Balkendiagramm</b><p>Vergleiche Newsletter auf absolute oder prozentuale Werte</p><b>Liniendiagramm</b><p>Übersicht der Newsletterstatistiken auf einem <b>Zeitstrahl</b>. Dadurch siehst Du auf einen Blick, an welchen Tagen am meisten gelesen, geklickt, gekauft oder abgemeldet wurde.</p><h4>Gutscheine</h4><p>Füge Deine erstellen Gutscheine dymamisch in den Newsletter ein. Diese kannst Du ganz einfach als Variable in den Erlebniswelten setzen und das Plugin generiert automatisch für jeden Empfänger den passenden Code.</p><h4>Empfänger-Gruppen</h4><p>Erstelle in der Shopware Administration verschiedene <b>Newslettergruppen</b>, die Du in jedem Newsletter-Formular über die Erlebniswelten zuweisen kannst. Damit kannst Du deinem Kunden die Möglichkeit geben, sich nur für bestimmte Inhalte deines Newsletters zu registrieren. Über den integrierten <b>Rulebuilder </b>von Shopware kannst Du bei der Versendung nur die Gruppen auswählen, die sich für den Inhalt Deines Newsletters interessieren. So generierst Du eine noch <b>höhere Conversion-Rate</b>.<br></p><p>Gleichzeitig hast Du die Möglichkeit, Gruppen automatisch zuweisen zu lassen. So hat der Kunde nicht die Qual der Wahl, landet aber trotzdem im richtigen Verteiler.</p><h4>Google&nbsp;Kampagnenparameter&nbsp;</h4><p>Erstelle benutzerdefinierte Kampagnenparameter pro Newsletter und Sprache um die Klicks zusätzlich über Google Analytics auszuwerten. Weitere Informationen hierzu findest Du&nbsp;<a href=\"https://support.google.com/analytics/answer/1033867\" target=\"_blank\" rel=\"noreferrer noopener\">direkt bei Google</a>.</p><h4>Archivierung</h4><p>Archiviere Newsletter nachdem sie versendet worden sind, damit Du nicht den Überblick verlierst.</p><h3>Cronjob Befehl</h3><p><i>/ihr/shopware/verzeichnis/bin/console spno:newsletter:send</i></p><h3>Onboarding-Service:<br></h3><p>Die webpiloten. bieten gerne Unterstützung beim erstellen und versenden deines Newsletters an.<br>Schreibe uns einfach eine E-Mail an:&nbsp;<a href=\"https://web-piloten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">kontakt@web-piloten.de</a>&nbsp;oder rufe direkt an unter:&nbsp;<a href=\"https://tel/\" target=\"_blank\" rel=\"noreferrer noopener\">0231 137 52 128</a>.</p><h3>Bitte beachte:</h3><p>Manche Hoster&nbsp;<b>limitieren&nbsp;</b>die Anzahl der Mails pro Stunde. Wenn Du große Empfänger-Listen hast, die Du versenden möchtest, erkundige Dich vorerst bei Deinem Hoster.</p><p>Externe E-Mail-Dienstleister außerhalb der EU sind laut Aufsichtsbehörden entgegen vieler Informationen aus dem Internet nicht DSGVO-konform zu bekommen. Informiere Dich vorher!</p>","installationManual":"<h3>Installieren</h3><p>Als Abhängigkeit ist das <b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\"><a href=\"https://store.shopware.com/spno671636854217/newsletter-economy.html\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter • Economy</a></b>&nbsp;Plugin erforderlich, dieses muss zuvor installiert werden.</p><h3>Cronjob</h3><h4>Erklärung</h4><p>Der Befehl sendet für jeden aktiven Newsletter mit eingereichten Versand einen Stapel und wird dann beendet. Der Befehl muss also in regelmäßigen abständen ausgeführt werden, dazu ist ein Cronjob geeignet. Ein Cronjob ist lediglich ein Programm, dass in regelmäßigen Abständen im Hintergrund ausgeführt wird.</p><h4>Webhosting</h4><p>Wenn Du das Cronjob Feature nutzen möchtest, dann solltest Du den Cronjob Befehl&nbsp;<i>/ihr/shopware/verzeichnis/bin/console spno:newsletter:send</i> in Deinem Webhosting einrichten. Als&nbsp;Ausführungsintervall sollte man den gleichen Wert einrichten wie in der Plugin-Konfiguration Newsletter Economy: <i>Wartezeit zwischen den Stapeln</i> – Ein geringerer Wert ist auch in Ordnung, bei einem höheren Wert, wird aber dadurch natürlich die Wartezeit zwischen den Stapeln ebenfalls höher, da ja technisch keine Newsletter versendet werden.</p><h4>Shopware</h4><p>Möchte man einen Newsletter nun per Cronjob versenden, muss im betreffenden Newsletter der Cronjob Versand aktiviert werden. Dazu navigierst Du in das Newsletter-Detail der Administration im ersten Tab (<i>Einstellungen</i>). Dann lässt Du dir die <i>Zusatzinformationen</i> anzeigen. De Option<i> Newsletter zum automatischen Versand bereit stellen (Cronjob)</i>&nbsp;wird angehakt und ein <i>Versandzeitpunkt </i>eingerichtet.</p><p>Es kann vorher sinnvoll sein, die Serverzeit zu überprüfen. Falls diese in einer falschen Zeitzone ist oder sonstig abweichend ist, beeinflusst dies den Versandzeitpunkt. Möchte man einen Newsletter Sofort versenden, kann man auch einfach ein Datum von gestern auswählen.</p><p><br></p>","shortDescription":"Newsletter • Business ist das Upgrade zu unserem Newsletter • Economy.  >>> Für Statistiken- und Feature-Liebhaber <<< DSGVO-Konform. Die No 1. für Shopware 6","highlights":"Upgrade zu unserem Newsletter • Economy (muss vorher installiert werden)\nIntegration der Erlebniswelten\nStatistiken/Reports\nVersenden von Gutscheine\nEmpfänger-Gruppen definieren","features":"Erweitert den Newsletter Economy\nNutzung des Rulebuilder für die Steuerung verschiedener Empfängergruppen\nGestalte Deinen Newsletter im Corporate Design pro Sales Channel\nHTML Editor zur Individualisierung Deines Inhaltes\nUnterstützung von Emojis in der Betreff-Zeile. Beispiele: ✌ ✂ ❎\nMehrere Sprachen gleichzeitig versenden\nVersand über einen abweichenden SMTP-Server möglich\nNewsletter Reporting (Anzahl der Empfänger, Öffnungsrate, Klick-Rate, Abmeldungs-Rate)\nDu kannst mehrere Absender Adressen definieren"},{"id":18819,"name":"Newsletter • Business (Upgrade)","description":"<p><b>This plugin is the upgrade to our <a href=\"https://store.shopware.com/en/spno671636854217/newsletter-economy.html\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter • Economy</a>&nbsp;plugin (must be installed first!).&nbsp;We are the first and only developer with two gold-certified Apps in Shopware 6! Get Gold x2 and more with this Bundle.&nbsp;</b><a href=\"https://store.shopware.com/spno437223894231/newsletter-business-upgrade.html#bundles\">Gold certified x2!</a></p><h3>The perfect plugin for professional newsletter marketing</h3><p>The webpilots' <b>newslettersystem</b>&nbsp;has integrated the functions of \"<b>Smart Newsletter</b>\" from<b> Shopware 5</b>. The newsletter plugin can be installed directly in your Shopware 6 online shop as a plugin. You can now do without external newsletter services. The \"Newsletter system • Economy\" plugin combines modern newsletter relevant functions in just one plugin. Here, the plugin picks up where Shopware 6 functionality ends and supports you <b>profitably </b>with your online marketing measures. The plugin supports you in complying with the <b>DSGVO </b>by not sending any newsletters to recipients who are marked as opt-out.</p><h3>Overview of features:</h3><h4>Experience worlds</h4><p>The <b>experience worlds</b> are integrated with the business version of the newsletter system. This gives you the opportunity to complete your newsletter via experience worlds <b>layouts </b>in the shortest possible time without the help of a shopware agency or more in-depth knowledge of HTML and CSS. In addition, we have given you the opportunity to use all <b>vouchers </b>and <b>variables </b>from the newsletter and recipients in the experience worlds. With the new product element in the experience worlds, it is even possible to select dynamic product groups or random products.</p><h4>Statistics / reports</h4><p>Check the success of your newsletter using the new reports module. Here you select all newsletters to be compared and generate current <b>statistics</b>. Here you can see several diagram types as well as all orders that were created by newsletter clicks.</p><b>Bar diagram</b><p>Compare newsletters for absolute or percentage values.</p><b>Line diagram</b><p>Overview of the newsletter statistics on a <b>timeline</b>.&nbsp;</p><h4>Voucher</h4><p>Insert your created vouchers dynamically into the newsletter. You can easily set these as variables in the experience worlds and the plugin automatically generates the appropriate code for each recipient.</p><h4>Recipient groups</h4><p>Create various <b>newsletter groups </b>in Shopware Administration, which you can assign in each newsletter form via the experience worlds. This allows you to give your customer the option of only registering for certain content in your newsletter. With the integrated Rulebuilder from Shopware, you can only select the groups that are interested in the content of your newsletter. This is how you generate an even <b>higher conversion rate</b>.<br></p><p>At the same time, you have the option of having groups assigned automatically.</p><h4>Google campaign parameter</h4><p>Create custom campaign parameters for each newsletter and language in order to additionally evaluate the clicks via Google Analytics. You can find more information about this <a href=\"https://support.google.com/analytics/answer/1033867\" target=\"_blank\" rel=\"noreferrer noopener\">directly on Google</a>.</p><h4>Archiving</h4><p>Archive newsletters after they have been sent so that you do not lose track.</p><h3>Cronjob Command</h3><p><i>/ihr/shopware/verzeichnis/bin/console spno:newsletter:send</i></p><h3>Onboarding-Service:</h3><p>You have a question? Contact us directly.<br><a target=\"_blank\" href=\"https://web-piloten.de/\" rel=\"noopener nofollow\">kontakt@web-piloten.de</a>&nbsp;or by phone:&nbsp;<a target=\"_blank\" href=\"https://tel/\" rel=\"noopener nofollow\">+49231 137 52 128</a>.</p><h3>Please note:</h3><p>Some hosts&nbsp;<b>limit&nbsp;</b>the number of emails per hour. If you have large recipient lists that you want to send, inquire with your hoster for the time being.</p>","installationManual":"<h3>Install</h3><p>The&nbsp;<b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\"><a href=\"https://store.shopware.com/spno671636854217/newsletter-economy.html\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter • Economy</a></b>&nbsp;Plugin&nbsp;is required as a dependency and must be installed beforehand.</p><h3>Cronjob</h3><h4>Explanation</h4><p>The command sends a stack for each active newsletter with a submitted send and then exits. The command must therefore be executed at regular intervals, a cron job is suitable for this. A cron job is just a program that runs in the background at regular intervals.</p><h4>Webhosting</h4><p>If you want to use the cron job feature, you should set up the cron job command /your/shopware/directory/bin/console spno:newsletter:send in your web hosting. You should set up the same value as the execution interval as in the plugin configuration Newsletter Economy: Waiting time between batches – A lower value is also fine, but with a higher value, the waiting time between batches will of course also be higher, as it is technical no newsletters will be sent.<br></p><h4>Shopware</h4><p>If you now want to send a newsletter via cronjob, the cronjob dispatch must be activated in the relevant newsletter. To do this, navigate to the newsletter detail of the administration in the first tab (Settings). Then you can display the additional information. The Make newsletter ready for automatic dispatch (cron job) option is checked and a dispatch time is set up.</p><p>It may be useful to check the server time beforehand. If this is in the wrong time zone or is otherwise different, this affects the time of dispatch. If you want to send a newsletter immediately, you can simply select a date from yesterday.</p>","shortDescription":"Newsletter • Business is the upgrade to our Newsletter • Economy - the next generation of \"Smart Newsletter\" of Shopware 5. Take this one if you love features and statistics","highlights":"Upgrade to our Newsletter • Economy (must be installed before)\nstatistics / reports\nGoogle campaign parameter\nSend vouchers\nDefine recipient groups","features":"Use of the Rulebuilder to control different recipient groups\nDesign your newsletter in the corporate design per saleschannel\nHTML editor for customizing your content\nEmojis support in the subject line. Examples: ✌ ✂ ❎\nSend multiple languages ​​at the same time\nSending via a different SMTP server possible\nNewsletter reporting (number of recipients, opening rate, click rate, unsubscription rate)\nYou can define multiple sender addresses"}],"addons":["enterpriseCertified","emotionPreset"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160639,"bookingKey":"Spno437223894231","bookingText":"Newsletter • Business","price":299.97,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160638,"bookingKey":"Spno437223894231_M","bookingText":"Newsletter • Business","price":29.97,"duration":1,"trialPhaseIncluded":true,"discount":83.3,"discountAppliesForMonths":9,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpi9lx2r","preview":true,"priority":0,"id":85011},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoGTr34","preview":false,"priority":25,"id":93166},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHZ1PDj","preview":false,"priority":21,"id":46641},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpu3HyFj","preview":false,"priority":20,"id":46639},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkImGgk","preview":false,"priority":19,"id":46640},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpG9VjFi","preview":false,"priority":18,"id":46637},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4YGHe5","preview":false,"priority":17,"id":46643},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbAfJ7j","preview":false,"priority":16,"id":46638},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfk4EEj","preview":false,"priority":14,"id":46635},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6CQsKg","preview":false,"priority":13,"id":46634},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJM99wf","preview":false,"priority":12,"id":46632},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDFYnie","preview":false,"priority":11,"id":46631},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3oMzdf","preview":false,"priority":10,"id":46630},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpF8uvNc","preview":false,"priority":9,"id":46628},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwIg8Vc","preview":false,"priority":8,"id":46626},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpExPFbd","preview":false,"priority":7,"id":46627},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppoobOl","preview":false,"priority":6,"id":46642},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWD3d7b","preview":false,"priority":5,"id":46624},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdmOn79","preview":false,"priority":4,"id":46629},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZsmjx9","preview":false,"priority":3,"id":46633},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplrPKH4","preview":false,"priority":2,"id":46731},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpt5H1p9","preview":false,"priority":1,"id":46623},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpY2pUPi","preview":false,"priority":0,"id":46636}],"comments":[{"authorName":"Joachim Eicher","text":"Das Plugin ist top, die Integration in Shopware super umgesetzt, und das wohlgemerkt in doch recht engen Möglichkeiten, die Shopware bezüglich Newsletter (vor allem bei der Signin/Signout und Adressverwaltung) von Haus aus bietet. Es bietet genau die Funktionalität, die wir uns erhofft haben - und ganz ohne diese elends teuren Newsletterdienste. Besonders super finde ich die Möglichkeit, den Newsletter in den Shop zu integrieren, sei es mit Gutscheincodes oder der Möglichkeit, über die Erlebniswelten (wer sich den Namen ausgedacht hat frage ich  mich in 100 Jahren noch...) die Newslettergestaltung vorzunehmen. Zwar hat man da nicht ganz alle Möglichkeiten wie für eine Shopseite, aber das ist irgendwie auch logisch, weil für ein Nesletter einiges auch keinen Sinn ergäbe. Besonders hervorheben möchte ich den Support. Er gehört zu den besten hier bei Shopware. Fragen oder Anregungen werden ernst genommen, und man bekommt auch etwas erklärt, ohne dass man wie oft bei Shopware Plugin Anbietern gleich abgewimmelt wird. Wirklich sehr gut. Für uns das entscheidende Argument, das Plugin zu nutzen. Vielen Dank den Webpiloten! Weiter so!","headline":"Super!","creationDate":{"date":"2023-01-28 17:45:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christian Steinmetz","text":"","headline":"Tolles Plugin - macht was es soll","creationDate":{"date":"2022-11-14 10:06:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Martina Urban","text":"Super Erweiterung, läuft super!","headline":"läuft super!","creationDate":{"date":"2022-06-22 10:30:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Nicole Rinas","text":"","headline":"Saubere und übersichtliche Integration ins Backend. Macht, was es soll.","creationDate":{"date":"2022-06-03 06:33:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Michael Friedrich","text":"Das Newsletter Plugin \"Newsletter Business\" ist leider ein kompletter Reinfall. Der Newsletter hat nicht mal ein Header und Footer, daher ist auch nicht DSGVO-konform. Vom Hersteller wird man nur vertröstet.","headline":"Das Newsletter Plugin \"Newsletter Business\" ist leider ein kompletter Reinfall.","creationDate":{"date":"2022-03-08 11:43:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Stefan Saalfeld","text":"Unter all den Plugins, die wir für unseren neuen SW6-Shop installieren, möchte ich dieses als das beste herausstellen. Mit diesem Plugin haben wir unseren Newsletter integriert in Shopware und sind nicht auf mittelmäßig funktionierende Anbindungen an Cleverreach etc. angewiesen. Die Newsletter lassen sich supereinfach gestalten und sehen sehr schön aus. Das beste ist, dass man einen Newsletter in verschiedenen Sprachen in nur einem Rutsch verfassen kann. Ich freue mich auf weitere Features, die hoffentlich mal dazukommen (ohne dass ich jetzt etwas vermissen würde).","headline":"Top Plugin","creationDate":{"date":"2021-11-25 11:15:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Manfred Gabriel","text":"Wir haben schon das „Newsletter • Economy“ Plugin im Einsatz uns sind sehr zufrieden damit. Zur Erweiterung der Funktionen (Erlebniswelten, Gutscheine, Statistiken, …) haben wir auch noch dieses Plugin erworben. Damit wird dann der Versand von Newsletter via Shopware perfekt. Absolute Empfehlung für beide Plugins und auch für den Hersteller dessen Support einfach großartig ist.","headline":"Perfekte Erweiterung zum „Newsletter • Economy“ Plugin","creationDate":{"date":"2021-10-14 10:15:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Robert Opitz","text":"","headline":"Top Empfehlung, weil man keine monatlichen Kosten hat, die bei großen Listen schnell explodieren bei anderen Anbietern","creationDate":{"date":"2021-09-30 10:07:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"TX24","text":"Das Plugin ist direkt im Shopsystem integriert und die Funktionen sind einfach und perfekt zu handeln. Der Support war überragend und es erfolgte sogar eine Rückmeldung telefonisch um eine für uns individuelle Anpassung vorzunehmen.","headline":"Klasse Pugin","creationDate":{"date":"2021-09-29 13:35:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Shopware Account Hagius GmbH","text":"Mit diesen PlugIn haben sich die Mitarbeiter der WebPiloten selbst übertroffen. Sehr gutes NewsletterPlugin. Der Support ist ebenfalls sehr lobend zu erwähnen ! Weiter so ! (27.07.2021)","headline":"Sehr guter Newsletter !","creationDate":{"date":"2021-07-27 15:55:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":9,"label":"Newsletter - Business (Upgrade)","description":"<p><b>Dieses Plugin das Upgrade zu unserem <a href=\"https://store.shopware.com/spno671636854217/newsletter-economy.html\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter • Economy</a> Plugin ist (muss vorher installiert werden)</b><b>! Wir empfehlen Ihnen, unser Bundle zu kaufen. </b><b><a href=\"https://store.shopware.com/spno437223894231/newsletter-business-upgrade.html#bundles\">2x Gold prämiert!</a></b></p><h3>Das perfekte Plugin für professionelles Newsletter Marketing</h3><p>Das<b> Newslettersystem</b> der <b>webpiloten.</b> hat die Funktionen des \"<b>Intelligenten Newsletters</b>\" aus <b>Shopware 5 </b>integriert. Das Newsletter Plugin ist direkt in Deinem Shopware 6 Onlineshop als Plugin installierbar. Jetzt kannst Du auf externe Newsletterservices verzichten. Das Plugin \"Newslettersystem • Economy\" vereint moderne Newsletter relevante Funktionen in nur einem Plugin. Hierbei setzt das Plugin da an, wo Shopware 6 aufhört und unterstützt Dich <b>gewinnbringend </b>bei deinen Online Marketing Maßnahmen. Dabei unterstützt Dich das Plugin bei der Einhaltung der <b>DSGVO</b>, indem es keine Newsletter an Empfänger sendet, die als Opt-Out gekennzeichnet sind. </p><h3>Features im Überblick:</h3><h4>Erlebniswelten</h4><p>Mit der Business Version des Newslettersystems werden die <b>Erlebniswelten </b>integriert. Das gibt Dir die Möglichkeit Deine Newsletter über Erlebniswelten-<b>Layouts </b>in kürzester Zeit ohne die Hilfe einer Shopware-Agentur oder fundierteres Wissen über HTML und CSS fertigzustellen. Zusätzlich haben wir Dir die Möglichkeit gegeben, alle <b>Gutscheine </b>und <b>Variablen </b>des Newsletters und der Empfänger in den Erlebniswelten zu nutzen. Über das neue Produktelement in den Erlebniswelten ist es sogar möglich, dynamische Produktgruppen oder Zufallsprodukte auszuwählen.</p><h4>Statistiken / Reports</h4><p>Überprüfe den Erfolg Deiner Newsletter über das neue Reports Module. Hier wählst Du alle zu vergleichenden Newsletter aus und generierst Dir aktuelle <b>Statistiken</b>. Mehrere Diagramm-Arten sowie alle Bestellungen die durch Newsletter-Klicks entstanden sind kannst Du hier sehen.</p><b>Balkendiagramm</b><p>Vergleiche Newsletter auf absolute oder prozentuale Werte</p><b>Liniendiagramm</b><p>Übersicht der Newsletterstatistiken auf einem <b>Zeitstrahl</b>. Dadurch siehst Du auf einen Blick, an welchen Tagen am meisten gelesen, geklickt, gekauft oder abgemeldet wurde.</p><h4>Gutscheine</h4><p>Füge Deine erstellen Gutscheine dymamisch in den Newsletter ein. Diese kannst Du ganz einfach als Variable in den Erlebniswelten setzen und das Plugin generiert automatisch für jeden Empfänger den passenden Code.</p><h4>Empfänger-Gruppen</h4><p>Erstelle in der Shopware Administration verschiedene <b>Newslettergruppen</b>, die Du in jedem Newsletter-Formular über die Erlebniswelten zuweisen kannst. Damit kannst Du deinem Kunden die Möglichkeit geben, sich nur für bestimmte Inhalte deines Newsletters zu registrieren. Über den integrierten <b>Rulebuilder </b>von Shopware kannst Du bei der Versendung nur die Gruppen auswählen, die sich für den Inhalt Deines Newsletters interessieren. So generierst Du eine noch <b>höhere Conversion-Rate</b>.<br /></p><p>Gleichzeitig hast Du die Möglichkeit, Gruppen automatisch zuweisen zu lassen. So hat der Kunde nicht die Qual der Wahl, landet aber trotzdem im richtigen Verteiler.</p><h4>Google Kampagnenparameter </h4><p>Erstelle benutzerdefinierte Kampagnenparameter pro Newsletter und Sprache um die Klicks zusätzlich über Google Analytics auszuwerten. Weitere Informationen hierzu findest Du <a href=\"https://support.google.com/analytics/answer/1033867\" target=\"_blank\" rel=\"noreferrer noopener\">direkt bei Google</a>.</p><h4>Archivierung</h4><p>Archiviere Newsletter nachdem sie versendet worden sind, damit Du nicht den Überblick verlierst.</p><h3>Cronjob Befehl</h3><p><i>/ihr/shopware/verzeichnis/bin/console spno:newsletter:send</i></p><h3>Onboarding-Service:<br /></h3><p>Die webpiloten. bieten gerne Unterstützung beim erstellen und versenden deines Newsletters an.<br />Schreibe uns einfach eine E-Mail an: <a href=\"https://web-piloten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">kontakt@web-piloten.de</a> oder rufe direkt an unter: <a href=\"https://tel/\" target=\"_blank\" rel=\"noreferrer noopener\">0231 137 52 128</a>.</p><h3>Bitte beachte:</h3><p>Manche Hoster <b>limitieren </b>die Anzahl der Mails pro Stunde. Wenn Du große Empfänger-Listen hast, die Du versenden möchtest, erkundige Dich vorerst bei Deinem Hoster.</p><p>Externe E-Mail-Dienstleister außerhalb der EU sind laut Aufsichtsbehörden entgegen vieler Informationen aus dem Internet nicht DSGVO-konform zu bekommen. Informiere Dich vorher!</p>","installationManual":"<h3>Installieren</h3><p>Als Abhängigkeit ist das <b><a href=\"https://store.shopware.com/spno671636854217/newsletter-economy.html\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter • Economy</a></b> Plugin erforderlich, dieses muss zuvor installiert werden.</p><h3>Cronjob</h3><h4>Erklärung</h4><p>Der Befehl sendet für jeden aktiven Newsletter mit eingereichten Versand einen Stapel und wird dann beendet. Der Befehl muss also in regelmäßigen abständen ausgeführt werden, dazu ist ein Cronjob geeignet. Ein Cronjob ist lediglich ein Programm, dass in regelmäßigen Abständen im Hintergrund ausgeführt wird.</p><h4>Webhosting</h4><p>Wenn Du das Cronjob Feature nutzen möchtest, dann solltest Du den Cronjob Befehl <i>/ihr/shopware/verzeichnis/bin/console spno:newsletter:send</i> in Deinem Webhosting einrichten. Als Ausführungsintervall sollte man den gleichen Wert einrichten wie in der Plugin-Konfiguration Newsletter Economy: <i>Wartezeit zwischen den Stapeln</i> – Ein geringerer Wert ist auch in Ordnung, bei einem höheren Wert, wird aber dadurch natürlich die Wartezeit zwischen den Stapeln ebenfalls höher, da ja technisch keine Newsletter versendet werden.</p><h4>Shopware</h4><p>Möchte man einen Newsletter nun per Cronjob versenden, muss im betreffenden Newsletter der Cronjob Versand aktiviert werden. Dazu navigierst Du in das Newsletter-Detail der Administration im ersten Tab (<i>Einstellungen</i>). Dann lässt Du dir die <i>Zusatzinformationen</i> anzeigen. De Option<i> Newsletter zum automatischen Versand bereit stellen (Cronjob)</i> wird angehakt und ein <i>Versandzeitpunkt </i>eingerichtet.</p><p>Es kann vorher sinnvoll sein, die Serverzeit zu überprüfen. Falls diese in einer falschen Zeitzone ist oder sonstig abweichend ist, beeinflusst dies den Versandzeitpunkt. Möchte man einen Newsletter Sofort versenden, kann man auch einfach ein Datum von gestern auswählen.</p><p><br /></p>","version":"1.6.3","changelog":[{"version":"1.6.3","text":"<ul><li>Fix: SalesChannelContextService has been replaced by SalesChannelContextServiceInterface for plugin compatibility</li></ul>","creationDate":{"date":"2023-06-27 11:32:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"<ul><li>Fix: Checkboxes for newsletter registration have been adapted to Bootstrap 5.</li></ul>","creationDate":{"date":"2023-06-19 11:02:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<ul><li>Fix: CMS elements in the newsletter no longer have a white border</li><li>Fix: Newsletter produkts padding</li></ul>","creationDate":{"date":"2023-04-20 17:03:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<ul><li>Fix: Compatibility with Shopware ^6.5 established.</li></ul>","creationDate":{"date":"2023-04-05 13:39:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.19","text":"<ul><li>Fix: SalesChannelContextService has been replaced by SalesChannelContextServiceInterface for plugin compatibility</li></ul>","creationDate":{"date":"2023-06-27 10:36:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.18","text":"<ul><li>Fix: Removed experimental code from newsletter form</li></ul>","creationDate":{"date":"2023-04-20 16:59:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.17","text":"<ul><li>Fix: CMS elements in the newsletter no longer have a white border</li><li>Fix: Newsletter produkts padding</li></ul>","creationDate":{"date":"2023-04-20 14:52:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.16","text":"<ul><li>Fix: The packaging unit is now displayed correctly in the product box</li></ul>","creationDate":{"date":"2023-01-25 09:42:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.15","text":"<ul><li>Fix: Newsletter registration at customer registration and in the checkout process work again if the customer data record contains additional fields.</li><li>Fix: Dumps in the newsletter send command have been replaced with IO errors.</li><li>Fix: Newsletter Send command now considers the dispatch date again</li></ul>","creationDate":{"date":"2023-01-11 10:36:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.14","text":"<ul><li>Fix: Newsletter registrations now also work with double opt-in for account registrations, as well as guest order registrations.</li></ul>","creationDate":{"date":"2022-12-09 16:34:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.13","text":"<ul><li>Fix|Comp: All updates from 1.5.6 were previously only compatible with Shopware Version &gt;= 6.4.17.0.</li></ul>","creationDate":{"date":"2022-12-06 11:58:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.12","text":"<ul><li>Feat: Newsletter registration is now also possible on the customer registration page.</li></ul>","creationDate":{"date":"2022-12-05 15:36:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.11","text":"<ul><li>Fix: Newsletter checkout registration now also works with different sales channel domains.</li><li>Fix: Storefront snippets added in en-GB for the newsletter checkout registration.</li></ul>","creationDate":{"date":"2022-12-02 16:21:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.10","text":"<ul><li>Fix: HTML is no longer displayed in the newsletter product description.</li><li>Fix: Minimum content in newsletter products now removes the product description size</li><li>Fix: \"Product titles have a fixed size of\" Configuration now has the default value 64</li></ul>","creationDate":{"date":"2022-11-30 12:00:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.9","text":"<ul><li>Fix: SalesChannelRepository was changed back to SalesChannelRepositoryInterface because too many plugins use this deprecated interface and otherwise there would be incompatibilities.</li></ul>","creationDate":{"date":"2022-11-28 15:44:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.8","text":"<ul><li>Fix: Newsletter cronjob command does not find any newsletter.</li></ul>","creationDate":{"date":"2022-11-25 12:02:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.7","text":"<ul><li>Fix: Prices for newsletter products are now displayed correctly if price rules are assigned.</li><li>Feat: The lowest price from the last 30 days is now displayed in newsletter product cards.</li></ul>","creationDate":{"date":"2022-11-25 10:52:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.6","text":"<ul><li>Fix: Newsletter form can no longer be used for spam (NEXT-22957)</li></ul>","creationDate":{"date":"2022-11-22 15:37:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.5","text":"<h2>Cronjob Intervall</h2><p></p><ul><li>Fix: Cronjob dispatch has been simplified. When the cronjob command is executed, a stack will be sent for each newsletter that is ready to be sent. After that, the process is terminated. It is recommended to set the cronjob interval in the hosting like the plugin setting in the newsletter economy (\"Waiting time between stacks\"). If the cronjob time is set lower, the newsletter command checks whether the last newsletter that was sent was longer than the waiting time set.<br /></li></ul>","creationDate":{"date":"2022-10-21 14:30:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<ul><li>Fix: All section settings are available again for CMS worlds<br /></li></ul>","creationDate":{"date":"2022-09-01 09:33:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<ul><li>Fix: Encoded HTML entities are rendered correctly in product description and name (raw)<br /></li></ul>","creationDate":{"date":"2022-08-30 11:33:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<ul><li>Fix: Compatibility update for SW Core and Store plugins<br /></li></ul>","creationDate":{"date":"2022-08-10 16:32:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<ul><li>Fix: Newsletter product title has been given more padding to the product image<br /></li><li>Fix: Newsletter products are displayed aligned with different image sizes<br /></li><li>Fix: Newsletter product titles and descriptions can now be configured in the plugin settings</li></ul>","creationDate":{"date":"2022-07-11 11:23:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Fix: Newsletter sender can now be derived from the system default language<br /></li></ul>","creationDate":{"date":"2022-07-06 15:56:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.12","text":"<ul><li>Fixed minimum size for product images (158px)<br /></li></ul>","creationDate":{"date":"2022-04-28 15:47:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.11","text":"<ul><li></li><li>List prices are now displayed similar to the Shopware standard</li><li>Even spacing in product boxes</li><li>Fixed bug in product selection in newsletter admin component</li></ul>","creationDate":{"date":"2022-04-27 12:28:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.10","text":"<ul><li>Adjusted image size of products<br /></li></ul>","creationDate":{"date":"2022-04-21 09:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.9","text":"<ul><li>Adaptation in the newsletter products element because there is an error that you can no longer select products<br /></li></ul>","creationDate":{"date":"2022-04-20 10:07:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.8","text":"<ul><li>For performance reasons, the number of recipients is no longer displayed in the newsletter recipient group listing.<br /></li><li>Fixed a bug that newsletters were not displayed as active in the CMS listing<br /></li></ul>","creationDate":{"date":"2022-04-07 11:17:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.7","text":"<ul><li>Bug fixed with compatibility to other CMS plugins<br /></li></ul>","creationDate":{"date":"2022-03-03 15:11:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.6","text":"<ul><li>Fixed another bug when 'building' the plugin</li></ul>","creationDate":{"date":"2022-02-21 11:12:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.5","text":"<p></p><ul><li>Bug fixed when 'building' the plugin</li></ul>","creationDate":{"date":"2022-02-18 13:39:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<ul><li>Added newsletter registration in checkout (settings &gt; newsletter)<br /></li></ul>","creationDate":{"date":"2021-11-04 12:00:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<ul><li>Extended prices for products are now also taken into account in newsletter products<br /></li></ul>","creationDate":{"date":"2021-10-06 15:11:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p></p><ul><li>Fixed error message in the newsletter cronjob validation dump</li><li>Cronjob processes no longer send the same newsletter if the cronjob has a short interval.</li></ul><p><br /></p><p></p><h2>Cronjob Interval</h2><p>Newsletters are only selected by a cron job if the current time minus the \"waiting time between the stacks\" * 10 is still greater than the time the last newsletter was sent to a recipient. This is important for newsletters that can be continued.<br /></p>","creationDate":{"date":"2021-09-30 14:17:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<ul><li>Fixed bug with newsletter CMS assignment (since 1.4.0)<br /></li></ul>","creationDate":{"date":"2021-09-29 09:27:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Received newsletters that were canceled when they were sent can now be continued<br /></li><li>Newsletter CMS sidebar features are now also available in the \"normal\" view (not just form)<br /></li></ul>","creationDate":{"date":"2021-09-24 16:10:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p></p><ul><li>Fixed an error in block settings (CMS)</li></ul>","creationDate":{"date":"2021-08-26 11:25:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p></p><ul><li>Error when sending newsletters via cronjobs</li></ul>","creationDate":{"date":"2021-08-12 10:29:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p></p><ul><li>Preparations for Shopware 6.4.0.0</li><li>Use UserConfig instead of cookies</li></ul>","creationDate":{"date":"2021-05-25 09:09:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>Fixed a bug in the CMS section and block settings<br /></li></ul>","creationDate":{"date":"2021-04-09 15:00:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p></p><ul><li>Added Access Control List feature</li></ul>","creationDate":{"date":"2021-04-07 15:30:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>Added uninstall process</li></ul>","creationDate":{"date":"2021-03-24 10:47:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<ul><li>Error when ordering with vouchers</li></ul>","creationDate":{"date":"2020-12-14 11:26:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>Small fixes            .</li></ul>","creationDate":{"date":"2020-10-08 15:26:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Support of Shopware 6.3.1.0</li></ul>","creationDate":{"date":"2020-09-08 16:08:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Sending via a different SMTP server added</li></ul>","creationDate":{"date":"2020-09-07 14:41:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<ul><li>Added support for Shopware 6.3</li><li>Optimized newsletter recipient association</li></ul>","creationDate":{"date":"2020-08-12 12:09:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>Added google campaign link</li></ul>","creationDate":{"date":"2020-07-24 13:47:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p></p><ul><li>First release in store</li></ul>","creationDate":{"date":"2020-07-21 16:13:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Spno437223894231","redirectToStore":false,"lowestPriceValue":29.97}