{"id":12012,"name":"InvHomepageSlideshowPro","code":"Inv7339059404789","lastChange":{"date":"2023-07-18 11:16:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbwwj8f","examplePageUrl":"","moduleKey":"InvHomepageSlideshowPro","creationDate":{"date":"2020-07-09 12:15:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-07-10 13:09:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-22 17:21:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2834,"prefix":"Inv","name":"inventivo.de","website":"//www.inventivo.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2834_inventivo-logo-shopware.png"},"infos":[{"id":19029,"name":"Homepage Slideshow PRO für Shopware 6","description":"<p>Dieses Plugin ermöglichst es Dir, auf Deiner Shop Homepage direkt unter dem Hauptmenü eine Slideshow anzuzeigen. Die Slideshow verfügt über bis zu 4 Slides. Der Clou: Jeder Slide kann mit jeweils einem Bild für die Desktop und die Mobile Ansicht Deines Shops und mit einem Text bestückt werden. Im Text kannst Du HTML, etwa für Buttons, und Links, verwenden. So kannst Du Deinen potenziellen Kunden Deine Shop Aktionen, einzelne Produkte, Kategorien oder sonstige Informationen gekonnt und ansprechend präsentieren.&nbsp;</p><h2>Komplett überarbeitet: Flexibles und zeitgemäßes Responsive Design – einfach effektiv und ohne viel Schnick-Schnack!</h2><p>Das Plugin wurde mit der Version 1.1.0 komplett überarbeitet und an die Bedürfnisse der Merchants angepasst. Ziel war es, eine im Tagesgeschäft möglichst einfach zu bedienende und flexible Slideshow-Lösung für Dich zu schaffen. <b>Probier es aus und lass mich gerne wissen, wie Dir das Plugin gefällt und ob Du eventuell besondere Wünsche oder Verbesserungsvorschläge hast!<br></b></p><h2>Potenzielle Kunden überzeugen, einfach zu bedienen im Tagesgeschäft</h2><p>Überzeuge mit diesem Slideshow Plugin potenzielle Kunden zügig von Deinem Angebot und sende sie gezielt in die wichtigsten Bereiche Deines Shops. Somit stellt die Homepage Slideshow PRO eine gute Möglichkeit dar, das Einkaufserlebnis Deiner Kunden positiv zu beeinflussen.&nbsp;<br>Du hast ein bewegtes Tagesgeschäft? Kein Problem: Konfiguriere die Slideshow aufgrund ihrer Einfachheit schnell und zielsicher für die Darstellung Deiner wechselnden Shop-Aktionen und Info-Themen.</p><h2>Darstellung der Slideshow auf der Homepage Deines Shops</h2><p>Die Darstellung erfolgt auf der Startseite Seite Deines Shops unter dem Hauptmenü.&nbsp;</p><h2>Zwei Bilder (Desktop und Mobile) und ein Text pro Slide für mehr Flexibilität</h2><p>Du kannst pro Slide zwei Bilder (je eines für die Desktop und die Mobile Variante Deines Shops) und einen Text verwenden. Wahlweise kannst Du aber auch nur ein Dektop-Bild hinterlegen und dieses auch in der mobilen Version Deines Shops anzeigen.<br>Die Darstellung des Textes jedes Slides kannst Du über die dafür vorgesehene Textarea mit HTML verfeinern. Für die beiden Hintergrundbilder verwendest Du idealerweise .jpg-Dateien. Die Höhe der Slideshow wird über die Plugin-Konfiguration für eine optimale Darstellung fest angegeben. Ideal sind hier 500px Höhe. Auch hier gibt es zwei getrennte Felder für Desktop und für Mobile.<br></p><h2>Volle Bildschirmbreite, aber maximale Breite für große Bildschirme definierbar</h2><p>Die Slideshow läuft über die volle Bildschirmbreite. Du kannst für große Bildschirme eine maximale Breite konfigurieren, ab der die Slideshow nicht mehr breiter wird. So werden die Bilder immer in einer schönen Größe dargestellt.<br></p><h2>Höhe getrennt für Desktop- und Mobile-Ansicht einstellen</h2><p>Auch kannst Du eine Höhe jeweils für die Desktop und die Mobile Ansicht Deines Shops festlegen. Die Slideshow passt sich so den individuellen Bedürfnissen Deines Shops an.<br></p><h2>Autoplay und Slidespeed</h2><p>Konfiguriere, ob Deine Slideshow automatisch abspielen soll oder per Klick durch den potenziellen Käufer. Dabei kannst Du auch die Anzeigedauer der einzelnen Slides einstellen.</p><h2>Maximale Kompatibilität durch Minimalismus</h2><p></p><p>Das Homepage Slideshow PRO Plugin integriert sich nahtlos in das Standard-Theme von Shopware 6 und viele andere.&nbsp;</p><p>Du kannst das Plugin pro Verkaufskanal unabhängig konfigurieren.</p><h2>Kompatibel für die Verwendung in mehreren Verkaufskanälen</h2><p>Das Plugin kann für verschiedene Verlaufskanäle individuell konfiguriert werden und ermöglich Dir somit eine maximale Flexibilität.</p><h2>Gut erreichbarer, freundlicher und schneller Support</h2><p></p><p>Du hast im Fall der Fälle per Support Ticket den direkten Draht zu mir als Entwickler.&nbsp;</p><h2>Wichtig: Wenn Du die Konfiguration der Slideshow änderst, musst Du einmal Dein Theme speichern, damit dieses kompiliert wird. Dies ist derzeit die einzige Möglichkeit in Shopware, ist aber schnell gemacht.&nbsp;</h2><h2>Alternativ kannst Du Dein Theme natürlich auch per SSH-Terminal mit bin/console theme:compile kompilieren.</h2>","installationManual":"<p>Das Plugin wird, wie gewohnt, über den Plugin-Manager installiert und aktiviert.</p><p>1. Lade das Plugin herunter</p><p>2. Installiere das Plugin über Einstellungen -&gt; System -&gt; Plugins -&gt; Drei Punkte + Installieren</p><p>3. Aktiviere das Plugin an gleicher Stelle per Klick auf den Button in der Spalte \"Aktiv\".</p><p>4. Konfiguriere das Plugin über Einstellungen -&gt; System -&gt; Plugins -&gt; Drei Punkte + Konfiguration</p><p>5. Die Änderungen speichern und das Theme kompilieren (gehe dazu zu Deinem Theme unter Inhalte -&gt; Themes und speichere es)</p><p>6. Wenn nötig, leere den Shopware Cache (Einstellungen -&gt; System -&gt; Caches &amp; Indexe) und den Browser-Cache</p><p>Geschafft! Das Plugin wurde erfolgreich installiert, aktiviert und konfiguriert.</p>","shortDescription":"Aktionen in einer Slideshow auf der Homepage Deines Shops darstellen. Verwende bis zu 4 Slides mit Text und getrennten Bildern für Desktop & Mobile. Jetzt Einkaufserlebnis verbessern!","highlights":"Bis zu 4 Slides mit Bild und Text (HTML möglich)\nGetrennte Bilder für die Desktop- und Mobile-Ansicht Deines Shops\nMaximale Breite und Höhe definierbar. Die Höhe getrennt konfigurierbar für die Desktop- und Mobile-Ansicht Deines Shops\nMehrsprachig: Plugin übersetzt auf Deutsch, Englisch, Spanisch, Französisch und Niederländisch\nKompatibel für die Verwendung in mehreren Verkaufskanälen","features":"Plugin wahlweise aktivieren und deaktivieren\nEinfache Konfiguration pro Verlaufskanal\nBis zu 4 Slides mit Bild und Text (HTML möglich)\nFully Responsive - Eigenes Bild für mobile Ansicht\nMaximale Breite und Höhe definierbar. Die Höhe getrennt konfigurierbar für die Desktop- und Mobile-Ansicht Deines Shops\nEigenes HTML für den Text verwenden\nMehrsprachig: Plugin übersetzt auf Deutsch, Englisch, Spanisch, Französisch und Niederländisch\nKompatibel für die Verwendung in mehreren Verkaufskanälen\nEinfach und effektiv für eine flexible Nutzung im Tagesgeschäft"},{"id":19030,"name":"Homepage Slideshow PRO for Shopware 6","description":"<h2></h2><p>This plugin allows you to display a slideshow on your store homepage directly under the main menu. The slideshow has up to 4 slides. The highlight: Each slide can be equipped with an image for the desktop and the mobile view of your store and with a text. In the text you can use HTML, for example for buttons, and links. This way you can present your store promotions, individual products, categories or other information to your potential customers in a skillful and appealing way. </p><h2>Completely revised: Flexible and contemporary Responsive Design - simply effective and without a lot of bells and whistles!</h2><h2></h2><p>The plugin was completely revised with version 1.1.0 and adapted to the needs of merchants. The goal was to create an easy to use and flexible slideshow solution for you.<b> Try it out and let me know how you like the plugin and if you have any special wishes or suggestions for improvement!</b><br /></p><h2>Convince potential customers, easy to use in day-to-day business</h2><h2></h2><p>Use this slideshow plugin to quickly convince potential customers of your offer and send them to the most important areas of your store. Thus, the Homepage Slideshow PRO is a good way to positively influence the shopping experience of your customers. </p><p>You have a busy daily business? No problem: Due to its simplicity, configure the slideshow quickly and unerringly for the presentation of your changing store promotions and info topics.</p><h2>Display of the slideshow on the homepage of your store</h2><h2></h2><p>It is displayed on the home page of your store under the main menu. </p><h2>Two images (desktop and mobile) and one text per slide for more flexibility</h2><h2></h2><p>You can use two images per slide (one for the desktop and one for the mobile version of your store) and one text. Alternatively, you can also store only one desktop image and display it in the mobile version of your store.</p><p>You can refine the display of the text of each slide with HTML using the text area provided for this purpose. For the two background images you ideally use .jpg files. The height of the slideshow is fixed via the plugin configuration for an optimal display. Ideal here are 500px height. Again, there are two separate fields for desktop and mobile.</p><h2>Full screen width, but maximum width definable for large screens</h2><h2></h2><p>The slideshow runs over the full screen width. You can configure a maximum width for large screens, above which the slideshow will not get wider. This way the images are always displayed in a nice size.<br /></p><h2>Set height separately for desktop and mobile view</h2><h2></h2><p>You can also set a height for the desktop and the mobile view of your store. The slideshow adapts to the individual needs of your store.<br /></p><h2>Autoplay and Slidespeed</h2><h2></h2><p>Configure whether your slideshow should play automatically or via click by the potential buyer. You can also set the display duration of the individual slides.</p><h2>Maximum compatibility through minimalism</h2><h2></h2><p></p><p>Homepage Slideshow PRO plugin integrates seamlessly with Shopware 6 default theme and many others. </p><p>You can configure the plugin independently per sales channel.</p><h2>Compatible for use in multiple sales channels</h2><h2></h2><p>The plugin can be configured individually for different history channels, giving you maximum flexibility.</p><h2>Easily accessible, friendly and fast support</h2><h2></h2><p></p><p>You have a direct line to me as a developer via support ticket in case of emergency. </p><h2>Important: If you change the configuration of the slideshow, you have to save your theme once, so that it is compiled. This is currently the only possibility in Shopware, but it is done quickly. </h2><h2>Alternatively you can compile your theme via SSH terminal with bin/console theme:compile.</h2>","installationManual":"<p>The plugin is installed and activated as usual via the plugin manager.</p><p>1. download the plugin</p><p>2. install the plugin via Settings -&gt; System -&gt; Plugins -&gt; Three points + Install</p><p>3. activate the plugin at the same place by clicking on the button in the \"Active\" column</p><p>4. configure the plugin via Settings -&gt; System -&gt; Plugins -&gt; Three dots + configuration</p><p>5. save the changes and compile the theme (go to your theme under Contents -&gt; Themes and save it)</p><p>6. if necessary, empty the Shopware cache (Settings -&gt; System -&gt; Caches &amp; Indexes) and the browser cache</p><p>We did it! The plugin was successfully installed, activated and configured.</p>","shortDescription":"Display actions in a slideshow on your store's homepage. Use up to 4 slides with text and separate images for desktop & mobile. Improve your shopping experience now!","highlights":"Up to 4 slides with image and text (HTML possible)\nSeparate images for desktop and mobile view of your store.\nMaximum width and height definable. The height can be configured separately for the desktop and mobile view of your store.\nMultilingual: plugin translates to English, German, Spanish, French and Dutch\nCompatible for use in multiple sales channels","features":"Optionally activate and deactivate plugin\nSimple configuration per history channel\nUp to 4 slides with image and text (HTML possible)\nFully Responsive - own image for mobile view\nMaximum width and height definable. Height separately configurable for desktop and mobile view of your store\nUse your own HTML for the text\nMultilingual: plugin translates to English, German, Spanish, French and Dutch\nCompatible for use in multiple sales channels\nSimple and effective for flexible day-to-day use"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160552,"bookingKey":"Inv7339059404789","bookingText":"Homepage Slideshow PRO for Shopware 6","price":129,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160551,"bookingKey":"Inv7339059404789_M","bookingText":"Homepage Slideshow PRO for Shopware 6","price":16.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":167843,"bookingKey":"Inv7339059404789_M12","bookingText":"Homepage Slideshow PRO for Shopware 6","price":159.99,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZAsTpc","preview":true,"priority":0,"id":77471},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7haiKS","preview":false,"priority":4,"id":77472},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpw4AD3u","preview":false,"priority":3,"id":77473},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDjNWde","preview":false,"priority":2,"id":77474},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2NQSjt","preview":false,"priority":1,"id":77477}],"comments":[{"authorName":"Burney van Leenen","text":"We were looking for a homepage slider with a desktop and mobile version.  The installation and configuration was easy. The mobile version of the slider was n't working in the beginning, but was solved really quickly. Great support!  Also the fact that you can use HTML in the description is very useful for us.","headline":"Great slider","creationDate":{"date":"2022-03-10 12:01:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Martina Brede","text":"","headline":"Eine responsive Slideshow, die auch in der mobilen Ansicht individuell angepasst werden kann. Einfach anwendbar &amp; zuverlässiger Support.","creationDate":{"date":"2022-02-23 14:38:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Tobias Degen","text":"","headline":"Installiert und macht, was es soll. Super Support!","creationDate":{"date":"2021-12-10 13:10:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Homepage Slideshow PRO für Shopware 6","description":"<p>Dieses Plugin ermöglichst es Dir, auf Deiner Shop Homepage direkt unter dem Hauptmenü eine Slideshow anzuzeigen. Die Slideshow verfügt über bis zu 4 Slides. Der Clou: Jeder Slide kann mit jeweils einem Bild für die Desktop und die Mobile Ansicht Deines Shops und mit einem Text bestückt werden. Im Text kannst Du HTML, etwa für Buttons, und Links, verwenden. So kannst Du Deinen potenziellen Kunden Deine Shop Aktionen, einzelne Produkte, Kategorien oder sonstige Informationen gekonnt und ansprechend präsentieren. </p><h2>Komplett überarbeitet: Flexibles und zeitgemäßes Responsive Design – einfach effektiv und ohne viel Schnick-Schnack!</h2><p>Das Plugin wurde mit der Version 1.1.0 komplett überarbeitet und an die Bedürfnisse der Merchants angepasst. Ziel war es, eine im Tagesgeschäft möglichst einfach zu bedienende und flexible Slideshow-Lösung für Dich zu schaffen. <b>Probier es aus und lass mich gerne wissen, wie Dir das Plugin gefällt und ob Du eventuell besondere Wünsche oder Verbesserungsvorschläge hast!<br /></b></p><h2>Potenzielle Kunden überzeugen, einfach zu bedienen im Tagesgeschäft</h2><p>Überzeuge mit diesem Slideshow Plugin potenzielle Kunden zügig von Deinem Angebot und sende sie gezielt in die wichtigsten Bereiche Deines Shops. Somit stellt die Homepage Slideshow PRO eine gute Möglichkeit dar, das Einkaufserlebnis Deiner Kunden positiv zu beeinflussen. <br />Du hast ein bewegtes Tagesgeschäft? Kein Problem: Konfiguriere die Slideshow aufgrund ihrer Einfachheit schnell und zielsicher für die Darstellung Deiner wechselnden Shop-Aktionen und Info-Themen.</p><h2>Darstellung der Slideshow auf der Homepage Deines Shops</h2><p>Die Darstellung erfolgt auf der Startseite Seite Deines Shops unter dem Hauptmenü. </p><h2>Zwei Bilder (Desktop und Mobile) und ein Text pro Slide für mehr Flexibilität</h2><p>Du kannst pro Slide zwei Bilder (je eines für die Desktop und die Mobile Variante Deines Shops) und einen Text verwenden. Wahlweise kannst Du aber auch nur ein Dektop-Bild hinterlegen und dieses auch in der mobilen Version Deines Shops anzeigen.<br />Die Darstellung des Textes jedes Slides kannst Du über die dafür vorgesehene Textarea mit HTML verfeinern. Für die beiden Hintergrundbilder verwendest Du idealerweise .jpg-Dateien. Die Höhe der Slideshow wird über die Plugin-Konfiguration für eine optimale Darstellung fest angegeben. Ideal sind hier 500px Höhe. Auch hier gibt es zwei getrennte Felder für Desktop und für Mobile.<br /></p><h2>Volle Bildschirmbreite, aber maximale Breite für große Bildschirme definierbar</h2><p>Die Slideshow läuft über die volle Bildschirmbreite. Du kannst für große Bildschirme eine maximale Breite konfigurieren, ab der die Slideshow nicht mehr breiter wird. So werden die Bilder immer in einer schönen Größe dargestellt.<br /></p><h2>Höhe getrennt für Desktop- und Mobile-Ansicht einstellen</h2><p>Auch kannst Du eine Höhe jeweils für die Desktop und die Mobile Ansicht Deines Shops festlegen. Die Slideshow passt sich so den individuellen Bedürfnissen Deines Shops an.<br /></p><h2>Autoplay und Slidespeed</h2><p>Konfiguriere, ob Deine Slideshow automatisch abspielen soll oder per Klick durch den potenziellen Käufer. Dabei kannst Du auch die Anzeigedauer der einzelnen Slides einstellen.</p><h2>Maximale Kompatibilität durch Minimalismus</h2><p></p><p>Das Homepage Slideshow PRO Plugin integriert sich nahtlos in das Standard-Theme von Shopware 6 und viele andere. </p><p>Du kannst das Plugin pro Verkaufskanal unabhängig konfigurieren.</p><h2>Kompatibel für die Verwendung in mehreren Verkaufskanälen</h2><p>Das Plugin kann für verschiedene Verlaufskanäle individuell konfiguriert werden und ermöglich Dir somit eine maximale Flexibilität.</p><h2>Gut erreichbarer, freundlicher und schneller Support</h2><p></p><p>Du hast im Fall der Fälle per Support Ticket den direkten Draht zu mir als Entwickler. </p><h2>Wichtig: Wenn Du die Konfiguration der Slideshow änderst, musst Du einmal Dein Theme speichern, damit dieses kompiliert wird. Dies ist derzeit die einzige Möglichkeit in Shopware, ist aber schnell gemacht. </h2><h2>Alternativ kannst Du Dein Theme natürlich auch per SSH-Terminal mit bin/console theme:compile kompilieren.</h2>","installationManual":"<p>Das Plugin wird, wie gewohnt, über den Plugin-Manager installiert und aktiviert.</p><p>1. Lade das Plugin herunter</p><p>2. Installiere das Plugin über Einstellungen -&gt; System -&gt; Plugins -&gt; Drei Punkte + Installieren</p><p>3. Aktiviere das Plugin an gleicher Stelle per Klick auf den Button in der Spalte \"Aktiv\".</p><p>4. Konfiguriere das Plugin über Einstellungen -&gt; System -&gt; Plugins -&gt; Drei Punkte + Konfiguration</p><p>5. Die Änderungen speichern und das Theme kompilieren (gehe dazu zu Deinem Theme unter Inhalte -&gt; Themes und speichere es)</p><p>6. Wenn nötig, leere den Shopware Cache (Einstellungen -&gt; System -&gt; Caches &amp; Indexe) und den Browser-Cache</p><p>Geschafft! Das Plugin wurde erfolgreich installiert, aktiviert und konfiguriert.</p>","version":"1.1.6","changelog":[{"version":"1.1.6","text":"- Establish compatibility with Shopware 6.5","creationDate":{"date":"2023-05-22 17:20:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"- Bugfix for 4th slide mobile image display","creationDate":{"date":"2023-02-16 16:13:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"- Add ThemeCompilerEnrichScssVariablesEvent as formerly used event is deprecated<br />","creationDate":{"date":"2022-07-08 07:41:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"- Add seperate mobile height definition variable","creationDate":{"date":"2022-03-16 10:37:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"- Add seperate mobile height definition","creationDate":{"date":"2022-03-10 10:23:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"- Only load script when container is present","creationDate":{"date":"2022-02-23 16:03:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- Reloaded: Completely new design and possibilities","creationDate":{"date":"2021-12-10 17:17:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"- Check if secondary image is defined","creationDate":{"date":"2021-09-01 17:50:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"- Bugfix template variables","creationDate":{"date":"2021-08-03 12:05:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"Compatibility update for Shopware 6.4.0.0","creationDate":{"date":"2021-05-10 15:21:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- Enhance optional background image for mobile view</p>","creationDate":{"date":"2020-08-14 14:58:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- Add optional background image for mobile view</p>","creationDate":{"date":"2020-08-12 21:14:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- Enhance configuration per sales channel </p>","creationDate":{"date":"2020-07-30 15:51:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- Bugfix Konfiguration pro Verkaufskanal</p>","creationDate":{"date":"2020-07-20 11:02:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p>- Added configurable autoplay function and moved script to inline","creationDate":{"date":"2020-07-13 14:45:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Added configuration for background colors for left and right column of each slide</p>","creationDate":{"date":"2020-07-10 13:25:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>-Initial version of the plugin - hurray!</p>","creationDate":{"date":"2020-07-09 13:16:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Inv7339059404789","redirectToStore":true,"lowestPriceValue":16.9}