{"id":12179,"name":"CogiLicenseManager","code":"cogi418937392086","lastChange":{"date":"2023-07-18 11:16:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphfV1Bs","examplePageUrl":"","moduleKey":"CogiLicenseManager","creationDate":{"date":"2020-08-14 18:37:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-09-02 15:22:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-06 11:49:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2698,"prefix":"cogi","name":"codegiganten GmbH","website":"//www.codegiganten.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2698_logo-cg.png"},"infos":[{"id":19333,"name":"Lizenzverwaltung für digitale Produkte","description":"<p>Das Shopware 6 Plugin \"Lizenzmanager\" ist ein umfangreiches Tool zur Verwaltung und zum Verkauf von Lizenzen jeglicher Art, wie zum Beispiel Softwarelizenzen oder Keys. Das Plugin kann auch einfach für andere Situationen verwendet werden, wie zum Beispiel Eintrittskarten für Veranstaltungen und vieles mehr. Mit seinen vielfältigen Funktionen und Features bietet das Plugin eine umfassende Lösung für alle Lizenzierungsanforderungen.</p><p>Der Lizenzmanager ermöglicht die einfache Erstellung von Pools für Lizenzen mit umfangreichen Einstellungsmöglichkeiten. Jeder Pool kann individuell konfiguriert werden, einschließlich Links, Mail-Texte, Anzeigen und anderen Optionen. Zudem können Pools bestimmten Kategorien zugeordnet werden, um eine bessere Organisation und Navigation zu ermöglichen.</p><p>Der Bestand der verfügbaren Lizenzen wird automatisch angepasst, sobald eine Lizenz verkauft wird. Dadurch wird sichergestellt, dass es zu keinen doppelten Verkäufen kommt und der Bestand immer aktuell ist. Kunden erhalten ihre Lizenz direkt nach dem Kauf automatisch per E-Mail, ohne manuellen Eingriff.</p><p>Der Lizenzmanager ermöglicht auch den Import und Export von Lizenzen. Sie können Lizenzen bequem über eine CSV-Datei importieren und exportieren, um die Verwaltung großer Mengen von Lizenzen zu erleichtern. Des Weiteren wird das Plugin in einem nächsten Update die Verwendung mehrerer Verkaufskanäle unterstützen, sodass Sie Ihre Lizenzen über verschiedene Plattformen oder Websites verkaufen können.</p><p>Die Zustellung der Lizenzen erfolgt direkt nach einer Bestellung ohne manuelle Bearbeitung. Sie können jedoch einstellen, dass die Zustellung erst nach Erreichen eines bestimmten Bezahlstatus der Bestellung erfolgt, um sicherzustellen, dass Kunden ihre Lizenz erst nach erfolgreicher Bezahlung erhalten.</p><p>Das Plugin bietet anpassbare E-Mail-Templates für die Zustellung der Lizenzen. Sie können den Inhalt und das Design der E-Mails nach Ihren eigenen Vorstellungen gestalten.</p><p>Der Lizenzmanager ist eine vollständige Lösung für den Verkauf von Lizenzen in Ihrem Shopware 6 Onlineshop. Egal ob Softwarelizenzen, Keys, Eintrittskarten oder andere Arten von Lizenzen, mit dem Lizenzmanager haben Sie ein leistungsstarkes Werkzeug zur Hand, um Ihre Lizenzverkäufe effizient und professionell zu verwalten.</p><p>________________________________________________________________________________________________________________________________________________________________</p><p><b>Über uns</b></p><p>Wir sind die code<b>giganten</b>&nbsp;aus Paderborn, Ihr erfahrener Partner für Shopware 6 Projekte. Jahrelange Erfahrung in individuellen PHP-Projekten mit aktuellen Frameworks bilden das Fundament für einen effizienten und professionellen Umgang mit sämtlichen Technologien im Shopware Universum. Unsere Apps und Themes entwickeln wir fortlaufend weiter und bieten kompetenten, individuellen Support sowie maßgeschneiderte Lösungen, um Ihren Shop noch besser zu machen.</p><p>Mit der code<b>giganten</b>&nbsp;GmbH haben Sie nicht nur einen absolut technisch versierten Partner an Ihrer Seite, sondern profitieren zudem von einem immensen Erfahrungsschatz aus zahlreichen eCommerce-Projekten im B2C- und B2B-Bereich.</p><p></p><p>code<b>giganten</b>&nbsp;GmbH - Ihr Partner für Shopware 6</p><p>Friedrichstraße 15 | 33102 Paderborn</p><p>Geschäftsführer: Oliver Krimmer</p><p><a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">codegiganten.de</a><br></p><p>Benötigen Sie eigene Apps oder Themes, welche es noch nicht im Store gibt? Kein Problem! Melden Sie sich jederzeit bei uns unter&nbsp;<a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">info@codegiganten.de</a></p><p></p><p>*******&nbsp;<a href=\"https://codegiganten.de/newsletter/\" target=\"_blank\" rel=\"noreferrer noopener\">Jetzt kostenfrei unseren informativen&nbsp;<b>Newsletter</b>&nbsp;zu Shopware 6 und Apps abonnieren!</a>&nbsp;*******</p><p></p><p>________________________________________________________________________________________________________________________________________________________________</p>","installationManual":"<p>Sie haben sich für unsere App entschieden? Vielen Dank! Jetzt folgt nur noch die einfache Installation.</p><p>Tipp: Haben Sie eine App oder ein Theme erworben und Ihr Shop ist mit Ihrem Account verbunden, taucht die jeweilige Erweiterung automatisch in Ihrem Shop in der App-/Themes-Liste auf und muss nur noch installiert werden. So überspringen Sie den unten aufgeführten Schritt zum Hochladen der Erweiterung.</p><p><br></p><p></p><ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Loggen Sie sich in Ihren Shopware 6 Administrationsbereich ein und navigieren zu&nbsp;<b><i>Erweiterungen &gt; Meine Erweiterungen &gt; Apps</i></b></li><li>Klicken Sie auf den \"<b><i>Erweiterung hochladen</i></b>\"-Button und wählen die heruntergeladene Erweiterung aus</li><li>Nutzen Sie das Menü neben der Erweiterung, um sie zu installieren und den Schalter, um sie zu aktivieren&nbsp;</li><li>Bearbeiten Sie in der Konfiguration der Erweiterung&nbsp;Ihre gewünschten Einstellungen</li><li>Erstellen Sie Ihre erste Kategorie unter&nbsp;<i><b>Kataloge &gt; Lizenz &gt; Kategorie&nbsp;</b></i></li><li>Erstellen Sie Ihren ersten Pool und weisen&nbsp;Sie ihn einer Kategorie zu&nbsp;unter&nbsp;<i><b>Kataloge&nbsp;&gt; Lizenz &gt; Pool &gt; Kategorie</b></i></li><li>Weisen Sie Produkte einem gewünschten Lizenz-Pool zu unter <b>Produkte &gt; Produkte hinzufügen</b>&nbsp;</li><li>Die App ist jetzt aktiv und die Funktionen nutzbar!</li></ol><p></p><p><br></p><p><b>Sollten Sie Hilfe benötigen, stehen wir Ihnen jederzeit unter info@codegiganten.de und https://codegiganten.de/kontakt/ zur Verfügung.</b></p>","shortDescription":"Diese Erweiterung ermöglicht den Verkauf von digitalen Lizenzen. Pro Lizenzprodukt steht ein Pool an Lizenzen zur Verfügung. Diverse Einstellungen können pro Pool erstellt werden.","highlights":"Erstellung von Pools für Keys mit umfangreichen Einstellungsmöglichkeiten (Links, Mail-Texte, Anzeigen etc.)\nAutomatische Anpassung des Bestandes\nDirekte Lieferung der Lizenz per E-Mail ohne manuellen Eingriff\nImport und Export der Lizenzen\nMulti-Verkaufskanal Support","features":"Pool kann einer Kategorie zugeteilt werden\nIndividuelle Einstellungen pro Pool\nDer verfügbare Bestand eines verbundenen Produktes wird automatisch an den Pool angepasst\nDirekte Zustellung nach Bestellung ohne manuelle Bearbeitung\nZustellung nach zuvor eingestelltem Bezahlstatus einer Bestellung\nAnpassbare E-Mail-Templates\nAnzeige, dass es sich um ein digitales Produkt handelt\nImport von Lizenzen aus einer CSV-Datei\nExport der Lizenzen mit Informationen über Verkauf- und Versandstatus dieser\nMail an Shopbetreiber, wenn eine Lizenz gekauft wurde\nPool spezifischer Text für die E-Mail\nMehrfach Keys\nMulti-Verkaufskanal Support"},{"id":19334,"name":"Licence Management for Digital Products","description":"<p>This extension allows you to sell digital licences. For each product, which represents a licence, a pool is created in the administration section. To simplify the overview a pool is assigned to the product and a category. These pools contain licence keys, which are automatically sent to the customer when an order is placed. You can choose individual settings for each pool, e.g. visibility, whether it is a digital product, automatic inventory adjustment, direct delivery after ordering without manual processing and much more. The licences are sent via e-mail after the previously set order and payment status criteria are met.&nbsp;</p><p>You no longer need to worry about manual processing of licence orders, just make sure that your pools are filled with licences.</p><p><b>You can request the corresponding version with a purchase confirmation via E-Mail. You will receive the corresponding app version with installation instructions by E-Mail.</b><br></p><p><b>Individual support and regular updates</b></p><p><b></b></p><p>If you would like special adaptations for the use of our extension in your store, please feel free to contact us. We are continuously improving the app. The satisfaction of our customers and top-quality support are our number one priority. Contact us directly through the Shopware Plugin Support, we will do everything we can to help you competently and quickly.</p><p>________________________________________________________________________________________________________________________________________________________________<br></p><p></p><p><b>About us</b></p><p><b></b></p><p>We are the code<b>giganten</b>&nbsp;(code giants) from Paderborn, your experienced partner for any Shopware 6 project. We offer years of experience in individual PHP projects with current frameworks form the foundation for an efficient and professional handling of all technologies in the Shopware universe. We continuously update and improve our apps and themes and offer competent, individual support as well as customised solutions to make your store even better.</p><p></p><p>With code<b>giganten</b>&nbsp;GmbH, you will not only have an absolutely technically skilled partner at your side, but also benefit from an immense wealth of experience from numerous eCommerce projects in the B2C and B2B markets.</p><p></p><p>codeg<b>iganten</b>&nbsp;GmbH – Your Shopware 6 Partner</p><p></p><p>Friedrichstraße 15 | 33102 Paderborn | Germany</p><p></p><p>Managing Director: Oliver Krimmer</p><p></p><p><a href=\"https://codegiganten.de/\">codegiganten.de</a></p><p></p><p>Do you need a special app or theme, which is not yet available in the store? No problem! Please contact us at any time via E-Mail to&nbsp;<a href=\"https://codegiganten.de/kontakt/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">info@codegiganten.de</a></p><p></p><p><b></b><b></b></p><p>________________________________________________________________________________________________________________________________________________________________</p>","installationManual":"<p>You've decided to go with our app? Thank you! Now all that is left to do is the installation.</p><p><br></p><p>Tip: If you have purchased an app or theme and your shop is connected to your account, the extension will automatically appear in your shop in the app/theme list. All you have to do is install them. This way you skip the step below to upload the extension.<br></p><p><br></p><p></p><ol><li>Download the app from the store</li><li>Log into your Shopware 6 administration section and navigate to<b><i>&nbsp;Settings &gt; System &gt; Apps</i></b></li><li>Click on the \"<b><i>Upload App</i></b>\" button and select the downloaded extension</li><li>Use the menu next to the extension to install it and the switch to activate it&nbsp;</li><li>The app is now active and you can use all the features!</li></ol><p><br></p><p><b>If you need any help, we are always available at info@codegiganten.de and https://codegiganten.de/kontakt/.</b></p>","shortDescription":"This extension enables the sale of digiatle licences. A pool of licences is available for each licensed product. You can define various settings for each pool.","highlights":"A licence pool per product\nExtensive settings for each pool\nAutomatic adjustment of the stock\nDirect delivery of the licence by e-mail without manual intervention\nImport of licences from a CSV file","features":"Pools can be assigned to a category\nIndividual settings per pool\nThe available stock of a linked product is automatically adjusted to the pool\nDirect delivery after ordering without manual processing\nDelivery according to previously set order and payment status of an order\nCustomisable e-mail templates\nIndication that the product is digital\nImport of licences from a CSV file"}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160867,"bookingKey":"cogi418937392086","bookingText":"License management for digital products","price":349,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160866,"bookingKey":"cogi418937392086_M","bookingText":"License management for digital products","price":49.95,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168903,"bookingKey":"cogi418937392086_M12","bookingText":"Licence Management for Digital Products","price":499.95,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpw5DHUr","preview":true,"priority":10,"id":116222},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRvOWjj","preview":false,"priority":9,"id":116226},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnmiyIn","preview":false,"priority":8,"id":116229},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpK9fIQu","preview":false,"priority":7,"id":116227},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT6h1gQ","preview":false,"priority":6,"id":116223},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcGJnNp","preview":false,"priority":4,"id":116220},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT0EmYh","preview":false,"priority":3,"id":116221},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnsnXKI","preview":false,"priority":2,"id":116225},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIm0qO6","preview":false,"priority":1,"id":116228},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphgrS9l","preview":false,"priority":0,"id":116224}],"comments":[{"authorName":"wazzl GmbH","text":"Sowohl die Einrichtung als auch der Funktionsumfang sind super. und ermöglichen eine nachhaltige Anwendung.","headline":"Problemlose Einrichtung, klasse Funktionsumfang","creationDate":{"date":"2023-04-19 11:10:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Joachim Eicher","text":"Wir setzen das Plugin für Sofortdownloads ein von Programmen, mit Lizenzschlüsseln. Das Plugin überzeugt durchweg mit durchdachter und gelungener Umsetzung. Gut zu wissen: Die Snippets (\"Beschriftungen im Frontend\") sind nicht auf deutsch sondern nur auf englisch vorbelegt, nach der Installation erscheinen also erst mal die entsprechenden Platzhalter auf Schaltflächen usw. (das ist kein Fehler sondern gehört so), die dann über die Textbausteinverwaltung im Backend super einfach auf die entsprechende Nutzung des Plugins hin angepasst werden können, so dass dann die Beschriftgungen auf Schaltflächen, im Kundenkonto usw. stehen, die passend sind. Auch gibt es ein E-Mail Template für die automatische Auslieferung z.B. nach Zahlung (bei PayPal und Co -&gt; Sofort), wann was genau sein soll kann man alles im Plugin einstellen. Also:  Anwendungsmöglichkeiten gibt es viele. Und vor allem: Der Support ist ein echter Support. Das muss hier GANZ deutlich gsagt werden, denn Pfeifen gibt es hier bei den Plugin Anbietern schon so einige, wie wir mit der Zeit leider erfahren mussten - hier aber nicht! Herzlichen Dank auch an dieser Stelle nochmal für die rasche und geduldige Hilfe bei der Klärung von Fragen,  und die super rasche Bereitsstellung einen Updates. Hier wird Support noch gelebt. Wir können das Plugin und die Codegiganten nur empfehlen! Alles Tiptop!","headline":"Super Plugin, viele Möglichkeiten, und super Support!","creationDate":{"date":"2022-12-15 16:40:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"SK","text":"Leider fehlen im Produkt Basis-Features, welche den Einsatz - obwohl anders angegeben - nur für Einzellizenzen zu gebrauchen ist. Eine Rückfrage beim Support, mit der Rückmeldung, man würde sich darum kümmern und am folgetag noch Updaten, verlief im Sand und der Support ignoriert bis dato jede Anfrage diesbezüglich. Nun gut, nach heutigen Update und weiterhin fehlender Grundfunktion, müssen wir wohl einsehen, dass das Plugin nicht zu gebrauchen ist, den viele Szenarien werden nicht abgedeckt.\n\n- Kunde bekommt keine Mitteilung bei Mehrfachaktivierungslizenzen, wie oft dieser auf Geräten eingesetzt werden kann.\n- Produktcodes werden nur in separaten E-Mails zugestellt, keine Einbindung in die von SW versandten Mails.\n- Gekaufte Mehrfachaktivierungscodes werden nicht versandt, wenn die Anzahl der Menge der gekauften Menge übersteigt, obwohl im Pool genügend Lizenzen bzw. Aktivierungen vorhanden sind.\n- Bugs der Sortierungsfunktion\n- Bug beim ändern der Anzahl der anzuzeigenden Produkte im Pool.\n- Mehrfach-Keys-funktion nutzlos, da diese als Single-Lizenz behandelt wird\netc. pp.\n\nAlles im allen: Undurchdacht, verbuggt und Support nicht (mehr) existent.","headline":"Bugs, fehlende Basis-Features, Support ignoriert E-Mails.","creationDate":{"date":"2022-12-14 14:46:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2}],"ratingAverage":7,"label":"Lizenzverwaltung für digitale Produkte","description":"<p>Das Shopware 6 Plugin \"Lizenzmanager\" ist ein umfangreiches Tool zur Verwaltung und zum Verkauf von Lizenzen jeglicher Art, wie zum Beispiel Softwarelizenzen oder Keys. Das Plugin kann auch einfach für andere Situationen verwendet werden, wie zum Beispiel Eintrittskarten für Veranstaltungen und vieles mehr. Mit seinen vielfältigen Funktionen und Features bietet das Plugin eine umfassende Lösung für alle Lizenzierungsanforderungen.</p><p>Der Lizenzmanager ermöglicht die einfache Erstellung von Pools für Lizenzen mit umfangreichen Einstellungsmöglichkeiten. Jeder Pool kann individuell konfiguriert werden, einschließlich Links, Mail-Texte, Anzeigen und anderen Optionen. Zudem können Pools bestimmten Kategorien zugeordnet werden, um eine bessere Organisation und Navigation zu ermöglichen.</p><p>Der Bestand der verfügbaren Lizenzen wird automatisch angepasst, sobald eine Lizenz verkauft wird. Dadurch wird sichergestellt, dass es zu keinen doppelten Verkäufen kommt und der Bestand immer aktuell ist. Kunden erhalten ihre Lizenz direkt nach dem Kauf automatisch per E-Mail, ohne manuellen Eingriff.</p><p>Der Lizenzmanager ermöglicht auch den Import und Export von Lizenzen. Sie können Lizenzen bequem über eine CSV-Datei importieren und exportieren, um die Verwaltung großer Mengen von Lizenzen zu erleichtern. Des Weiteren wird das Plugin in einem nächsten Update die Verwendung mehrerer Verkaufskanäle unterstützen, sodass Sie Ihre Lizenzen über verschiedene Plattformen oder Websites verkaufen können.</p><p>Die Zustellung der Lizenzen erfolgt direkt nach einer Bestellung ohne manuelle Bearbeitung. Sie können jedoch einstellen, dass die Zustellung erst nach Erreichen eines bestimmten Bezahlstatus der Bestellung erfolgt, um sicherzustellen, dass Kunden ihre Lizenz erst nach erfolgreicher Bezahlung erhalten.</p><p>Das Plugin bietet anpassbare E-Mail-Templates für die Zustellung der Lizenzen. Sie können den Inhalt und das Design der E-Mails nach Ihren eigenen Vorstellungen gestalten.</p><p>Der Lizenzmanager ist eine vollständige Lösung für den Verkauf von Lizenzen in Ihrem Shopware 6 Onlineshop. Egal ob Softwarelizenzen, Keys, Eintrittskarten oder andere Arten von Lizenzen, mit dem Lizenzmanager haben Sie ein leistungsstarkes Werkzeug zur Hand, um Ihre Lizenzverkäufe effizient und professionell zu verwalten.</p><p>________________________________________________________________________________________________________________________________________________________________</p><p><b>Über uns</b></p><p>Wir sind die code<b>giganten</b> aus Paderborn, Ihr erfahrener Partner für Shopware 6 Projekte. Jahrelange Erfahrung in individuellen PHP-Projekten mit aktuellen Frameworks bilden das Fundament für einen effizienten und professionellen Umgang mit sämtlichen Technologien im Shopware Universum. Unsere Apps und Themes entwickeln wir fortlaufend weiter und bieten kompetenten, individuellen Support sowie maßgeschneiderte Lösungen, um Ihren Shop noch besser zu machen.</p><p>Mit der code<b>giganten</b> GmbH haben Sie nicht nur einen absolut technisch versierten Partner an Ihrer Seite, sondern profitieren zudem von einem immensen Erfahrungsschatz aus zahlreichen eCommerce-Projekten im B2C- und B2B-Bereich.</p><p></p><p>code<b>giganten</b> GmbH - Ihr Partner für Shopware 6</p><p>Friedrichstraße 15 | 33102 Paderborn</p><p>Geschäftsführer: Oliver Krimmer</p><p><a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">codegiganten.de</a><br /></p><p>Benötigen Sie eigene Apps oder Themes, welche es noch nicht im Store gibt? Kein Problem! Melden Sie sich jederzeit bei uns unter <a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">info@codegiganten.de</a></p><p></p><p>******* <a href=\"https://codegiganten.de/newsletter/\" target=\"_blank\" rel=\"noreferrer noopener\">Jetzt kostenfrei unseren informativen <b>Newsletter</b> zu Shopware 6 und Apps abonnieren!</a> *******</p><p></p><p>________________________________________________________________________________________________________________________________________________________________</p>","installationManual":"<p>Sie haben sich für unsere App entschieden? Vielen Dank! Jetzt folgt nur noch die einfache Installation.</p><p>Tipp: Haben Sie eine App oder ein Theme erworben und Ihr Shop ist mit Ihrem Account verbunden, taucht die jeweilige Erweiterung automatisch in Ihrem Shop in der App-/Themes-Liste auf und muss nur noch installiert werden. So überspringen Sie den unten aufgeführten Schritt zum Hochladen der Erweiterung.</p><p><br /></p><p></p><ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Loggen Sie sich in Ihren Shopware 6 Administrationsbereich ein und navigieren zu <b><i>Erweiterungen &gt; Meine Erweiterungen &gt; Apps</i></b></li><li>Klicken Sie auf den \"<b><i>Erweiterung hochladen</i></b>\"-Button und wählen die heruntergeladene Erweiterung aus</li><li>Nutzen Sie das Menü neben der Erweiterung, um sie zu installieren und den Schalter, um sie zu aktivieren </li><li>Bearbeiten Sie in der Konfiguration der Erweiterung Ihre gewünschten Einstellungen</li><li>Erstellen Sie Ihre erste Kategorie unter <i><b>Kataloge &gt; Lizenz &gt; Kategorie </b></i></li><li>Erstellen Sie Ihren ersten Pool und weisen Sie ihn einer Kategorie zu unter <i><b>Kataloge &gt; Lizenz &gt; Pool &gt; Kategorie</b></i></li><li>Weisen Sie Produkte einem gewünschten Lizenz-Pool zu unter <b>Produkte &gt; Produkte hinzufügen</b> </li><li>Die App ist jetzt aktiv und die Funktionen nutzbar!</li></ol><p></p><p><br /></p><p><b>Sollten Sie Hilfe benötigen, stehen wir Ihnen jederzeit unter info@codegiganten.de und https://codegiganten.de/kontakt/ zur Verfügung.</b></p>","version":"2.3.1","changelog":[{"version":"2.3.1","text":"<ul><li>Multi Salechannel Support</li><li>Bugfixes</li></ul>","creationDate":{"date":"2023-06-20 16:44:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<ul><li>6.5 Release  Version</li></ul>","creationDate":{"date":"2023-06-07 08:54:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.6","text":"<ul><li></li><li>Error in order status processing</li><li>General bug fixes and optimizations</li></ul>","creationDate":{"date":"2023-06-05 14:09:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.3","text":"<p><b>Customer account:</b></p><p></p><ul><li>Display of keys optimized if this was too long</li></ul><p><br /></p><p><b>Backend:</b></p><p></p><ul><li>General bugs and bugfixes fixed</li><li>Invalid JSON in customfield removed</li><li>Pool Stats optimized</li><li>Bugfix: Too many keys were reserved</li></ul>","creationDate":{"date":"2023-05-09 16:25:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p></p><ul><li>In the license overview now up to 2000 positions can be displayed and edited</li><li>Now the oldest keys are always sent first</li><li>Faulty German snippets adjusted</li><li>Preparations for 6.5</li></ul><p><br /></p><p><b>New function:</b></p><p></p><ul><li>Licenses can be hidden in the mail and replaced with a link. This link will then show the key to the customer on the website. The clicking / opening of the key is tracked. This is to avoid fraud attempts. </li></ul><p><b>! Adjustment of the Mail Templates &amp; Config entry necessary !</b></p><p><br /></p><p></p><ul><li>If the keys of an order were released as a result of a canceled payment status, now with subsequent payment, new keys are loaded from the pool and sent accordingly. Previously, the keys had to be sent manually.</li></ul>","creationDate":{"date":"2023-04-03 11:36:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<ul><li>Fixed CSS Bug in Admin view</li></ul>","creationDate":{"date":"2023-03-07 09:06:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.9","text":"<ul><li></li><li>Some bugfixes</li><li>License view in customer account Responsive</li><li>Links are now displayed in the customer's license view</li></ul>","creationDate":{"date":"2022-12-14 10:26:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.8","text":"<ul><li>Fixed bug with category display in pool creation<br /></li></ul>","creationDate":{"date":"2022-10-07 13:49:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.7","text":"<ul><li>Fixed a bug with the listing of categories<br /></li></ul>","creationDate":{"date":"2022-10-07 12:30:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.6","text":"<ul><li>Fixed bug with Amazon Pay<br /></li></ul>","creationDate":{"date":"2022-09-20 09:12:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"<p></p><ul><li>Inventory adjustment of licensed products improved</li><li>Manual function for sync. Of the stock supplemented</li><li>Minor improvements and bug fixes</li></ul>","creationDate":{"date":"2022-05-18 11:00:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p></p><ul><li>Added missing translations in the backend</li><li>Fixed a bug that caused the pool overview not to load anymore</li><li>Fixed a bug with vouchers in the check-out</li><li>Small optimizations</li></ul>Shopware 6.4.11 Update","creationDate":{"date":"2022-05-05 09:44:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<ul><li>Remove Dump from Order Event</li></ul>","creationDate":{"date":"2022-04-05 09:13:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<ul><li>Fixed Error with Promotion</li></ul>","creationDate":{"date":"2022-03-30 09:00:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<ul><li>Bugfix with &gt; SW-6.4.9</li></ul>","creationDate":{"date":"2022-03-22 14:10:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p></p><ul><li>Multiple Key Support</li><li>Advanced search with multiple change function</li><li>Keys resend, out of order</li><li>Various bug fixes</li><li>Performance optimization</li></ul>","creationDate":{"date":"2022-03-22 08:52:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p></p><ul><li>Filter extended</li><li>Global license search function added to the pool view</li></ul>","creationDate":{"date":"2021-08-24 16:05:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<ul><li>Error after update with the Admin Email Template fixed<br /></li></ul>","creationDate":{"date":"2021-07-15 11:43:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<ul><li>Fixed bug in migration for older DB versions<br /></li></ul>","creationDate":{"date":"2021-07-07 12:12:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<ul><li></li><li>Operator now optionally receives an e-mail when purchasing licenses</li><li>Emails are now sent pool separated</li><li>Statistics now work correctly in the pool overview</li></ul>","creationDate":{"date":"2021-07-06 15:54:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p></p><ul><li>Display error in the storefront with the digital label fixed.</li><li>A text is now displayed in the product detail view if there are not enough licenses in the pool</li><li>It is now possible to hide pools in the admin area</li><li>Filters for the pool and license table added </li><li>Licenses can be assigned to Manuel order and customer</li><li>Option to ignore duplicate keys in the pool when importing and creating licenses</li><li>Bugfixes</li></ul>","creationDate":{"date":"2021-07-02 18:29:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p></p><ul><li>Texts can now be maintained for each pool, which are then displayed in the mail.</li><li>Per pool media can now be maintained, which are then attached to the mail</li><li>Small bugfixes</li><li>Performance optimization</li></ul>","creationDate":{"date":"2021-06-28 15:24:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p></p><ul><li>6.4 Update</li><li>100% Recode</li><li>Admin area revised</li><li>Improved usability for the store owner</li><li>Several bugs fixed</li><li>Settings of the order and payment status in now globally regulated via the Config</li></ul><p><br /></p><p>- Selection stock automatically adjust removed</p><p>- Order status is no longer considered</p><p><br /></p><p><br /></p><p>+ Inventory is now always automatically adjusted to the number of available licenses</p><p>+ Single licenses or all of an order can now be released for purchase again</p><p>+ A pool can now be assigned to more products</p><p><br /></p><p>+ It is now possible to assign a quantity to the products, how many keys are sold (pool sale).</p><p>+ It is now possible to clearly identify which key belongs to which order and customers</p><p>+ Customer can now retrieve his keys under Account</p><p>+ Keys are now sent all together in one e-mail with assignment of the product</p><p>+ Performance and loading time improvement</p>","creationDate":{"date":"2021-06-15 16:48:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p></p><ul><li>Paypal bug fixed</li><li>License export to CSV </li></ul>","creationDate":{"date":"2021-03-08 18:27:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p></p><ul><li>Fixed bug where shipping status was not set correctly when shipping directly</li><li>Plugin Config Adjusted</li></ul>","creationDate":{"date":"2021-02-18 11:53:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li></li><li>Paypal Bugfixes</li><li>Paypal as payment method is now supported correctly</li><li>Keys are released again after a payment has been cancelled</li><li>Data remains optionally after uninstallation</li><li>Various small bugfixes and improvements</li></ul>","creationDate":{"date":"2021-01-28 14:59:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li></li><li>CSV Import added</li><li>Bug fixing that not all licenses are displayed in the license overview</li><li>Improved loading times</li></ul>","creationDate":{"date":"2020-09-18 16:52:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First release of the plugin</p>","creationDate":{"date":"2020-09-01 14:37:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=cogi418937392086","redirectToStore":true,"lowestPriceValue":49.95}