{"id":12208,"name":"UltraFooterTunerProModulTwo","code":"ultra83097265961","lastChange":{"date":"2023-07-18 11:16:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRieaSU","examplePageUrl":"","moduleKey":"UltraFooterTunerProModulTwo","creationDate":{"date":"2020-08-20 20:32:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-09-15 12:13:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-09-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-03-30 06:09:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1578,"prefix":"ultra","name":"Agentur Ultra Media","website":"//ultra-media.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1578_logo-ultra-media-shopware-store.png"},"infos":[{"id":19389,"name":"Footer Tuner Pro Modul 2 | Kategorie & HTML Box - SW6 (Basic Modul)","description":"<p>Wir bauen Plugins die glücklich machen!&nbsp;</p><h2><b>Plugin Support / Fragen zum Produkt&nbsp;</b></h2><h2></h2><p><b>Mail:</b>&nbsp;support@ultra-media.de&nbsp; &nbsp;<b>Webseite:&nbsp;</b><a target=\"_blank\" href=\"http://ultra-media.de/\" rel=\"noreferrer noopener\">ultra-media.de</a></p><p><br></p><p>Mit unseren Shopware 6 Footer Tuner Modulen finden Sie nützliche Funktionen und Design Einstellungen um einen individuellen Footer definieren und gestalten zu können. Frei definierbare Text und Funktions Elemente&nbsp; ermöglichen Ihnen zahlreiche Layouts.</p><p>Je individueller Ihr Footer-Design, desto stärker ist der Eindruck, den es auf die Kunden macht. Wir empfehlen das der Fokus klar auf dem Informationsgehalt Ihres Footers liegt. Eine dezente Farbgestaltung und ein sparsamer Einsatz von Grafiken ist empfehlenswert.<br></p><p>Generell sollten Sie sich mit Textinhalten im Footer zurückhalten und lieber relevante Links bereitstellen. So verhindern Sie nicht nur Probleme bei den Suchmaschinen Google &amp; Co. und&nbsp; auch Ihre Kunden werden sich freuen, wenn Sie ihre Inhalte&nbsp; im Footer kurz und knackig auf den Punkt bringt.<br></p><p>Nutzen Sie den Footer um das Vertrauen der Kunden in Ihrem Online Shop zu stärken. Fördern Sie über Ihren Footer Transparenz und Kundennähe mit nützlichen Informationen wie z.B.: Öffnungszeiten oder Kontaktdaten &amp; Service.</p><p><br></p><h2>Generelle Design Konfigurationen</h2><p>Setzen Sie im Shopware 6 Footer ein eigenes Hintergrundbild. Bestimmen Sie einen eigenen Hintergrundbild Transparenz Wert ein. Die Ausrichtung des Hintergrundbildes und auch ob das Hintergrundbild wiederholt werden soll können selbst definiert werden.</p><p>Der Einsatz eines&nbsp; Farbverlauf und Ausrichtungswinkel für die Hintergrundfarbe ist ebenfalls möglich. Die Footer Inhalte und Hintergrundfarben können auf Wunsch auf volle Desktop Breite (Vollflächig) gesetzt werden.&nbsp;</p><p><br></p><h2>individuelle Spalten Breite</h2><p>Bestimmen Sie selbst die Breit Ihre Spalten (Boxen). Jede Spalten Breite ist mit diesem Plugin möglich.&nbsp;</p><p>Zum Beispiel 37% + 23% + 20% + 20% = 100% je Zeile. Eine Spalte (Box) muss somit nur so Breit gesetzt werden wie die Inhalte benötigen.&nbsp;</p><p><br></p><h2>Newsletter in Kategorie Spalte setzen</h2><p>Bieten Sie Ihren Kunden eine Newsletter Anmeldung an. Dabei bestimmen Sie in welcher Spalte die Newsletter Anmeldung erscheinen soll. Bestimmen Sie auch das Aussehen der Anmeldung und der Überschrift sowie einem Infotext über eine separate HTML Box.</p><p>Setzen Sie in den Senden Button Ihr eigenes I-Icon oder Shopware 6 Icon ein. Farben, Schriftart und Schriftgröße und Abstände können definiert werden.&nbsp;</p><p><br></p><h2>Individualisieren der Kategorie Boxen&nbsp;</h2><p>Setzen Sie Ihre angelegten Footer Kategorien in die gewünschte Spalte ein. Dabei bestimmen Sie über eigene individuelle Überschrift, hinzu schaltbare Kategorie Link Animationen, eigene individuelle I-Icons bzw. Shopware 6 Icons, Abständen, Schriftarten, Schriftgrößen und Schriftfarben.</p><p>Definieren Sie für jede Kategorie Box Hintergrundfarben und Transparenzen. Aktivierbare Linien (Farbe und Stärke definierbar) unter den jeweiligen Kategorie Links heben diese im Shopware 6 Footer hervor.</p><p><br></p><h2>Eigene Icons für Menüpunkte einsetzen</h2><p>Vor den Kategorie Links können je Kategorie Spalte (Box) eigene I-Icons bzw Shopware 6 Icons gesetzt werden. Je Box können dabei die Größe und Farbe der Icons bestimmt werden.</p><p><br></p><h2>Gruppen Verbindung, Gruppen Hintergrundfarben und Gruppen Trennlinie setzen</h2><p>Verbinden Sie Spalten (Boxen) zu Gruppen um diesen dann eine gemeinsame Hintergrundfarbe und Trennlinien zu definieren. Dabei können Transparenz Werte definiert werden.</p><p><br></p><h2>Kategorien optimal und einheitlich per Icon einkürzen</h2><p>Um ein wirklich einheitliches Design und eine einheitliche optimale gleich bleibende Höhe zu erreichen haben wir eine weitere Funktion hinzugefügt. Mit dem Element Kategorien kürzen können Sie wenn in einer der Kategorie Spalten mehr Kategorie Links vorhanden sind, diese gleich bleibend einkürzen. Dem Element kann eine eigene individuelle Öffnen und Schließen Beschriftung sowie Schriftart, Schriftgröße und Schriftfarbe hinzugefügt werden. Die Kategorie Links sind auch im geschlossenen Zustand für die Suchmaschinen lesbar.</p><p><br></p><h2>Zahlung und Versand Icon per eigener URL verlinken</h2><p>Vergeben Sie den Zahlung und Versand Icons eigene URLs und verlinken so optimal zu den Info-Seiten der im Shop angelegten Zahlungsarten und Versandarten.&nbsp;</p><p>Bestimmen Sie die Größe der Versand und Zahlung Icons. In den Boxen (Spalten) können über eine Dropdown Auswahl entweder Zahlungs und Versand Icons oder nur Versand bzw. nur Zahlungs Icons ausgewählt und angezeigt werden.</p><p><br></p><h2>Entdecke weitere nützliche Footer Tuner Pro Module und Erweiterungen</h2><p>Sie vermissen weitere Footer Funktionen und Gestaltungsmöglichkeiten? Dann Schauen Sie sich die weiteren Footer Tuner Pro Module an. Sparen Sie mit unserem Footer Tuner Pro Modul Bundle.</p><p><br></p><ul><li><a href=\"https://store.shopware.com/ultra18634244679/footer-tuner-pro-modul-1-newsletter-trenner-box-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\">Footer Tuner Pro Modul 1 | Newsletter &amp; Trenner Box</a><br></li><li><a href=\"https://store.shopware.com/ultra83097265961/footer-tuner-pro-modul-2-kategorie-html-box.html\">Footer Tuner Pro Modul 2 | Kategorie &amp; HTML Box</a></li><li><a href=\"https://store.shopware.com/ultra58432292265/footer-tuner-pro-modul-3-zahlung-und-copyright-box.html?c=3\">Footer Tuner Pro Modul 3 | Zahlung und Copyright Box</a><br></li><li>Footer Tuner Pro Modul 4 | Medien Container (Erweiterung für Modul 2)</li></ul><p></p><p><br></p><h2>Hilfe / Dokumentation</h2><h2></h2><p><a href=\"https://ultra-media.de/Online-Dokumentation/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation Footer Tuner Pro Modul 2 | Kategorie &amp; HTML Box</a><br></p><p><br></p><h2>Erfahrung</h2><p>Unser erfahrenes Shopware Entwickler Team hat bereits&nbsp;<b>29 aktiven Plugins und Erweiterungen</b>&nbsp;erstellt.</p><p><br></p><p></p><h2>Bewerten Sie unsere Plugins offen und ehrlich. Ihre Meinung ist uns wichtig!</h2><p>Für ihre Mühe bedanken wir uns nach Freischaltung der Bewertung und belohnen Sie mit einem&nbsp;<b>5 EUR Rabatt Gutschein</b>&nbsp;auf den Kauf weiterer von uns entwickelter und hier im Store angebotenen Agentur Ultra Media Shopware Plugins.</p><p><br></p>","installationManual":"<p>- Einfache Installation über den Shopware 6 Pluginmanager.&nbsp;&nbsp;</p><p>- Einfache Erweiterungsmöglichkeiten mit weiteren Footer Tuner Pro Modulen</p><p>- Nach der Installation, bzw. nach dem Speichern der Konfiguration bitte den Cache leeren und das Theme kompilieren.<br></p>","shortDescription":"Das Footer Hauptmodul ermöglicht das setzen individueller Kategorien und Inhalte sowie viele Gestaltungsmöglichkeiten wie Schriftart, Farben, Animationen und einer Newsletter Anmeldung.","highlights":"individuelle je Footer Spalte (Box) und Zeile selbst definierbare Spalten Breiten\nZeilen Gruppierungen für Hintergrundfarben mit Transparenzen\nInhalte selbst bestimmen (Kategorie Links, eigene Inhalte, Zahlung &amp; Versand Infos uvm.)\nZentrales Footer Hintergrundbild\nNewsletter Anmeldung platzieren","features":"Schriftart, Schriftgröße, Schriftstärke, Schriftfarbe\nKategorie Link Animationen\neigene Icons einsetzen\nHTML Eingabe Boxen\nKategorien einkürzen"},{"id":19390,"name":"Footer Tuner Pro Module 2 | Category & HTML Box","description":"<p>We build plugins that make you happy! </p><h2>Plugin Support / Questions about the product </h2><p>Mail: support@ultra-media.de Website:  <a href=\"http://ultra-media.de/\" target=\"_blank\" rel=\"noreferrer noopener\">ultra-media.de</a></p><p><br /></p><p>With our Shopware 6 Footer Tuner Modules you will find useful functions and design settings to define and design an individual footer. Freely definable text and function elements enable you to create numerous layouts.</p><p>The more individual your footer design, the stronger the impression it makes on the customers. We recommend that the focus lies clearly on the information content of your footer. A discreet colour scheme and an economical use of graphics is recommended.</p><p>In general, you should be reserved with text content in the footer and rather provide relevant links. This will not only prevent problems with the search engines Google &amp; Co. and your customers will also be happy if you put your content in the footer in a short and crisp way.</p><p>Use the footer to strengthen the trust of the customers in your online shop. Use your footer to promote transparency and customer proximity with useful information such as opening hours or simple contact options.</p><p><br /></p><h2>General Design Configurations</h2><p>Set your own background image in Shopware 6 Footer. Set your own background image transparency value. The orientation of the background image and also if the background image should be repeated can be defined by yourself. The use of a gradient and alignment angle for the background color is also possible. The footer contents and background colors can be set to full desktop width (Full Screen) if desired. </p><p><br /></p><p><br /></p><p><br /></p><h2>individual column width</h2><p>Set the width of your columns (boxes) yourself. Any column width is possible with this plugin. </p><p><br /></p><p>For example 37% + 23% + 20% + 20% = 100% per line. A column (box) must therefore only be set as wide as the content requires. </p><p><br /></p><p><br /></p><p><br /></p><h2>Set newsletter in category column</h2><p>Offer your customers a newsletter registration. You decide in which column the newsletter registration should appear. You can also define the appearance of the registration and the headline as well as an info text via a separate HTML box.</p><p><br /></p><p>Insert your own icon or Shopware 6 icon in the Send button. Colors, font and font size and spacing can be defined. </p><p><br /></p><p><br /></p><p><br /></p><h2>Individualize the category Boxes </h2><p>Insert your created footer categories into the desired column. You determine 6 icons, spacing, fonts, font sizes and font colors via your own individual headline, link animations, individual icons or Shopware category that can be added.</p><p><br /></p><p>Define for each category box background colors and transparencies. Activatable lines (color and thickness definable) under the respective category links highlight these in the Shopware 6 footer.</p><p><br /></p><p><br /></p><p><br /></p><h2>Use own icons for menu items</h2><p>In front of the category links, you can place 6 icons per category column (box) or Shopware 6 icons. The size and color of the icons can be determined for each box.</p><p><br /></p><p><br /></p><p><br /></p><h2>Set group connection, group background colors and group separator</h2><p>Connect columns (boxes) to groups to define a common background color and dividing lines. Transparency values can be defined.</p><p><br /></p><p><br /></p><p><br /></p><h2>Categories can be shortened optimally and uniformly by icon</h2><p>In order to achieve a truly uniform design and a uniform optimal constant height, we have added another feature. With the element Shorten Categories you can shorten category links if there are more category links in one of the category columns. You can add your own individual opening and closing caption, font, font size and font color to the element. The category links are also readable for search engines when closed.</p><p><br /></p><p><br /></p><p><br /></p><h2>Link payment and shipping icon via own URL</h2><p>Assign your own URLs to the payment and shipping icons and link to the info pages of the payment and shipping methods created in the store. </p><p><br /></p><p>Determine the size of the shipping and payment icons. In the boxes (columns) you can select and display either payment and shipping icons or only shipping or only payment icons.</p><p><br /></p><p><br /></p><p><br /></p><h2>Discover more useful Footer Tuner Pro modules and extensions</h2><p>You miss further footer functions and design possibilities? Then take a look at the other Footer Tuner Pro modules. Save money with our Footer Tuner Pro Module Bundle.</p><p><a href=\"https://store.shopware.com/ultra18634244679/footer-tuner-pro-modul-1-newsletter-trenner-box-sw6.html\">Footer Tuner Pro Module 1 | Newsletter &amp; Separator Box</a><br /></p><p>Footer Tuner Pro Module 2 | Category &amp; HTML Box</p><p><a href=\"https://store.shopware.com/en/ultra58432292265/footer-tuner-pro-module-3-payment-and-copyright-box.html?c=3\">Footer Tuner Pro Module 3 | Payment and Copyright Box</a><br /></p><p>Footer Tuner Pro Module 4 | Media Container (Extension for Module 2)</p><p><br /></p><h2>Experience</h2><p>Our experienced Shopware developer team has already created <b>29 active plugins</b> and extensions.</p><p><br /></p><p></p><p><br /></p><h2>Please rate our plugins openly and honestly. Your opinion is important to us!</h2><p>We thank you for your effort after your evaluation is activated and reward you with a <b>5 EUR</b> discount voucher for the purchase of further developed and here in the store offered agency Ultra Media Shopware plugins.</p>","installationManual":"<p>- Easy installation via the Shopware 6 plugin manager.</p><p>- Easy expansion possibilities with the additional Footer Tuner Pro modules</p><p>- After installation or after saving the configuration, please clear the cache and compile the theme.<br></p>","shortDescription":"The Footer main module allows you to set individual categories and content as well as many design options such as font, colors, animations and a newsletter registration.","highlights":"individual per footer column (box) and row self-defined column widths\nLine groupings for background colors with transparencies\nDetermine content yourself (category links, own content, payment &amp; shipping info and much more)\nCentral footer wallpaper\nPlace newsletter subscription","features":"font, font size, font strength, font color\nCategory Link Animations\nuse your own icons\nHTML Input Boxes\nShorten categories"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160915,"bookingKey":"ultra83097265961","bookingText":"Footer Tuner Pro Module 2 | Category & HTML Box","price":140,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160914,"bookingKey":"ultra83097265961_M","bookingText":"Footer Tuner Pro Module 2 | Category & HTML Box","price":17.5,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnwGO90","preview":true,"priority":0,"id":98809},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJuCCNF","preview":false,"priority":1500,"id":48787},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7lCNrz","preview":false,"priority":1400,"id":48927},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVtp0Dm","preview":false,"priority":1300,"id":48929},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmVs51z","preview":false,"priority":1200,"id":48930},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOd1z98","preview":false,"priority":1100,"id":48938},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplIpm0x","preview":false,"priority":100,"id":48937},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT6HYEZ","preview":false,"priority":0,"id":99169},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4qTUK0","preview":false,"priority":0,"id":99170},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppvmKn9","preview":false,"priority":0,"id":99171},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1Zp0xP","preview":false,"priority":0,"id":99172}],"comments":[],"ratingAverage":0,"label":"Footer Tuner Pro Modul 2 | Kategorie & HTML Box - SW6 (Basic Modul)","description":"<p>Wir bauen Plugins die glücklich machen! </p><h2><b>Plugin Support / Fragen zum Produkt </b></h2><h2></h2><p><b>Mail:</b> support@ultra-media.de   <b>Webseite: </b><a target=\"_blank\" href=\"http://ultra-media.de/\" rel=\"noreferrer noopener\">ultra-media.de</a></p><p><br /></p><p>Mit unseren Shopware 6 Footer Tuner Modulen finden Sie nützliche Funktionen und Design Einstellungen um einen individuellen Footer definieren und gestalten zu können. Frei definierbare Text und Funktions Elemente  ermöglichen Ihnen zahlreiche Layouts.</p><p>Je individueller Ihr Footer-Design, desto stärker ist der Eindruck, den es auf die Kunden macht. Wir empfehlen das der Fokus klar auf dem Informationsgehalt Ihres Footers liegt. Eine dezente Farbgestaltung und ein sparsamer Einsatz von Grafiken ist empfehlenswert.<br /></p><p>Generell sollten Sie sich mit Textinhalten im Footer zurückhalten und lieber relevante Links bereitstellen. So verhindern Sie nicht nur Probleme bei den Suchmaschinen Google &amp; Co. und  auch Ihre Kunden werden sich freuen, wenn Sie ihre Inhalte  im Footer kurz und knackig auf den Punkt bringt.<br /></p><p>Nutzen Sie den Footer um das Vertrauen der Kunden in Ihrem Online Shop zu stärken. Fördern Sie über Ihren Footer Transparenz und Kundennähe mit nützlichen Informationen wie z.B.: Öffnungszeiten oder Kontaktdaten &amp; Service.</p><p><br /></p><h2>Generelle Design Konfigurationen</h2><p>Setzen Sie im Shopware 6 Footer ein eigenes Hintergrundbild. Bestimmen Sie einen eigenen Hintergrundbild Transparenz Wert ein. Die Ausrichtung des Hintergrundbildes und auch ob das Hintergrundbild wiederholt werden soll können selbst definiert werden.</p><p>Der Einsatz eines  Farbverlauf und Ausrichtungswinkel für die Hintergrundfarbe ist ebenfalls möglich. Die Footer Inhalte und Hintergrundfarben können auf Wunsch auf volle Desktop Breite (Vollflächig) gesetzt werden. </p><p><br /></p><h2>individuelle Spalten Breite</h2><p>Bestimmen Sie selbst die Breit Ihre Spalten (Boxen). Jede Spalten Breite ist mit diesem Plugin möglich. </p><p>Zum Beispiel 37% + 23% + 20% + 20% = 100% je Zeile. Eine Spalte (Box) muss somit nur so Breit gesetzt werden wie die Inhalte benötigen. </p><p><br /></p><h2>Newsletter in Kategorie Spalte setzen</h2><p>Bieten Sie Ihren Kunden eine Newsletter Anmeldung an. Dabei bestimmen Sie in welcher Spalte die Newsletter Anmeldung erscheinen soll. Bestimmen Sie auch das Aussehen der Anmeldung und der Überschrift sowie einem Infotext über eine separate HTML Box.</p><p>Setzen Sie in den Senden Button Ihr eigenes I-Icon oder Shopware 6 Icon ein. Farben, Schriftart und Schriftgröße und Abstände können definiert werden. </p><p><br /></p><h2>Individualisieren der Kategorie Boxen </h2><p>Setzen Sie Ihre angelegten Footer Kategorien in die gewünschte Spalte ein. Dabei bestimmen Sie über eigene individuelle Überschrift, hinzu schaltbare Kategorie Link Animationen, eigene individuelle I-Icons bzw. Shopware 6 Icons, Abständen, Schriftarten, Schriftgrößen und Schriftfarben.</p><p>Definieren Sie für jede Kategorie Box Hintergrundfarben und Transparenzen. Aktivierbare Linien (Farbe und Stärke definierbar) unter den jeweiligen Kategorie Links heben diese im Shopware 6 Footer hervor.</p><p><br /></p><h2>Eigene Icons für Menüpunkte einsetzen</h2><p>Vor den Kategorie Links können je Kategorie Spalte (Box) eigene I-Icons bzw Shopware 6 Icons gesetzt werden. Je Box können dabei die Größe und Farbe der Icons bestimmt werden.</p><p><br /></p><h2>Gruppen Verbindung, Gruppen Hintergrundfarben und Gruppen Trennlinie setzen</h2><p>Verbinden Sie Spalten (Boxen) zu Gruppen um diesen dann eine gemeinsame Hintergrundfarbe und Trennlinien zu definieren. Dabei können Transparenz Werte definiert werden.</p><p><br /></p><h2>Kategorien optimal und einheitlich per Icon einkürzen</h2><p>Um ein wirklich einheitliches Design und eine einheitliche optimale gleich bleibende Höhe zu erreichen haben wir eine weitere Funktion hinzugefügt. Mit dem Element Kategorien kürzen können Sie wenn in einer der Kategorie Spalten mehr Kategorie Links vorhanden sind, diese gleich bleibend einkürzen. Dem Element kann eine eigene individuelle Öffnen und Schließen Beschriftung sowie Schriftart, Schriftgröße und Schriftfarbe hinzugefügt werden. Die Kategorie Links sind auch im geschlossenen Zustand für die Suchmaschinen lesbar.</p><p><br /></p><h2>Zahlung und Versand Icon per eigener URL verlinken</h2><p>Vergeben Sie den Zahlung und Versand Icons eigene URLs und verlinken so optimal zu den Info-Seiten der im Shop angelegten Zahlungsarten und Versandarten. </p><p>Bestimmen Sie die Größe der Versand und Zahlung Icons. In den Boxen (Spalten) können über eine Dropdown Auswahl entweder Zahlungs und Versand Icons oder nur Versand bzw. nur Zahlungs Icons ausgewählt und angezeigt werden.</p><p><br /></p><h2>Entdecke weitere nützliche Footer Tuner Pro Module und Erweiterungen</h2><p>Sie vermissen weitere Footer Funktionen und Gestaltungsmöglichkeiten? Dann Schauen Sie sich die weiteren Footer Tuner Pro Module an. Sparen Sie mit unserem Footer Tuner Pro Modul Bundle.</p><p><br /></p><ul><li><a href=\"https://store.shopware.com/ultra18634244679/footer-tuner-pro-modul-1-newsletter-trenner-box-sw6.html\" target=\"_blank\" rel=\"noreferrer noopener\">Footer Tuner Pro Modul 1 | Newsletter &amp; Trenner Box</a><br /></li><li><a href=\"https://store.shopware.com/ultra83097265961/footer-tuner-pro-modul-2-kategorie-html-box.html\">Footer Tuner Pro Modul 2 | Kategorie &amp; HTML Box</a></li><li><a href=\"https://store.shopware.com/ultra58432292265/footer-tuner-pro-modul-3-zahlung-und-copyright-box.html?c=3\">Footer Tuner Pro Modul 3 | Zahlung und Copyright Box</a><br /></li><li>Footer Tuner Pro Modul 4 | Medien Container (Erweiterung für Modul 2)</li></ul><p></p><p><br /></p><h2>Hilfe / Dokumentation</h2><h2></h2><p><a href=\"https://ultra-media.de/Online-Dokumentation/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation Footer Tuner Pro Modul 2 | Kategorie &amp; HTML Box</a><br /></p><p><br /></p><h2>Erfahrung</h2><p>Unser erfahrenes Shopware Entwickler Team hat bereits <b>29 aktiven Plugins und Erweiterungen</b> erstellt.</p><p><br /></p><p></p><h2>Bewerten Sie unsere Plugins offen und ehrlich. Ihre Meinung ist uns wichtig!</h2><p>Für ihre Mühe bedanken wir uns nach Freischaltung der Bewertung und belohnen Sie mit einem <b>5 EUR Rabatt Gutschein</b> auf den Kauf weiterer von uns entwickelter und hier im Store angebotenen Agentur Ultra Media Shopware Plugins.</p><p><br /></p>","installationManual":"<p>- Einfache Installation über den Shopware 6 Pluginmanager.  </p><p>- Einfache Erweiterungsmöglichkeiten mit weiteren Footer Tuner Pro Modulen</p><p>- Nach der Installation, bzw. nach dem Speichern der Konfiguration bitte den Cache leeren und das Theme kompilieren.<br /></p>","version":"3.1.1","changelog":[{"version":"3.1.1","text":"<p>- reviewed an fixed a little bug</p>","creationDate":{"date":"2023-07-13 08:31:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<p>- Added minimal footer</p>","creationDate":{"date":"2023-07-04 15:20:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<p>- csrf compability with 6.4 and 6.5</p>","creationDate":{"date":"2023-06-12 16:25:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>- fast navigation adjusted</p>","creationDate":{"date":"2023-06-12 13:28:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>- Fixed a little Javascript bug</p>","creationDate":{"date":"2023-05-25 15:59:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p> - Compatible with Shopware 6.5</p>","creationDate":{"date":"2023-05-25 07:39:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.7.0","text":"<p>- HTML Boxes now snippets</p>","creationDate":{"date":"2023-04-13 09:25:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.8","text":"<p>- unuset css style removed</p>","creationDate":{"date":"2023-04-12 09:03:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.7","text":"<p>- Added a fallback if the container is missing in the footer</p>","creationDate":{"date":"2023-04-11 12:10:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.6","text":"<p>- Increased compability with Modul 4</p>","creationDate":{"date":"2023-04-04 11:26:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.5","text":"<p>- fixed Icons on non cms pages<br /></p>","creationDate":{"date":"2023-03-23 14:28:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.4","text":"<p>- fixed media container from Modul 4</p>","creationDate":{"date":"2023-02-23 16:56:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.3","text":"<p>- fixed little javascript error</p>","creationDate":{"date":"2023-02-13 09:20:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.2","text":"<p>- mobile view display error fixed</p>","creationDate":{"date":"2023-02-08 10:29:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.1","text":"<p>- Payment- and shipping Icons display error fixed</p>","creationDate":{"date":"2022-12-21 14:40:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.0","text":"<p>- Footer Tuner Modul 4 new implemented</p>","creationDate":{"date":"2022-12-12 11:59:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.1","text":"<p>- fixed style error in mobile viewport</p>","creationDate":{"date":"2022-11-16 12:21:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.0","text":"<p>- source code reduced and optimized</p>","creationDate":{"date":"2022-11-02 12:49:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"<p>- Source code reduced and optimized</p>","creationDate":{"date":"2022-10-23 22:00:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<p>- Checked and adjusted routinely.</p>","creationDate":{"date":"2022-09-05 13:11:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p>- Link to the privacy policy adapted</p>","creationDate":{"date":"2021-12-14 17:48:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>- Shopware system memory adapted</p>","creationDate":{"date":"2021-08-30 19:44:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>- Compatibility update for Shopware 6.4.x.x</p>","creationDate":{"date":"2021-05-07 15:40:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Compatibility update for Shopware 6.4.x.x</p>","creationDate":{"date":"2021-05-06 13:45:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Adaptations to the current Shopware Core<br /></p>","creationDate":{"date":"2021-03-10 07:29:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- Plugin published in the store</p>","creationDate":{"date":"2020-09-02 16:56:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=ultra83097265961","redirectToStore":false,"lowestPriceValue":17.5}