{"id":12216,"name":"NetiNextAdminTools","code":"Neti846166253478","lastChange":{"date":"2023-07-21 09:18:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5eS2QH","examplePageUrl":"","moduleKey":"NetiNextAdminTools","creationDate":{"date":"2020-08-24 12:14:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-08-26 08:43:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-04-05 12:43:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":36,"prefix":"Neti","name":"Net Inventors GmbH","website":"//www.netinventors.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod36_netinventors_100-extensions.png"},"infos":[{"id":19407,"name":"Produktkategoriebaum, Produktsuchfilter, als Kunde einloggen - AdminTools","description":"<p>Wer als Shop-Betreiber im Shopware 6 Admin Produkte bearbeiten möchte, kann sich diese derzeit nur\nin Form einer großen Produktliste anzeigen lassen und nach den Produktnamen suchen. Bei kleinen Onlineshops lässt sich\ndas gut händeln, bei Shops mit mehreren hundert oder sogar tausend Artikeln wird jede Bearbeitung allerdings enorm\naufwendig. Die aus Shopware 5 bekannte <strong>Anzeige der Artikel im Kategoriebaum</strong> ist aktuell nicht möglich – ist der\ngenaue Name eines Produkts oder die Kategorie nicht bekannt, hilft aktuell nur die zeitaufwändige Suche über das\nFrontend.</p>\n<p>Hier setzt das Plugin an, wir haben die aus Shopware 5 bekannte <strong>Ansicht als Kategoriebaum</strong> implementiert, sodass du ab sofort wieder\n<strong>auf eine Kategorie klicken</strong> und dir sämtliche dieser <strong>Kategorie zugewiesenen Produkte anzeigen</strong> lassen kannst. Der\nKategoriebaum gibt zusätzlich Auskunft über die <strong>Anzahl der zugewiesenen Produkte</strong> und den aktuellen <strong>Status der Sichtbarkeit</strong> der\nKategorie – so siehst du sofort, ob eine Kategorie deaktiviert oder aktiviert ist.</p>\n<p>Ein weiteres Highlight ist der hochflexible <strong>Filter</strong>, den du bei der <strong>Suche</strong> von Produkten, Bestellungen und Kunden einsetzen kannst.\nDu möchtest alle Bestellungen suchen, die einen bestimmtem Lieferstatus haben, in einem beliebigen Zeitraum erstellt wurden und ein bestimmtes Produkt enthalten? Mit dem <strong>Suchfilter</strong> kein Problem.\nEs stehen jeder Entität (Produkte, Bestellungen, Kunden) alle Eigenschaften zur verfügung, die gefiltert werden können.</p>\n<p>Oft ist es notwendig zu sehen, was dein Kunde sieht. Mit der Funktion <strong>„Als Kunde einloggen“</strong> kannst du dich im Frontend als Kunde anmelden.</p>\n<p>Um einen schnelleren <strong>Überblick</strong> in deinen <strong>Bestellungen</strong> zu erhalten, haben wir die Spalten „<strong>Zahlungsart</strong>“\nund „<strong>Versandart</strong>“ ergänzt. In der Bestellung ist es nun ebenfalls möglich mit einem Klick direkt zum Kundenprofil zu\ngelangen.</p>\n<p><strong>AdminTools ist das Standard-Plugin für Shopware 6, mit dem du deine Arbeit am Onlineshop unkompliziert ausführen kannst und dabei viel Zeit sparst.</strong></p>\n<h2>Das sagen unsere Kunden:</h2>\n<p><em>Bin begeistert vom SW6 Plugin AdminTools – genau das was wir brauchen, um unseren großen Katalog zu managen. Gerade die\nFilterfunktion ist mächtig und flexibel. (ML 11/2020)</em></p>\n<h3>FAQ</h3>\n<h4>Kompatibilität</h4>\n<p>Sofern sich die Funktionalitäten nicht gegenseitig ausschließen, können wir eine Kompatibilität dieses Plugins mit all unseren eigenen Plugins gewährleisten.\nEine Kompatibilität mit Drittanbieter-Plugins, zu denen z. B. auch die Premium-Plugins von Shopware zählen, können wir nicht garantieren.\nFalls es hier Probleme gibt, hilft dir unser Support gerne weiter.\nSelbstverständlich halten wir unsere Plugins mit einer neuen Shopware Version kompatibel.\nHier beziehen wir uns auf die Shopware Community Edition mit Standard Responsive Theme.</p>\n<h4>Support</h4>\n<p>Du benötigst Unterstützung? Gerne hilft dir unser Support Team in deutscher und englischer Sprache kompetent weiter.\nSupport gibts für all unsere kostenpflichtigen Plugins.</p>\n<p>Um eine Supportanfrage zu stellen, verwende entweder deinen Shopware-Account oder nutze unser Support-Portal\nunter https://support.netinventors.de - hier findest du ebenfalls schon viele hilfreiche Informationen.</p>\n<p>Um schnell deine Anfrage zu bearbeiten, stelle folgende Punkte sicher:</p>\n<ol>\n<li>es ist die aktuelle Version für die jeweilige Shopware Version des Plugin installiert</li>\n<li>es liegt eine gültige Subscription des Plugins vor</li>\n<li>das Problem tritt im Shopware Standardtheme und mit deaktivierten Drittanbieterplugins ebenfalls auf</li>\n<li>es wurden keine Änderungen von dir oder Dritten am Plugin vorgenommen</li>\n</ol>\n<p>Wir unterstützen dich dann natürlich trotzdem, berechnen den Support aber nach Aufwand.</p>\n<h4>Testversion</h4>\n<p>Selbstverständlich kannst du all unsere Plugins zunächst einmal für 30 ausführlich Tage testen.\nSchau dir die unterschiedlichen Funktionalitäten an und probiere alles aus, bevor du dich für Miete oder Kauf entscheidest.\nFalls du eine Beratung benötigst stehen wir dir gerne zur Verfügung.\nKontaktiere einfach unseren Support unter https://support.netinventors.de</p>\n<h4>Features</h4>\n<p>Wir entwickeln neue Plugin-Features in der Regel auf Basis der aktuellen Shopware Feature Version.\nDie Produktbeschreibung, Features und Highlights beziehen sich immer für die zum Zeitpunkt des Releases aktuellste Shopware Feature Version.</p>\n<h4>Individuelle Entwicklung</h4>\n<p>Wenn ein Plugin nicht ganz zu deinen Anforderungen passt, dann erweitern oder adaptieren wir es gern nach deinen individuellen Wünschen.\nSelbstverständlich erstellen wir dir auch ein ganz eigenes Plugin.\nNimm hierzu einfach Kontakt mit uns auf und sag uns, was wir für dich tun können.</p>\n<h2>Links</h2>\n<ul>\n<li>\n<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://shopware6.io.netinventors.de/plugins/NetiNextAdminTools/de\">Handbuch</a>\n</li>\n<li>\n<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://support.netinventors.de/hc/de/requests/new\">Support</a>\n</li>\n<li>\n<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://netinventors.de\">Net Inventors GmbH</a>\n</li>\n</ul>\n","installationManual":"<h2>Installation</h2>\n<p>Installation via Plugin Manager</p>\n<p>Weitere Informationen findest du online im <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://shopware6.io.netinventors.de/plugins/NetiNextAdminTools/de/\">Handbuch</a>.</p>\n","shortDescription":"Anzeige der Artikel im Kategoriebaum, Suchfilter für Produkte, Bestellungen & Kunden, Login in Kundenaccount, Zahlungs- und Versandart in Bestellübersicht und vieles mehr.","highlights":"Kategoriebaum & dynamische Produktgruppen in Produktübersicht\nNotizen für Produkte, Kunden und Bestellungen\nKombinierbare Suchfilter für Produkte, Bestellungen und Kunden mit Speichermöglichkeit für eigenen Account, alle Nutzer, oder für bestimmte Rollen\nBeleg- und Dokumentenübersicht mit Möglichkeit zum Filtern, Herunterladen und E-Mail Versand der Dokumente\nLogin in Kundenaccount (als Kunde einloggen)","features":"Öffnen des Produkts im Frontend im jeweiligen Verkaufskanal aus Produktdetail\nAnzeige der Produktanzahl einer Kategorie im Kategoriebaum\nAnzeige des Kategoriestatus (aktiv / inaktiv) im Kategoriebaum\nDirektlink in einer Bestellung zum Kundenprofil\nFilter für Dokument- und Belegnummer in Bestellungen\nAnzeige der Zahlungs- und Versandart in Bestellübersicht\nAnzeige von Zahlungs-, Bestell- und Lieferstatus sowie die Rechnungsnummer in der Kundendetailansicht\nFlow Trigger für Kundenkonto aktiviert\nFlow Trigger für Kundenkonto deaktiviert\nBelege aus Bestellung per E-Mail an Kunde, Administrator oder weitere Empfänger senden"},{"id":19408,"name":"Product category tree & product search filter - AdminTools","description":"<p>If you as a shop operator would like to edit products in Shopware 6 Admin, you can currently only do so\nin the form of a large product list and search for the product names. In small online shops\nHandle it well, but in shops with several hundred or even thousands of items, each processing is enormous\nlaborious. The <strong>display of articles in the category tree</strong> known from Shopware 5 is currently not possible - it is\nThe exact name of a product or the category is not known, currently only the time-consuming search via the helps\nFront end.</p>\n<p>This is where the plugin comes in, we have implemented the <strong>view as a category tree</strong> known from Shopware 5, so that you can go back immediately\n<strong>click on a category</strong> and you can see all the products <strong>assigned to this</strong> category. The\nThe category tree also provides information on the <strong>number of assigned products</strong> and the current <strong>status of visibility</strong> of the\nCategory - so you can see immediately whether a category is deactivated or activated.</p>\n<p>Another highlight is the highly flexible <strong>filter</strong>, which you can use to keep track of products, orders and customers.\nWould you like to filter orders that have a certain delivery status, were created in any period and contain a certain product? No problem with the filter.\nEach entity (products, orders, customers) has all properties available that can be filtered.</p>\n<p>Often it is necessary to see what your customer is seeing. With the function <strong>&quot;Log in as customer&quot;</strong> you can log into\nRegister frontend as a customer.</p>\n<p>In order to get a faster <strong>overview</strong> in your <strong>orders</strong>, we have the columns &quot;<strong>Payment method</strong>&quot;\nand &quot;<strong>Shipping method</strong>&quot; added. When ordering, it is now also possible to go directly to the customer profile with one click\nreach.</p>\n<p><strong>AdminTools is a standard plugin for Shopware 6, with which you can carry out your work on the online shop as usual in the future and save a lot of time.</strong></p>\n<h3>FAQ</h3>\n<h4>Compatibility</h4>\n<p>If the functionalities are not mutually exclusive, we can ensure that this plugin is compatible with all of our own plugins.\nCompatibility with third-party plugins, for which For example, we cannot guarantee that Shopware's premium plugins count.\nIf there are any problems, our support will be happy to help you.\nOf course, we keep our plugins compatible with a new Shopware version.\nHere we refer to the Shopware Community Edition with Standard Responsive Theme.</p>\n<h4>Support</h4>\n<p>Do you need support? Our support team will be happy to help you competently in German and English.\nSupport is available for all our paid plugins.</p>\n<p>To make a support request, either use your Shopware account or use our support portal\nat https://support.netinventors.de - here you will also find a lot of helpful information.</p>\n<p>To quickly process your request, make sure of the following:</p>\n<ol>\n<li>the current version for the respective Shopware version of the plugin is installed</li>\n<li>there is a valid subscription to the plugin</li>\n<li>the problem also occurs in the Shopware standard theme and with deactivated third-party plugins</li>\n<li>no changes were made to the plugin by you or third parties</li>\n</ol>\n<p>We will of course support you anyway, but we will calculate the support according to the effort.</p>\n<h4>Trial version</h4>\n<p>Of course, you can first test all of our plugins for 30 detailed days.\nTake a look at the different functionalities and try everything out before you decide to rent or buy.\nIf you need advice, we are happy to help.\nSimply contact our support at https://support.netinventors.de</p>\n<h4>Features</h4>\n<p>We usually develop new plugin features based on the current Shopware feature version.\nThe product description, features and highlights always refer to the most current Shopware feature version at the time of release.</p>\n<h4>Individual development</h4>\n<p>If a plugin does not fully meet your requirements, we would be happy to expand or adapt it according to your individual wishes.\nOf course, we also create your own plugin. Simply contact us and tell us what we can do for you.</p>\n<h2>Links</h2>\n<ul>\n<li>\n<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://shopware6.io.netinventors.de/plugins/NetiNextAdminTools/en\">Manual</a>\n</li>\n<li>\n<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://support.netinventors.de/hc/en/requests/new\">Support</a>\n</li>\n<li>\n<a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://netinventors.de\">Net Inventors GmbH</a>\n</li>\n</ul>\n","installationManual":"<h2>Installation</h2>\n<p>Installation via plugin manager</p>\n<p>You can find more information online in the <a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://shopware6.io.netinventors.de/plugins/NetiNextAdminTools/en/\">manual</a>.</p>\n","shortDescription":"Display of articles in the category tree, search filter for products, orders and customers, login to customer account, payment & shipping method in the order overview.","highlights":"Category tree & dynamic product groups in product overview\nNotes for products, customers and orders\nCombinable search filters for products, orders and customers with storage option for your own account, all users, or for specific roles\nReceipt and document overview with the option of filtering, downloading and sending the documents by e-mail\nLogin to customer account (log in as customer)","features":"Open the product in the frontend in the respective sales channel from the product detail\nDisplay of the number of products in a category in the category tree\nDisplay of the category status (active / inactive) in the category tree\nDirect link in an order to the customer profile\nFilter for document and receipt number in orders\nDisplay of the payment and shipping method in the order overview\nDisplay of payment, order and delivery status as well as the invoice number in the customer detail view\nFlow trigger enabled for customer account\nFlow trigger disabled for customer account\nSend order documents via e-mail to the customer, administrator or other recipients."}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160939,"bookingKey":"Neti846166253478","bookingText":"Product category tree & product search filter - AdminTools","price":129,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160938,"bookingKey":"Neti846166253478_M","bookingText":"Product category tree & product search filter - AdminTools","price":10,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsQ50EN","preview":true,"priority":1000,"id":120307},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiOWiBI","preview":false,"priority":950,"id":120286},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbUKiw6","preview":false,"priority":940,"id":120287},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHlNvVK","preview":false,"priority":930,"id":120288},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxLjB7M","preview":false,"priority":920,"id":120289},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphByAXI","preview":false,"priority":910,"id":120290},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6wMCs4","preview":false,"priority":900,"id":120291},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphzBtCM","preview":false,"priority":890,"id":120292},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRt7BYF","preview":false,"priority":880,"id":120293},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9A32hA","preview":false,"priority":870,"id":120294},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpS2nE02","preview":false,"priority":860,"id":120295},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMwfpbJ","preview":false,"priority":850,"id":120296},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpokJ7B7","preview":false,"priority":840,"id":120297},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZ7oRgJ","preview":false,"priority":830,"id":120298},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvwQwaa","preview":false,"priority":825,"id":120299},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuiOTle","preview":false,"priority":820,"id":120300},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpblLh40","preview":false,"priority":750,"id":120302},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjyFgas","preview":false,"priority":700,"id":120303},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDsDciC","preview":false,"priority":10,"id":120305},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdgzVOO","preview":false,"priority":0,"id":120301}],"comments":[{"authorName":"Mario Müller","text":"Sorry, normal hasse ich solche Modewörter, aber hier trifft es ausnahmsweise mal wirklich zu.\nOhne dieses Plugin ist Shopware 6 so gut wie unbrauchbar.\nWobei ich das leider gleich mal mit einer fetten Kritik an Shopware verbinden muss: Wie kann es sein, dass die angeblich tollste, beste und nebenbei mit 2500 Euro auch nicht grade billige Shopsoftware diese Funktion nicht schon von Haus aus hat???","headline":"Ein absolutes must have...","creationDate":{"date":"2020-10-11 18:50:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Produktkategoriebaum, Produktsuchfilter, als Kunde einloggen - AdminTools","description":"<p>Wer als Shop-Betreiber im Shopware 6 Admin Produkte bearbeiten möchte, kann sich diese derzeit nur\nin Form einer großen Produktliste anzeigen lassen und nach den Produktnamen suchen. Bei kleinen Onlineshops lässt sich\ndas gut händeln, bei Shops mit mehreren hundert oder sogar tausend Artikeln wird jede Bearbeitung allerdings enorm\naufwendig. Die aus Shopware 5 bekannte <strong>Anzeige der Artikel im Kategoriebaum</strong> ist aktuell nicht möglich – ist der\ngenaue Name eines Produkts oder die Kategorie nicht bekannt, hilft aktuell nur die zeitaufwändige Suche über das\nFrontend.</p>\n<p>Hier setzt das Plugin an, wir haben die aus Shopware 5 bekannte <strong>Ansicht als Kategoriebaum</strong> implementiert, sodass du ab sofort wieder\n<strong>auf eine Kategorie klicken</strong> und dir sämtliche dieser <strong>Kategorie zugewiesenen Produkte anzeigen</strong> lassen kannst. Der\nKategoriebaum gibt zusätzlich Auskunft über die <strong>Anzahl der zugewiesenen Produkte</strong> und den aktuellen <strong>Status der Sichtbarkeit</strong> der\nKategorie – so siehst du sofort, ob eine Kategorie deaktiviert oder aktiviert ist.</p>\n<p>Ein weiteres Highlight ist der hochflexible <strong>Filter</strong>, den du bei der <strong>Suche</strong> von Produkten, Bestellungen und Kunden einsetzen kannst.\nDu möchtest alle Bestellungen suchen, die einen bestimmtem Lieferstatus haben, in einem beliebigen Zeitraum erstellt wurden und ein bestimmtes Produkt enthalten? Mit dem <strong>Suchfilter</strong> kein Problem.\nEs stehen jeder Entität (Produkte, Bestellungen, Kunden) alle Eigenschaften zur verfügung, die gefiltert werden können.</p>\n<p>Oft ist es notwendig zu sehen, was dein Kunde sieht. Mit der Funktion <strong>„Als Kunde einloggen“</strong> kannst du dich im Frontend als Kunde anmelden.</p>\n<p>Um einen schnelleren <strong>Überblick</strong> in deinen <strong>Bestellungen</strong> zu erhalten, haben wir die Spalten „<strong>Zahlungsart</strong>“\nund „<strong>Versandart</strong>“ ergänzt. In der Bestellung ist es nun ebenfalls möglich mit einem Klick direkt zum Kundenprofil zu\ngelangen.</p>\n<p><strong>AdminTools ist das Standard-Plugin für Shopware 6, mit dem du deine Arbeit am Onlineshop unkompliziert ausführen kannst und dabei viel Zeit sparst.</strong></p>\n<h2>Das sagen unsere Kunden:</h2>\n<p><em>Bin begeistert vom SW6 Plugin AdminTools – genau das was wir brauchen, um unseren großen Katalog zu managen. Gerade die\nFilterfunktion ist mächtig und flexibel. (ML 11/2020)</em></p>\n<h3>FAQ</h3>\n<h4>Kompatibilität</h4>\n<p>Sofern sich die Funktionalitäten nicht gegenseitig ausschließen, können wir eine Kompatibilität dieses Plugins mit all unseren eigenen Plugins gewährleisten.\nEine Kompatibilität mit Drittanbieter-Plugins, zu denen z. B. auch die Premium-Plugins von Shopware zählen, können wir nicht garantieren.\nFalls es hier Probleme gibt, hilft dir unser Support gerne weiter.\nSelbstverständlich halten wir unsere Plugins mit einer neuen Shopware Version kompatibel.\nHier beziehen wir uns auf die Shopware Community Edition mit Standard Responsive Theme.</p>\n<h4>Support</h4>\n<p>Du benötigst Unterstützung? Gerne hilft dir unser Support Team in deutscher und englischer Sprache kompetent weiter.\nSupport gibts für all unsere kostenpflichtigen Plugins.</p>\n<p>Um eine Supportanfrage zu stellen, verwende entweder deinen Shopware-Account oder nutze unser Support-Portal\nunter https://support.netinventors.de - hier findest du ebenfalls schon viele hilfreiche Informationen.</p>\n<p>Um schnell deine Anfrage zu bearbeiten, stelle folgende Punkte sicher:</p>\n<ol>\n<li>es ist die aktuelle Version für die jeweilige Shopware Version des Plugin installiert</li>\n<li>es liegt eine gültige Subscription des Plugins vor</li>\n<li>das Problem tritt im Shopware Standardtheme und mit deaktivierten Drittanbieterplugins ebenfalls auf</li>\n<li>es wurden keine Änderungen von dir oder Dritten am Plugin vorgenommen</li>\n</ol>\n<p>Wir unterstützen dich dann natürlich trotzdem, berechnen den Support aber nach Aufwand.</p>\n<h4>Testversion</h4>\n<p>Selbstverständlich kannst du all unsere Plugins zunächst einmal für 30 ausführlich Tage testen.\nSchau dir die unterschiedlichen Funktionalitäten an und probiere alles aus, bevor du dich für Miete oder Kauf entscheidest.\nFalls du eine Beratung benötigst stehen wir dir gerne zur Verfügung.\nKontaktiere einfach unseren Support unter https://support.netinventors.de</p>\n<h4>Features</h4>\n<p>Wir entwickeln neue Plugin-Features in der Regel auf Basis der aktuellen Shopware Feature Version.\nDie Produktbeschreibung, Features und Highlights beziehen sich immer für die zum Zeitpunkt des Releases aktuellste Shopware Feature Version.</p>\n<h4>Individuelle Entwicklung</h4>\n<p>Wenn ein Plugin nicht ganz zu deinen Anforderungen passt, dann erweitern oder adaptieren wir es gern nach deinen individuellen Wünschen.\nSelbstverständlich erstellen wir dir auch ein ganz eigenes Plugin.\nNimm hierzu einfach Kontakt mit uns auf und sag uns, was wir für dich tun können.</p>\n<h2>Links</h2>\n<ul>\n<li>\n<a target=\"_blank\" href=\"https://shopware6.io.netinventors.de/plugins/NetiNextAdminTools/de\" rel=\"noreferrer noopener\">Handbuch</a>\n</li>\n<li>\n<a target=\"_blank\" href=\"https://support.netinventors.de/hc/de/requests/new\" rel=\"noreferrer noopener\">Support</a>\n</li>\n<li>\n<a target=\"_blank\" href=\"https://netinventors.de\" rel=\"noreferrer noopener\">Net Inventors GmbH</a>\n</li>\n</ul>","installationManual":"<h2>Installation</h2>\n<p>Installation via Plugin Manager</p>\n<p>Weitere Informationen findest du online im <a target=\"_blank\" href=\"https://shopware6.io.netinventors.de/plugins/NetiNextAdminTools/de/\" rel=\"noreferrer noopener\">Handbuch</a>.</p>","version":"5.2.0","changelog":[{"version":"5.2.0","text":"<ul><li>[#42958] Internal notes can be filtered. It is now more visible when there are notes</li></ul>","creationDate":{"date":"2023-07-17 13:56:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.1","text":"<ul><li>[#42836] Category display fixed</li><li>[#42745] Fixed issue with affiliate code filter in customer list in administration</li></ul>","creationDate":{"date":"2023-06-27 10:09:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.0","text":"<ul><li>[#42713] Internal notes can now be written for products, orders and customers in the administration</li></ul>","creationDate":{"date":"2023-06-07 14:50:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.1","text":"<ul><li>[#42634] Added missing coiled source files</li></ul>","creationDate":{"date":"2023-05-22 16:37:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.0","text":"<ul><li>[#42424] Compatibility with Shopware 6.5</li></ul>","creationDate":{"date":"2023-05-02 11:26:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.15.1","text":"<ul><li>[#42836] Category display fixed</li><li>[#42745] Fixed issue with affiliate code filter in customer list in administration</li></ul>","creationDate":{"date":"2023-06-27 10:01:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.15.0","text":"<ul><li>[#42527] Adjusted the loaded context for the flow events</li><li>[#42074] Internal notes can now be written for products, orders and customers in the administration</li></ul>","creationDate":{"date":"2023-06-07 14:42:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.14.1","text":"<ul><li>[#42456] Adjusted filter for tags, creation and update date</li></ul>","creationDate":{"date":"2023-04-24 15:50:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.14.0","text":"<ul><li>[#42077] Added context menu link in product category tree</li></ul>","creationDate":{"date":"2023-03-09 10:31:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.13.1","text":"<ul><li>[#41987] The customer's shopping cart is no longer deleted when logging in from the administration</li></ul>","creationDate":{"date":"2023-03-02 10:13:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.13.0","text":"<ul><li>[#41749] Manuellen Versand der Dokumente aus der Bestellung ermöglicht</li><li>[#41947] Fixed issue with boolean filters in the administration</li></ul>","creationDate":{"date":"2023-02-09 13:42:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.12.1","text":"<ul><li>[#41915] Fixed compatibility issues with Amazon Pay</li></ul>","creationDate":{"date":"2023-01-30 16:04:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.12.0","text":"<ul><li>[#41730] Documents can be sent manually</li></ul>","creationDate":{"date":"2022-12-21 12:45:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.11.1","text":"<ul><li>[#41014] Fixed filter siderbar</li></ul>","creationDate":{"date":"2022-08-30 10:18:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.11.0","text":"<ul><li>[#40581] Fixed issue with filter badge count from shopware</li><li>[#40495] New product filter \"properties\"</li></ul>","creationDate":{"date":"2022-06-16 11:31:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.10.1","text":"<ul><li>[#40505] Fixed compatibility issue with flow events</li></ul>","creationDate":{"date":"2022-05-30 12:50:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.10.0","text":"<ul><li>[#40451] Added flow events for activation/deactivation of a customer</li></ul>","creationDate":{"date":"2022-05-30 09:46:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.9.0","text":"<ul><li>[#40368] Added new columns to order list at customer: payment status, delivery status &amp; invoice number</li></ul>","creationDate":{"date":"2022-05-18 11:17:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.8.0","text":"<ul><li>[#40161] Extended product filter for empty associations</li><li>[#40249] Added tags to the filter</li></ul>","creationDate":{"date":"2022-04-27 12:00:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.7.2","text":"<ul><li>[#40209] Fixed compatibility with SW 6.4.10.0</li></ul>","creationDate":{"date":"2022-04-20 11:26:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.7.1","text":"<ul><li>[#39946] Fixed issue in administration with manufacturer creation</li></ul>","creationDate":{"date":"2022-03-17 17:28:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.7.0","text":"<ul><li>[#35148] Manufacturer area - display of the products</li></ul>","creationDate":{"date":"2022-02-21 14:24:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.6.0","text":"<ul><li>[#39393] Save orders filter</li><li>[#39394] Save customers filter</li></ul>","creationDate":{"date":"2022-02-10 10:59:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.2","text":"<ul><li>[#39447] Fixed compatibility issue with SW 6.4.7.0</li></ul>","creationDate":{"date":"2022-01-26 16:58:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.1","text":"<ul><li>[#39387] Fixed missing translations</li><li>[#39388] Fixed a problem with saving the filters</li></ul>","creationDate":{"date":"2022-01-18 14:37:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.5.0","text":"<ul><li>[#35132] New function: Filters can now be saved</li></ul>","creationDate":{"date":"2022-01-10 14:33:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.4.0","text":"<ul><li>[#39216] Added document overview in administration</li></ul>","creationDate":{"date":"2022-01-05 17:18:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.2","text":"<ul><li>[#39256] Improved search for documents in the document filter</li></ul>","creationDate":{"date":"2021-12-17 14:45:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.1","text":"<ul><li>[#39196] Improved search for documents in the document filter</li></ul>","creationDate":{"date":"2021-12-16 13:52:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.0","text":"<ul><li>[#38233] The selection of the category tree in the product overview is now remembered</li><li>[#39139] New filter in order list: documents</li></ul>","creationDate":{"date":"2021-12-09 16:09:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.2","text":"<ul><li>[#38879] Fixed a bug with categories without a dynamic product group</li></ul>","creationDate":{"date":"2021-11-15 14:11:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.1","text":"<ul><li>[#38750] Improved implementation of the product filter</li></ul>","creationDate":{"date":"2021-10-25 16:53:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.0","text":"<ul><li>[#38542] Error with filter function in the administration fixed</li><li>[#38348] New function: Filter by dynamic product group in product overview</li></ul>","creationDate":{"date":"2021-10-06 17:33:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.1","text":"<ul><li>[#37497] Fixed a bug where the order overview was broken if an order existed without a delivery type.</li></ul>","creationDate":{"date":"2021-06-09 22:01:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.0","text":"<ul><li>[#36345] Added ACL for \"Login as customer\"</li></ul>","creationDate":{"date":"2021-05-26 20:56:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<ul><li>[#37243] Shopware 6.4.x Compatibility</li></ul>","creationDate":{"date":"2021-05-18 10:54:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.7","text":"<ul><li>[#38879] Fixed a bug with categories without a dynamic product group</li></ul>","creationDate":{"date":"2021-11-15 14:02:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.6","text":"<ul><li>[#38750] Improved implementation of the product filter</li></ul>","creationDate":{"date":"2021-10-25 16:42:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.5","text":"<ul><li>[#38526] Function \"Login as customer\" extended by domain selection</li></ul>","creationDate":{"date":"2021-10-06 17:19:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.4","text":"<ul><li>[#37497] Fixed a bug where the order overview was broken if an order existed without a delivery type.</li></ul>","creationDate":{"date":"2021-06-09 21:52:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.3","text":"<ul><li>[#36645] Date filter optimised</li></ul>","creationDate":{"date":"2021-02-17 18:46:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.2","text":"<ul><li>[#36479] Added a filter for the payment method to the orders</li><li>[#36522] Added delivery and payment status</li><li>[#36516] Fix filter styling</li><li>[#36342] Product filter category with dynamic product group does not work</li></ul>","creationDate":{"date":"2021-01-27 16:29:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.1","text":"<ul><li>[#36482] Disabled the login for guest customers</li><li>[#36408] Open product in SalesChannel did not work correctly when shop is installed in subfolder</li><li>[#36476] Sidebar with fix</li></ul>","creationDate":{"date":"2021-01-25 20:04:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"<ul><li>[#35342] Added filter to the customers view</li><li>[#35343] Added filter to the orders</li><li>[#36445] Code fixes</li></ul>","creationDate":{"date":"2021-01-18 17:46:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.1","text":"<ul><li>[#36236] Fixed cache issue with product count in category tree</li><li>[#36344] Fixed an issue with \"Login as customer\" on version 6.3.4.0</li></ul>","creationDate":{"date":"2021-01-13 16:26:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"<p>[#36134] Added \"Login as customer\"-function in customer overview</p><p>[#36196] Added a link to the user profile in the order details</p><p>[#36224] New columns for the overview of orders</p><p><br /></p>","creationDate":{"date":"2020-12-14 10:49:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.1","text":"<p>[#35810] New condition for the product filter: manufacturer number</p>","creationDate":{"date":"2020-11-09 18:49:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"<p>[#35581] New product filter: Products without categories</p>","creationDate":{"date":"2020-10-12 14:43:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.1","text":"<p>[#35293] Styling of condition tree in product filter</p>","creationDate":{"date":"2020-10-05 17:36:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"<p>- [#35293] Added product preview link in administration</p>","creationDate":{"date":"2020-09-21 18:42:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<p>[#35202] Added number of articles in the overview of the categories</p><p>[#35345] Implemented display of the category status</p>","creationDate":{"date":"2020-09-14 17:37:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>[#35130] Shopware 6.3 Compatibility</p>","creationDate":{"date":"2020-08-25 14:58:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>[#34877] First release for SW 6</p>","creationDate":{"date":"2020-08-25 14:57:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Neti846166253478","redirectToStore":false,"lowestPriceValue":10}