{"id":12284,"name":"NenoVisualMailEditor","code":"Neno100259496702","lastChange":{"date":"2023-07-18 11:16:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfkv1cd","examplePageUrl":"","moduleKey":"NenoVisualMailEditor","creationDate":{"date":"2020-09-03 22:28:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-09-11 16:02:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-01 16:25:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2816,"prefix":"Neno","name":"neno","website":"//neno-digital.io","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2816_neno_hersteller_logo_Zeichenfl%C3%A4che+1.jpg"},"infos":[{"id":19533,"name":"Visual Mail Editor","description":"<p>Mit dem Visual Mail Editor können Sie im Handumdrehen anspruchsvolle und responsive E-Mail-Templates für transaktionale Mails über einen Drag and Drop Editor erstellen.</p>","installationManual":"<h2>App installieren</h2><p>Kleiner Shopware 6.4.x: Installieren und aktiveren Sie die App über Einstellungen &gt; System &gt; Plugins.<br></p><p>Ab Shopware 6.4.x: Installieren und aktiveren Sie die App über Erweiterungen &gt; Meine Erweiterungen.<br></p><p><br></p><h2>Nach der Installation</h2><p><br></p><p></p><h4>Template Designer</h4><p>Der Template-Designer ist das Hauptwerkzeug um E-Mai-Templates visuell zu erstellen und zu bearbeiten.</p><p><br></p><p>Der Template-Designer erweitert die Standard E-Mail-Template Ansicht der Shopware-Administration.</p><p>Um den Template Designer zu öffnen, wechseln Sie daher in die E-Mail-Template Übersicht (Einstellungen &gt; Shop &gt; E-Mail-Templates).<br></p><p>Nun wählen Sie ein Template aus der Liste, das Sie bearbeiten wollen aus oder erstellen ein neues E-Mail-Template des gewünschten Typs.<br></p><p>In der Bearbeiten-Ansicht des Templates finden Sie eine neue Sektion mit dem Namen \"Visual Mail Editor\". In der Sektion befindet sich die Schaltfläche \"Designer öffnen\".&nbsp;</p><p>Betätigen Sie die Schaltfläche und der Template Designer öffnet sich.</p><p><br></p><p>Öffnen Sie den Designer zum ersten mal in diesem Template, wird automatisch das Visual Mail Editor Default Theme für den ausgewählten Template-Typ und die ausgewählte Sprache geladen.</p><p><br></p><p><br></p><p>Nach der Installation und Aktivierung der App wird außerdem die Einstellungsseite der Shopware-Administration um den Haupt-Navigationspunkt \"Visual Mail Editor\" erweitert. Öffnen Sie den Menüpunkt Visual Mail Editor haben Sie Zugriff auf die zwei zusätzlichen Module \"Theme installer\" und \"Probleme beheben\":<br></p><p><br></p><h4>Theme Installer</h4><p>Wollen Sie direkt mit den vorgefertigten Templates, die dem Visual Mail Editor beiliegen starten, können sie hier direkt alle Templates installieren und für den Mail-Versand aktivieren.</p><p>Wählen Sie hierzu die Verkaufskanäle, welchen die Templates zugeordnet werden sollen aus der Liste aus und bestätigen die Schaltfläche \"Default Theme installieren &amp; zuweisen\".</p><p></p><p>Alle Templates werden nun in den Sprachen Deutsch und Englisch installiert.</p><p><br></p><p>Das Default Theme ist eine Responsive-Adaption der Shopware Standard Mail-Templates, die durch Features des Visual Mail Editors erweitert wurden.</p><p>Das Theme besteht aus 25 Templates, in deutsch und englisch übersetzt. Das Theme dient als Einstiegspunkt für ihre individuellen Anpassungen.</p><p><br></p><p>Nach der Installation stehen alle installierten Templates unter Einstellungen &gt; Shop &gt; E-Mail-Templates bereit. Die installierten Templates haben die Beschreibung \"Visual Mail Editor Basis/Default Theme\".</p><h4><br></h4><h4>Probleme beheben</h4><p>Im Modul \"Probleme beheben\" werden die Templates, basierend auf der installierten Shopware-Version, automatisch nach Problemen in den angelegten Templates durchsucht. Werden Probleme gefunden, erscheint die Schaltfläche \"Probleme beheben\". Mit Klick auf die Schaltfläche werden alle gefundenen Probleme automatisch behoben.</p><p><br></p><p>Zusätzlich werden Optimierungsvorschläge für Ihre Templates angezeigt, die Sie wahlweise applizieren können.</p><p><br></p><h2>Hinweise</h2><p></p><ul><li>Erstellen Sie ein neues Template, finden Sie in der Sektion \"Visual Mail Editor\" einen Hinweis, dass Sie das Template zuerst speichern müssen bevor Sie den Designer öffnen können.<br>Füllen Sie alle erforderlichen Daten des Mail Templates aus und speichern Sie das Mail Template. Sie werden zur Bearbeiten-Ansicht weitergeleitet.<br>In der Karte \"Visual Mail Editor\" taucht nun die Schaltfläche \"Designer öffnen\" auf. Betätigen Sie die Schaltfläche öffnet sich der Designer.<br><br></li><li>Wollen Sie ein Shopware Standard Template bearbeiten finden Sie in der Sektion \"Visual Mail Editor\" einen Hinweis, dass Sie das Standard Template nicht direkt bearbeiten können.<br>Ihnen wird über die Schaltfläche \"In neuem Template öffnen\" die Option gegeben, in einer Kopie des Templates fortzufahren ohne das Standard-Template zu überschreiben.<br>Klicken Sie auf diese Schaltfläche wird eine Kopie des Templates erstellt und der Designer öffnet sich automatisch.</li></ul><br><ul><li>Die Standard Textfelder für HTML und Plain-Text sind nach der Installation in allen Templates außer den Shopware Standard Templates nicht mehr beschreibbar,<br>sondern dienen nur noch als Ausgabefeld von Code, den der Designer automatisch generiert.<br><br></li><li>Wenn Sie aus der Listen-Ansicht ein Shopware-Standard-Template duplizieren, wird der System-Standard-Wert nicht entfernt, dies führt dazu das sie aufgefordert werden den Designer in einem neuen Template zu öffnen.<br>Öffnen Sie daher direkt die Bearbeiten-Ansicht des Standard-Templates und nutzen die Schaltfläche In neuem Template öffnen\" um eine Kopie zu erstellen.</li></ul><p><br></p><p></p><ul><li>Für die Vorschau-Funktion muss mindestens eine Bestellung im System vorliegen.</li></ul><p><br></p><h2>Dokumentation</h2><p><br></p><p>Eine ausführliche Dokumentation finden Sie unter:&nbsp;<a href=\"https://apps.neno-digital.io/visual-mail-editor/help\" target=\"_blank\" rel=\"noreferrer\">https://apps.neno-digital.io/visual-mail-editor/help</a></p><p></p><p></p><p></p><p></p>","shortDescription":"Mit dem Visual Mail Editor können Sie im Handumdrehen anspruchsvolle und responsive E-Mail-Templates für transaktionale Mails über einen Drag and Drop Editor erstellen.","highlights":"Einfaches Drag &amp; Drop Interface\nBeinhaltet 25 Standard-Templates mit Deutscher und Englischer Übersetzung\nVersandgetreue Vorschau ihres Template-Entwurfs mit ihren Shop-Daten direkt im Designer\nBasiert auf dem Mjml-Kern, um eine Darstellung responsiver Mails auf einer Vielzahl an Geräten zu ermöglichen\nErweiterung der verfügbaren Datensätze u.a. Cover-Bilder in Bestellbestätigungen","features":"Jede Komponente ist im Detail anpassbar\nWhat You See Is What You Get - Der Editor minimiert die Abweichung zwischen Ihrem Design und was Kunden sehen\nResponsive Vorschau - Testen und entwickeln Sie Ihre Designs auf 3 Geräte-Größen\nFür Templates mit komplexeren Verhalten stehen vorgefertigte Presets zur Verfügung, die einfach von Ihnen angepasst werden können\nBilder direkt aus der Medienverwaltung laden.\nVariablen können einfach aus einer Auflistung in Ihre Texte eingefügt werden\nEs werden nur Variablen angezeigt die auch wirklich an den Template-Typ übergeben werden\nDas beste aus zwei Welten - Mischen Sie Code mit visuellen Elementen für fortgeschrittene Anwendungsfälle\nIn Code definierte Variablen können in visuellen Elementen ausgewählt werden\nAutomatische Generierung von Plain-Text\nDer Code wird Client-Seitig erzeugt und schont so ihre Server-Ressourcen\nKeine externen API-Anfragen"},{"id":19534,"name":"Visual Mail Editor","description":"<p>With the Visual Mail Editor you can create advanced responsive mail layouts for transactional mail templates, with no hassle, via a simple drag and drop interface.</p>","installationManual":"<h2>App installation</h2><p>Priror to Shopware 6.4.x: Install and activate the app via Settings &gt; System &gt; Plugins.<br></p><p>Since Shopware 6.4.x: Install and activate the app via Extensions &gt; My Extensions.</p><p><br></p><h2>After the installation</h2><p><br></p><p></p><h4>Template Designer</h4><p>The Template-Designer is the main tool to create and edit your email templates visually.</p><p><br></p><p>The Template-Designer extends the default email template view in the shopware administration.</p><p>To open the designer, navigate to shopwares default email template overview (Settings &gt; Shop &gt; Email templates).<br></p><p>Then choose a template from the list, that you want to edit, or create a new email template of the desired type.<br></p><p>You will find a new section with name \"Visual Mail Editor\" in the edit-view of the template. Inside the section is a button called \"Open Designer\".&nbsp;</p><p>Click the button to open the Template Designer.</p><p><br></p><p>If you open the designer for the first time, the Visual Mail Editor default theme for the selected template type will be opened as a starting point.</p><p><br></p><p><br></p><p>After the installation and activation of the app, the shopware administrations settings page will be updated with a new main navigation entry called \"Visual Mail Editor\":</p><p>Via the new menu entry you have access to the two additional modules \"Theme installer\" and \"Problem solving\":</p><p><br></p><h4>Theme Installer</h4><p>After the app installation you will find a new settings entry in the shop settings (Settings &gt; Shop) called \"Visual Mail Editor Theme Installer\".<br></p><p>If you want to start directly with the Visual Mail Editor Default Theme, here you are able to install all templates that ship with Visual Mail Editor and automatically assign them as the outgoing mail templates.</p><p>To install all templates, first choose the sales channels, that should be assigned to all installed templates and start the installer process with the button \"Install &amp; Assign Default Theme\".</p><p></p><p>All templates will be installed in the languages English and German.</p><p><br></p><p>The Default Theme is an responsive adaption of the default shopware mail templates, that is extended with Visual Mail Editor features.</p><p>The theme holds 25 templates, translated in English and German language. It serves well as an entry point for your individual customizations.</p><p><br></p><p>After the theme installation, all installed templates will be available via&nbsp; Settings &gt; Shop &gt; Email templates. The installed templates have the description \"Visual Mail Editor Default Theme\".</p><p><br></p><h4>Problem Solving</h4><p>In the module \"Problem Solving\", templates will be automatically searched for problems based on your currently installed shopware version.</p><p>If any problems will be encountered, the button \"Solve problems\" appears. When this button is clicked, all found problems will be automatically fixed.</p><p><br></p><p>Additionally, the module displays optimization advice for your templates. Optimizations can also be automatically applied to your templates, either selectively or in bulk.</p><p><br></p><h2>Further remarks</h2><p></p><ul><li>If you create a new template, you will find a notice in the section \"Visual Mail Editor\", prompting you to save your template before it can be opened in the Designer.<br>Fill all required fields of the mail template with your data and save it. You will be redirectet to the templates edit view.<br>Now, in the section \"Visual Mail Editor\", the button \"Open Designer\" appears. Click the button to start editing the template in the Designer.<br><br></li><li>If you want to edit a Shopware default template, you will find a notice in the \"Visual Mail Editor\" section, stating you can't edit the template directly.<br>The \"Open in new template\" button gives you the option of continuing with a copy of the template without overwriting the standard template.<br>If you click on this button, a copy of the template is created and the Designer opens automatically in the duplicated template.<br><br></li><li>The standard text fields for HTML and plain text cannot be written to in any of the templates that are not Shopware default templates.<br>Instead, they only serve as an output field for code that is generated by the designer.<br><br></li><li>If you duplicate a Shopware default template from the list view, the system standard value is not removed; this means that you are prompted to open the designer in a new template. <br>Therefore open the edit view of the standard template directly and use the button \"Open in new template\" to create a copy.</li></ul><p><br></p><p></p><ul><li>There needs to be at least one order in the system, for the preview function to work properly.</li></ul><p></p><p></p><p></p><p></p>","shortDescription":"With the Visual Mail Editor you can create advanced responsive mail layouts for transactional mail templates, with no hassle, via a simple drag and drop interface.","highlights":"Easy Drag and Drop Interface\nIncludes 25 Basic Templates with English and German translations,\nInstant preview of templates with your own shop data right in the designer\nBased on Mjml core, to allow for responsive mails, that work on a wide variety of devices\nExtends the available data sets e.g adds product cover images to order confirmation mails","features":"Every component is adjustable in detail - Wide variety of configuration options with nearly infinite combinations\nWhat You See Is What You Get - The editor minimizes discrepancy between your design and what customers receive\nResponsive preview - Check your design on different device sizes\nMost templates with more complex bahviour have ready-made presets available, that can be customized by you\nImages are selectable directly from shopware media\nInsert variables into your text and components from a list\nOnly variables, that are available for the respective template type are selectable\nBest of both worlds - Mix code and visual elements for advanced use cases\nVariables defined in code can be selected in visual elements\nAutomatic plain text and HTML generation\nCode generation on client-side reduces server load\nNo external APIs are called"}],"addons":["highlightInListing"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":161075,"bookingKey":"Neno100259496702","bookingText":"Visual Mail Editor","price":245,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":168696,"bookingKey":"Neno100259496702_M","bookingText":"Visual Mail Editor","price":24.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168697,"bookingKey":"Neno100259496702_M12","bookingText":"Visual Mail Editor","price":245,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplQFD1F","preview":true,"priority":10,"id":48603},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe0KOCh","preview":false,"priority":8,"id":48597},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEkhnsU","preview":false,"priority":8,"id":48598},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptXfN4T","preview":false,"priority":6,"id":48599},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqkQSxW","preview":false,"priority":4,"id":48606},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpF3B8TU","preview":false,"priority":0,"id":48601}],"comments":[{"authorName":"Carlo H","text":"Wir nutzen das Plugin bereits seit einiger Zeit und sind sehr zufrieden. Eine einfachere Möglichkeit, anschauliche und professionelle Mail Templates zu bauen, gibt es nicht. Der Support reagiert extrem schnell. Nach dem letzten Patch (Version 1.4.1) gab es Probleme mit dem Mailversand (konnte glücklicherweise mit deaktiviertem Plugin umgangen werden)... Noch am gleichen Abend, nur wenige Stunden nach unserer Ticket-Erstellung, war das Problem behoben und der neue Patch 1.4.2 verfügbar.  Verdiente 5 Stars. :)","headline":"Super Plugin mit tollen Möglichkeiten - extrem schneller Service","creationDate":{"date":"2023-07-13 08:56:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"TorbenJ","text":"Completely takes the pain out of creating beautiful customer emails, including order confirmations with images and text well aligned and looking great. It is clear that a lot of thought went into making this user friendly. Also had a support request regarding inserting tracking link, which was possible out of the box with a bit of guidance from developer. Support was friendly and fast. Will be happy to buy other plugins from neno in the future.","headline":"Well designed and excellent addition to Shopware 6","creationDate":{"date":"2022-08-24 11:31:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dierk Demelt","text":"Ich bin mit dem Tool sehr zufrieden. Mails können ganz einfach selbst gestaltet werden. Support reagiert schnell .","headline":"Einfach zu bedienen","creationDate":{"date":"2021-12-09 12:40:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Oskar  Boryczka","text":"Die Tickets wurden sehr schnell bearbeitet. \nPlugin funktioniert einwandfrei &amp; sehr zufriedenstellend.","headline":"Super Hilfe und tolles Plugin","creationDate":{"date":"2021-11-10 11:22:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Steven de Haan","text":"Nice module in which you create good email. Only the product image is not showing in the emails. Maybe a bug?","headline":"Nice emails","creationDate":{"date":"2021-11-06 08:43:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"TEAM DR JOSEPH","text":"Wirklich ein Super Plugin, diese Funktionalität würde man sich natürlich in Shopware selbst erwarten. So machen Mail-Templates wieder Spass! 100% weiterzuempfehlen!","headline":"Super Plugin, jeden Cent wert!","creationDate":{"date":"2021-05-06 22:13:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Visual Mail Editor","description":"<p>Mit dem Visual Mail Editor können Sie im Handumdrehen anspruchsvolle und responsive E-Mail-Templates für transaktionale Mails über einen Drag and Drop Editor erstellen.</p>","installationManual":"<h2>App installieren</h2><p>Kleiner Shopware 6.4.x: Installieren und aktiveren Sie die App über Einstellungen &gt; System &gt; Plugins.<br /></p><p>Ab Shopware 6.4.x: Installieren und aktiveren Sie die App über Erweiterungen &gt; Meine Erweiterungen.<br /></p><p><br /></p><h2>Nach der Installation</h2><p><br /></p><p></p><h4>Template Designer</h4><p>Der Template-Designer ist das Hauptwerkzeug um E-Mai-Templates visuell zu erstellen und zu bearbeiten.</p><p><br /></p><p>Der Template-Designer erweitert die Standard E-Mail-Template Ansicht der Shopware-Administration.</p><p>Um den Template Designer zu öffnen, wechseln Sie daher in die E-Mail-Template Übersicht (Einstellungen &gt; Shop &gt; E-Mail-Templates).<br /></p><p>Nun wählen Sie ein Template aus der Liste, das Sie bearbeiten wollen aus oder erstellen ein neues E-Mail-Template des gewünschten Typs.<br /></p><p>In der Bearbeiten-Ansicht des Templates finden Sie eine neue Sektion mit dem Namen \"Visual Mail Editor\". In der Sektion befindet sich die Schaltfläche \"Designer öffnen\". </p><p>Betätigen Sie die Schaltfläche und der Template Designer öffnet sich.</p><p><br /></p><p>Öffnen Sie den Designer zum ersten mal in diesem Template, wird automatisch das Visual Mail Editor Default Theme für den ausgewählten Template-Typ und die ausgewählte Sprache geladen.</p><p><br /></p><p><br /></p><p>Nach der Installation und Aktivierung der App wird außerdem die Einstellungsseite der Shopware-Administration um den Haupt-Navigationspunkt \"Visual Mail Editor\" erweitert. Öffnen Sie den Menüpunkt Visual Mail Editor haben Sie Zugriff auf die zwei zusätzlichen Module \"Theme installer\" und \"Probleme beheben\":<br /></p><p><br /></p><h4>Theme Installer</h4><p>Wollen Sie direkt mit den vorgefertigten Templates, die dem Visual Mail Editor beiliegen starten, können sie hier direkt alle Templates installieren und für den Mail-Versand aktivieren.</p><p>Wählen Sie hierzu die Verkaufskanäle, welchen die Templates zugeordnet werden sollen aus der Liste aus und bestätigen die Schaltfläche \"Default Theme installieren &amp; zuweisen\".</p><p></p><p>Alle Templates werden nun in den Sprachen Deutsch und Englisch installiert.</p><p><br /></p><p>Das Default Theme ist eine Responsive-Adaption der Shopware Standard Mail-Templates, die durch Features des Visual Mail Editors erweitert wurden.</p><p>Das Theme besteht aus 25 Templates, in deutsch und englisch übersetzt. Das Theme dient als Einstiegspunkt für ihre individuellen Anpassungen.</p><p><br /></p><p>Nach der Installation stehen alle installierten Templates unter Einstellungen &gt; Shop &gt; E-Mail-Templates bereit. Die installierten Templates haben die Beschreibung \"Visual Mail Editor Basis/Default Theme\".</p><h4><br /></h4><h4>Probleme beheben</h4><p>Im Modul \"Probleme beheben\" werden die Templates, basierend auf der installierten Shopware-Version, automatisch nach Problemen in den angelegten Templates durchsucht. Werden Probleme gefunden, erscheint die Schaltfläche \"Probleme beheben\". Mit Klick auf die Schaltfläche werden alle gefundenen Probleme automatisch behoben.</p><p><br /></p><p>Zusätzlich werden Optimierungsvorschläge für Ihre Templates angezeigt, die Sie wahlweise applizieren können.</p><p><br /></p><h2>Hinweise</h2><p></p><ul><li>Erstellen Sie ein neues Template, finden Sie in der Sektion \"Visual Mail Editor\" einen Hinweis, dass Sie das Template zuerst speichern müssen bevor Sie den Designer öffnen können.<br />Füllen Sie alle erforderlichen Daten des Mail Templates aus und speichern Sie das Mail Template. Sie werden zur Bearbeiten-Ansicht weitergeleitet.<br />In der Karte \"Visual Mail Editor\" taucht nun die Schaltfläche \"Designer öffnen\" auf. Betätigen Sie die Schaltfläche öffnet sich der Designer.<br /><br /></li><li>Wollen Sie ein Shopware Standard Template bearbeiten finden Sie in der Sektion \"Visual Mail Editor\" einen Hinweis, dass Sie das Standard Template nicht direkt bearbeiten können.<br />Ihnen wird über die Schaltfläche \"In neuem Template öffnen\" die Option gegeben, in einer Kopie des Templates fortzufahren ohne das Standard-Template zu überschreiben.<br />Klicken Sie auf diese Schaltfläche wird eine Kopie des Templates erstellt und der Designer öffnet sich automatisch.</li></ul><br /><ul><li>Die Standard Textfelder für HTML und Plain-Text sind nach der Installation in allen Templates außer den Shopware Standard Templates nicht mehr beschreibbar,<br />sondern dienen nur noch als Ausgabefeld von Code, den der Designer automatisch generiert.<br /><br /></li><li>Wenn Sie aus der Listen-Ansicht ein Shopware-Standard-Template duplizieren, wird der System-Standard-Wert nicht entfernt, dies führt dazu das sie aufgefordert werden den Designer in einem neuen Template zu öffnen.<br />Öffnen Sie daher direkt die Bearbeiten-Ansicht des Standard-Templates und nutzen die Schaltfläche In neuem Template öffnen\" um eine Kopie zu erstellen.</li></ul><p><br /></p><p></p><ul><li>Für die Vorschau-Funktion muss mindestens eine Bestellung im System vorliegen.</li></ul><p><br /></p><h2>Dokumentation</h2><p><br /></p><p>Eine ausführliche Dokumentation finden Sie unter: <a href=\"https://apps.neno-digital.io/visual-mail-editor/help\" target=\"_blank\" rel=\"noreferrer noopener\">https://apps.neno-digital.io/visual-mail-editor/help</a></p><p></p><p></p><p></p><p></p>","version":"1.5.0","changelog":[{"version":"1.5.0","text":"<p></p><ul><li>Compatibility with Shopware 6.5.x.</li><li>Resolves issues with missing variables in variable selection.</li><li>Resolves issues with missing product images in templates sent via Flow Builder.</li></ul>","creationDate":{"date":"2023-04-13 17:09:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p></p><ul><li>Fixes mail delivery issues with version 1.4.1</li></ul>","creationDate":{"date":"2023-07-12 17:23:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p></p><ul><li>Improved variable selection</li><li>Allows editing of raw mail plain/html text in mail template view</li></ul>","creationDate":{"date":"2023-07-07 22:53:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p></p><ul><li>Added support for custom css-classes on most elements.</li><li>Added option for enabling/disabling automatic font loading from google fonts.</li><li>Automatic font loading from google fonts is now disabled by default.</li></ul>","creationDate":{"date":"2023-02-07 13:48:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p></p><ul><li>Added document settings tab, to set the documents title and inbox preview title.</li><li>Added ability to inject custom html into the documents head section.</li><li>Automatic font loading from google fonts.</li></ul>","creationDate":{"date":"2022-07-04 11:50:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p></p><ul><li>Fixes a bug, where missing font-family attributes caused disappearance of text in some email clients.</li><li>Added check for missing font-family attributes to problem-solving-dialog</li></ul>","creationDate":{"date":"2022-06-16 18:25:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p></p><ul><li>Fixes incorrectly translated variables in the preview</li></ul>","creationDate":{"date":"2022-03-07 10:32:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p></p><ul><li>Fixed loading of images in custom presets</li><li>Added default twig filters for variables</li><li>Added code editor to edit and import/export template files</li></ul>","creationDate":{"date":"2022-01-29 14:01:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>Fixed bug where sales channels with no domains will be used for preview data<br /></li></ul>","creationDate":{"date":"2022-01-15 22:12:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p></p><ul><li>Fixed bug with image component, when set to auto width</li><li>Added ability to load other templates of the same type from the left-hand template tray</li><li>Added padding controls for text components</li></ul>","creationDate":{"date":"2021-12-21 20:59:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p></p><ul><li>Fixed administration errors on Shopware 6.4.7.x</li><li>Added error Log to menu</li></ul>","creationDate":{"date":"2021-12-14 12:38:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Fixes inaccessible settings tab in 6.4.4.x<br /></li></ul>","creationDate":{"date":"2021-09-30 17:06:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p></p><ul><li>New settings menu navigation (Added problem-solving dialog)</li><li>Problem-solving-dialog now allows for non-destructive updates of existing templates</li><li>Bugfix: Media selection component now uploads images correctly</li><li>Variable selection now uses live data to derive available variables</li></ul>","creationDate":{"date":"2021-08-02 13:52:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p></p><ul><li>Compatibility to Shopware 6.4.x (exclusively)</li><li>Added option to save custom presets from selected components</li></ul>","creationDate":{"date":"2021-05-26 11:19:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.2","text":"<p></p><ul><li>Bugfix: Promotions and line items with no cover images won't fail mail delivery</li></ul>","creationDate":{"date":"2020-10-28 09:00:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.1","text":"<p></p><ul><li>First version (release for the community store)</li></ul>","creationDate":{"date":"2020-09-04 00:21:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Neno100259496702","redirectToStore":true,"lowestPriceValue":24.99}