{"id":12482,"name":"AcrisPromotionCS","code":"acris64962038916","lastChange":{"date":"2023-07-18 19:10:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdzO8en","examplePageUrl":"","moduleKey":"AcrisPromotionCS","creationDate":{"date":"2020-10-12 10:07:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-10-21 10:28:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-10-12 11:33:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":19906,"name":"Rabatte & Aktionen im Listing, Erlebniswelten und Produktdetailseite anzeigen","description":"<h2>Kurzbeschreibung</h2><p>\nDas Shopware Standard Feature \"Rabatte &amp; Aktionen\" optimal ausnutzen, indem die Aktions-Preise bereits angezeigt werden, bevor diese in den Warenkorb gelegt werden. Ermöglicht es Rabattausweisungen an Produkten bereits im Listing, Erlebniswelten und Produktdetailseiten anzuführen.&nbsp;</p><p><br></p><h2>Funktionsumfang</h2><h3>Anzeige neuer rabattierter Preis im Listing</h3><p>\nDer rabattierte Preis wird an allen Positionen (PÜ, PA, Erlebniswelten) angezeigt und der neu berechnete Streichpreis\nausgewiesen. Im Shopware Admin Bereich kann über die Anzeigeneinstellungen bestimmt werden ob die Rabatte Gruppiert (wie es der Standard vorgibt) oder Positionsbezogen im Warenkorb angezeigt werden sollen. Dies ist für jede Aktion einzeln konfigurierbar. Zusätzlich ermöglich dieses Plugin über einen Button, welcher ebenfalls im Shopware Admin Bereich unter den Anzeigeneinstellungen zu finden ist, die Meldungen der Rabatte beim automatischen Hinzufügen und Entfernen aus dem Warenkorb zu verstecken.\n</p><p>Wenn dieser Button aktiviert ist, erscheint nicht mehr die Meldung\n\"Rabatt \"xy\" wurde dem Warenkorb hinzugefügt\", wennn Produkte dem\nWarenkorb hinzugefügt wurde, sondern die Standard Meldung \"Ein Produkt\nwurde dem Warenkorb hinzugefügt\" wird angezeigt. Somit erscheint auch keine Meldung \"Die Rabattaktion \"xy\" ist nicht länger gültig!\", beim entfernen von Produkten.&nbsp; </p><p><br></p><h2>Nutzung des Plugins <br></h2><h3>Erstellen Sie bitte zuerst eine Aktion mir Rabatt <br></h3><p>Im\nBereich Marketing-&gt; Rabatte &amp; Aktionen -&gt; Aktion anlegen<br></p><p>Hier\nkönnen Sie indivuell ihre eigene Aktion mit selbst gewähltem Rabatt erstellen.&nbsp;</p><p><br></p><p><b>Konfigurations / Einstellungsmöglichkeiten</b></p><p><b>ALLGEMEIN<br></b></p><p><b>- Einstellung<br></b></p><p><b>Name :</b> der Titel welcher in der Storefront angezeigt wird<br></p><p><b>Aktiv:</b> aktiv oder nicht aktiv</p><p><b>Verkaufskanäle:</b> Hier können sie bestimmen bei welchen Vertriebskanäle diese Aktionen und Rabatte angewendet werden sollen</p><p><b>Gültig von und Gültig bis: </b>Hier können Sie bestimmen in welchem Zeitraum Ihre Aktionen gültig sein soll</p><p><b>Anzahl insgesamt: </b>Wie oft (Anzahl) ist es erlaubt die Aktion zu nutzen<b><br></b></p><p><b>Anzhal pro Kunde: </b>Wie oft ist es für den einzelnen Kunden erlaubt, die Aktion zu nutzen <br></p><p><b>Nicht kombinieren mit:</b> Hier können Sie bestimmen ob die Aktion nicht mit anderen <br></p><p><b>- Anzeigeneinstellungen</b></p><p><b>Rabattausweisung im Warenkorb : </b>Gruppiert (Standard) oder Positionsbezogen</p><p>Button um <b>Rabatthinweise beim automatischen Hinzufügen und Entfernen aus dem Warenkorb verstecken&nbsp;</b><b></b></p><p><b>- Aktionscodes: </b>ACHTUNG: Wird ein Aktionscode hinterlegt, wird der Rabatt beim Produkt nicht automatisch im Listing ausgewiesen. <br></p><p><b>BEDINGUNGEN <br></b></p><p><b>Für diese Bedingungen müssen zuerst passenden Regeln im RuleBuilder erstellt werden. <br></b></p><p><b>Zielgruppe: </b>Bestimmen Sie, welche Kunden von dieser Aktion profitieren sollen. <b><br></b></p><p><b>Warenkörbe:</b> Definieren Sie qualifizierte Warenkörbe für diese Rabatt-Aktion. <b><br></b></p><p><b>Qualifizierte Bestellungen: </b>Definieren Sie qualifizierte Bestell-Eigenschaften für die Rabattaktion. <br></p><p><b>RABATTE </b><br></p><p><b>Anwenden auf</b>: Geben Sie an, auf was der Rabatt angewendet werden soll. (Warenkorb, Versandkosten, Gesamtes Set, Set-Gruppe, Warenkorb und Versandkosten) <b><br></b></p><p><b>Oder nur auf ausgewählte Produkte anwednen.<br></b></p><p><b>Art: </b>Wählen Sie zwischen einem prozentualem oder absolutem Rabatt</p><p><b>Wert: </b>Hier geben Sie den prozentualen oder absoluten Wert des Rabattes an</p><p><b>Maximaler Rabattwert: </b>Es ist ebenfalls möglich einen maximalen Rabatwertwert, wie viel maximal abgezogen werden dürfen, zu bestimmen</p><p><br></p><h3>Mögliche Anwendungsszenarien <br></h3><p>Verkaufsförderung ist eine Art Marketingtechnik. Wenn Sie ein Produkt\nhaben, das neu auf dem Markt ist oder nicht viel Aufmerksamkeit erfährt,\ndann können Sie dieses Produkt über Verkaufsförderungsmaßnahmen bei\nKunden bewerben. Sie können verschiedene Techniken verwenden, wie zum\nBeispiel Rabatte auf das Produkt geben oder 1 + 1 kostenlose Exemplare\nanbieten.</p><p>Die häufigste Art von Verkaufsförderung Maßnahmen sind\nVerbraucherrabatte oder Handelsrabatte. Ob E-Commerce-Shops,\nEinzelhandelsgeschäfte oder andere. Der Grund, warum Rabatt am\nhäufigsten verwendet wird, ist, dass er tatsächlich funktioniert!</p><p>Wenn\nes einen Rabatt von 10 % auf das Produkt für den Verbraucher gibt, dann\nwird diese Art der Verkaufsförderung als Verbraucherrabatt bezeichnet.\nWenn es jedoch einen Rabatt von 10 % für den Händler gibt, wenn er bei\ndem Unternehmen einkauft, wird die Verkaufsförderung als Handelsrabatt\nbezeichnet.</p><p>Bei Handelsrabatten kann der Händler den Rabatt an den\nKunden weitergeben oder nicht. Es ist nicht notwendig, dass der Händler\nden Kunden zusätzliche 5 % Rabatt gewährt, wenn er selbst 10 %\nzusätzlichen Rabatt erhält. Viele Händler wissen jedoch, wie wichtig es\nist, ein Umsatzvolumen zu erreichen, weshalb sie Rabatte an die Kunden\nweitergeben, wenn sie Handelsrabatte erhalten.</p><p><br></p><h3>Warum sollte man Rabatte anbieten?</h3><p>Rabatte erfüllen sinvolle Funktionen. Unter anderem ist es möglich damit <br></p><ul><li>den Gewinn zu erhöhen</li><li>neue Kunden anzulocken – Marktanteile steigern</li><li>alte Ware loszuwerden</li><li>schwache Zeiten zu füllen</li><li>die Kundenbindung zu erhöhen</li><li>ein bestimmtes Preisimage zu&nbsp; kommunizieren</li><li>Aufmerksamkeit zu generieren und den Bekanntheitsgrad zu steigern</li></ul><p>Am besten verknüpfen Sie Rabatte &amp; Atktionen&nbsp; mit gewisse Anlässe! Preis- und verkaufspsychologisch betrachtet, ist es sinnvoll, Rabatte\nmit Anlässen oder Aufhängern zu verbinden. Allerdings sind Weihnachten,\nSchulbeginn und Muttertag schon reichlich abgegrast. Damit Ihre Aktion\nauffällt, müssen Sie kreativer sein. Zum Glück mangelt es nicht an\nAnlässen</p><p><br></p><h3>Badge Text und Farbe</h3><p></p><p>Das Aussehen der Badges kann über das Plugin <a href=\"https://store.shopware.com/acris88121129316/produkt-highlights/badges.html\" target=\"_blank\" rel=\"noreferrer\">Produkt Highlights / Badges</a> angepasst werden.<br></p><p><br></p><h2>Zukünftig geplante Features und bekannte Einschränkungen</h2><ul><li><h3>Variantenartikel</h3>Die Preisdarstellung der rabattierten Preise von Variantenartikel ist umgesetzt - es gibt eine Einschränkung: Alle Varianten müssen alle denselben Preis haben.<br><b>Dieses Feature wurde in der aktuellen Version bereits umgesetzt.</b><br></li></ul>","installationManual":"<h3>\nDie Installation des Plugins geht sehr schnell und ist unkompliziert.</h3><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren</li><li>Keine weiter Konfiguration nötig.<br /></li></ul>","shortDescription":"Ermöglicht es, Rabatte & Aktionen bereits im Listing, Erlebniswelten und Produktdetailseiten anzuzeigen. Es wird ein \"ehemaliger\" Verkaufspreis und der \"rabbatierte\" Preis dargestellt.","highlights":"Rabatte und Aktionen in den Übersichtsseiten, auf Erlebniswelten und auf der Produktdetailseite anzeigen\nIdeal für alle, die bereits vor dem Warenkorb die Preisreduzierungen anzeigen wollen (Sales &amp; Conversion Optimierung)\nRabatte positionsbezogen im Warenkorb anzeigen lassen \nRabatthinweise  - Rabatt \"xy\" wurde dem Warenkorb hinzugefügt  - beim Hinzufügen und Entfernen von Produkten im Warenkorb verstecken","features":"Aktionspreise und Rabatte sofort anzeigen (bevor der Artikel in den Warenkorb gelegt wird)\nAnzeige der rabbatierten Preise auf Produkt-Übersichtsseiten, auf Erlebniswelten und auf der Produkt-Detailseite\nAnzeige des rabattierten Preises und Streichpreis (Pseudopreis)"},{"id":19907,"name":"Show discounts & promotions in listing, experience worlds and product detail page","description":"<h3>Brief description</h3>Make the most of Shopware's standard \"Discounts &amp; Promotions\" feature by displaying promotional prices before they are added to the shopping cart. Allows you to display discounts on products already in the listing, experience worlds and product detail pages. <br><br><h3>Functionality</h3>Display new discounted price in listing<br><br>The discounted price is displayed at all positions (PÜ, PA, Experience Worlds) and the newly calculated strike price is shown. In the Shopware admin area, the display settings can be used to determine whether the discounts should be displayed grouped (as the default) or item-related in the shopping cart. This is configurable for each action individually. In addition, this plugin allows a button, which can also be found in the Shopware Admin area under the ad settings, to hide the messages of the discounts when automatically adding and removing from the cart.<br><br>If this button is activated, the message \"Discount \"xy\" has been added to the cart\" will no longer appear when products have been added to the cart, but the standard message \"A product has been added to the cart\" will be displayed. Thus, also no message \"Discount promotion \"xy\" is no longer valid!\", appears when removing products. <br><br><br><h3>How to use the plugin</h3>Please create first a promotion with discount<br>In the area Marketing-&gt; Discounts &amp; Actions -&gt; Create Action<br><br>Here you can individually create your own action with self-selected discount. <br><br><h3>Configuration / Settings</h3><h3>GENERAL</h3><h4>- Setting</h4>Name : the title which will be displayed in the storefront<br>Active: active or not active<br>Sales channels: Here you can specify which sales channels these promotions and discounts should be applied to<br>Valid from and Valid until: Here you can determine in which period your promotions should be valid<br>Total number: How often (number) is it allowed to use the promotion<br>Number per customer: How often is it allowed for the single customer to use the promotion<br>Do not combine with: Here you can determine if the promotion cannot be combined with other<br><br><h4>- Advertisement settings</h4><p>Discount display in the shopping cart: Grouped (default) or by item</p><p>Button to hide discount notices when automatically adding and removing from cart </p><p>- Promotion codes: ATTENTION: If a promotion code is stored, the discount will not be automatically shown on the product in the listing.</p><br><h3>CONDITIONS</h3><p>For these conditions, suitable rules must first be created in the RuleBuilder.</p><p>Target group: Define which customers should benefit from this promotion.</p><p>Shopping carts: define qualified shopping carts for this discount promotion.</p><p>Qualified Purchase Orders: Define qualified order properties for the discount promotion.</p><br><h4>DISCOUNTS</h4><p>Apply to: Specify what the discount should be applied to. (Shopping cart, Shipping costs, Total set, Set group, Shopping cart and Shipping costs).</p><p>Or apply only to selected products.</p><p>Type: Choose between a percentage or absolute discount.</p><p>Value: Here you specify the percentage or absolute value of the discount</p><p>Maximum discount value: It is also possible to specify a maximum discount value, how much can be deducted at most.</p><p><br></p><h3>Possible application scenarios</h3><p>Sales promotion is a kind of marketing technique. If you have a product that is new on the market or not getting much attention, then you can promote this product to customers through sales promotions. You can use different techniques such as giving discounts on the product or offering 1 + 1 free copies.</p><p><br>The most common type of sales promotions are consumer discounts or trade discounts. Whether e-commerce stores, retail stores or others. The reason rebate is most commonly used is because it actually works!<br><br>If there is a 10% discount on the product for the consumer, then this kind of sales promotion is called a consumer discount. However, if there is a 10% discount for the retailer when they purchase from the company, then the sales promotion is called a trade discount.<br><br>With trade discounts, the retailer may or may not pass the discount on to the customer. It is not necessary for the retailer to give the customer an additional 5% discount if the retailer receives an additional 10% discount themselves. However, many retailers know the importance of achieving sales volume, which is why they pass on discounts to customers when they receive trade discounts.<br></p><p><br></p><h3>Why offer discounts?</h3><p>Discounts perform useful functions. Among other things, it is possible to&nbsp;&nbsp;&nbsp; <br></p><ul><li><p>&nbsp;&nbsp;&nbsp; increase the profit</p></li></ul><ul><li>&nbsp;&nbsp;&nbsp; attract new customers - increase market share</li><li>&nbsp;&nbsp;&nbsp; to get rid of old goods</li><li>&nbsp;&nbsp;&nbsp; to fill weak times</li><li>&nbsp;&nbsp;&nbsp; increase customer loyalty</li><li>&nbsp;&nbsp;&nbsp; communicate a certain price image</li><li>&nbsp;&nbsp;&nbsp; to generate attention and increase brand awareness</li></ul><p><br>It is best to link discounts &amp; promotions with certain occasions! From a price and sales psychology point of view, it makes sense to link discounts with occasions or hang-ups. However, Christmas, back-to-school, and Mother's Day have been plenty grazed. To make your promotion stand out, you need to be more creative. Fortunately, there is no shortage of occasions<br></p><p><br></p><h3>Badge text and color<br></h3><p></p><p>The appearance of the badges can be customised via the plugin <a href=\"https://store.shopware.com/en/acris88121129316/product-badges/highlights.html\" target=\"_blank\" rel=\"noreferrer\">Product Highlights / Badges</a>.<br><br></p><h2>Future planned features and known limitations</h2><ul><li><p>&nbsp;&nbsp;&nbsp; Badge text and color</p></li><li>&nbsp;&nbsp;&nbsp; Planned feature: it should be possible to determine a badge text and a badge color during the promotion.</li></ul><p><br></p><h4>Variant article</h4><ul><li>&nbsp;&nbsp;&nbsp; The price display of discounted prices of variant items is implemented - there is one restriction: all variants must all have the same price.<br></li><li>&nbsp;&nbsp;&nbsp; This feature has already been implemented in the current version.</li></ul><p><br></p>","installationManual":"<h3>The installation of the plugin is very fast and uncomplicated.</h3><ul><li>Plugin Manager via Settings &gt; System &gt; Plugins</li></ul><ul><li><p>Upload, install and activate the plugin</p></li></ul>","shortDescription":"Enables you to display discounts & promotions already in the listing, experience worlds and product detail pages. A \"former\" sales price and the \"discounted\" price is displayed.","highlights":"Display discounts and promotions in the overview pages, on experience worlds and on the product detail page\nIdeal for all those who want to display price reductions before the shopping cart (Sales &amp; Conversion Optimization)","features":"Show special prices and discounts immediately (before the article is put into the shopping cart)\nDisplay of discounted prices on product overview pages, on experience worlds and on the product detail page\nDisplay of the discounted price and strike price (pseudo price)"}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161468,"bookingKey":"acris64962038916","bookingText":"Show discounts & promotions in listing, experience worlds and product detail page","price":99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":161467,"bookingKey":"acris64962038916_M","bookingText":"Show discounts & promotions in listing, experience worlds and product detail page","price":9.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHVQugb","preview":true,"priority":0,"id":68775},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2oZr6i","preview":false,"priority":13,"id":50387},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcJGQtO","preview":false,"priority":12,"id":50388},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpt5hc5Z","preview":false,"priority":11,"id":62318},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeK0V6Z","preview":false,"priority":10,"id":62316},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmGa59Z","preview":false,"priority":9,"id":62319},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGut4b0","preview":false,"priority":8,"id":62317},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcOh4XX","preview":false,"priority":7,"id":57557},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEa2avZ","preview":false,"priority":6,"id":62315},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php04iJ0X","preview":false,"priority":5,"id":62314},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYsGWmJ","preview":false,"priority":0,"id":50386},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpALfPDv","preview":false,"priority":0,"id":62320},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVBz9XT","preview":false,"priority":0,"id":62321}],"comments":[{"authorName":"TGU","text":"Super Plugin. Support antwortet extrem schnell bei Rückfragen.","headline":"Super","creationDate":{"date":"2023-04-21 08:27:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Julian","text":"Der Support ist sehr hilfsbereit und antwortet sehr schnell!","headline":"Super Plugin un Super Support!","creationDate":{"date":"2023-03-06 11:19:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"David Jardin","text":"Die Erweiterung tut genau was Sie soll, die Code-Qualität  ist gut und vor allem der Support reagiert schnell und professionell!","headline":"Top Plugin, Top Support","creationDate":{"date":"2022-06-27 13:43:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Vincent Bourgonje","text":"Für uns ist dies ein grundlegendes Plugin, das in einer Basisinstallation von Shopware 6 nicht fehlen sollte. Wenn du Rabattpreise für Produkte mit Marketingrabatten und -aktionen festlegst, möchtest du dies auch in den Produktlisten und -details sehen. Die Standardlösung von Shopware ist hier wirklich zu wenig. Dieses Plugin löst das ohne Probleme und auch der Support ist gut und super schnell.","headline":"Unverzichtbares Plugin mit super Unterstützung","creationDate":{"date":"2022-06-23 15:56:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"O.K.","text":"Der Support ist top, noch am gleichen Tag bekam ich eine Antwort und Hilfe und mein Problem war gelöst. Das Plugin ist in unserem Shop unverzichtbar und leistet genau das, was wir gebraucht haben, nämlich dass bei Rabattaktionen die reduzierten Preise direkt in der Artikelübersicht zu sehen sind und nicht erst im Warenkorb. Sehr gut ist auch die Darstellung im Warenkorb gelöst, dass man entscheiden kann, ob die Reduzierung als Block zu sehen sein soll oder bei jedem Artikel gesondert dargestellt wird. Das erhöht die Transparenz für den Kunden. Wir sind mit dem Plugin sehr zufrieden.","headline":"Sehr zu empfehlen","creationDate":{"date":"2021-06-08 11:04:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Rabatte & Aktionen im Listing, Erlebniswelten und Produktdetailseite anzeigen","description":"<h2>Kurzbeschreibung</h2><p>\nDas Shopware Standard Feature \"Rabatte &amp; Aktionen\" optimal ausnutzen, indem die Aktions-Preise bereits angezeigt werden, bevor diese in den Warenkorb gelegt werden. Ermöglicht es Rabattausweisungen an Produkten bereits im Listing, Erlebniswelten und Produktdetailseiten anzuführen. </p><p><br /></p><h2>Funktionsumfang</h2><h3>Anzeige neuer rabattierter Preis im Listing</h3><p>\nDer rabattierte Preis wird an allen Positionen (PÜ, PA, Erlebniswelten) angezeigt und der neu berechnete Streichpreis\nausgewiesen. Im Shopware Admin Bereich kann über die Anzeigeneinstellungen bestimmt werden ob die Rabatte Gruppiert (wie es der Standard vorgibt) oder Positionsbezogen im Warenkorb angezeigt werden sollen. Dies ist für jede Aktion einzeln konfigurierbar. Zusätzlich ermöglich dieses Plugin über einen Button, welcher ebenfalls im Shopware Admin Bereich unter den Anzeigeneinstellungen zu finden ist, die Meldungen der Rabatte beim automatischen Hinzufügen und Entfernen aus dem Warenkorb zu verstecken.\n</p><p>Wenn dieser Button aktiviert ist, erscheint nicht mehr die Meldung\n\"Rabatt \"xy\" wurde dem Warenkorb hinzugefügt\", wennn Produkte dem\nWarenkorb hinzugefügt wurde, sondern die Standard Meldung \"Ein Produkt\nwurde dem Warenkorb hinzugefügt\" wird angezeigt. Somit erscheint auch keine Meldung \"Die Rabattaktion \"xy\" ist nicht länger gültig!\", beim entfernen von Produkten.  </p><p><br /></p><h2>Nutzung des Plugins <br /></h2><h3>Erstellen Sie bitte zuerst eine Aktion mir Rabatt <br /></h3><p>Im\nBereich Marketing-&gt; Rabatte &amp; Aktionen -&gt; Aktion anlegen<br /></p><p>Hier\nkönnen Sie indivuell ihre eigene Aktion mit selbst gewähltem Rabatt erstellen. </p><p><br /></p><p><b>Konfigurations / Einstellungsmöglichkeiten</b></p><p><b>ALLGEMEIN<br /></b></p><p><b>- Einstellung<br /></b></p><p><b>Name :</b> der Titel welcher in der Storefront angezeigt wird<br /></p><p><b>Aktiv:</b> aktiv oder nicht aktiv</p><p><b>Verkaufskanäle:</b> Hier können sie bestimmen bei welchen Vertriebskanäle diese Aktionen und Rabatte angewendet werden sollen</p><p><b>Gültig von und Gültig bis: </b>Hier können Sie bestimmen in welchem Zeitraum Ihre Aktionen gültig sein soll</p><p><b>Anzahl insgesamt: </b>Wie oft (Anzahl) ist es erlaubt die Aktion zu nutzen<b><br /></b></p><p><b>Anzhal pro Kunde: </b>Wie oft ist es für den einzelnen Kunden erlaubt, die Aktion zu nutzen <br /></p><p><b>Nicht kombinieren mit:</b> Hier können Sie bestimmen ob die Aktion nicht mit anderen <br /></p><p><b>- Anzeigeneinstellungen</b></p><p><b>Rabattausweisung im Warenkorb : </b>Gruppiert (Standard) oder Positionsbezogen</p><p>Button um <b>Rabatthinweise beim automatischen Hinzufügen und Entfernen aus dem Warenkorb verstecken </b><b></b></p><p><b>- Aktionscodes: </b>ACHTUNG: Wird ein Aktionscode hinterlegt, wird der Rabatt beim Produkt nicht automatisch im Listing ausgewiesen. <br /></p><p><b>BEDINGUNGEN <br /></b></p><p><b>Für diese Bedingungen müssen zuerst passenden Regeln im RuleBuilder erstellt werden. <br /></b></p><p><b>Zielgruppe: </b>Bestimmen Sie, welche Kunden von dieser Aktion profitieren sollen. <b><br /></b></p><p><b>Warenkörbe:</b> Definieren Sie qualifizierte Warenkörbe für diese Rabatt-Aktion. <b><br /></b></p><p><b>Qualifizierte Bestellungen: </b>Definieren Sie qualifizierte Bestell-Eigenschaften für die Rabattaktion. <br /></p><p><b>RABATTE </b><br /></p><p><b>Anwenden auf</b>: Geben Sie an, auf was der Rabatt angewendet werden soll. (Warenkorb, Versandkosten, Gesamtes Set, Set-Gruppe, Warenkorb und Versandkosten) <b><br /></b></p><p><b>Oder nur auf ausgewählte Produkte anwednen.<br /></b></p><p><b>Art: </b>Wählen Sie zwischen einem prozentualem oder absolutem Rabatt</p><p><b>Wert: </b>Hier geben Sie den prozentualen oder absoluten Wert des Rabattes an</p><p><b>Maximaler Rabattwert: </b>Es ist ebenfalls möglich einen maximalen Rabatwertwert, wie viel maximal abgezogen werden dürfen, zu bestimmen</p><p><br /></p><h3>Mögliche Anwendungsszenarien <br /></h3><p>Verkaufsförderung ist eine Art Marketingtechnik. Wenn Sie ein Produkt\nhaben, das neu auf dem Markt ist oder nicht viel Aufmerksamkeit erfährt,\ndann können Sie dieses Produkt über Verkaufsförderungsmaßnahmen bei\nKunden bewerben. Sie können verschiedene Techniken verwenden, wie zum\nBeispiel Rabatte auf das Produkt geben oder 1 + 1 kostenlose Exemplare\nanbieten.</p><p>Die häufigste Art von Verkaufsförderung Maßnahmen sind\nVerbraucherrabatte oder Handelsrabatte. Ob E-Commerce-Shops,\nEinzelhandelsgeschäfte oder andere. Der Grund, warum Rabatt am\nhäufigsten verwendet wird, ist, dass er tatsächlich funktioniert!</p><p>Wenn\nes einen Rabatt von 10 % auf das Produkt für den Verbraucher gibt, dann\nwird diese Art der Verkaufsförderung als Verbraucherrabatt bezeichnet.\nWenn es jedoch einen Rabatt von 10 % für den Händler gibt, wenn er bei\ndem Unternehmen einkauft, wird die Verkaufsförderung als Handelsrabatt\nbezeichnet.</p><p>Bei Handelsrabatten kann der Händler den Rabatt an den\nKunden weitergeben oder nicht. Es ist nicht notwendig, dass der Händler\nden Kunden zusätzliche 5 % Rabatt gewährt, wenn er selbst 10 %\nzusätzlichen Rabatt erhält. Viele Händler wissen jedoch, wie wichtig es\nist, ein Umsatzvolumen zu erreichen, weshalb sie Rabatte an die Kunden\nweitergeben, wenn sie Handelsrabatte erhalten.</p><p><br /></p><h3>Warum sollte man Rabatte anbieten?</h3><p>Rabatte erfüllen sinvolle Funktionen. Unter anderem ist es möglich damit <br /></p><ul><li>den Gewinn zu erhöhen</li><li>neue Kunden anzulocken – Marktanteile steigern</li><li>alte Ware loszuwerden</li><li>schwache Zeiten zu füllen</li><li>die Kundenbindung zu erhöhen</li><li>ein bestimmtes Preisimage zu  kommunizieren</li><li>Aufmerksamkeit zu generieren und den Bekanntheitsgrad zu steigern</li></ul><p>Am besten verknüpfen Sie Rabatte &amp; Atktionen  mit gewisse Anlässe! Preis- und verkaufspsychologisch betrachtet, ist es sinnvoll, Rabatte\nmit Anlässen oder Aufhängern zu verbinden. Allerdings sind Weihnachten,\nSchulbeginn und Muttertag schon reichlich abgegrast. Damit Ihre Aktion\nauffällt, müssen Sie kreativer sein. Zum Glück mangelt es nicht an\nAnlässen</p><p><br /></p><h3>Badge Text und Farbe</h3><p></p><p>Das Aussehen der Badges kann über das Plugin <a href=\"https://store.shopware.com/acris88121129316/produkt-highlights/badges.html\" target=\"_blank\" rel=\"noreferrer noopener\">Produkt Highlights / Badges</a> angepasst werden.<br /></p><p><br /></p><h2>Zukünftig geplante Features und bekannte Einschränkungen</h2><ul><li><h3>Variantenartikel</h3>Die Preisdarstellung der rabattierten Preise von Variantenartikel ist umgesetzt - es gibt eine Einschränkung: Alle Varianten müssen alle denselben Preis haben.<br /><b>Dieses Feature wurde in der aktuellen Version bereits umgesetzt.</b><br /></li></ul>","installationManual":"<h3>\nDie Installation des Plugins geht sehr schnell und ist unkompliziert.</h3><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren</li><li>Keine weiter Konfiguration nötig.<br /></li></ul>","version":"6.0.0","changelog":[{"version":"6.0.0","text":"<p>Compatibility established with SW 6.5</p>","creationDate":{"date":"2023-04-19 16:15:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.4","text":"<ul><li>Optimised plugin compatibility.</li></ul>","creationDate":{"date":"2022-12-12 12:01:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.3","text":"<p>- Optimizes ACRIS Rrp service call.</p>","creationDate":{"date":"2022-11-28 13:06:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.1","text":"<ul><li> Performance optimisation on loading the variant prices.</li></ul>\n                                                                                                    <ul><li> Optimizes displaying of the promotion discount for the variants on the listing page.</li></ul>","creationDate":{"date":"2022-10-04 09:48:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.0","text":"<p>Adds a plugin setting for rounding of the percentage discounts.</p>","creationDate":{"date":"2022-08-01 11:25:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.0","text":"- Compatibility with Shopware &gt;= 6.4.10.0.<br /><p>- Adds the lowest price of the last 30 days also for discounted products.</p>","creationDate":{"date":"2022-06-23 15:32:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.11","text":"<p>Fixes problems where the basic price is not calculated correctly for the discounted price.</p>","creationDate":{"date":"2022-06-23 15:26:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.10","text":"<p>Optimizes loading of the promotions with a search term at the promotion list page in Administration.</p>","creationDate":{"date":"2022-06-16 16:29:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.9","text":"<p>Optimizes loading of the products in cart.</p>","creationDate":{"date":"2022-06-15 15:17:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.8","text":"<p>Improvement of plug-in compatibility for graduated prices with lowest price of the last 30 days.</p>","creationDate":{"date":"2022-06-09 13:53:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.7","text":"<p>Performance optimization in the checkout process.</p>","creationDate":{"date":"2022-06-03 07:44:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.6","text":"<p>Improve compatibility with other plugins.</p>","creationDate":{"date":"2022-05-18 15:07:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.5","text":"<ul><li>Optimizes plugin image.</li><li>Improves compatibility with Shopware &gt;= 6.4.10.0.</li></ul>","creationDate":{"date":"2022-04-25 07:19:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.4","text":"<p>Fixes a possible problem with the calculation and display of discounted prices.</p>","creationDate":{"date":"2022-04-11 13:38:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"<p>Fixes a problem where a configured rounding for currencies was not correctly used.</p>","creationDate":{"date":"2021-12-17 10:44:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<p>Fixes a possible problem when loading products where the \"Free shipping\" identifier is not set.</p>","creationDate":{"date":"2021-12-13 09:57:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>Improved the compatibility of item-related discount display in the shopping cart with Shopware &gt;= 6.4.2.0.</p>","creationDate":{"date":"2021-12-03 10:33:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.5","text":"<p>Fixes a problem where a configured rounding for currencies was not correctly used.</p>","creationDate":{"date":"2021-12-17 10:59:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"<p>Fixes a possible problem with the calculation of discounts and promotions for products with a quantity smaller than 1.</p>","creationDate":{"date":"2021-08-27 06:48:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<p>Fixes a problem on removing the inheritance.</p>","creationDate":{"date":"2021-07-05 07:01:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"- Fixes a problem where the additional configurations were not displayed in \"Promotions\".<br /><p>- Optimisation of the storefront display of item-related discounts.</p>","creationDate":{"date":"2021-06-02 07:40:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>Performance optimizations</p>","creationDate":{"date":"2021-06-01 13:13:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"- Compatibility with Shopware 6.4.x.<br /><p>- Optimisation of compatiblity with ACRIS Badge plugin.</p>","creationDate":{"date":"2021-05-25 13:56:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p>Fixes problem of removing the association column on plugin uninstall.</p>","creationDate":{"date":"2021-09-09 11:17:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p>Improve plugin compatibility.</p>","creationDate":{"date":"2021-05-04 14:03:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p>Add promotion Id to the product extension.</p>","creationDate":{"date":"2021-05-03 12:11:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>- Discounts can be grouped</p>\n                                                                                                            <p>- Fix promotion price calculation for products with graduated prices and variants.</p>\n                                                                                                            <p>- Adds the possibility not to display a message when adding discounts.</p>","creationDate":{"date":"2021-03-16 10:19:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>Compatibility with plugin \"ACRIS prevent product order, price display and export\"</p>","creationDate":{"date":"2020-12-03 09:46:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Massive performance improvements</p>","creationDate":{"date":"2020-11-06 11:28:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Optimisation of the price display for price rules</p>","creationDate":{"date":"2020-11-04 11:42:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Discount display also for graduated prices and rule-based prices<br /></li></ul>","creationDate":{"date":"2020-10-30 12:51:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>Erstveröffentlichung, Store Release</li></ul>","creationDate":{"date":"2020-10-12 11:33:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris64962038916","redirectToStore":false,"lowestPriceValue":9.9}