{"id":12576,"name":"WuunderShipping","code":"wuund93935659152","lastChange":{"date":"2023-07-18 11:16:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeuNGbL","examplePageUrl":"","moduleKey":"WuunderShipping","creationDate":{"date":"2020-10-26 14:22:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-07-20 15:49:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-06-24 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-11-04 08:43:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1582,"prefix":"wuunder","name":"Wuunder - Shipping Module","website":"//www.wearewuunder.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1582_logo+wuunder+RGB_128x128.png"},"infos":[{"id":20076,"name":"Wuunder Shipping","description":"<h3>Hallo, wir sind Wuunder!</h3><p>Mit unserem machen wir den Versand Ihrer Post, (Briefkasten-)Pakete, Paletten, (Luft-, See- und Straßen-)Fracht oder anderen Sendungsarten so einfach wie möglich. Das Generieren von Versandetiketten ist für uns nur der Anfang. Wir bieten eine Gesamtlösung für Ihre Versandprobleme.</p><br /><h3>Konto &amp; Preise</h3><p> Beginnen Sie mit der Erstellung eines kostenlosen Wuunder-Kontos unter <a href=\"https://www.wearewuunder.com\" target=\"_blank\" rel=\"noreferrer noopener\">www.wearewuunder.com</a>. Sie können das Modul nach der Anmeldung herunterladen und installieren. Sie sind nicht zum Abschluss von Verträgen verpflichtet. Sie zahlen pro Sendung und falls Sie Ihre eigenen Verträge mit Spediteuren verwenden, zahlen Sie eine Servicegebühr pro Sendung.</p><br /><p>Bevor Sie mit Wuunder beginnen, können Sie unser System in der Staging-Umgebung testen. Auf diese Weise können Sie sicher sein, dass alles richtig funktioniert!</p><br /><h3>Contact</h3><p>Benötigen Sie Hilfe? Wenden Sie sich über <a href=\"https://wearewuunder.com/en/customerconnections/\" target=\"_blank\" rel=\"noreferrer noopener\">https://wearewuunder.com/en/customerconnections/</a>  an unsere Shopware-Entwickler. Sie helfen Ihnen bei Fragen.</p>","installationManual":"<p></p><ul><li>Beginnen Sie mit der Erstellung eines kostenlosen Wuunder-Kontos unter <a href=\"https://www.wearewuunder.com.\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.wearewuunder.com</a>. </li><li>Installation über den Pluginmanager.</li></ul>","shortDescription":"Wuunders Transportmanagement-Service macht den Versand Ihrer Post, (Briefkasten-)Pakete, Paletten, (Luft-, See- und Straßen-)Fracht oder anderen Sendungsarten so einfach wie möglich.","highlights":"Mehrere Buchungen gleichzeitig: Buchen Sie mehrere oder alle Sendungen auf einmal in Wuunder\nEtiketten &amp; Transferlisten: Drucken Sie einfach Versandetiketten und Transferlisten für den Fahrer\nAbholen oder selbst mitbringen:Wuunder sorgt für die Abholung oder Sie können Ihre Sendung zum Paketshop bringen\nSpediteure kombinieren: Sie haben eine Auswahl unter mehr als 300 Optionen\nSorgloser Versand mit Wuunder: Wuunder verfolgt all Ihre Sendungen proaktiv","features":"Importieren Sie alle Ihre Bestell- und Kontaktdaten mit nur einem Klick von xx in das Wuunder-System.\nMit einer Auswahl von mehr als 300 Spediteuren (wie DHL Parcel, DPD, PostNL, GLS, UPS, TNT Express, FedEx, Rhenus oder Red Je Pakketje) wählen Sie immer die beste Versandoption: am selben Tag, am nächsten Tag oder zu einem anderen Zeitpunkt.\nDiese zusätzlichen Versandoptionen verursachen Ihrerseits KEINE zusätzlichen Probleme. Unsere proaktive Kundendienstabteilung wendet sich bei Problemen wie Verzögerungen, Schäden oder falschen Adressen an den Spediteur und den Empfänger. Sie müssen keine Maßnahmen ergreifen! \nVersenden Sie weltweit aus und innerhalb der Niederlande, Belgiens, Frankreichs, Deutschlands und Luxemburgs oder nutzen Sie unseren weltweiten Rückholservice.\nVerwenden Sie Ihre eigenen Spediteurverträge oder wählen Sie die Verträge aus, die Wuunder mit den verschiedenen Carriern hat.\nIn unserem Dashboard finden Sie eine klare Übersicht über alle Ihre Sendungen. Hier können Sie beispielsweise all Ihre Sendungen nachverfolgen. Alle Track &amp; Trace-Informationen sind aber auch in xx verfügbar.\nDie Adressinformationen des Empfängers werden vor dem Senden überprüft, sodass es zu keinen unnötigen Rückgaben kommt.\nMit unserem Paketshop-Locator ist es möglich, Sendungen direkt an einen Paketshop zu senden. Wir zeigen Ihren Kunden die nächstgelegenen Optionen und Öffnungszeiten beim Check-out.\nSie können eine automatische Abholung Ihrer Sendungen (an Ihrem Standort, bei einem Kunden oder Lieferanten / per Drop-Sendung) veranlassen oder einen festen Abholzeitpunkt wählen.\nMit nur einem Klick können Sie alle Versandetiketten drucken und sie auch an den Lieferanten oder Empfänger senden (im Falle einer Rücksendung).\nGenerieren Sie einfach Transferlisten und lassen Sie diese vom Fahrer unterschreiben. Auf diese Weise haben Sie immer den Nachweis, dass Sie Ihre Sendungen beim Spediteur abgegeben haben.\nSie sind nicht zum Abschluss von Verträgen verpflichtet. Sie zahlen pro Sendung undfalls Sie Ihre eigenen Verträge mit Spediteuren verwenden, zahlen Sie eine Servicegebühr pro Sendung.\nDie Scan- und Print-Methode mit Versandschein-Modul führt zu mehr Effizienz im Versandprozess. Mit einem simplen Scanner kann man den Versandschein scannen und direkt das dazugehörige Versandetikett ausdrucken.\nWuunder kann Sie auch bei Ihrer Rechnungsstellung unterstützen. Wir überprüfen Ihre Rechnungen auf Ungenauigkeiten. Auf diese Weise zahlen Sie nie zu viel für Ihre Sendungen.\nSie können ferner unsere Kundendienstabteilung nutzen, um alle Fragen Ihrer Kunden zu beantworten. Auf Anforderung antworten wir mit Ihrem Firmennamen und bearbeiten die Fragen umfassend."},{"id":20077,"name":"Wuunder Shipping","description":"<h3>Hello, We Are Wuunder!</h3><p>We make the shipping of your mail, (letterbox) parcels, pallets, (air, sea &amp; road) freight as easy as possible with our transport management service. Generating shipping labels is just the beginning for us. We offer an overall solution for your shipping concerns.<br /></p><br /><h3>Account &amp; Pricing</h3><p>Start with making a free Wuunder account at <a href=\"https://www.wearewuunder.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.wearewuunder.com</a>. Afterwards, request an API-key for the Shopware on the following page: <a href=\"https://wearewuunder.com/en/contact/\" target=\"_blank\" rel=\"noreferrer noopener\">https://wearewuunder.com/en/contact/</a>. You can download and install the module after signing up. </p><p><br /></p><p>You’re not obliged to any contracts. You’ll be paying per shipment, and if you use your own contracts with carriers, you’ll be paying a service fee per shipment. </p><p>Before you get started with Wuunder, you can test our system in the staging environment. This way you can be sure that everything is working properly!</p><br /><h3>Contact</h3><p>In need of help? Contact our Shopware developers via <a href=\"https://wearewuunder.com/en/customerconnections/\" target=\"_blank\" rel=\"noreferrer noopener\">https://wearewuunder.com/en/customerconnections/</a>, they will help you with any questions.</p>","installationManual":"<ul><li>Start with making a free Wuunder account at <a href=\"https://www.wearewuunder.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.wearewuunder.com</a>.<br /></li><li>Install via the plugin manager.</li></ul>","shortDescription":"Wuunder makes the shipping of your mail, (letterbox) parcels, pallets, (air, sea & road) freight or other types of shipments as easy as possible with our transport management service.","highlights":"Multiple bookings at once: Book some or all shipments in one go from Wuunder\nPrint labels &amp; transfer lists: Easily print shipping labels and transfer lists for the driver\nPick-up or bring yourself: Wuunder arranges the pick-up or you can take your shipment to the parcelshop\nCombine carriers with a choice of more than 300 options\nCarefree shipping: Wuunder proactively follows all your shipments","features":"Import all your order and contact details with just one click from Shopware into the Wuunder system.\nWith a choice of more than 300 carriers (such as DHL Parcel, DPD, PostNL, GLS, UPS, TNT Express, FedEx, Rhenus or Red Je Pakketje) you’ll always choose the best delivery option: same day, next day or otherwise.\nThese extra delivery options WON’T cause you extra concerns. Our proactive customer service department will contact the carrier and receiver when problems such as delays, damage or incorrect addresses occur. You don’t need to take any actions! \nShip globally from and within The Netherlands, Belgium, France, Germany and Luxembourg or use our worldwide returns service.\nUse your own carrier contracts or choose the contracts Wuunder has with all the different carriers.\nIn our dashboard, you’ll find a clear overview of all your shipments. Here you can track all your shipments for example. But all the track &amp; trace information is also available in Shopware.\nAddress information of the receiver is validated before sending, so no unnecessary returns occur.\nWith our parcelshop locator it’s possible to send shipments directly to a parcelshop. We’ll show your customers the nearest options and opening hours in the check-out. \nYou can arrange a pick-up of your shipments automatically (at your location, customer or supplier / drop-shipment) or choose a fixed pick-up moment.\nWith only one click you can print all shipping labels and you can also send them to the supplier or receiver (when it’s a return).\nGenerate transfer lists easily and let them sign by the driver. That way, you’ll always have proof that you gave your shipments with the carrier.\nThe scan and print method with packing slip module will give you higher levels of efficiency in your shipping process. You can scan your packing slip with a simple scanner and immediately print the corresponding shipping label."}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":161715,"bookingKey":"wuund93935659152","bookingText":"Wuunder Shipping","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPCRiLY","preview":true,"priority":0,"id":52061},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8tBe0k","preview":false,"priority":5,"id":52063},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwLM02k","preview":false,"priority":4,"id":52065},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4lDC4k","preview":false,"priority":3,"id":52064},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNqmtql","preview":false,"priority":2,"id":52066},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpS4d4Si","preview":false,"priority":1,"id":52062}],"comments":[],"ratingAverage":0,"label":"Wuunder Shipping","description":"<h3>Hallo, wir sind Wuunder!</h3><p>Mit unserem machen wir den Versand Ihrer Post, (Briefkasten-)Pakete, Paletten, (Luft-, See- und Straßen-)Fracht oder anderen Sendungsarten so einfach wie möglich. Das Generieren von Versandetiketten ist für uns nur der Anfang. Wir bieten eine Gesamtlösung für Ihre Versandprobleme.</p><br /><h3>Konto &amp; Preise</h3><p> Beginnen Sie mit der Erstellung eines kostenlosen Wuunder-Kontos unter <a href=\"https://www.wearewuunder.com\" target=\"_blank\" rel=\"noreferrer noopener\">www.wearewuunder.com</a>. Sie können das Modul nach der Anmeldung herunterladen und installieren. Sie sind nicht zum Abschluss von Verträgen verpflichtet. Sie zahlen pro Sendung und falls Sie Ihre eigenen Verträge mit Spediteuren verwenden, zahlen Sie eine Servicegebühr pro Sendung.</p><br /><p>Bevor Sie mit Wuunder beginnen, können Sie unser System in der Staging-Umgebung testen. Auf diese Weise können Sie sicher sein, dass alles richtig funktioniert!</p><br /><h3>Contact</h3><p>Benötigen Sie Hilfe? Wenden Sie sich über <a href=\"https://wearewuunder.com/en/customerconnections/\" target=\"_blank\" rel=\"noreferrer noopener\">https://wearewuunder.com/en/customerconnections/</a>  an unsere Shopware-Entwickler. Sie helfen Ihnen bei Fragen.</p>","installationManual":"<p></p><ul><li>Beginnen Sie mit der Erstellung eines kostenlosen Wuunder-Kontos unter <a href=\"https://www.wearewuunder.com.\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.wearewuunder.com</a>. </li><li>Installation über den Pluginmanager.</li></ul>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p>Wuunder Shopware 6 Shipping app, v. 1.0.0</p>","creationDate":{"date":"2020-11-09 12:56:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=wuund93935659152","redirectToStore":false,"lowestPriceValue":0}