{"id":12712,"name":"ZeobvBundleProducts","code":"zeobv39295123891","lastChange":{"date":"2023-07-19 14:15:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgDSrKQ","examplePageUrl":"","moduleKey":"ZeobvBundleProducts","creationDate":{"date":"2020-11-24 16:20:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-03-29 10:48:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-08-17 16:11:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":22101,"name":"Artikel-Sets, Stücklisten & Bundles","description":"<p>Bestehen Ihre Produkte aus mehreren Komponenten, die Sie separat verkaufen? Unser Plugin Bundle Products löst dieses Problem! Es ermöglicht Ihnen, die einzelnen Komponenten auszuwählen, die zusammen ein einziges Produkt ergeben. Sie können auswählen, welches Produkt Sie verkaufen möchten, und gleichzeitig anzeigen, welche einzelnen Komponenten darin enthalten sind. Sie haben sogar die Möglichkeit, die Menge für jede Komponente auszuwählen. Bei einem Tisch würde die Seite zum Beispiel anzeigen, dass vier Tischbeine im Produkt enthalten sind.</p><h3>Vorteile</h3><p><b>Erleichterung für den Kunden</b></p><p>Neben der Möglichkeit, Komponenten in einem einzigen Produkt zusammenzufassen, bietet das Produktbündel auch Vorteile für Ihre Kunden. Sie müssen nicht mehr auf verschiedene Seiten gehen, um das Produkt in ihren Warenkorb zu legen. Jede Komponente eines einzelnen Produkts kann jetzt mit einem einzigen Klick in den Warenkorb gelegt werden!</p><p><b>Steigern Sie Ihren durchschnittlichen Bestellwert</b></p><p>Durch die Zusammenstellung von Produktbündeln oder Komponenten werden sich die Kunden nicht auf den Kauf eines einzelnen Produkts konzentrieren. Stattdessen werden sie höchstwahrscheinlich ein Bündel mit ergänzenden Produkten kaufen, was wiederum den durchschnittlichen Bestellwert erhöht und Ihrem Online-Geschäft zugute kommt.</p><p><b>Möglichkeiten zur Senkung der Lagerkosten</b></p><p>Wenn Sie ein umsatzschwaches Produkt haben, können Sie es mit einem umsatzstarken Produkt kombinieren, um die mit dem umsatzschwachen Produkt verbundenen Bestandskosten zu senken. Auf diese Weise senken Sie Ihre Gesamtkosten und haben die Möglichkeit, überflüssige Bestände von Produkten, die sich schlecht verkaufen, loszuwerden.</p><h3>Immer noch nicht überzeugt?</h3><p>Mehr als 180 Online-Unternehmen nutzen das Plugin bereits, um ihre einzelnen Komponenten zu einem einzigen Produktpaket zusammenzufassen. Sehen Sie sich an, wie die unten aufgeführten Shops das Plugin in ihren Shops eingesetzt haben:</p><p><ul><li><a href=\"https://trigress.com/\" target=\"_blank\" rel=\"noreferrer\">https://trigress.com/</a>&nbsp;</li><li><a href=\"https://serverando.de/\" target=\"_blank\" rel=\"noreferrer\">https://serverando.de/</a>&nbsp;</li><li><a href=\"https://kitchenpoint.de/\" target=\"_blank\" rel=\"noreferrer\">https://kitchenpoint.de/&nbsp;</a><br></li><li><a href=\"https://www.floraseta.de/\" target=\"_blank\" rel=\"noreferrer\">https://www.floraseta.de/&nbsp;</a><br></li></ul></p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt des Checkouts geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin auswählen oder eine Nachricht an&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a>&nbsp;senden. Geben Sie unbedingt Ihre aktuelle Shopware-Version und die Version des Plugins an, das Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p>","installationManual":"<h4>Beginnen Sie mit dem Zeo BundleProducts-Plugin:</h4><ul><li>Laden Sie das Zeo BundleProducts-Plugin herunter.</li></ul><ul><li>Aktivieren Sie das Plugin in Ihrer Shopware 6-Installation. Dies kann über Einstellungen&gt; System&gt; Lizenzen erfolgen. Alternativ können Sie die Schaltfläche \"Plugin hochladen\" verwenden, um die ZIP-Datei des Plugins hochzuladen.</li></ul><ul><li>Navigieren Sie zu \"Kataloge&gt; Produkte\" und öffnen Sie ein Produkt Ihrer Wahl.</li></ul><ul><li>Konfigurieren Sie über die Tabelle im Abschnitt \"Bundle-Konfiguration\", welche Produkte mit dem Bundle verbunden sind.</li></ul><ul><li>Aktivieren Sie das Kontrollkästchen \"Produkte in der Storefront anzeigen\", wenn der Inhalt des Bundles in der Storefront angezeigt werden soll.</li></ul>","shortDescription":"Bieten Sie Produkte an, die aus anderen Produkten bestehen. Mit diesem Plugin können Sie Produktbeziehungen einfach konfigurieren und komplexe Produkte im Handumdrehen verkaufen.","highlights":"Super einfache produktrelationale Konfiguration.\nStarke administrative Einblicke in die Ordnung.\nVerstecken Sie Ihre Beziehungen vor Ihren Kunden.\nZeigen Sie, wie viel der Kunde von einem Bundle profitiert.\nMultifunktional.","features":"Automatische Kennzeichnung von Lagerbeständen, wenn ein oder mehrere Produkte im Paket nicht vorrätig sind.\nKonfigurationsoption, um zu erzwingen, dass das Bundle immer auf Lager ist, auch wenn eines seiner Produkte nicht auf Lager ist.\nBestell-API-kompatibel.\nBündeln Sie Details, die auf Positionsebene in den Bestelldetails sichtbar sind.\nOptionaler Kommentar pro Produkt im Bundle, um Anweisungen für die Auftragsverwaltung hinzuzufügen.\nVerwalten der Sortierung von Produkten innerhalb das Bundle"},{"id":22102,"name":"Bundle/composed products","description":"<p>Do your products consist of several components yet you are selling them separately? Our Bundle Products plugin solves this! It enables you to select the specific components that, when combined, make up a single product. You can select which product to sell, while simultaneously showcasing which separate components are included in it. We even made it possible for you to select the quantity for each component. For example, for a table, the page would show that four table legs are included in the product.</p><h3>Advantages</h3><p><b>Facilitate convenience for customers</b></p><p>Besides being able to combine components into a single product, the Bundle Product also facilitates convenience for your customers. They will no longer have to go to separate pages to add the product to their cart. Each component of a single product can now be added to their cart with only a single click!</p><p><b>Increase your average order value</b></p><p>By creating bundles of products or components, customers will not focus on the purchase of one single product. Instead, they will most likely purchase a bundle with complementary products, which in turn increases the average order value, benefiting your online business.</p><p><b>Opportunities to reduce inventory costs</b></p><p>If you have a slow-selling product, you can combine it with a fast-selling product to reduce the inventory costs associated with that slow-selling product. By doing so, you reduce your overall costs as well as give you the opportunity to get rid of redundant inventory of products that sell slowly.</p><h3>Still not convinced?</h3><p>Over 180 online businesses are already using the plugin to combine their separate components into a single product bundle. See how the stores below have applied it to their stores:</p><p><a href=\"https://trigress.com/\" target=\"_blank\" rel=\"noreferrer\">https://trigress.com/&nbsp;</a><br></p><p><a href=\"https://serverando.de/\" target=\"_blank\" rel=\"noreferrer\">https://serverando.de/&nbsp;</a><br></p><p><a href=\"https://kitchenpoint.de/\" target=\"_blank\" rel=\"noreferrer\">https://kitchenpoint.de/&nbsp;</a><br></p><p><a href=\"https://www.floraseta.de/\" target=\"_blank\" rel=\"noreferrer\">https://www.floraseta.de/&nbsp;</a><br></p><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the checkout changed or improved, contact us via the Shopware support portal by selecting the plugin or by sending a message to&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process it's best to provide as much information as possible or provide us with access to your test environment. This way we can reproduce the issue for ourselves and come up with a solution quicker.</p><h3>About us</h3><p>The team of professionals at Zeo has over 15 years of experience in both online marketing and web development. With this experience, we have helped over 80 clients in 11 different countries, both B2C and B2B. Several new e-commerce shops have been built from the ground up using the Shopware platform and Zeo’s plugins. Notable customers of ours include Simon Lévelt, 24Kae, ABN AMRO Bank, and Allianz Global Assistance. For more information about us, visit&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p>","installationManual":"<h4>Get started with the plugin: <br></h4><ul><li>Download the Zeo BundleProducts plugin. <br></li></ul><ul><li>Activate the plugin in your Shopware 6 installation this can be done via Extensions &gt; My Extensions&gt; Apps. Alternatively, you can use the \"Upload plugin\" button to upload the plugin ZIP file. <br></li></ul><ul><li>Navigate to \"Catalogues &gt; Products\" and open a product of your choice. <br></li></ul><ul><li>Configure which products are connected to the bundle via the table in the \"Bundle configuration\" section. <br></li></ul><ul><li>Check the box \"Show products on storefront\" if you like the contents of the bundle to appear on the storefront.\n</li></ul>","shortDescription":"Offer products consisting of other products. This plugin allows you to easily configure product relations allowing you to sell complex products with a breeze.","highlights":"Show how much a customer saves if they purchase the products as a bundle\nEasy to adjust relational configuration between components and products\nShow or hide all components from your customers\nA clear and easy-to-understand interface to easily adjust, create, or remove bundles\nUseful for both promotional and/or administrative purposes","features":"Adjust the quantity of each component included in the bundle.\nAutomatic out-of-stock marking when one or more products in the bundle are out of stock.\nOption to display the included products in the bundle on the storefront.\nSetting to display or hide each component's price on the storefront.\nSort the products in the order you want them to appear in the bundle.\nCompatible with the order API.\nBundle details visible on line item level in order details.\nOptional comment per product in bundle possible to add instructions for order management."}],"addons":["ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":161915,"bookingKey":"zeobv39295123891","bookingText":"Bundle/composed products","price":439,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":161914,"bookingKey":"zeobv39295123891_M","bookingText":"Bundle/composed products","price":36.95,"duration":1,"trialPhaseIncluded":true,"discount":5,"discountAppliesForMonths":6,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpclMXGY","preview":true,"priority":0,"id":108543},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6siVYU","preview":false,"priority":100,"id":108544},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0O34Yj","preview":false,"priority":90,"id":108545},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVRfF9u","preview":false,"priority":80,"id":52515},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphcH5Uw","preview":false,"priority":70,"id":52516},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpehtkDR","preview":false,"priority":0,"id":108546}],"comments":[{"authorName":"DigitalMasters","text":"Gutes Plugin, dass keine Unvereinbarkeiten mit anderen Plugins aufweist. Hersteller reagiert sehr schnell. Good Job!","headline":"Gutes Plugin","creationDate":{"date":"2023-03-17 15:21:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Daniel Kleine","text":"","headline":"Great Support, Good Plugin :)","creationDate":{"date":"2023-02-14 17:05:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Alexandra","text":"seit wir dieses Plug-in im September installiert haben, hat das Team und insbesondere Gydo auf alle unsere Änderungswünsche reagiert, um es zu verbessern und vor allem das Problem der Kompatibilität mit Pickware und dem Lager zu lösen. \nBemerkenswert ist die Aufmerksamkeit für die Kunden und die Schnelligkeit ihrer Antworten, die immer die richtige Lösung und die richtigen Worte finden. \nVielen Dank dafür! \nJetzt funktioniert alles perfekt und wir können das Jahr 2023 gut beginnen!\nIch kann dieses Plug-in nur empfehlen!","headline":"Nur zu empfehlen!!","creationDate":{"date":"2023-01-10 10:18:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"admin admin","text":"We are happy to have this app. The support ist brilliant. Some errors on the Detailpage while try to add a new bundle are now solved.","headline":"Top App- Worked out of the box","creationDate":{"date":"2022-12-06 10:06:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Manfred Bolz","text":"Verkauf eines Bundles (Set aus mehreren Einzelartikeln) mit automatischer Pflege des Bestands der Einzelartikel. Ohne zusätzliche WaWi.\nGenau das habe ich gebraucht und hiermit bekommen.\n\nWerden die Einzelartikel (bei Bedarf) im Storefront angezeigt, fehlte bislang eine Sortiermöglichkeit der Einzelartikel. Diese jetzt frei wählbare Sortierung wurde auf Kundenwunsch hin umgesetzt - jetzt gibt es auch 5 Sterne. Nicht nur für das Produkt an sich, sondern auch für das \"auf Kundenwunsch hören\".\n\nWenn sich die Liste der Einzelartikel jetzt noch auf die Belege bringen lässt, bin ich euer Evangelist!","headline":"Erstklassiger Service","creationDate":{"date":"2022-09-24 18:33:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dennis Rüsing","text":"Die App erfüllt nach und nach all unsere Anforderungen. Verbesserungen und neue Funktionen kommen stetig hinzu und man nimmt unsere Anmerkungen und Wünsche gern an. Deshalb sind wir sehr glücklich eine so mächtige App gefunden zu haben die viel Potential für die Zukunft bietet. Der Support ist unschlagbar gut und schnell!","headline":"Hervorragende App die nur durch den Support getoppt wird!","creationDate":{"date":"2021-11-30 10:57:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Aaron Holenstein","text":"Set Artikel können einfach in der Artikelspezifikation ausgewählt werden und mit einem Hinweis versehen werden.\nAuf eine Supportanfrage wurde innerhalb einer Stunde reagiert und die Kommunikation verlief super freundlich!\nDas Plugin wird zudem vom Hersteller weiterentwickelt, somit stehen neuen Anforderungen nichts im Weg.\nGerne wieder!","headline":"Einfaches Plugin das hält was es verspricht","creationDate":{"date":"2021-11-11 11:06:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sven Bergmann","text":"Works just as expected. Really quick help if you are facing issues. Thanks a lot!","headline":"Great Plugin and a great customer service!","creationDate":{"date":"2021-11-03 15:15:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Artikel-Sets, Stücklisten & Bundles","description":"<p>Bestehen Ihre Produkte aus mehreren Komponenten, die Sie separat verkaufen? Unser Plugin Bundle Products löst dieses Problem! Es ermöglicht Ihnen, die einzelnen Komponenten auszuwählen, die zusammen ein einziges Produkt ergeben. Sie können auswählen, welches Produkt Sie verkaufen möchten, und gleichzeitig anzeigen, welche einzelnen Komponenten darin enthalten sind. Sie haben sogar die Möglichkeit, die Menge für jede Komponente auszuwählen. Bei einem Tisch würde die Seite zum Beispiel anzeigen, dass vier Tischbeine im Produkt enthalten sind.</p><h3>Vorteile</h3><p><b>Erleichterung für den Kunden</b></p><p>Neben der Möglichkeit, Komponenten in einem einzigen Produkt zusammenzufassen, bietet das Produktbündel auch Vorteile für Ihre Kunden. Sie müssen nicht mehr auf verschiedene Seiten gehen, um das Produkt in ihren Warenkorb zu legen. Jede Komponente eines einzelnen Produkts kann jetzt mit einem einzigen Klick in den Warenkorb gelegt werden!</p><p><b>Steigern Sie Ihren durchschnittlichen Bestellwert</b></p><p>Durch die Zusammenstellung von Produktbündeln oder Komponenten werden sich die Kunden nicht auf den Kauf eines einzelnen Produkts konzentrieren. Stattdessen werden sie höchstwahrscheinlich ein Bündel mit ergänzenden Produkten kaufen, was wiederum den durchschnittlichen Bestellwert erhöht und Ihrem Online-Geschäft zugute kommt.</p><p><b>Möglichkeiten zur Senkung der Lagerkosten</b></p><p>Wenn Sie ein umsatzschwaches Produkt haben, können Sie es mit einem umsatzstarken Produkt kombinieren, um die mit dem umsatzschwachen Produkt verbundenen Bestandskosten zu senken. Auf diese Weise senken Sie Ihre Gesamtkosten und haben die Möglichkeit, überflüssige Bestände von Produkten, die sich schlecht verkaufen, loszuwerden.</p><h3>Immer noch nicht überzeugt?</h3><p>Mehr als 180 Online-Unternehmen nutzen das Plugin bereits, um ihre einzelnen Komponenten zu einem einzigen Produktpaket zusammenzufassen. Sehen Sie sich an, wie die unten aufgeführten Shops das Plugin in ihren Shops eingesetzt haben:</p><p></p><ul><li><a href=\"https://trigress.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://trigress.com/</a> </li><li><a href=\"https://serverando.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://serverando.de/</a> </li><li><a href=\"https://kitchenpoint.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://kitchenpoint.de/ </a><br /></li><li><a href=\"https://www.floraseta.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.floraseta.de/ </a><br /></li></ul><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt des Checkouts geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin auswählen oder eine Nachricht an <a href=\"mailto:\" target=\"_blank\" rel=\"noreferrer noopener\">plugins@zeo.nl</a> senden. Geben Sie unbedingt Ihre aktuelle Shopware-Version und die Version des Plugins an, das Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter <a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.zeo.nl/</a>.</p>","installationManual":"<h4>Beginnen Sie mit dem Zeo BundleProducts-Plugin:</h4><ul><li>Laden Sie das Zeo BundleProducts-Plugin herunter.</li></ul><ul><li>Aktivieren Sie das Plugin in Ihrer Shopware 6-Installation. Dies kann über Einstellungen&gt; System&gt; Lizenzen erfolgen. Alternativ können Sie die Schaltfläche \"Plugin hochladen\" verwenden, um die ZIP-Datei des Plugins hochzuladen.</li></ul><ul><li>Navigieren Sie zu \"Kataloge&gt; Produkte\" und öffnen Sie ein Produkt Ihrer Wahl.</li></ul><ul><li>Konfigurieren Sie über die Tabelle im Abschnitt \"Bundle-Konfiguration\", welche Produkte mit dem Bundle verbunden sind.</li></ul><ul><li>Aktivieren Sie das Kontrollkästchen \"Produkte in der Storefront anzeigen\", wenn der Inhalt des Bundles in der Storefront angezeigt werden soll.</li></ul>","version":"1.5.2","changelog":[{"version":"1.5.2","text":"<p>Added link to bundle product from product detail pages of products that are inside a bundle</p><p><br /></p>","creationDate":{"date":"2023-06-12 14:21:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Resolved bundle product link on when visibilities is selected Hide in Listings and search.</p>","creationDate":{"date":"2023-06-12 14:13:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<p>-   Introduced compatibility for Shopware 6.5.0 </p><p><br /></p>","creationDate":{"date":"2023-04-10 15:50:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.20","text":"<p>Resolved error while using multi currency price on bundle.</p>","creationDate":{"date":"2023-07-11 10:28:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.19","text":"<p>Resolved missing bin Location in picklist</p>","creationDate":{"date":"2023-06-22 08:26:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.18","text":"<p>- Resolved missing bundle items in picklist</p><p><br /></p>","creationDate":{"date":"2023-06-20 12:46:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.17","text":"<p>Resolved the picklist pdf not generated.</p>","creationDate":{"date":"2023-06-20 11:11:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.16","text":"<p>Resolved bundle product link on when visibilities is selected Hide in Listings and search.</p>","creationDate":{"date":"2023-05-17 15:46:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.15","text":"<p>Added seo url in bundle product link on product detail pages.</p>","creationDate":{"date":"2023-04-28 12:06:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.14","text":"<p>Fixed template break.</p>","creationDate":{"date":"2023-04-25 16:07:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.13","text":"<p>- Casting maxPurchase to int to avoid type error</p><p><br /></p>","creationDate":{"date":"2023-04-06 08:43:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.12","text":"<p>- Product detail bundle table display advance pricing bug fixed.</p><p>- Added configuration option to disable Max. order quantity override.</p><p>- Fixed weight calculation issue for bundle items with a quantity higher than 1</p>","creationDate":{"date":"2023-04-05 14:21:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.11","text":"<p>- Make bundle product inherit the lowest \"Max. order quantity\" value from products in the bundle.</p><p>- Resolved price calculation bug in administration product listing</p>","creationDate":{"date":"2023-03-15 14:34:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.10","text":"<p>-   Changed style of product number in bundle line item table</p><p>-   Edited config option label to provide more clarity</p><p>-   Fixed bug where the manufacturer would not be included anymore</p><p>-   Added product number to bundle product table when enabled in plugin config.</p><p>-   Added Bundle product quantity to cart and checkout items when enabled in plugin config.</p><p>-   Added hide bundle information in shopping cart and checkout when enabled in plugin config.</p><p>-   Fixed display hide/show price in shopping cart, order finish, user account order.</p>","creationDate":{"date":"2023-03-10 10:20:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.8","text":"<p>Fixed the design issue in Storefront.</p>","creationDate":{"date":"2023-03-03 11:56:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.7","text":"<p>-   Performed some fine-tuning in the sorting of line items of the Pickware picklist template override</p><p>-   Fixed an issue where the bundle product would fall apart during reorder via the Storefront</p><p>-   Fixed a rare exception in combination with advanced prices during bundle generation</p><p><br /></p>","creationDate":{"date":"2023-02-27 10:40:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.6","text":"<p>-   Fixed missing cover image in bundle item list</p><p>-   Fixed error in cart collector when using the Shopware custom product plugin</p>","creationDate":{"date":"2023-02-20 15:20:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.5","text":"<p>-   Fixed error occuring when a customer would be excempted from taxes</p><p><br /></p>","creationDate":{"date":"2023-02-14 14:12:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<p>-   Fixed small bug in advanced price selection in the bundle product overview on the product detail page</p><p><br /></p>","creationDate":{"date":"2023-02-13 14:54:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>-   Fixed sub product item recalculation when adding a credit item in the order</p><p>-   Fixed issue where bundle products wouldn't always get saved</p><p>-   Added fix for duplicate number in bundle item positions</p><p>-   Fixed sorting of bundle line items on the storefront.</p><p>-   Bundle products are now considering inheritance for variants within a bundle, fixing the price of a bundle product containing variants in the admin</p>","creationDate":{"date":"2023-02-10 11:24:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>-   Fixed order on picklist</p><p><br /></p>","creationDate":{"date":"2023-02-07 15:54:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>-   Fixed division by zero issue</p><p><br /></p>","creationDate":{"date":"2023-02-06 11:51:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>-   Added advanced prices support</p><p>-   Added price calculation optimisations</p><p>-   Added option to hide total price in bundle price list</p>","creationDate":{"date":"2023-01-26 09:26:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<p>-   Updated weight override to be more configurable</p><p><br /></p>","creationDate":{"date":"2023-01-24 10:19:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>-   Added weight override</p><p><br /></p>","creationDate":{"date":"2023-01-19 16:55:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p>-   Improved presentation of bundle products in picklist document</p><p>-   Product variant swatches now correctly present the availability of a variant bundle product</p>","creationDate":{"date":"2023-01-09 13:07:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>-   Added partial support with Pickware ERP Starter. Warning, this update is experimental and can alter the function of the plugin on certain installations. Disable the newly added backwards compatibility config option for this new compatibility to take effect.</p><p>-   New configuration option added to create backwards compatibility with older installations. To improve compatibility with Pickware ERP starter disable the new option \"Use a custom line item type instead of the default 'Product' line item type\" option.</p><p>-   Deprecating the stock management configuration setting. When line items of type product are used Shopware will now manage the stock accordingly.</p><p>-   Added async hard \"stock\" and \"available stock\" updates via the message queue.</p><p>-   Fixed rounding precision errors originating from cart collector</p>","creationDate":{"date":"2022-12-19 07:14:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"<p>-   Added partial compatibility with Shopware's Customized Products plugin. Some anomalies still occur</p><p><br /></p>","creationDate":{"date":"2022-12-06 09:30:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"<p>-   Fixed error in admin when adding a new product to the bundle</p><p><br /></p>","creationDate":{"date":"2022-11-28 13:52:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"<p>-   Added an option to divide the stock by the quantity of the product inside the bundle</p><p><br /></p>","creationDate":{"date":"2022-11-24 12:33:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<p>- Fixed error during add to cart in a Tax Free context</p><p><br /></p>","creationDate":{"date":"2022-10-13 10:01:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p>- Added position support for pre-1.2.0 bundle products.</p><p><br /></p>","creationDate":{"date":"2022-09-30 11:34:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>- Added block to the buy-widget override called buy_widget_buy_container_bundle_list to improve extendability</p><p><br /></p>","creationDate":{"date":"2022-09-27 12:58:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- Added manual sorting feature for products inside a bundle.</p><p><br /></p>","creationDate":{"date":"2022-09-24 09:04:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.27","text":"<p>- Patch for issue introduced in 1.1.26, causing an error for products without a manufacturer.</p><p><br /></p>","creationDate":{"date":"2022-09-12 13:28:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.26","text":"<p>- Added manufacturer to bundle item payload for use in documents and mail templates</p><p>- Added manufacturer name to cart and checkout items when enabled in plugin config</p>","creationDate":{"date":"2022-09-09 09:52:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.25","text":"<p>- Fixed german translation error</p><p><br /></p>","creationDate":{"date":"2022-09-05 08:14:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.24","text":"<p>- Fixed tax calculation issue when using the \"Set the price of products inside a bundle to 0.00\" option.</p><p><br /></p>","creationDate":{"date":"2022-07-27 12:23:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.23","text":"<p>- Changed \"Adjust the product prices to fit within the bundle price\" calculation to attempt providing more representative prices.</p><p><br /></p>","creationDate":{"date":"2022-07-13 11:45:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.22","text":"<p>- The multi vat calculation is disabled in combination with the \"Don't perform any calculations\" setting found in the plugin settings</p><p><br /></p>","creationDate":{"date":"2022-07-06 14:29:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.20","text":"<p>- Added link to product detail page of products within a bundle on the storefront</p><p>- Added option to show the cover image of products inside the bundle as a thumbnail on the storefront</p><p>- Added option to show the availability of products inside the bundle on the storefront</p><p>- Added import/export support for bundle product connections</p>","creationDate":{"date":"2022-06-27 13:55:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.19","text":"- Fixed bug of bundle connections not refreshing when switching to another product using the \"Show product\" function.","creationDate":{"date":"2022-05-06 14:12:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.18","text":"- Increased bundle connection limit from 25 to 100 <p>- Rebuild administration JS files under v6.4.5.0 to fix issue https://github.com/shopware/platform/issues/2420\n</p>","creationDate":{"date":"2022-05-05 11:01:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.17","text":"- Patched bundle connection save issue occurring in rare cases.","creationDate":{"date":"2022-04-13 09:58:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.16","text":"- Fixed issue where product layouts would conflict with new bundle product price calculation","creationDate":{"date":"2022-03-18 08:29:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.15","text":"- Added option to override the \"Stock\" field of the product with the stock of the product in the bundle with the lowest available stock.","creationDate":{"date":"2022-03-08 09:31:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.14","text":"- Add bundle purchase price calculation based on purchase prices of products inside the bundle","creationDate":{"date":"2022-02-24 10:21:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.13","text":"- Now calculating weight of bundle product based on weight of products inside the bundle. <p>- Price shown on product detail page of products inside the bundle now based on calculated price. Unfortunately it's not yet possible to included advanced prices in this price calculation\n</p>","creationDate":{"date":"2022-02-21 12:10:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.12","text":"- Backwards compatibility patch with v.6.4.1.0","creationDate":{"date":"2022-02-02 14:40:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.11","text":"- Made some adjustment to the stock inheritance system in order to improve the stock and availability determination","creationDate":{"date":"2021-11-24 09:38:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.10","text":"- Added delivery time inheritance from the product with the longest delivery time","creationDate":{"date":"2021-11-18 13:24:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"- Added extra configuration option to select a price calculation mode for both bundle product and items within a bundle product <p>- Added extra configuration option to set the price of all line items within a bundle product to 0.00. </p>","creationDate":{"date":"2021-11-17 17:04:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"- Added option to activate stock management for products inside a bundle. <p>- Added product number to bundle product select results to make identifying variants easier.</p>","creationDate":{"date":"2021-11-10 14:31:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"- Fixed order of bundle line items in documents","creationDate":{"date":"2021-11-04 13:55:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>- Refactored bundle relation assignment resulting in a significant performance improvement.</p><p>- Improved UX of bundle product management in the administration</p><p>- Added configuration option to disable automatic recalculation of prices of products in a bundle.</p>","creationDate":{"date":"2021-10-28 10:56:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>- Added extra options for bundle item storefront presentation</p><p>- Fixed some small visualization issues</p><p>- Fixed errors in bundle line item price calculation</p>","creationDate":{"date":"2021-10-01 15:21:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>- Fixed line item integrity constraint error when adding/editing an order with a bundle line item via the admin</p><p>- Fixed quantity validation error when adding/editing an order with a bundle line item containing a stock &gt; 1</p>","creationDate":{"date":"2021-09-06 12:39:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"- Added compatibility patch for cart recovery plugin <p>- Fixed decimal precision issue occurring when cart is empty.</p>","creationDate":{"date":"2021-08-25 20:10:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- Fixed uninstall error</p><p>- Added reference version fields to avoid error during dal:schema:create command</p><p>- Improved available stock determination by including bundle item quantity in the equation</p><p>- Improved performance.</p><p>- Code refactor, removed dead code.</p>","creationDate":{"date":"2021-07-22 11:51:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- Added compatibility for v6.4","creationDate":{"date":"2021-05-07 12:12:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"- Hotfix addressing error in checkout","creationDate":{"date":"2021-11-04 13:28:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- Fixed order of bundle line items in documents","creationDate":{"date":"2021-10-22 11:03:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- Improved performance.</p><p>- Order delivery positions created for cart child items.</p><p>- Moved bundle information from payload info to cart child items. </p><p>- Code refactor, removed dead code.</p>","creationDate":{"date":"2021-06-21 20:17:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- Replaced getPayloadValue by hasPayloadValue to prevent an exception from being thrown in older Shopware versions","creationDate":{"date":"2021-04-30 15:07:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Fixed price calculation of bundle product child items</p><p>- Added better bundle item price insights in order details</p><p>- Improved styling of bundle product item grid on product detail page</p><p>- Fixed bug where \"Show products in bundle on storefront\" toggle would be hidden</p><p>- Fixed bug where bundle items would still be visible on order finish screen</p><p>- Fixed bug where bundle items would still be visible in account order details</p><p>- Fixed bug where the unit price of bundle item would be presented as \"FREE:\" in the account order details </p>","creationDate":{"date":"2021-04-29 14:21:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- Initial release of plugin<br /></p>","creationDate":{"date":"2020-11-24 16:39:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv39295123891","redirectToStore":false,"lowestPriceValue":36.95}