{"id":12904,"name":"mailcShopware6MailchimpIntegration","code":"mailc14137522715","lastChange":{"date":"2023-07-21 00:30:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOgA32U","examplePageUrl":"","moduleKey":"mailcShopware6MailchimpIntegration","creationDate":{"date":"2021-01-21 10:10:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-05-27 15:46:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-05-06 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-05-10 17:35:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1814,"prefix":"mailc","name":"Mailchimp","website":"//mailchimp.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1814_Mailchimp_Logo-Vertical_Black_128.png"},"infos":[{"id":22452,"name":"Mailchimp for Shopware 6","description":"<h3>Steigere deinen Unternehmenserfolg mit der All-in-one-Marketingplattform von Mailchimp.</h3><p>Wenn du deinen Shopware-Store mit Mailchimp verbindest, erhältst du Zugang zu einer All-in-one-Marketingplattform, mit der du deinen Absatz steigern kannst. Profitiere von einem Marketingansatz, der vollständig individualisierbar ist und deine Kunden motiviert.</p><p>Diese kostenlose Erweiterung synchronisiert deine Kunden und deren Bestelldaten mit Mailchimp. Dadurch kannst du deine Zielgruppe besser segmentieren und mit personalisierten Marketingkampagnen deinen Umsatz steigern.&nbsp;</p><ul><li><p>Erstelle ansprechende <a href=\"https://mailchimp.com/de/features/email/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">E‑Mails</a>, die deine Zielgruppe erreichen und deine Marke stärken.</p></li><li><p>Richte <a href=\"https://mailchimp.com/features/automations/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Marketingautomatisierungen</a> ein – mit visuellen Journeys, benutzerdefinierten Triggern, Terminplanungstools und einsatzfertigen Automatisierungen.</p></li><li><p>Nutze den <a href=\"https://mailchimp.com/de/features/automations/customer-journey-builder/?utm_source=shopware&amp;utm_medium=integration_page&amp;utm_campaign=fall_update&amp;utm_content=mailchimp_integration\">Customer Journey Builder</a>, um anhand von Verhaltensweisen und Interaktionen mit deinem Store automatisch relevante Inhalte anzubieten.</p></li><li><p>Steigere mit <a href=\"https://mailchimp.com/features/product-recommendations/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Produktempfehlungen deinen Umsatz</a>.</p></li><li><p><a href=\"https://mailchimp.com/de/features/segmentation/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Segmentiere deine Abonnenten </a>anhand von Daten wie Wohnort, Geburtsdatum oder Kaufhistorie.</p></li><li><p>Verwende <a href=\"https://mailchimp.com/de/features/landing-pages/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Landingpages</a>, um deine Zielgruppe zu erweitern, Werbegeschenke zu verteilen oder ein Produkt zu bewerben.</p></li><li><p>Nutze Analytics und <a href=\"https://mailchimp.com/de/features/reports-and-analytics/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">ermittle deinen ROI</a>, um die Wirkung deiner Marketingkampagnen besser zu verstehen.</p></li><li><p>Erstelle attraktive, datengesteuerte <a href=\"https://mailchimp.com/de/digital-ads/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Facebook- und Instagram-Ads</a>, die deine Wiederholungskäufe steigern.</p></li></ul><h3>Support</h3><p>Damit die optimale und schnelle Mailchimp Support Erreichbarkeit genutzt werden kann logge Dich bitte&nbsp;<a href=\"https://login.mailchimp.com/\" target=\"_blank\" rel=\"noreferrer\">here</a>&nbsp;ein. Alle Support Optionen findest Du unter folgender URL:&nbsp;<a href=\"https://admin.mailchimp.com/support/ecommerce-support\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://admin.mailchimp.com/support/ecommerce-support</a><br></p>","installationManual":"<p>Eine ausführliche Dokumentation wie die App zu installieren ist findet man hier:&nbsp;Mailchimp for Shopware 6 verwenden: https://eepurl.com/gv_sQn</p>","shortDescription":"Mailchimp ist eine leistungsstarke Marketingplattform für deinen E‑Commerce-Erfolg. Verbinde deinen Shopware-6, um gezielte E‑Mails zu versenden und dein Marketing zu automatisieren.","highlights":"Steigere deinen Umsatz und deine Konversionsrate mit Multichannel-Kampagnen, die soziale Medien, E‑Mails, digitale Ads und mehr umfassen.\nMailchimp hilft dir mit einem komplett ausgestatteten Marketing-CRM, Automatisierungen und Tools zur Zielgruppensegmentierung, engere Kundenbeziehungen aufzubauen.\nDurch Verbinden deines Stores führst du deine E‑Commerce- und Marketingdaten an einem zentralen Ort zusammen, um einen besseren Überblick über das Wachstum deiner Zielgruppe, den Customer Lifetime Value und die Kaufwahrscheinlichkeit zu erhalten.","features":"Synchronisierung von Neukunden: Neue Bestellungen und Kundendaten werden in Echtzeit von Shopware zu Mailchimp synchronisiert.\nSynchronisierung von Bestandskunden: Synchronisiere alle deine Bestandskunden mit einer Mailchimp-Zielgruppe deiner Wahl. Bei einer Änderung der Zielgruppe startet die Erweiterung automatisch die Erstsynchronisierung für die neue Mailchimp-Zielgruppe. Die Daten der vorherigen Zielgruppe werden nicht gelöscht.\nHistorische Kaufdaten: Synchronisiere alle bisherigen Bestellungen einschließlich der gekauften Produkte und Produktkategorien.\nKaufdaten-Synchronisierung von Bestandsprodukten und Varianten: Synchronisiere alle Produkte samt Varianten mit der ausgewählten Mailchimp-Zielgruppe. Bei einer Änderung der Zielgruppe startet die Erweiterung automatisch die Erstsynchronisierung für die neue Zielgruppe.\nNeuprodukt-Synchronisierung: Dein Produktkatalog wird in Echtzeit synchronisiert.\nProduktempfehlungen: Empfiehl in Kampagnen und Automatisierungen relevante Produkte anhand der individuellen Kaufdaten deiner Kunden, um Wiederholungskäufe zu fördern und deinen Umsatz zu steigern.\nProdukt-Inhaltsblöcke: Ziehe den Produkt-Inhaltsblock in dein E‑Mail-Layout, um Sonderangebote oder Bestseller zu empfehlen.\nE‑Commerce-Automatisierungsworkflows: Versende gezielte E‑Mails, die durch Kundenaktivitäten, Ereignisse oder ein spezielles Datum ausgelöst werden. Dadurch verbindest du Zielgruppensegmentierung und E‑Mail-Automatisierung.\nUnterstützung für mehrere Vertriebskanäle: Synchronisiere Kunden und Bestellungen aus mehreren Shopware-Vertriebskanälen mit einer oder mehreren Mailchimp-Zielgruppen.\nBestellstatus-Updates: Bestellungen werden für die letzten 60 Tage aktualisiert."},{"id":22453,"name":"Mailchimp for Shopware 6","description":"<h3></h3><h3>Grow your business with Mailchimp's all-in-one Marketing Platform.</h3><p>When you connect your Shopware store to Mailchimp, you’ll have access to an all‑in‑one Marketing Platform that will help you sell more stuff. Power a marketing approach that’s fully customizable and keeps your customers engaged.&nbsp;</p><p>This free extension syncs your customers and their order information to Mailchimp. Better segment your audience and create personalized marketing campaigns that drive revenue.</p><p></p><ul><li><p>Create beautiful and engaging <a href=\"https://mailchimp.com/features/email/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">emails</a> that help you reach your audience and build your brand.</p></li><li><p>Set up <a href=\"https://mailchimp.com/features/automations/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">marketing automations</a> with visual journeys, custom triggers, scheduling tools, and pre-built automations.</p></li><li><p>Use the <a href=\"https://mailchimp.com/features/automations/customer-journey-builder/?utm_source=shopware&amp;utm_medium=integration_page&amp;utm_campaign=fall_update&amp;utm_content=mailchimp_integration\">Customer Journey Builder</a> to deliver relevant content based on behaviors and interactions with your store automatically.</p></li><li><p>Showcase <a href=\"https://mailchimp.com/features/product-recommendations/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">product recommendations</a> to drive more sales.</p></li><li><p><a href=\"https://mailchimp.com/features/segmentation/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">Segment subscribers</a> based on data like location, birthdate, or purchase history.</p></li><li><p>Grow your audience, run a giveaway, or promote a product with <a href=\"https://mailchimp.com/features/landing-pages/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">landing pages</a>.</p></li><li><p>View analytics and <a href=\"https://mailchimp.com/features/reports-and-analytics/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">measure your ROI</a> to better understand the impact of your marketing campaigns.</p></li><li><p>Create beautiful, data-informed  <a href=\"https://mailchimp.com/digital-ads/?utm_source=integration&amp;amp;utm_medium=partner&amp;amp;utm_campaign=shopware&amp;amp;utm_content=de-listing\">Facebook and Instagram Ads</a> that drive repeat purchases.</p></li></ul><h3>Support</h3><p>In order to receive an optimal and timely Mailchimp Support experience, please&nbsp;<a href=\"https://login.mailchimp.com/\" target=\"_blank\" rel=\"noreferrer\">login</a>&nbsp;to your Mailchimp account, and utilize one of our Mailchimp Support options at the following URL:&nbsp;<a href=\"https://admin.mailchimp.com/support/ecommerce-support\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://admin.mailchimp.com/support/ecommerce-support</a><br></p>","installationManual":"<p>A tutorial how to install the App can be found here: https://eepurl.com/gv_sQn</p>","shortDescription":"Mailchimp is a powerful marketing platform for your e-commerce business. Connect your Shopware 6 store to start sending targeted emails and automate your marketing.","highlights":"Increase revenue and drive conversion with support for multi-channel campaigns across social media, email, digital ads, and more.\nMailchimp tools help you build stronger relationships with your customers with a full-service Marketing CRM, audience segmentation tools and automations.\nA connected store brings your ecommerce and marketing data into one centralized place to better monitor audience growth, customer lifetime value, and likelihood to purchase.","features":"New customer subscriber sync: Syncs new orders and customer data Shopware to Mailchimp in real time.\nExisting customer subscriber sync: Sync all of your existing customers to a Mailchimp audience of your choice. If you choose a new target audience, the extension automatically starts syncing all of those contacts. Data from the previous audience won’t be deleted.\nHistoric purchase data: Sync all existing orders, including previously purchased products and product categories.\nPurchase data sync of existing products + variants: Sync all products and their variants to the selected Mailchimp audience. If the target audience changes, the extension automatically starts the initial sync for the new audience.\nNew products sync: Keeps your product catalogue synced in real time.\nProduct recommendations: Use individual customer purchase data to recommend relevant products in campaigns and automations to encourage repeat purchases and increase revenue.\nProduct content blocks: Drop the product content block into your email layout to promote special offers or best-selling items.\nE-commerce automation workflows: Send targeted emails triggered by a customer's activity, event, or a specific date. Allows for audience segmentation and email automation.\nMultiple sales channel support: Sync customers and orders from multiple Shopware sales channels to one or more Mailchimp audiences.\nOrder status updates: Orders are updated going back 60 days."}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":163319,"bookingKey":"mailc14137522715","bookingText":"Mailchimp for Shopware 6","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpI0W32M","preview":true,"priority":0,"id":65961},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQAE4dC","preview":false,"priority":0,"id":65957},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvGGhdb","preview":false,"priority":0,"id":65958},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmCLS7M","preview":false,"priority":0,"id":65959},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpj0z2Qv","preview":false,"priority":0,"id":65960}],"comments":[{"authorName":"Christian Schlotter","text":"Wir haben jetzt Juli! Eine Info wäre mal nicht schlecht, sonst müssen wir auch wechseln....","headline":"Update für die 6.5.....","creationDate":{"date":"2023-07-08 08:50:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Julian Börsig","text":"Erweiterung funktioniert nicht mehr seit Shopware-Update auf 6.5.","headline":"Funktioniert nicht mehr seit Shopware-Update auf 6.5","creationDate":{"date":"2023-05-15 11:09:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Steven","text":"Not working in most of the shops","headline":"Bad plugin","creationDate":{"date":"2023-04-06 12:26:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Steffen Meuser","text":"Ich habe die App zu Beginn des Jahres ausprobieren wollen. Nach einigen Anforderungen die shopseitig noch erfüllt werden mussten ließ sich die App in Betrieb nehmen und konfigurieren. Allerdings hat der Sync nie einen Newsletter Empfänger oder Shop-Kunden zu Mailchimp hin übertragen. Der Support konnte mir bei dem Sync-Problem dann auch nicht helfen.","headline":"Leider funktioniert der Sync nicht","creationDate":{"date":"2023-03-08 12:54:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":5},{"authorName":"Jonas Pattyn","text":"We are experiencing problems with the configuration of the module.\n\nOur Shopware store currently has one Sales Channel, but we have several languages. We have Dutch, French and English. \n\nWe want to reach out to our subscribers in the right language. That means, if customers create an account in the Dutch-language store environment, they should be automatically synced into a Dutch-language Mailchimp audience list. \n\nHowever, we can only connect the Sales Channel to one single audience list. Can this be solved?\n\nSecondly, we want to be able to map custom fields with the contact fields in Shopware. However, existing Shopware attributes like \"language\" do not show up in the mapping table. How do we map them?","headline":"Only 1 Mailchimp Audience List per Sales Channel? Custom fields (such as Language) cannot be mapped.","creationDate":{"date":"2022-05-11 11:58:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Wolfgang Kreminger","text":"Just installed this app in our staging environment and unfortunately the user agent is not Mailchimp-Shopware6\nInstead it is python-requests/2.26.0\n\nOnce this issue is fixed, I will be able to test this app fully and update my review.","headline":"User agent doesn't match what's mentioned in the documentation","creationDate":{"date":"2022-01-27 12:25:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Oliver Kohnke","text":"Since we are not the only ones facing this issue, any fix would be appreciated!","headline":"Won't sync to Mailchimp.","creationDate":{"date":"2022-01-05 14:23:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"WVC","text":"Send a PM for more information. Will edit the rating after a fix is provided","headline":"Installation fails","creationDate":{"date":"2021-12-07 16:04:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Biemans","text":"","headline":"Customers, orders and promotions won't sync to Mailchimp.","creationDate":{"date":"2021-10-28 23:31:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Tim Scharner","text":"After logging in I only see \"Active sales channel mappings\" and nothing else. Cannot select anything.","headline":"Not working","creationDate":{"date":"2021-08-31 12:09:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Rim Ben Amor","text":"Doesn't work, I'm blocked \"Checking Shop Configuration\" and when I opened Chrome dev tools it shows me that the request received a 502 {message: \"Internal server error\"}","headline":"Blocked at Checking Shop Configuration","creationDate":{"date":"2021-08-30 20:47:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Josua Sievers","text":"Seit einigen Wochen werden die Kontakte nicht mehr zu MailChimp übertragen, obwohl die Verbindung passt.","headline":"Seit einigen Wochen keine Sync mehr","creationDate":{"date":"2021-08-01 15:40:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Jan Sass","text":"Das Plugin, seit der ersten Version, und auch mit der aktuellen 6.4.2.1 von Shopware liefert nur:\n\nCould not sign payload with store secret for app: „mailcShopware6MailchimpIntegration“\n\n…Mailchimp schiebt die Schuld auf Shopware, Shopware sagt, alles seit in Ordnung.\n\nDas Plugin so, ohne weitere Hilfe des Herstellers oder eine Möglichkeit, den Fehler einzugrenzen, funktioniert nicht.","headline":"Funktioniert nicht: Could not sign payload …","creationDate":{"date":"2021-07-20 09:30:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Danijel Petkovic","text":"Hey, I see only xml file inside the plugin folder, so it can't be installed at all. Do you maybe know why is this happening?","headline":"Can't be installed. I see only xml file inside the plugin folder","creationDate":{"date":"2021-07-12 16:38:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Monique Heijmans","text":"Ich habe Mailchimp bereits kontaktiert und also Antwort erhalten, dass man mir nicht sagen kann, wann das Update für die 6.4.1.2 kommen wird. Ändere meine Bewertung gerne, sobald ich das Plugin testen konnte.","headline":"Integration leider nicht möglich, da das Update für die 6.4.1.2 fehlt","creationDate":{"date":"2021-07-12 15:01:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"R-Valorize AG","text":"Eigentlich ist Mailchimp ne tolle Sache, leider lies es sich erst nicht installieren (Version 6.4.0) das geht jetzt zwar. Aber danach lässt sich die App nicht öffnen ({\"message\": \"Internal server error\"} direkt beim Öffnen der App (Caches &amp; alles schön bereinigt) wir müssen leider sagen das es nicht funktioniert und offenbar gib mal sich hier bei Mailchimp nicht die Mühe das ganze mal sauber zu testen. Für alle anderen Grossen Shopysteme gibt es eine Direkte Integration nur für Shopware 6 (wo ja eigentlich am einfachsten wäre die API anzubinden) existiert das nicht.  Deswegen 1 Stern. \n\nGerne revidiere ich meine Bewertung wenn Mailchimp es schafft das man das Plugin direkt benutzten kann.","headline":"Lässt sich installieren aber nicht benutzen ! (message\": \"Internal server error)","creationDate":{"date":"2021-06-17 18:46:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Armin T","text":"Lässt sich nicht installieren!","headline":"Gleiche Problem wie die Kollegen","creationDate":{"date":"2021-06-09 21:22:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Michael Eugster","text":"Bei der ersten Installation hat das Plugin leider nicht funktioniert, der Fehler wurde aber rasch behoben.","headline":"Endlich da Mailchimp-Plugin für Shopware 6","creationDate":{"date":"2021-06-09 13:13:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"CRDEV","text":"Läuft alles so wie es soll :)","headline":"Plugin funktioniert!","creationDate":{"date":"2021-06-08 19:41:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":3,"label":"Mailchimp for Shopware 6","description":"<h3>Steigere deinen Unternehmenserfolg mit der All-in-one-Marketingplattform von Mailchimp.</h3><p>Wenn du deinen Shopware-Store mit Mailchimp verbindest, erhältst du Zugang zu einer All-in-one-Marketingplattform, mit der du deinen Absatz steigern kannst. Profitiere von einem Marketingansatz, der vollständig individualisierbar ist und deine Kunden motiviert.</p><p>Diese kostenlose Erweiterung synchronisiert deine Kunden und deren Bestelldaten mit Mailchimp. Dadurch kannst du deine Zielgruppe besser segmentieren und mit personalisierten Marketingkampagnen deinen Umsatz steigern. </p><ul><li><p>Erstelle ansprechende <a href=\"https://mailchimp.com/de/features/email/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">E‑Mails</a>, die deine Zielgruppe erreichen und deine Marke stärken.</p></li><li><p>Richte <a href=\"https://mailchimp.com/features/automations/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Marketingautomatisierungen</a> ein – mit visuellen Journeys, benutzerdefinierten Triggern, Terminplanungstools und einsatzfertigen Automatisierungen.</p></li><li><p>Nutze den <a href=\"https://mailchimp.com/de/features/automations/customer-journey-builder/?utm_source=shopware&amp;utm_medium=integration_page&amp;utm_campaign=fall_update&amp;utm_content=mailchimp_integration\">Customer Journey Builder</a>, um anhand von Verhaltensweisen und Interaktionen mit deinem Store automatisch relevante Inhalte anzubieten.</p></li><li><p>Steigere mit <a href=\"https://mailchimp.com/features/product-recommendations/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Produktempfehlungen deinen Umsatz</a>.</p></li><li><p><a href=\"https://mailchimp.com/de/features/segmentation/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Segmentiere deine Abonnenten </a>anhand von Daten wie Wohnort, Geburtsdatum oder Kaufhistorie.</p></li><li><p>Verwende <a href=\"https://mailchimp.com/de/features/landing-pages/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Landingpages</a>, um deine Zielgruppe zu erweitern, Werbegeschenke zu verteilen oder ein Produkt zu bewerben.</p></li><li><p>Nutze Analytics und <a href=\"https://mailchimp.com/de/features/reports-and-analytics/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">ermittle deinen ROI</a>, um die Wirkung deiner Marketingkampagnen besser zu verstehen.</p></li><li><p>Erstelle attraktive, datengesteuerte <a href=\"https://mailchimp.com/de/digital-ads/?utm_source=integration&amp;utm_medium=partner&amp;utm_campaign=shopware&amp;utm_content=de-listing\">Facebook- und Instagram-Ads</a>, die deine Wiederholungskäufe steigern.</p></li></ul><h3>Support</h3><p>Damit die optimale und schnelle Mailchimp Support Erreichbarkeit genutzt werden kann logge Dich bitte <a href=\"https://login.mailchimp.com/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a> ein. Alle Support Optionen findest Du unter folgender URL: <a href=\"https://admin.mailchimp.com/support/ecommerce-support\" target=\"_blank\" rel=\"noreferrer noopener\">https://admin.mailchimp.com/support/ecommerce-support</a><br /></p>","installationManual":"<p>Eine ausführliche Dokumentation wie die App zu installieren ist findet man hier: Mailchimp for Shopware 6 verwenden: https://eepurl.com/gv_sQn</p>","version":"1.2.3","changelog":[{"version":"1.2.3","text":"<p>There is now a possibility to choose between net/gross prices.</p><p><br /></p><p>We have introduced the webhook for newsletter unsubscribers.</p>","creationDate":{"date":"2022-12-08 17:57:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p>UX improvements for easier usability</p>","creationDate":{"date":"2022-09-09 12:53:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>We fixed an error with the \"customer\" webhook.</p>","creationDate":{"date":"2022-02-10 12:36:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>With this version we added some new features and overall improvements.</p><p>New:</p><p>- You can now map custom fields from your customers and your customers last order to merge fields in Mailchimp</p><p>- We added more webhooks for instant sync</p><p><br /></p><p>Improvements:</p><p>- The frontend is now easier to understand and gives you more control</p><p>- Many small improvements everywhere</p>","creationDate":{"date":"2021-12-08 16:03:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- New webhooks added to synchronize the order state in a timely manner</p><p>- Promotion codes are now synchronized to Mailchimp and can be used in campaigns</p><p>- Safari browser is now supported as well</p>","creationDate":{"date":"2021-08-18 13:32:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release with initial basic features</p>","creationDate":{"date":"2021-05-12 17:29:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=mailc14137522715","redirectToStore":false,"lowestPriceValue":0}