{"id":13030,"name":"AcrisStockNotificationCS","code":"acris67848641835","lastChange":{"date":"2023-07-18 19:11:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLhpjRq","examplePageUrl":"","moduleKey":"AcrisStockNotificationCS","creationDate":{"date":"2021-02-15 13:42:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-02-09 07:01:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-03-08 10:46:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":22685,"name":"Lagerstands-E-Mail Benachrichtigung mit Übersichten","description":"<h2>Funktionsumfang <br></h2>Wenn ein Produkt nicht lagernd ist, kann der User mit Angabe seiner E-Mail Adresse sicht benachrichtigen lassen, wenn das Produkt wieder lagernd ist. Der Kunde wird automatisch mit einem frei änderbaren E-Mail benachrichtigt (einmalig). Die Einstellung der Lagerstandsbenachrichtigung erfolgt bei jedem Produkt individuell.<br>In der Plugin Konfiguration, kann der Shopbetreiber einstellen, ob Produkte trotz aktiver E-Mail Benachrichtigung bestellbar sind oder ob nur die Benachrichtigungsfunktion angezeigt wird. &nbsp; Im Admin Bereich (Marketing -&gt; Lagerstandsbenachrichtigung) sieht der Shopbetreiber eine Übersicht alle User, die sich benachrichtigen lassen wollen (inkl. Status, ob und wann eine Benachrichtigung erfolgt ist).&nbsp; <br><br><h3>Funktionalität</h3><p>Seit version 3.2.0 gibt es zwei Möglichkeiten wie die E-Mail Benachrichtigung aktiviert werden kann.<br>In der ersten Variante ist in der Pluginkonfiguration die E-Mail Benachrichtigung auf immer inaktiv gesetzt.&nbsp; Bei dieser Einstellung wird das Benachrichtiungsfeld beim Produkt erst angezeigt sofern dieses keinen aktuellen verfügbaren Lagerstand besitzt und ein zusätzlicher Kenner für die E-Mail Benachrichtigung beim Produkt aktiviert wurde. Erst dann ist es dem Kunden möglich beim Produkt im Shop seine E-Mail Adresse einzugeben.<br>Bei der zweiten Variante ist in der Pluginkonfiguration die E-Mail Benachrichtigung auf immer aktiv gesetzt. Bei dieser Einstellung wird das Benachrichtiungsfeld beim Produkt sofort angezeigt sofern dieses keinen aktuellen verfügbaren Lagerstand besitzt. Es ist dem Kunden gleich möglich beim Produkt im Shop seine E-Mail Adresse einzugeben. Über einen Kenner beim Produkt, kann die E-Mail Benachrichtigung für dieses Produkt deaktiviert werden.<br>Sobald ein Kunde seine E-Mail Adresse eingegeben hat wird dieser automatisch benachrichtigt, sobald das Produkt einen verfügbaren Lagerstand besitzt. Dies wird über einen Scheduled Task (= Cronjob) einmal pro Tag geprüft und ausgeführt. <br></p><p><br></p><p>Im Admin Bereich erscheint bei dem jeweiligen Produkt unter dem Menüpunkt Lieferbarkeit ein Button \"E-Mail-Benachrichtigung anzeigen\"/\"E-Mail-Benachrichtigung nicht anzeigen\". Der Text des Buttons variiert je nachdem welche Einstellung zuvor in der Pluginkonfiguration gewählt wurde. Wird dieser aktiviert, wird auf der Produktdetail-Seite im Schaufenster das Feld für die Eingabe der E-Mail entweder angezeigt oder nicht angezeigt. <br></p><p><br></p><p>Nach Eingabe der E-Mail erscheint eine Auforderung, die E-Mail mittels Link zu bestätigen. So können ungültige oder nicht vorhanden E-Mails für die Benachrichtigung ausgeschlossen werden. Der Kunde erhält also eine E-Mail bei der Registrierung, bei der Bestätigung der E-Mail und wenn das Produkt wieder verfügbar ist. Die Templates der E-Mails können individuell gestaltet werden. <br></p><p><br></p><p>Im Admin unter Einstellungen &gt; Erweiterungen &gt; Lagerstands Benachrichtgungen befinden sich 2 verschiedene Möglichkeiten um zu sehen, welche Produkte \"nachgefragt\" wurden bzw, welche Kunden eine Benachrichtigung gewünscht haben und ob diese informiert wurden.<br></p><p><br></p><h3>Anwendungszenario <br></h3><p>Einer Ihrer Kunden möchte unbedingt ein bestimmtes Produkt in Ihrem Shop\nkaufen – leider ist es jedoch momentan ausverkauft und nicht mehr lagernd. Diese Situation ist sowohl für Sie als auch für\nIhren Kunden ärgerlich. Dieses Plugin, für eine E-Mail Benachrichtigung wenn der Lagerstand sich wieder erhöht, biete dafür die perfekte Lösung. Ihr Kunde kann in diesem Fall seine E-Mail-Adresse angeben und wird\nautomatisch benachrichtigt, sobald sein gewünschtes Produkt wieder verfügbar ist.</p><p><br></p><h3>Vorraussetzung für die ordnungsgemäße Funktion, ist die Einrichtung der Shopware Message Queue &amp; der Scheduled Tasks<br></h3><p>https://docs.shopware.com/en/shopware-platform-dev-en/developer-guide/core/message-queue</p><p>https://docs.shopware.com/de/shopware-6-de/tutorials-und-faq/scheduled-tasks-anlegen<br></p>","installationManual":"<p><b>Die Installation des Plugins geht sehr schnell und ist unkompliziert.</b></p><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren.</li><li>Keine weitere Konfiguration des Plugins möglich.</li></ul>","shortDescription":"Dieses Plugin ermöglicht es Kunden, sich für nicht lagernde Artikel, mittels E-Mail benachrichtigen zu lassen. Dies kann für Produkte über einen bestimmten Kenner, festgelegt werden.","highlights":"Benachrichtigungsmöglichkeit via E-Mail bei Produkten ohne Lagerstand. \nWenn die Benachrichtigung aktiv ist, dann wird der Kunde über die Produktverfügbarkeit informiert\nÜbersichtsliste der Benachrichtigung inkl. aktuellem Status\nIndividuell je Produkt einstellbar, ob die Benachrichtigungsfunktion angezeigt wird\neinstellbare Plugin Konfiguration, ob nur die Benachrichtigung bei nicht lagernden Produkten angezeigt wird oder ob das Produkt weiterhin bestellbar ist.","features":"Benachrichtigungsmöglichkeit via E-Mail bei Produkten ohne Lagerstand - Im Frontend wird ein Eingabefeld für die E-Mail Adresse bei Produkten eingeblendet\nAutomatische Benachrichtigung der Kunden, wenn sich der Lagerbestand des Produktes (auf bestellbar) ändert (Scheduled Tasks und Message Queue muss eingerichtet sein)\nE-Mail Template Vorlage für Benachrichtigung individuell anpassbar\nIm Shopware Admin Bereich: Übersichtsliste aller User, die eine Benachrichtigung wünschen inkl. aktuellem Status (offen, benachrichtigt am)"},{"id":22686,"name":"Stock Notification via E-Mail","description":"<h2>Range of functions<br></h2>If a product is not in stock, the user can be notified with his e-mail address sicht when the product is back in stock. The customer is automatically notified with a freely modifiable e-mail (once). The setting of the stock level notification is done individually for each product.<br>In the plugin configuration, the store owner can set whether products are orderable despite active e-mail notification or whether only the notification function is displayed. &nbsp; In the admin area (marketing -&gt; stock level notification), the store operator sees an overview of all users who want to be notified (including status, whether and when a notification has been made).&nbsp; <br><br><h3>Functionality</h3>Since version 3.2.0 there are two ways to activate the e-mail notification.<br>In the first variant, the e-mail notification is set to always inactive in the plugin configuration.&nbsp; With this setting, the notification field is only displayed for the product if it currently does not have an available stock level and an additional identifier has been activated for the e-mail notification for the product. Only then it is possible for the customer to enter the e-mail address in the store at the product.<br>With the second variant, the e-mail notification is set to always active in the plugin configuration. With this setting, the notification field is immediately displayed at the product if this has currently no available stock level. It is possible for the customer to enter the e-mail address in the store at the product. Over an identifier with the product, the e-mail notification for this product can be deactivated.<br>As soon as a customer has entered the e-mail address, this customer will be automatically notified as soon as the product has an available stock level. This is checked and executed via a scheduled task (= cronjob) once a day.<br><br>In the admin area, a button \"Show e-mail notification\"/\"Hide e-mail notification\" appears for the respective product under the menu item deliverability. The text of the button varies depending on which setting was previously selected in the plugin configuration. If this is activated, the field for entering the e-mail is either displayed or not displayed on the product detail page in the shop window.<br><br>After entering the e-mail, a prompt appears to confirm the e-mail using a link. This way, invalid or non-existent emails can be excluded for notification. So the customer will receive an email when registering, when confirming the email and when the product is available again. The templates of the emails can be customized.<br><br>In the admin under Settings &gt; Extensions &gt; Stock level notifications there are 2 different options to see which products have been \"requested\" or which customers have requested a notification and whether they have been informed.<p><br></p><h3>Application scenario <br></h3><p>One of your customers desperately wants to buy a certain product in your store\nbuy - unfortunately, however, it is currently sold out and no longer in stock. This situation is both for you and for\nyour customer annoying. This plugin, for an email notification when the stock level increases again, offers the perfect solution for this. Your customer can enter his email address in this case and will be\nautomatically notified as soon as his desired product is available again.</p><p><br></p><h3>Prerequisite for proper function, is the setup of the Shopware Message Queue &amp; the Scheduled Tasks<br></h3><p>https://docs.shopware.com/en/shopware-platform-dev-en/developer-guide/core/message-queue</p><p>https://docs.shopware.com/de/shopware-6-de/tutorials-und-faq/scheduled-tasks-anlegen<br></p>","installationManual":"<p><b>The installation of the plugin is very fast and straightforward.</b></p><ul><li>Call the Plugin Manager via Settings &gt; System &gt; Plugins.</li><li>Upload, install and activate the plugin.</li><li>No further configuration of the plugin possible.</li></ul>","shortDescription":"This plugin allows customers to be notified for products which are out of stock by entering their email. This can be set for products via a specific identifier.","highlights":"Notification option via e-mail for products without stock. \nIf the notification is active, then the customer is informed about the product availability.\nOverview list of the notification incl. current status\nIndividually adjustable for each product, whether the notification function is displayed\nAdjustable plugin configuration, whether only the notification is displayed for out-of-stock products or whether the product can still be ordered.","features":"Notification option via e-mail for products with an unavailable stock - An input field for the e-mail address is displayed in the frontend for products.\nAutomatic notification of customers when the stock level of the product changes (to orderable) (Scheduled Tasks and Message Queue must be set up)\nEmail template for notification individually customizable\nIn the Shopware admin area: overview list of all users who want to be notified incl. current status (open, notified on)"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":162869,"bookingKey":"acris67848641835","bookingText":"ACRIS Stock Notification via E-Mail","price":49,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":162868,"bookingKey":"acris67848641835_M","bookingText":"ACRIS Stock Notification via E-Mail","price":4.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdqgikJ","preview":true,"priority":1,"id":81938},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbn4c3o","preview":false,"priority":10,"id":81939},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvUPJZj","preview":false,"priority":9,"id":81936},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMZPsEa","preview":false,"priority":8,"id":81940},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWBzkse","preview":false,"priority":7,"id":81941},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSEb3o0","preview":false,"priority":6,"id":81942},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3j6RV1","preview":false,"priority":5,"id":81944},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php25BYJK","preview":false,"priority":4,"id":81943}],"comments":[{"authorName":"Andrea Hadrian","text":"eine absolut sinnvolle Erweiterung für uns, die auch gerne von unseren Kunden genutzt wird. \nUnd jetzt auch die Möglichkeit zur Massenbearbeitung der Produkte, so dass man es nicht mehr bei jeden Artikel einzeln aktivieren muss, ist sehr sehr hilfreich. Danke!","headline":"insbesondere bei Shops mit kleineren Lagerbeständen im Abverkaufmodus einfach sehr gut","creationDate":{"date":"2022-12-06 11:44:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"David Kattannek","text":"Das Plugin funktioniert super und lässt sich sehr leicht einrichten. Besonders cool ist, dass man die Mails anpassen kann, die verschickt werden. \nIch hatte noch eine Frage zum besseren Verständnis des Plugins und habe deshalb den Support kontaktiert. Der Support antwortet sehr schnell und auch noch am Abend. Besser geht es nicht. Wenn es wirklich mal eine Störung geben sollte, weiß ich, dass der Support schnell weiterhelfen kann.\nIch kann das Plugin nur empfehlen.","headline":"Super Plugin und sehr guter Support","creationDate":{"date":"2022-11-02 20:20:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Markus Käsbeck","text":"We use this extension since 4 months. It works perfectly and fast supports. No known issues about compatibility to other extension from the shopware store.","headline":"Works perfectly without issues","creationDate":{"date":"2022-08-04 08:46:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Lagerstands-E-Mail Benachrichtigung mit Übersichten","description":"<h2>Funktionsumfang <br /></h2>Wenn ein Produkt nicht lagernd ist, kann der User mit Angabe seiner E-Mail Adresse sicht benachrichtigen lassen, wenn das Produkt wieder lagernd ist. Der Kunde wird automatisch mit einem frei änderbaren E-Mail benachrichtigt (einmalig). Die Einstellung der Lagerstandsbenachrichtigung erfolgt bei jedem Produkt individuell.<br />In der Plugin Konfiguration, kann der Shopbetreiber einstellen, ob Produkte trotz aktiver E-Mail Benachrichtigung bestellbar sind oder ob nur die Benachrichtigungsfunktion angezeigt wird.   Im Admin Bereich (Marketing -&gt; Lagerstandsbenachrichtigung) sieht der Shopbetreiber eine Übersicht alle User, die sich benachrichtigen lassen wollen (inkl. Status, ob und wann eine Benachrichtigung erfolgt ist).  <br /><br /><h3>Funktionalität</h3><p>Seit version 3.2.0 gibt es zwei Möglichkeiten wie die E-Mail Benachrichtigung aktiviert werden kann.<br />In der ersten Variante ist in der Pluginkonfiguration die E-Mail Benachrichtigung auf immer inaktiv gesetzt.  Bei dieser Einstellung wird das Benachrichtiungsfeld beim Produkt erst angezeigt sofern dieses keinen aktuellen verfügbaren Lagerstand besitzt und ein zusätzlicher Kenner für die E-Mail Benachrichtigung beim Produkt aktiviert wurde. Erst dann ist es dem Kunden möglich beim Produkt im Shop seine E-Mail Adresse einzugeben.<br />Bei der zweiten Variante ist in der Pluginkonfiguration die E-Mail Benachrichtigung auf immer aktiv gesetzt. Bei dieser Einstellung wird das Benachrichtiungsfeld beim Produkt sofort angezeigt sofern dieses keinen aktuellen verfügbaren Lagerstand besitzt. Es ist dem Kunden gleich möglich beim Produkt im Shop seine E-Mail Adresse einzugeben. Über einen Kenner beim Produkt, kann die E-Mail Benachrichtigung für dieses Produkt deaktiviert werden.<br />Sobald ein Kunde seine E-Mail Adresse eingegeben hat wird dieser automatisch benachrichtigt, sobald das Produkt einen verfügbaren Lagerstand besitzt. Dies wird über einen Scheduled Task (= Cronjob) einmal pro Tag geprüft und ausgeführt. <br /></p><p><br /></p><p>Im Admin Bereich erscheint bei dem jeweiligen Produkt unter dem Menüpunkt Lieferbarkeit ein Button \"E-Mail-Benachrichtigung anzeigen\"/\"E-Mail-Benachrichtigung nicht anzeigen\". Der Text des Buttons variiert je nachdem welche Einstellung zuvor in der Pluginkonfiguration gewählt wurde. Wird dieser aktiviert, wird auf der Produktdetail-Seite im Schaufenster das Feld für die Eingabe der E-Mail entweder angezeigt oder nicht angezeigt. <br /></p><p><br /></p><p>Nach Eingabe der E-Mail erscheint eine Auforderung, die E-Mail mittels Link zu bestätigen. So können ungültige oder nicht vorhanden E-Mails für die Benachrichtigung ausgeschlossen werden. Der Kunde erhält also eine E-Mail bei der Registrierung, bei der Bestätigung der E-Mail und wenn das Produkt wieder verfügbar ist. Die Templates der E-Mails können individuell gestaltet werden. <br /></p><p><br /></p><p>Im Admin unter Einstellungen &gt; Erweiterungen &gt; Lagerstands Benachrichtgungen befinden sich 2 verschiedene Möglichkeiten um zu sehen, welche Produkte \"nachgefragt\" wurden bzw, welche Kunden eine Benachrichtigung gewünscht haben und ob diese informiert wurden.<br /></p><p><br /></p><h3>Anwendungszenario <br /></h3><p>Einer Ihrer Kunden möchte unbedingt ein bestimmtes Produkt in Ihrem Shop\nkaufen – leider ist es jedoch momentan ausverkauft und nicht mehr lagernd. Diese Situation ist sowohl für Sie als auch für\nIhren Kunden ärgerlich. Dieses Plugin, für eine E-Mail Benachrichtigung wenn der Lagerstand sich wieder erhöht, biete dafür die perfekte Lösung. Ihr Kunde kann in diesem Fall seine E-Mail-Adresse angeben und wird\nautomatisch benachrichtigt, sobald sein gewünschtes Produkt wieder verfügbar ist.</p><p><br /></p><h3>Vorraussetzung für die ordnungsgemäße Funktion, ist die Einrichtung der Shopware Message Queue &amp; der Scheduled Tasks<br /></h3><p>https://docs.shopware.com/en/shopware-platform-dev-en/developer-guide/core/message-queue</p><p>https://docs.shopware.com/de/shopware-6-de/tutorials-und-faq/scheduled-tasks-anlegen<br /></p>","installationManual":"<p><b>Die Installation des Plugins geht sehr schnell und ist unkompliziert.</b></p><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren.</li><li>Keine weitere Konfiguration des Plugins möglich.</li></ul>","version":"4.0.5","changelog":[{"version":"4.0.5","text":"<ul><li>Logic of orderable quantity and stock notification optimized</li><li>Renaming of the plugin setting for orderable products with active stock notification</li></ul>","creationDate":{"date":"2023-07-11 08:41:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.4","text":"<ul><li>Logic problem of orderable quantity and stock notification fixed</li></ul>","creationDate":{"date":"2023-07-06 11:55:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.3","text":"<p>Optimizes checking of the available products.</p>","creationDate":{"date":"2023-06-07 08:06:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"<p>Optimizes displaying of the stock notification for products listing in the Administration.</p>","creationDate":{"date":"2023-05-11 15:30:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<p>Optimizes overview based on products module in the Administration.</p>","creationDate":{"date":"2023-05-09 12:41:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>Compatibility established for SW 6.5</p>","creationDate":{"date":"2023-05-03 14:51:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.6","text":"<ul><li>Logic of orderable quantity and stock notification optimized</li><li>Renaming of the plugin setting for orderable products with active stock notification</li></ul>","creationDate":{"date":"2023-07-11 08:40:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.5","text":"<ul><li>Logic problem of orderable quantity and stock notification fixed<br /></li></ul>","creationDate":{"date":"2023-07-06 11:55:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.4","text":"<p>Optimizes displaying of the stock notification for products listing in the Administration.</p>","creationDate":{"date":"2023-05-11 15:30:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.3","text":"<p>Optimizes overview based on products module in the Administration.</p>","creationDate":{"date":"2023-05-09 12:41:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.2","text":"<p>Display problem on backorder products fixed.</p>","creationDate":{"date":"2023-04-18 15:09:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.1","text":"<ul><li>Logic of quantity selection improved<br /></li></ul>","creationDate":{"date":"2023-04-11 11:18:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"<ul><li>Plugin settings for quantity selection were combined<br /></li></ul>","creationDate":{"date":"2023-04-11 11:06:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"<ul><li>New plugin setting to limit the quantity selection from the product<br /></li></ul>","creationDate":{"date":"2023-03-30 09:41:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"<p>- Added registry date to stock notification table columns and detail page.</p>","creationDate":{"date":"2023-03-14 16:18:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.7","text":"<ul><li>Fixed product available for purchase email error.</li></ul>","creationDate":{"date":"2023-03-08 14:25:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.6","text":"<ul><li>Fixed email notification for product variants.</li></ul>","creationDate":{"date":"2023-03-06 13:12:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.5","text":"<ul><li>Fixes issue with stock notification not sending.</li></ul>","creationDate":{"date":"2023-03-01 15:35:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.4","text":"<ul><li>Fixes a problem with loading the listing \"Stock notification for products\" in the administration<br /></li></ul>","creationDate":{"date":"2023-02-27 11:14:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.3","text":"<ul><li>Optimizes the loading of the plugin configuration in the administration<br /></li></ul>","creationDate":{"date":"2023-02-23 10:03:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.2","text":"<ul><li>Fixes a problem loading the email notification field on the product page in administration<br /></li></ul>","creationDate":{"date":"2023-02-23 08:27:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.1","text":"<ul><li>Optimization of the product page in the administration</li><li>Optimization of the shopping cart logic of products with stock level notifications<br /></li></ul>","creationDate":{"date":"2023-02-16 15:30:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"<ul><li>New plugin setting to activate the stock notifications.<br /></li></ul>","creationDate":{"date":"2023-02-16 12:16:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.4","text":"<ul><li>Optimizes displaying of the stock notification form.</li><li>Optimizes loading of the stock notification products in the scheduled task.</li></ul>","creationDate":{"date":"2023-02-08 15:54:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.2","text":"<p>- Moves ACRIS E-Mail Notification to custom fields to save the additional fields correctly.</p>","creationDate":{"date":"2023-02-06 14:36:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<p>- Bulk edit for e-mail notification in Administration product edit page.</p>","creationDate":{"date":"2022-12-05 09:59:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<p>Optimizes loading of the stock notification at the Cms product detail page in Storefront.</p>","creationDate":{"date":"2022-06-23 08:14:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>Fixes error on administration building.</p>","creationDate":{"date":"2022-05-15 17:14:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<ul><li>Optimizes plugin image.</li><li>Improves compatibility with Shopware &gt;= 6.4.10.0.</li><li>Optimizes plugin color in administration.</li></ul>","creationDate":{"date":"2022-04-25 13:54:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>- Migration from business events to the flow builder.</p>\n                                                                                                            <p>- Improved compatibility with Shopware 6.4.6*.</p>","creationDate":{"date":"2022-02-18 07:55:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"<ul><li>Store Releae / Communtity Store Veröffentlichung</li></ul>","creationDate":{"date":"2022-02-03 07:58:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>Fixed setting next execution time for stock notification scheduled task.</p>","creationDate":{"date":"2021-03-23 13:24:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>Fixed setting of storefront URL for confirming email.</p>","creationDate":{"date":"2021-03-19 12:18:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Fixed missing default language for creating default data on plugin installation.</p>","creationDate":{"date":"2021-03-15 13:32:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Fixed help text for showing e-mail notification on product page.</p>\n                                                                                                            <p>Added product number column to notification list.</p>","creationDate":{"date":"2021-03-04 13:15:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris67848641835","redirectToStore":false,"lowestPriceValue":4.9}