{"id":13114,"name":"AcrisProductBadgesCS","code":"acris88121129316","lastChange":{"date":"2023-07-25 08:25:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpySRUpb","examplePageUrl":"","moduleKey":"AcrisProductBadgesCS","creationDate":{"date":"2021-03-04 09:31:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-03-09 14:14:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-03-04 09:35:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":22831,"name":"Badge Pro - Produkt Badges & Highlights","description":"<h3><b>Funktionsumfang</b></h3><p>Mit diesem Plugin is es möglich ganz einfach die Highlights eines Produktes individuell zu gestalten und zu platzieren. Dazu gibt es im Shopware Administrationsbereich eine eigene Verwaltungsübersicht. Es ist möglich Highlights regelbasierend (dynamische Produktgruppen) mehreren Produkten automatisch zuzuordnen. Zusätzlich ist eine Steuerung der Anzeige durch Nutzung von Regeln mittels Rule Builder möglich. Wenn mehrere Highlights bei einem Produkt angzeigt werden, so ist durch eine Priorisierung die Reihenfolge steuerbar. In der Administrationsübersicht wird angezeigt ob ein Highlight aktiv oder zeitgesteuert angezeigt wird. Die Anzeige bietet verschieden Platzierungsmöglichkeiten (links/ rechts, oben/ unten) auf der Produktübersichtsseite und auf der Produktdetailseite. Die Highlights (Badges) können mittels HEX Farbcode unterschiedlich dargestellt werden. Die angezeigten Highlighttexte können mittels HTML Editor formatiert werden und auch Grafiken beinhalten.</p><p><br></p><h2>Nutzung des Plugins</h2><h4>Erstellen Sie bitte zuerst eine Regel im RuleBuilder<br></h4><p>Im\nBereich Einstellungen -&gt; Shop-&gt; RuleBuilder -&gt; Regel erstellen <br></p><p>Hier\nwird eine Regel festgelegt, die Sie später bei den Produkt Badges zuweisen, wann diese angezeigt werden sollen. <br></p><p><br></p><h4>Als nächstes legen Sie eine dynamische Produktgrupppe an <br></h4><p>Im Bereich Katagloge -&gt; Dynamische Produktgruppen-&gt; Produktgruppe anlegen</p><p> Hier\nwird eine dynamische Produktgruppe erstellt, die Sie später bei den Produkt Badges zuweisen</p><p><br></p><h4>Danach Erstellung eines Produkt Badges<br></h4><p>Im Bereich Einstellungen -&gt; Plugins -&gt; Produkt Badges-&gt; Hinzufügen</p><p><b><br></b></p><h2><b>Konfigurations / Einstellungsmöglichkeiten</b></h2><h3><b>Grundeinstellungen<br></b></h3><p><b>Interner Name:</b> Für eine eindeutige Wiedererkennung, wird nur intern verwendet und ist auch nur dort ersichtlich</p><p><b>Aktiv:</b> Aktiv oder nicht aktiv</p><p><b>Aktiv von:</b> Hier kann ein Startdatum, ab wann die Produktabzeichen erscheinen sollen, angegeben werden<br></p><p><b>Aktiv bis:</b> Hier kann ein Enddatum, bis wann die Produktabzeichen erscheinen sollen, angegeben werden</p><p><b>Priorität: </b>Selbst definierte Priorität kann vergeben werden - bei mehreren Produktabzeichen werden diese nach Priorisierung gereiht <br></p><p><br></p><h3><b>Gestaltung</b><br></h3><p><b>Vordergrund: </b>Hier kann zwischen Text, Grafik (links) und Text oder Grafik gewählt werden <b><br></b></p><p><b>Badge-Text:</b> ein individueller Text, welches im Abzeichen erscheint, kann hier definiert werden<b><br></b></p><p><b>Badge-Textfarbe: </b>für diesen Text, kann eine Farbe mittels HEX Code, RGB oder über Alpha definiert werden <b><br></b></p><p><b>SVG Icon: </b>falls bei der Gestaltung eine Grafik für den Vordergrund ausgewählt wurde, kann hier das Medium hochgeladen werden<b><br></b></p><p><b>Hintergrund: </b>für den Hintergrund des Abzeichen kann zwischen einer Farb- und Formauswahl oder einem Grafikupload gewählt werden<b><br></b></p><p><b>SVG Hintergrund From: </b>falls eine Grafik als Hintergrund verwendet werden soll, kann diese hier hochgeladen werden<b><br></b></p><p><b>Hintergrundfarbe: </b>eine individuelle Farbe, welches als Hintergrund beim Produkt Highlight erscheinen soll, kann hier definiert werden<b><br></b></p><p><b>Hintergrund Form:</b> hier kann zwischen einer runden und rechteckiger Form, welches das Produkt Highlight haben soll, gewählt werden <b><br></b></p><p><b><br></b></p><h3><b>Platzierung</b></h3><p><b>Produktbox im Artikellisting: </b>Hier kann ausgwählt werden ob das Produkt Hightlight rechts/links oben oder rechts/links unten, auf der Übersichtsseite angezeigt werden sollen<b><br></b></p><p><b>Produktdetailseite: </b>Hier kann ausgewählt werden ob das Produkt Highlight rechts/links\noben oder rechts/links unten, auf der Produktdetailseite angezeigt werden\n\nsollen</p><p><br></p><h3><b>Anzeigebedingung</b><br></h3><p><b>Regeln: </b>auf eine durch den Rule Builder erstellte Regel verweisen, unter welchen Bedingungen die Abzeichen angzeigt werden sollen. Das Produkt Badge wird im Shop angezeigt, wenn eine der zugewiesenen Regeln aktiv ist.</p><p><b>Dynamische Produktgruppe:</b> Hier kann eine dynamische Produktgruppe ausgwählt werden, wo die Abzeichen angezeigt werden sollen. Das Produkt Highlight wird in der Storefront angezeigt, wenn eine der zugewiesenen dynamischen Produktgruppen aktiv ist.</p><p><br></p><h4>Für was brauche ich Produkt Badgets/Highlights?</h4><p>Diese Art von Produkt Highlights können für vielerlei Zwecke verwendet werden. Damit können Hersteller, besondere Merkmale oder Abverkaufsprodukte ganz einfach gekennzeichnet werden. Durch die individuelle Gestaltung von Text, Grafik oder die Kombination aus Text und Grafik steht eine Vielzahl an Möglichkeiten offen. Vor allem die Priorisierung und individuelle Platzierung fördert das Zusammenspiel von mehreren Badges. Durch die regelbasierte Anwendung mit dynamischen Produktgruppen können diese Highlights auch ganz spezifisch zugewiesen werden. Zusätzlich können durch Nutzung von Regeln mittels Rule Builder weitere Anzeigeregeln festgelegt werden.</p><p><br></p><p><b>Änderung der Badges - Platzierung mittels CSS möglich</b><br></p><ul><li>.acris-product-badges-right-bottom {bottom: -30px;}</li><li>.acris-product-badges-left-bottom {bottom: -30px;}</li></ul>","installationManual":"<p><b>Die Installation des Plugins geht sehr schnell und ist unkompliziert.</b></p><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren.</li><li>Danach kann das Plugin indviduell konfiguriert werden.</li></ul>","shortDescription":"Das Plugin bietet die Möglichkeit, Kennzeichenfür Produkte in der Storefront zu konfigurieren und anzuzeigen. Die Badges erscheinen auf der Übersichtsseite sowie auf der Detailseite.","highlights":"Produkt Highlights (Badges) im Artikellisting und auf der Produktdetailseite anzeigen, dabei sind verschiedene Positionen einstellbar\nHighlights (Badges) indivduell gestalten mit Texten, Grafiken oder einer Kombination von Text und Grafik gestalten. Texte mittels HTML Editor konfigurierbar \nHighlightverwaltung im Shopware Adminbereich, inkl. Priorisierung \nNutzung der dynamischen Produktgruppen (bei welchen Produkten die Highlights angezeigt werden sollen)\nOptional: Einschränkung der Anzeige durch Nutzung von Regeln mittels Rule Builder","features":"Produkt Highlights auf der Produktübersichtsseite und der Produktdetailseite anzeigen \nAlle Highlights im Shopware Adminbereich übersichtlich verwalten \nMehrere Highlights gleichzeitig aktivieren, priorisieren und zeitsteuern\nZuweisung der Highlights zu den Produkten erfolgt über dynamische Produktgruppen (z.b. Produkte mit Preis &gt;100€)\nZusätzliche Möglichkeit der Nutzung von Regeln mittels Rule Builders (z.b. Produkte mit Neuheit = Ja)"},{"id":22832,"name":"Badge Pro - Product Badges & Highlights","description":"<h3><b>Features</b></h3><p>With this plugin it is possible to easily customize and place the highlights of a product. For this purpose, there is a separate administration overview in the Shopware administration area. It is possible to automatically assign highlights to multiple products based on rules (dynamic product groups). In addition, it is possible to control the display by using rules via Rule Builder. If several highlights are displayed for one product, the order can be controlled by prioritization. The administration overview shows whether a highlight is displayed actively or time-controlled. The display offers different placement options (left/right, top/bottom) on the product overview page and on the product detail page. The highlights (badges) can be displayed differently using HEX color codes. The displayed highlight texts can be formatted using HTML editor and also include graphics.</p><p><br></p><h2>Using the plugin</h2><h4>Please first create a rule in RuleBuilder<br></h4><p>In the\nSettings -&gt; Shop-&gt; RuleBuilder -&gt; Create rule<br></p><p>Here.\nsets a rule that you will later assign to the product badges when they should be displayed. <br></p><p><br></p><h4>Next, create a dynamic product group <br></h4><p>In the catagloge -&gt; Dynamic product group-&gt; Create product group</p><p>Here.\na dynamic product group will be created, which you will assign later in the product badges</p><p><br></p><h4>After creating a product badge<br></h4><p>In the section Settings -&gt; Plugins -&gt; Product Badges-&gt; Add</p><p><b><br></b></p><h2><b>Configuration / Setting Options</b></h2><h3><b>Basic Settings<br></b></h3><p><b>Internal Name: </b> For a unique recognition, is only used internally and is also only visible there</p><p><b>Active:</b> Active or not active</p><p><b>Active from:</b> Here a start date, from when the product badges should appear, can be specified<br></p><p><b>Active until: </b> An end date until when the product badges should appear can be specified here</p><p><b>Priority: </b>Your own defined priority can be assigned - if there are multiple product badges, they will be ranked according to prioritization<br></p><p><br></p><h3><b>Design</b><br></h3><p><b>Front: </b>here you can choose between text, graphic (left) and text or graphic<b><br></b></p><p><b>badge text:</b>an individual text which appears in the badge can be defined here<b><br></b></p><p><b>badge text color: </b>for this text, a color can be defined using HEX code, RGB or via alpha <b><br></b></p><p><b>SVG Icon: </b>if a graphic was selected for the foreground during design, the medium can be uploaded here<b><br></b></p><p><b>Background: </b>for the background of the badge can be chosen between a color and shape selection or a graphic upload<b><br></b></p><p><b>SVG Background From: </b>if a graphic is to be used as background, it can be uploaded here<b><br></b></p><p><b>Background Color: </b>an individual color, which should appear as background at the product highlight, can be defined here<b><br></b></p><p><b>Background Shape: </b>here you can choose between a round and rectangular shape, which the product highlight should have <b><br></b></p><p><b><br></b></p><h3><b>Placement</b></h3><p><b>Product Box in Item Listing: </b>Here you can select if the product highlight should be displayed on the right/left top or right/left bottom, on the overview page<b><br></b></p><p><b>Product detail page: </b>Here you can select if the product highlight should be displayed on the right/left\n\n\ntop or right/left bottom, be displayed on the product detail page.\n\n\nshould</p><p><br></p><h3><b>Display condition</b><br></h3><p><b>Rules: </b>refer to a rule created by the Rule Builder, under which conditions the badges should be displayed. The product badge will be displayed in the store if one of the assigned rules is active.</p><p><b>Dynamic product group:</b> Here you can select a dynamic product group where the badges should be displayed. The product highlight will be displayed in the storefront if one of the assigned dynamic product groups is active.</p><p><br></p><h4>Why do I need product badges ?</h4><p>This kind of product highlight can be used for many purposes. It can be used to mark manufacturers, special features or sales products easily. Through the individual design of text, graphics or the combination of text and graphics, a variety of possibilities are open. Especially the prioritization and individual placement promotes the interaction of multiple badges. Through the rule-based application with dynamic product groups, these highlights can also be assigned very specifically. In addition, further display rules can be defined by using rules via Rule Builder.</p><p><br></p><p><b>Position changes of the Badges via CSS possible</b><br></p><ul><li>.acris-product-badges-right-bottom {bottom: -30px;}</li><li>.acris-product-badges-left-bottom {bottom: -30px;}</li></ul>","installationManual":"<p><b>The installation of the plugin is very fast and straightforward.</b></p><ul><li>Call Plugin Manager via Settings &gt; System &gt; Plugins</li><li>Upload, install and activate the plugin.</li><li>After that, the plugin can be configured indviduell.</li></ul>","shortDescription":"The plugin provides the possibility to configure and display badges for products in the storefront. The badges appear on the overview page as well as on the details page.","highlights":"Show product highlights (badges) in the article listing and on the product detail page, different positions are adjustable.\nHightlights (badges) can be designed individually with text, graphics or a combination of text and graphics. Texts configurable with HTML editor \nHighlight management in the Shopware admin area, including prioritization \nUse of dynamic product groups (for which products the highlights should be displayed)\nOptional: Restriction of the display by using rules via Rule Builder","features":"Show product highlights on the product overview page and the product detail page \nManage all highlights clearly in the Shopware admin area \nActivate, prioritize and schedule multiple highlights at the same time\nAssignment of highlights to products via dynamic product groups (e.g. products with price &gt;100€)\nAdditional possibility to use rules via rule builder (e.g. products with novelty = yes)"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":162826,"bookingKey":"acris88121129316","bookingText":"","price":199,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":162825,"bookingKey":"acris88121129316_M","bookingText":"","price":19.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdCHuLB","preview":true,"priority":0,"id":67835},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBSt1zF","preview":false,"priority":12,"id":61481},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJWsExR","preview":false,"priority":11,"id":61451},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNkwOpS","preview":false,"priority":8,"id":61452},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUvatyR","preview":false,"priority":7,"id":61449},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBOwLZR","preview":false,"priority":6,"id":61450},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplTFacP","preview":false,"priority":0,"id":61444},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4DszGQ","preview":false,"priority":0,"id":61445},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpr3SXNv","preview":false,"priority":0,"id":61446},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAEaqmR","preview":false,"priority":0,"id":61447},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSGb8wR","preview":false,"priority":0,"id":61448},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdiajyc","preview":false,"priority":0,"id":61482}],"comments":[{"authorName":"Mert","text":"Wie der Titel schon sagt, wirklich gut durchdacht und druch die individualisierbaren Einstellungen sehr mächtig! Insbesondere die Flexibilität mit dem Rule Builder und den Anzeigeoptionen ist wirklich clever. \n\nIch hatte ein paar Sondernanpassungen die nötig waren und diese wurden super schnell und perfekt umgesetzt! \n\nNur zu empfehlen!","headline":"Unglaublich nützlich und sauber umgesetzt","creationDate":{"date":"2023-04-07 19:06:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"M. Jansen","text":"A great plugin with many features. We had some suggestions to further improve flexibility, which was deemed usefull and quickly implemented!","headline":"Great plugin with many features","creationDate":{"date":"2023-02-03 11:23:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Thomas R.","text":"Viele tolle Funktionen &amp; sehr schneller Produktsupport, wir hatten ein Problem mit zu vielen DB Abfragen bei mit dem Plugin, dies wurde sehr schnell gelöst und ein Update freigeschalten. Sehr zu empfehlen!","headline":"Sehr gutes Plugin &amp; schneller Support","creationDate":{"date":"2022-11-16 15:55:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Stefan Felder MyDarts.ch","text":"Wo soll ich anfangen.. Das Modul bietet mit der Art wie die Auswahl der Badges aufgebaut ist eine extreme vielfalt an Möglichkeiten. Wir haben die verschiedenen Badge Module verglichen und kamen zum Schluss, dass nur dieses in Frage kommt. \nZu Beginn gab es ein paar Probleme, die aber im Zusammenhang mit der Kompatibilität zu unserem Theme lagen. Nicht nur, dass der Fehler schnell gefunden wurde.. Es wurde gleich der passende Quellcode mit Anleitung zum einbinden an korrekter Stelle geliefert. Perfekt, wie auch bei den anderen ACRIS Erweiterungen. Danke!","headline":"1a Modul mit 1a Support","creationDate":{"date":"2022-10-11 17:43:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Badge Pro - Produkt Badges & Highlights","description":"<h3><b>Funktionsumfang</b></h3><p>Mit diesem Plugin is es möglich ganz einfach die Highlights eines Produktes individuell zu gestalten und zu platzieren. Dazu gibt es im Shopware Administrationsbereich eine eigene Verwaltungsübersicht. Es ist möglich Highlights regelbasierend (dynamische Produktgruppen) mehreren Produkten automatisch zuzuordnen. Zusätzlich ist eine Steuerung der Anzeige durch Nutzung von Regeln mittels Rule Builder möglich. Wenn mehrere Highlights bei einem Produkt angzeigt werden, so ist durch eine Priorisierung die Reihenfolge steuerbar. In der Administrationsübersicht wird angezeigt ob ein Highlight aktiv oder zeitgesteuert angezeigt wird. Die Anzeige bietet verschieden Platzierungsmöglichkeiten (links/ rechts, oben/ unten) auf der Produktübersichtsseite und auf der Produktdetailseite. Die Highlights (Badges) können mittels HEX Farbcode unterschiedlich dargestellt werden. Die angezeigten Highlighttexte können mittels HTML Editor formatiert werden und auch Grafiken beinhalten.</p><p><br /></p><h2>Nutzung des Plugins</h2><h4>Erstellen Sie bitte zuerst eine Regel im RuleBuilder<br /></h4><p>Im\nBereich Einstellungen -&gt; Shop-&gt; RuleBuilder -&gt; Regel erstellen <br /></p><p>Hier\nwird eine Regel festgelegt, die Sie später bei den Produkt Badges zuweisen, wann diese angezeigt werden sollen. <br /></p><p><br /></p><h4>Als nächstes legen Sie eine dynamische Produktgrupppe an <br /></h4><p>Im Bereich Katagloge -&gt; Dynamische Produktgruppen-&gt; Produktgruppe anlegen</p><p> Hier\nwird eine dynamische Produktgruppe erstellt, die Sie später bei den Produkt Badges zuweisen</p><p><br /></p><h4>Danach Erstellung eines Produkt Badges<br /></h4><p>Im Bereich Einstellungen -&gt; Plugins -&gt; Produkt Badges-&gt; Hinzufügen</p><p><b><br /></b></p><h2><b>Konfigurations / Einstellungsmöglichkeiten</b></h2><h3><b>Grundeinstellungen<br /></b></h3><p><b>Interner Name:</b> Für eine eindeutige Wiedererkennung, wird nur intern verwendet und ist auch nur dort ersichtlich</p><p><b>Aktiv:</b> Aktiv oder nicht aktiv</p><p><b>Aktiv von:</b> Hier kann ein Startdatum, ab wann die Produktabzeichen erscheinen sollen, angegeben werden<br /></p><p><b>Aktiv bis:</b> Hier kann ein Enddatum, bis wann die Produktabzeichen erscheinen sollen, angegeben werden</p><p><b>Priorität: </b>Selbst definierte Priorität kann vergeben werden - bei mehreren Produktabzeichen werden diese nach Priorisierung gereiht <br /></p><p><br /></p><h3><b>Gestaltung</b><br /></h3><p><b>Vordergrund: </b>Hier kann zwischen Text, Grafik (links) und Text oder Grafik gewählt werden <b><br /></b></p><p><b>Badge-Text:</b> ein individueller Text, welches im Abzeichen erscheint, kann hier definiert werden<b><br /></b></p><p><b>Badge-Textfarbe: </b>für diesen Text, kann eine Farbe mittels HEX Code, RGB oder über Alpha definiert werden <b><br /></b></p><p><b>SVG Icon: </b>falls bei der Gestaltung eine Grafik für den Vordergrund ausgewählt wurde, kann hier das Medium hochgeladen werden<b><br /></b></p><p><b>Hintergrund: </b>für den Hintergrund des Abzeichen kann zwischen einer Farb- und Formauswahl oder einem Grafikupload gewählt werden<b><br /></b></p><p><b>SVG Hintergrund From: </b>falls eine Grafik als Hintergrund verwendet werden soll, kann diese hier hochgeladen werden<b><br /></b></p><p><b>Hintergrundfarbe: </b>eine individuelle Farbe, welches als Hintergrund beim Produkt Highlight erscheinen soll, kann hier definiert werden<b><br /></b></p><p><b>Hintergrund Form:</b> hier kann zwischen einer runden und rechteckiger Form, welches das Produkt Highlight haben soll, gewählt werden <b><br /></b></p><p><b><br /></b></p><h3><b>Platzierung</b></h3><p><b>Produktbox im Artikellisting: </b>Hier kann ausgwählt werden ob das Produkt Hightlight rechts/links oben oder rechts/links unten, auf der Übersichtsseite angezeigt werden sollen<b><br /></b></p><p><b>Produktdetailseite: </b>Hier kann ausgewählt werden ob das Produkt Highlight rechts/links\noben oder rechts/links unten, auf der Produktdetailseite angezeigt werden\n\nsollen</p><p><br /></p><h3><b>Anzeigebedingung</b><br /></h3><p><b>Regeln: </b>auf eine durch den Rule Builder erstellte Regel verweisen, unter welchen Bedingungen die Abzeichen angzeigt werden sollen. Das Produkt Badge wird im Shop angezeigt, wenn eine der zugewiesenen Regeln aktiv ist.</p><p><b>Dynamische Produktgruppe:</b> Hier kann eine dynamische Produktgruppe ausgwählt werden, wo die Abzeichen angezeigt werden sollen. Das Produkt Highlight wird in der Storefront angezeigt, wenn eine der zugewiesenen dynamischen Produktgruppen aktiv ist.</p><p><br /></p><h4>Für was brauche ich Produkt Badgets/Highlights?</h4><p>Diese Art von Produkt Highlights können für vielerlei Zwecke verwendet werden. Damit können Hersteller, besondere Merkmale oder Abverkaufsprodukte ganz einfach gekennzeichnet werden. Durch die individuelle Gestaltung von Text, Grafik oder die Kombination aus Text und Grafik steht eine Vielzahl an Möglichkeiten offen. Vor allem die Priorisierung und individuelle Platzierung fördert das Zusammenspiel von mehreren Badges. Durch die regelbasierte Anwendung mit dynamischen Produktgruppen können diese Highlights auch ganz spezifisch zugewiesen werden. Zusätzlich können durch Nutzung von Regeln mittels Rule Builder weitere Anzeigeregeln festgelegt werden.</p><p><br /></p><p><b>Änderung der Badges - Platzierung mittels CSS möglich</b><br /></p><ul><li>.acris-product-badges-right-bottom {bottom: -30px;}</li><li>.acris-product-badges-left-bottom {bottom: -30px;}</li></ul>","installationManual":"<p><b>Die Installation des Plugins geht sehr schnell und ist unkompliziert.</b></p><ul><li>Plugin Manager über Einstellungen &gt; System &gt; Plugins aufrufen</li><li>Das Plugin hochladen, installieren und aktivieren.</li><li>Danach kann das Plugin indviduell konfiguriert werden.</li></ul>","version":"4.0.5","changelog":[{"version":"4.0.5","text":"<p>Fixes a problem when the height of the badges was specified smaller than 20px in the plugin settings.</p>","creationDate":{"date":"2023-07-25 08:25:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.4","text":"<ul><li>Improved performance when loading the product list.</li></ul><ul><li>Improved configuration of badge product variables.</li></ul>","creationDate":{"date":"2023-07-17 08:41:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.3","text":"<ul><li>Optimised badge display if we use product properties variable</li></ul>","creationDate":{"date":"2023-07-07 11:32:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"<ul><li>Improved storefront compatibility with other plugins.</li></ul>","creationDate":{"date":"2023-06-19 07:52:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<ul><li>Fixes a problem loading badges on the product detail page<br /></li></ul>","creationDate":{"date":"2023-05-23 12:01:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>Compatibility established with SW 6.5</p>","creationDate":{"date":"2023-04-21 14:29:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.3","text":"<ul><li>Fixes a problem loading badges on the product detail page<br /></li></ul>","creationDate":{"date":"2023-05-23 11:59:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.2","text":"<p>- Improves plugin compatibility.</p>\n                                                                                                    <p>- Change of the plugin name and the manufacturer links.</p>\n                                                                                            <p></p>","creationDate":{"date":"2023-04-06 15:00:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"<ul><li>Height of badges can be adjusted in the plugin configuration</li><li>Rounding of the badges can be adjusted</li><li>Improves plugin compatibility</li></ul>","creationDate":{"date":"2023-02-03 09:59:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<ul><li>Added badge positioning option for product detail to plugin configuration.</li></ul>","creationDate":{"date":"2022-11-18 11:46:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.5","text":"<p>Optimizes plugin compatibility.</p>","creationDate":{"date":"2022-11-16 08:51:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"<p>Improves performance on loading of the product badges in the Storefront.</p>","creationDate":{"date":"2022-11-15 11:52:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<ul><li>Fixes error when duplicating rules<br /></li></ul>","creationDate":{"date":"2022-10-17 09:48:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<ul><li>Fixes error when loading product badges<br /></li></ul>","creationDate":{"date":"2022-10-11 13:49:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<ul><li>Optimizes loading of product badge data<br /></li></ul>","creationDate":{"date":"2022-10-10 11:36:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>Performance optimisation.</p>","creationDate":{"date":"2022-08-22 10:48:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<ul><li>The position of the badges can now be better controlled via the plugin configuration.</li></ul>","creationDate":{"date":"2022-08-16 14:41:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.5","text":"<p>Improved plugin compatibility.</p>","creationDate":{"date":"2022-08-16 06:22:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.4","text":"<ul><li> Optimizes saving of the product badges in the Administration.</li></ul>","creationDate":{"date":"2022-08-02 08:23:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"<p>Fixes a problem where badges were not displayed on product detail pages when using a shopping experience layout.</p>","creationDate":{"date":"2022-06-29 14:15:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<ul><li>Improves compatibility with Shopware &gt;= 6.4.10.0.\n                                                                                                            </li></ul><ul><li>Optimizes plugin color in administration.</li></ul>","creationDate":{"date":"2022-04-24 15:01:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p>Adds possibility to insert variables to the badge text and displays value of the assigned variables at Storefront. </p>","creationDate":{"date":"2021-12-03 20:08:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>- Optimizes the loading of the badges.</p>\n                                                                                                            <p>- Adds possibility to replace default badges.</p>","creationDate":{"date":"2021-11-29 15:15:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Optimizes loading of the CMS elements.</p>","creationDate":{"date":"2021-11-16 12:27:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>Fixes problem on removing of the products with association.</p>","creationDate":{"date":"2021-09-30 09:00:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul><li>Compatible with 6.4.x.x<br /></li></ul>","creationDate":{"date":"2021-09-29 17:07:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"<p>Displays product badges at Cms pages.</p>","creationDate":{"date":"2021-09-21 09:02:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<p>Optimisation in connection with various themes and different product boxes</p>","creationDate":{"date":"2021-09-29 20:41:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<p>Performance optimisations</p>","creationDate":{"date":"2021-06-01 12:53:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"- Fixes an issue where badges are not loaded in product search results.<br />- Fix several issues change default values<br /><p>- Improve compatibility with \"ACRIS Promotion\" plugin.</p>","creationDate":{"date":"2021-05-25 13:55:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p>- Fixed badge display on product detail page.</p><p>- Added Shopware default badges to badge listing.<br />- Allows you do customize Shopware default badges.<br /></p><p><br /></p>","creationDate":{"date":"2021-05-19 16:05:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>Replace the default badge with custom badges, adjusted badges for multiple promotions.</p>","creationDate":{"date":"2021-05-04 14:04:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>Add promotions as display condition for displaying badges at storefront.</p>","creationDate":{"date":"2021-05-03 12:09:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- Fixes a problem with the differentiation between the display positions between product detail page and product box.</p>","creationDate":{"date":"2021-03-08 14:14:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Adds the option to not use a background for product badges.</p><p>- Optimisation and bug fixes of the storefront display in connection with the display of graphics</p><p>- Adds the display of badges on the product detail page.</p>\n                                                                                                            <p>- Allows you to enter HTML code as badge text.</p>","creationDate":{"date":"2021-03-08 11:23:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris88121129316","redirectToStore":false,"lowestPriceValue":19.9}