{"id":13193,"name":"IweltClickAndCollect","code":"iwelt69520975773","lastChange":{"date":"2023-07-18 11:16:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe61Z1w","examplePageUrl":"","moduleKey":"IweltClickAndCollect","creationDate":{"date":"2021-03-17 14:30:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-03-31 16:37:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-03-24 09:33:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3145,"prefix":"iwelt","name":"iWelt GmbH + Co. KG","website":"//iwelt.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3145_iwelt-shopware-hersteller.jpg"},"infos":[{"id":22969,"name":"Easy Click & Collect - Selbstabholung","description":"<p>Bieten Sie mit unserer <b>Click &amp; Collect</b> App Ihren Kunden jetzt die Möglichkeit <b>Bestellungen selbst vor Ort abzuholen</b>. Gerade in Zeiten wie diesen, in denen Ihr Store nicht regulär öffnen kann, können Sie mit Click &amp; Collect Ihren Kunden ein Stück Normalität zurückgeben. So haben Ihre Kunden die Möglichkeit die gewünschten Produkte in einer Ihrer Filialen zu einem <b>beliebigen Zeitpunkt abzuholen</b>, während Sie als Händler sich den zeitaufwändigen Versandprozess sparen. Außerdem <b>können</b> Sie Ihren Kunden einfach und flexibel die <b>Barzahlung vor Ort </b><b>ermöglichen</b>.</p><p><br /></p><p></p><h3><b>Weitere Features folgen</b></h3><p><b></b></p><p><b></b></p><b></b><p>Um Ihnen die bestmögliche Nutzung und Erfahrung mit unserer App bieten zu können, werden wir den Funktionsumfang zukünftig stetig erweitern.</p><p></p><p>Wenn Sie Wünsche und Anregungen zu unserer App haben, können Sie diese gerne einbringen, um uns bei der Verbesserung zu unterstützen und von weiteren Funktionen zu profitieren.</p><p></p><p> </p><h4>Es erwarten Sie zukünftig weitere Features, wie …</h4><p></p><ul><li>frei auswählbare Termine innerhalb der Öffnungszeiten zur Abholung mit der Möglichkeit Tage auszuschließen und die notwendige Vorlaufzeit zu konfigurieren.</li><li><p>das Hinterlegen von Urlaubs- und Feiertagen, damit ein Kunde diese Tage nicht zur Abholung auswählen kann.</p></li><li>die Möglichkeit zur Hinterlegung von beliebig vielen Abholorten über einen separaten Menüpunkt in der Administration.</li></ul><p></p><p></p><p></p>","installationManual":"<strong>Um die App einzurichten, muss dieses zuvor bereits installiert und aktiviert worden sein. Bei der Installation der App werden Versand- und Zahlungsart bereits angelegt. Folgende Schritte sind durchzuführen:</strong><ol><li>Gehen Sie in der Administrationsoberfläche auf Ihren Verkaufskanal. Dort müssen Sie die <b>Versandart \"Selbstabholung\"</b> hinzufügen.</li><li>Wünschen Sie auch eine mögliche <b>„Barzahlung bei Abholung“</b>, kann das im Feld der <b>„Zahlungsarten“</b> ebenfalls <b>hinzugefügt</b> werden. Die notwendige Regel, dass die Zahlungsart Barzahlung vom Kunden nur ausgewählt werden kann, wenn auch die Versandart „Selbstabholung“ verwendet wird, wurde mit der Installation bereits korrekt hinterlegt und aktiviert.</li><li>Stellen Sie nun sicher, dass in der <b>Appkonfiguration mindestens die erste Abholadresse eingetragen</b> ist.</li></ol><p><br /></p><h3>Konfigurationsmöglichkeiten:</h3><p></p><ul><li>Sie können das durch die Installation hinzugefügte E-Mail-Template mit Hilfe der dort verwendeten Variablen individuell nach Ihren Wünschen bearbeiten.</li><li>Wenn Sie ein eigenes E-Mail-Template verwenden möchten, können Sie dieses im von der App hinzugefügten Business-Event hinterlegen. Auf die Zusatzfelder zur Verwendung des Abholortes inkl. der Öffnungszeiten kann im E-Mail-Template ebenfalls zugegriffen werden - die Variablen hierfür können Sie dem ursprünglichen E-Mail-Template entnehmen.</li><li>Logos können der Versand- und Zahlungsart über die Administrationsoberfläche hinzugefügt werden.</li><li>In der Appkonfiguration können Sie insgesamt 3 Abholorte inkl. Öffnungszeiten hinterlegen. Sie haben die Möglichkeit Abholorte zu deaktivieren, um diese evtl. zu einem späteren Zeitpunkt wieder zu aktivieren. Der erste Ort kann allerdings nicht deaktiviert werden - dieser ist als Hauptabholort verpflichtend zu hinterlegen.</li></ul><p></p>","shortDescription":"Ermöglichen Sie Ihren Kunden die Abholung der Bestellung in einer Ihrer Filialen (bis zu 3, inkl. Öffnungszeiten/Freitext). Zudem erhalten diese die Möglichkeit zur Barzahlung vor Ort.","highlights":"Einfach und  flexibel: Der Kunde kann zwischen drei verschiedenen Abholorten wählen\nAnzeige der Öffnungszeiten für bessere Erreichbarkeit \n„Barzahlung bei Abholung“ als mögliche Zahlungsart, wenn Selbstabholung ausgewählt ist\nBestellbestätigung per Mail: individuell anpassbares Template, abgestimmt auf die Selbstabholung","features":"Flexible Auswahl des Abholortes: Der Kunde kann individuell den Abholort auswählen, der für ihn am nächsten ist. \nBei Selbstabholung wird an sämtlichen notwendigen Stellen - sowohl für den Kunden im Shop als auch für Sie in der Administration - die Abholadresse statt einer Lieferadresse angezeigt.\nÜber die Appkonfiguration können Sie ohne viel Aufwand Ihre Stores inkl. Öffnungszeiten mit Hilfe mehrzeiliger Textfelder hinterlegen.\nEine zusätzliche E-Mail zur Bestellbestätigung ist individuell auf die Selbstabholung abgestimmt. Das Template kann wie gewohnt in der Administrationsoberfläche angepasst werden. Über die Business Events kann außerdem ein eigens erstelltes Mailtemplate hinterlegt werden!\nje nach Belieben können für die verschiedenen Versandarten Zusatzkosten hinterlegt und automatisch in die Bestellung einberechnet werden.\nSowohl für Versand- als auch Zahlungsart können individuell Logos hinterlegt werden.\nÜberschriften können durch individuelle Textbausteine angepasst werden\nIn den mehrzeiligen Textfeldern der Appkonfiguration können (für techn. erfahrenere Kunden) auch sogenannte Inline-Styles problemlos verwendet werden."},{"id":22970,"name":"Easy Click & Collect - Store pickup","description":"<p>Offer your customers the option to pick up their orders on site with our <b>click &amp; collect</b> app. Precisely in times like these, where your store cannot be opened regularly, click &amp; collect helps you creating a bit of normality. The app provides your customers with the opportunity to <b>pick up the requested products in one of your stores any time during regular business hours,</b> while you as a retailer save yourself time of the consuming shipping process. In addition, you <b>can offer cash payment upon pickup</b>.</p><p><br /></p><h3>More features to come:</h3><p>In order to offer you the best possible usage and experience with our app, we will continuously expand the scope of functions in the future. If you have any suggestions concerning our app, please feel free to submit them. This will help us to improve our app.</p><p><br /></p><h4>More features can be expected, such as:</h4><p></p><ul><li>Freely selectable dates within the opening hours for pickup, with the possibility to exclude days and configure the necessary lead time.</li><li>Option to add specific dates such as vacations and public holidays so that a customer cannot select these dates for collection.</li><li>Possibility to store as many numbers of pickup locations as desired in a separate section of the administration interface.</li></ul><p></p>","installationManual":"<p>To set up the app, it must already be installed and activated.During the installation process, payment and shipping including all necessary components are automatically generated.</p><p><br /></p><h3>Steps to set up correctly:</h3><p></p><ol><li>Go to your sales channel in the administration interface. There you<b> have to add the shipping method \"self-pickup\"</b>.</li><li>If you wish to offer<b> \"cash payment upon pickup\"</b>, you can <b>add</b> this option in the section <b>\"Payment methods\"</b>. However, \"cash payment upon pickup\" can only be selected if the customer has chosen the shipping method \"self-pickup\" before. The corresponding rule has already been correctly preset and activated upon installation of the app.</li><li>Make sure that the <b>app configuration</b> contains <b>at least</b> the <b>primary pickup address</b>.</li></ol><p><br /></p><h3>Configuration options:</h3><p></p><ul><li>You can edit the within installation created email template according to your individual specifications with help of the provided variables.</li><li>If you would like to use your own email template, just store it in the automatically generated section business event. The additional fields for pickup location and opening hours can also be accessed in your individual email template - you can take the variables from the original template.</li><li>Logos can be added to the to the methods of shipping and payment in the administration interface.</li><li>You can add up to three different pickup locations including opening hours in the app configuration. Pickup locations can be deactivated and reactivated at a later date. However, the primary location cannot be deactivated - it is mandatory as it serves as the main pickup location.</li></ul><p></p><p></p>","shortDescription":"Allow your customers to pick up their order at one of your stores (up to 3, incl. opening hours/free text). In addition, they are given the option to pay cash.","highlights":"Simple and flexible: let your customers choose between 3 different pick-up locations\nDisplay of opening hours for better availability \nOption of “cash payment upon pickup”, provided that “self-pickup” has been selected as shipping method \nOrder confirmation via e-mail: customizable template, concerned for self-pickup","features":"Flexible selection of the pickup location: customers can choose the closest pickup location.\nIf the customer chooses self-pickup, the delivery address will be replaced by the pickup address. \nUsing the app configuration, you can easily manage your stores and opening hours with the help of multiline text fields.\nAn additional e-mail for order confirmation is adapted for the self-pickup option. The template can be customized as usual in the administration interface. In addition, a customized template can be stored in the section business events.\nadditional costs for different shipping methods can be stored and will automatically be included in the order.\nLogos can be added individually for methods of shipping and payment.\nCaptions can be customized with individual text modules.\nSo-called inline styles can also be used in the multiline text fields (for technically experienced customers)."}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":162931,"bookingKey":"iwelt69520975773","bookingText":"","price":299,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":162930,"bookingKey":"iwelt69520975773_M","bookingText":"","price":22,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwR0ahR","preview":true,"priority":100,"id":62915},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprl1FGS","preview":false,"priority":90,"id":62916},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWM3yMv","preview":false,"priority":80,"id":62833},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkBT1bT","preview":false,"priority":70,"id":62920},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeHv7aT","preview":false,"priority":60,"id":62918},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGkrB8S","preview":false,"priority":4,"id":62919}],"comments":[{"authorName":"Möbel Graf","text":"Die Anschaffung des Plugins hat sich für uns als lohnende Investition erwiesen. Es ist nahezu komplett auf unsere Bedürfnisse zugeschnitten. Kleine Anpassungseinstellungen wurden durch den perfekten Support in Rekordzeit erledigt.","headline":"Lohnende Investition","creationDate":{"date":"2022-08-17 08:55:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Easy Click & Collect - Selbstabholung","description":"<p>Bieten Sie mit unserer <b>Click &amp; Collect</b> App Ihren Kunden jetzt die Möglichkeit <b>Bestellungen selbst vor Ort abzuholen</b>. Gerade in Zeiten wie diesen, in denen Ihr Store nicht regulär öffnen kann, können Sie mit Click &amp; Collect Ihren Kunden ein Stück Normalität zurückgeben. So haben Ihre Kunden die Möglichkeit die gewünschten Produkte in einer Ihrer Filialen zu einem <b>beliebigen Zeitpunkt abzuholen</b>, während Sie als Händler sich den zeitaufwändigen Versandprozess sparen. Außerdem <b>können</b> Sie Ihren Kunden einfach und flexibel die <b>Barzahlung vor Ort </b><b>ermöglichen</b>.</p><p><br /></p><p></p><h3><b>Weitere Features folgen</b></h3><p><b></b></p><p><b></b></p><b></b><p>Um Ihnen die bestmögliche Nutzung und Erfahrung mit unserer App bieten zu können, werden wir den Funktionsumfang zukünftig stetig erweitern.</p><p></p><p>Wenn Sie Wünsche und Anregungen zu unserer App haben, können Sie diese gerne einbringen, um uns bei der Verbesserung zu unterstützen und von weiteren Funktionen zu profitieren.</p><p></p><p> </p><h4>Es erwarten Sie zukünftig weitere Features, wie …</h4><p></p><ul><li>frei auswählbare Termine innerhalb der Öffnungszeiten zur Abholung mit der Möglichkeit Tage auszuschließen und die notwendige Vorlaufzeit zu konfigurieren.</li><li><p>das Hinterlegen von Urlaubs- und Feiertagen, damit ein Kunde diese Tage nicht zur Abholung auswählen kann.</p></li><li>die Möglichkeit zur Hinterlegung von beliebig vielen Abholorten über einen separaten Menüpunkt in der Administration.</li></ul><p></p><p></p><p></p>","installationManual":"<strong>Um die App einzurichten, muss dieses zuvor bereits installiert und aktiviert worden sein. Bei der Installation der App werden Versand- und Zahlungsart bereits angelegt. Folgende Schritte sind durchzuführen:</strong><ol><li>Gehen Sie in der Administrationsoberfläche auf Ihren Verkaufskanal. Dort müssen Sie die <b>Versandart \"Selbstabholung\"</b> hinzufügen.</li><li>Wünschen Sie auch eine mögliche <b>„Barzahlung bei Abholung“</b>, kann das im Feld der <b>„Zahlungsarten“</b> ebenfalls <b>hinzugefügt</b> werden. Die notwendige Regel, dass die Zahlungsart Barzahlung vom Kunden nur ausgewählt werden kann, wenn auch die Versandart „Selbstabholung“ verwendet wird, wurde mit der Installation bereits korrekt hinterlegt und aktiviert.</li><li>Stellen Sie nun sicher, dass in der <b>Appkonfiguration mindestens die erste Abholadresse eingetragen</b> ist.</li></ol><p><br /></p><h3>Konfigurationsmöglichkeiten:</h3><p></p><ul><li>Sie können das durch die Installation hinzugefügte E-Mail-Template mit Hilfe der dort verwendeten Variablen individuell nach Ihren Wünschen bearbeiten.</li><li>Wenn Sie ein eigenes E-Mail-Template verwenden möchten, können Sie dieses im von der App hinzugefügten Business-Event hinterlegen. Auf die Zusatzfelder zur Verwendung des Abholortes inkl. der Öffnungszeiten kann im E-Mail-Template ebenfalls zugegriffen werden - die Variablen hierfür können Sie dem ursprünglichen E-Mail-Template entnehmen.</li><li>Logos können der Versand- und Zahlungsart über die Administrationsoberfläche hinzugefügt werden.</li><li>In der Appkonfiguration können Sie insgesamt 3 Abholorte inkl. Öffnungszeiten hinterlegen. Sie haben die Möglichkeit Abholorte zu deaktivieren, um diese evtl. zu einem späteren Zeitpunkt wieder zu aktivieren. Der erste Ort kann allerdings nicht deaktiviert werden - dieser ist als Hauptabholort verpflichtend zu hinterlegen.</li></ul><p></p>","version":"1.5.1","changelog":[{"version":"1.5.1","text":"<p>The plugin is now compatible with Shopware 6.5.</p>","creationDate":{"date":"2023-06-17 15:48:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p></p><ul><li>fixed a bug with selected collectAddress</li><li>fixed a bug with fetching variables from config</li><li>removed/cleaned up unused code and files</li></ul>","creationDate":{"date":"2021-10-01 08:47:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p></p><ul><li>made plugin compatible to shopware version 6.4.0.0</li></ul>","creationDate":{"date":"2021-04-27 14:16:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>shipping method now possible to change in plugin config</li><li>pickup address and opening hours now available as plain text in mail templates (\"pickup_address_plain\" and \"opening_hours_plain\"). <b>WARNING</b>: With this update the mail template will be overwritten. Be sure to have a backup of this mail template if you've made any changes to it.</li><li>fixed localization for each language</li></ul>","creationDate":{"date":"2021-04-13 11:45:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<ul><li>set fallback language for different fields of mail templates and payment &amp; shipping methods</li><li>changed plugin name<br /></li></ul>","creationDate":{"date":"2021-03-30 10:45:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>Initial version for community store<br /></p>","creationDate":{"date":"2021-03-25 10:32:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=iwelt69520975773","redirectToStore":false,"lowestPriceValue":22}