{"id":13261,"name":"EcocodeTrustpilot","code":"eco8644526753394","lastChange":{"date":"2023-07-18 11:16:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpw4SZ9O","examplePageUrl":"","moduleKey":"EcocodeTrustpilot","creationDate":{"date":"2021-03-31 11:09:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-06-03 17:39:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-03-31 11:43:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2721,"prefix":"eco","name":"ecocode","website":"//www.ecocode.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2721_ecoLogo.png"},"infos":[{"id":23083,"name":"Trustpilot Bewertungen","description":"<p>Trustpilot ist ein Bewertungsportal, das allen offensteht und auf dem Unternehmen den Verbrauchern zuhören und sich deren Vertrauen verdienen können. Steigern Sie Ihren Unternehmenserfolg mit authentischem Content von den Menschen, die für Sie am wichtigsten sind: Ihre Kunden. </p><h3><b>Trustpilot für Shopware </b></h3><p>Mit dem Trustpilot-Plug-in für Shopware können Händler ihre Kunden automatisch zur Bewertungsabgabe einladen und die Bewertungen mithilfe eines Drag-and-drop-Tools direkt auf ihrer Website präsentieren. Lesen Sie weiter, um zu erfahren, welche weiteren Vorteile Ihnen ein Trustpilot-Account bietet. </p><h3><b>Stärken Sie das Vertrauen in Ihre Marke</b></h3><p>• Laden Sie Ihre Kunden zum idealen Zeitpunkt zur Bewertungsabgabe ein. Authentische, von Ihren Kunden generierte Inhalte helfen Ihnen, Ihr Suchmaschinen-Ranking zu verbessern und mehr Traffic auf Ihre Website zu ziehen.</p><p>• Mit 70 Millionen Bewertern ist Trustpilot eine der weltweit meistbesuchten Websites. Unternehmensprofile auf Trustpilot erscheinen häufig auf der ersten Seite der Suchergebnisse.</p><p>• Optimieren Sie Ihre Präsenz auf Google – mit verifizierten Bewertungen, die in Ihre Google-Verkäuferbewertungen einfließen. Produktbewertungen bereichern Ihre Produktseiten und helfen diesen, sich für Rezensions-Snippets in der organischen Suche zu qualifizieren.</p><h3><b>Steigern Sie Ihre Conversions und Ihren Umsatz</b></h3><p>• Verwandeln Sie echte Bewertungen von echten Kunden in einen echten Conversion-Motor. Präsentieren Sie Bewertungen an allen relevanten Stellen auf Ihrer Website, um Verbraucher in ihren Kaufentscheidungen zu bestärken.</p><p>• Nutzen Sie die Stimme Ihrer Kunden, indem Sie Ihre Bewertungen überall dort präsentieren, wo Sie mit Verbrauchern in Kontakt treten – in Google-Anzeigen, E-Mails, sozialen Netzwerken und in der Außenwerbung. Geben Sie potenziellen Kunden das Vertrauen, das sie im Laufe ihrer Customer-Journey benötigen. </p><p>• Rücken Sie Ihre Lieblingsbewertungen mithilfe unseres Bildgenerators kreativ ins rechte Licht – ganz ohne Designkenntnisse. 87 % der Verbraucher in Großbritannien und den USA halten Werbeanzeigen mit dem Trustpilot-Logo und Trustpilot-Sternen für vertrauenswürdiger als ohne (Sirkin Research, „Trustpilot’s Impact on Advertisements“, September 2018).</p><h3><b>Stärken Sie Ihre Kundenbindung und maximieren Sie den Customer-Lifetime-Value</b></h3><p>• Lernen Sie von Ihren Kunden, um Ihren Service und Ihre Produkte weiter zu verbessern und zu optimieren. Erkennen Sie Trends in der Kundenstimmung in Bezug auf Ihre Produktauswahl, Ihren Kundenservice, Versand, Preise und mehr. </p><p>• Antworten Sie auf Ihre Bewertungen, zeigen Sie, dass Sie das Feedback Ihrer Kunden ernst nehmen, und machen Sie dadurch Erstkäufer zu Stammkunden und Ihren größten Fürsprechern. </p><p>• Liefern Sie Ihren Kunden in Form einer kontinuierlich optimierten Produktauswahl einen Grund, immer wieder zu Ihnen zurückzukehren. Bewertungen von Produktmerkmalen helfen Ihnen, Ihre Produkte mit den Augen Ihrer Kunden zu sehen.</p><p><br /></p><h3><b>Starten Sie mit dem kostenfreien Free-Paket</b></h3><p>• Versenden Sie jeden Monat 100 Bewertungseinladungen.</p><p>• Laden Sie frühere Kunden zur Bewertungsabgabe ein.</p><p>• Nutzen Sie zwei TrustBox-Widgets, um die Anzahl Ihrer Bewertungen auf Ihrer Website zu präsentieren und Besucher Ihrer Site zur Bewertungsabgabe zu animieren.</p><p>• Antworten Sie auf Ihre Bewertungen.</p><p>• Qualifizieren Sie sich für Google-Verkäuferbewertungen.</p><p>• Greifen Sie auf einfache Performanceberichte zu.</p><p>• Erhalten Sie Kundensupport per E-Mail und nutzen Sie unser Support-Center.</p><p><br /></p><p>Durch ein Upgrade auf unser Standard-Paket erhalten Sie Zugang zu einem optimierten Unternehmensprofil mit zusätzlichen Anpassungsmöglichkeiten, einer höheren Anzahl von Bewertungseinladungen, Unterstützung durch unser Customer-Success-Team, detaillierten Bewertungsanalysen, zusätzlichen TrustBox-Widgets für Ihre Website, Marketingmaterialien und mehr.</p>","installationManual":"<p>Nachdem die Plugin-Zip-Datei erfolgreich hochgeladen, installiert und im Shopware-Backend aktiviert wurde, kann die Ersteinrichtung beginnen.&nbsp;</p><h3><b>Bitte beachten Sie:</b></h3><p>• Für die Installation und Konfiguration werden Shopware-Administratorrechte benötigt.&nbsp;</p><p>• Ein Trustpilot-Geschäftskonto ist erforderlich. Falls Sie noch keins haben, können Sie sich während der Plugin-Einrichtung registrieren.</p><h3><b>1. Verbinden:&nbsp;</b></h3><p>Bitte verbinden Sie sich mit Ihrem Trustpilot-Geschäftskonto. Nach einer erfolgreichen Verbindung kann das Plugin konfiguriert werden.</p><h3><b>2. Konfiguration:&nbsp;</b></h3><p>Nach erfolgreicher Ersteinrichtung kann die Konfiguration auch nachträglich geändert werden unter: Shopware &gt; Erweiterungen &gt; Meine Erweiterungen &gt; Trustpilot Reviews Plugin &gt; \"---\" &gt; Konfiguration.&nbsp;</p><p><b>Verkaufskanäle: </b>Jeder Verkaufskanal kann unabhängig konfiguriert werden. Einstellungen für \"Alle Verkaufskanäle\" gelten für alle Verkaufskanäle. Für die individuelle Konfiguration eines bestimmten Vertriebskanals ist es notwendig, die \"Vererbung\" auf übergeordnete Einstellungen aller Vertriebskanäle zu entfernen. Der Zustand der \"Vererbung\" kann für jede Einstellung individuell angepasst werden, indem die Vererbungsklammer aktiviert/deaktiviert wird.&nbsp;</p><p><b>Grundeinstellungen: </b>In den Grundeinstellungen können allgemeine Einstellungen für das Versenden von Einladungen zu Service-Reviews und Produkt-Reviews vorgenommen werden. Aufgrund der Möglichkeit, die Einladungen auch manuell zu versenden (Punkt 3. Einladungen), ist das automatische Versenden zunächst standardmäßig deaktiviert. Für beide Arten von Einladungen können Sie einen Auslöser wählen und die Tage nach der Kundenbestellung festlegen, an denen die Einladungen verschickt werden sollen.&nbsp;</p><p>Das korrekte Versenden der Einladungen kann hier überprüft werden:</p><p>I. In Shopware &gt; Bestellungen &gt; Ansicht Bestellung XY &gt; Zusätzliche Felder &gt; Trustpilot&nbsp;</p><p>II. In Trustpilot &gt; Bewertungen &gt; Servicebewertungen / Produktbewertungen</p><p><b>Konfiguration der Absender-E-Mail:</b>&nbsp;Zusätzlich zum Versand von Einladungen über den Standardabsender (Trustpilot) ist es möglich, benutzerdefinierte Absender- und Antwortadressen im Plugin hinzuzufügen. Um dies korrekt einzurichten, folgen Sie bitte den Anweisungen:</p><p><ul><li>Fügen Sie Trustpilot zu Ihrem SPF-Eintrag hinzu, wie hier beschrieben: https://support.trustpilot.com/hc/de/articles/201814737</li><li>Wenden Sie sich an Trustpilot, um die Domain als autorisierte Absender-Domain auf deren Seite hinzuzufügen</li><li>Stellen Sie sicher, dass die im Plugin hinzugefügte Antwortadresse als verifizierte \"Reply-to\"-E-Mail in Ihrem Trustpilot-Geschäftskonto hinterlegt ist (Trustpilot &gt; Bewertungen erhalten &gt; Einladungs-Einstellungen &gt; E-Mail-Einstellungen &gt; Antwortadressen verwalten)</li></ul></p><p><b style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Konfiguration der Geschäftseinheit</b>: Für jede Geschäftseinheit können eigene E-Mail-Vorlagen verwendet werden. Diese Vorlagen können im Vorlagen-Editor der Trustpilot-Business-App konfiguriert werden. Wenn diese Option deaktiviert ist, werden die Standard-E-Mail-Vorlagen von Trustpilot verwendet.&nbsp;</p><p><b>Fußzeilen-Widget: </b>Wenn diese Option aktiviert ist, wird das Micro-Review-Count-Widget&nbsp; in die Fußzeile des Geschäftsbereichs eingefügt.&nbsp;<br><b>Benutzerdefinierte Vorlagen:&nbsp;</b>Das Widget kann auch in benutzerdefinierten Vorlagen verwendet werden, indem der folgende Block eingefügt wird:&nbsp;</p><p>{% include '@EcocodeTrustpilot/storefront/component/widget/micro-review-count.html.twig' %} Außerdem muss die folgende Zeile im Base-Template eingefügt werden:&nbsp;&lt;script type=\"text/javascript\" src=\"//widget.trustpilot.com/bootstrap/v5/tp.widget.bootstrap.min.js\" defer&gt;&lt;/script&gt;</p><h3><b>3. Einladungen:&nbsp;</b></h3><p>In der Ersteinrichtung kann eingestellt werden, dass an bestehende Kunden mit Bestellungen innerhalb der letzten 90 Tage (oder weniger) automatisch Review-Einladungen verschickt werden. Diese Einstellung ist für eine erfolgreiche Einrichtung nicht notwendig und kann übersprungen werden.&nbsp;</p><p>Das Versenden von Einladungen an Bestandskunden mit Bestellungen innerhalb der letzten 90 Tage ist auch zu einem späteren Zeitpunkt hier möglich:&nbsp;Shopware &gt; Verkaufskanal &gt; Trustpilot.&nbsp;</p>","shortDescription":"Automatisch Bewertungen Ihrer Kunden sammeln und in Ihre Website einbinden. Verbessern Sie die Conversion Rate, das Marketing und SEO Ihres Shopware-Shops.","highlights":"Gestalten Sie eine vertrauenswürdige Storefront: Erhöhen Sie mit echten nutzergenerierten Inhalten in Form verifizierter Bewertungen den Traffic für Ihren Shopware-Shop.\nSteigern Sie Ihre Absätze und Umsätze: Der Social Proof, den Sie durch die Präsentation Ihrer Service- und Produktbewertungen erzielen, gibt Kunden an entscheidenden Stationen ihrer Customer Journey das nötige Vertrauen, um Käufe zu tätigen.\nStärken Sie Ihre Kundenbindung: Maximieren Sie den Customer-Lifetime-Value, indem Sie Erkenntnisse aus Bewertungen nutzen, um mit Ihrem Onlineshop nicht nur ein gutes, sondern ein hervorragendes Kundenerlebnis zu bieten.","features":"Lösen Sie automatisch Einladungen zu Service- und Produktbewertungen aus.\nVersenden Sie Erinnerungs-E-Mails, um die Antwortrate Ihrer Bewertungseinladungen zu erhöhen.\nLaden Sie frühere Kunden zur Bewertungsabgabe ein, um die Anzahl Ihrer Bewertungen rasch zu steigern."},{"id":23086,"name":"Trustpilot Reviews","description":"<h3></h3><p>Trustpilot is an open-to-all reviews platform where consumers are heard by businesses, and where businesses can earn consumer trust. Grow your business with genuine content that comes directly from the people who matter most—your customers. </p><h3><b>Trustpilot for Shopware </b></h3><p>Trustpilot's plugin for Shopware enables merchants to automatically invite customers to leave reviews, and to showcase a store's ratings and review count onsite. Read on for what else you can do with a Trustpilot account. </p><h3><b>Grow a trusted brand</b></h3><p>• Invite your customers to share feedback at the ideal moment. Authentic content generated from your customers helps drive your SEO ranking and increases traffic to your site.</p><p>• Trustpilot is one of the world's most visited sites, powered by 70 million reviewers. Trustpilot profile pages frequently appear on the first page of search engines.</p><p>• Grow on Google with verified reviews that count toward Google Seller Ratings. Product reviews enhance amd qualify your product pages for review snippets in organic search.</p><h3><b>Increase purchasing conversion and grow revenue</b></h3><p>• Turn real reviews from real customers into real conversion drivers. Showcase reviews across your website when consumers are actively looking to make a purchase decision.</p><p>• Get consumers talking by sharing your reviews anywhere you engage with consumers—paid ads, email, social, and out-of-home. Give potential customers the confidence they need throughout their journey. </p><p>• Showcase reviews in ad creative without design skills with our Image Generator. 87% of consumers in the UK and US find ads more trustworthy with the Trustpilot logo and star rating than without (Sirkin Research, \"Trustpilot's Impact on Advertisements\", September 2018).).</p><h3><b>Increase customer retention and maximize LTV</b></h3><p>• Learn from customers to optimize and improve your service and products. Identify trends in customer sentiment across product inventory, customer service, shipping, price, and more. </p><p>• Respond to reviews and prove you take customer feedback seriously to turn first time buyers into repeat customers and your best advocates. </p><p>• Keep customers coming back with an ever-improving product selection. Product Attributes ratings help you understand your products from your customer’s point-of-view.</p><p><br /></p><h3><b>Get Started with a Free Account</b></h3><p>• Send 100 review invitations per month</p><p>• Invite past customers to leave a review</p><p>• Use two TrustBox widgets to showcase review count on site</p><p>• Respond to reviews</p><p>• Drive Google Seller Ratings</p><p>• See basic performance reports</p><p>• Receive support via Email, Web, and Support Center</p><p><br /></p><p>Upgrade to a Standard Plan to access an upgraded profile page, more review invitations, the Customer Success team, detailed review analysis, more TrustBox widgets on site, marketing assets, and more.</p>","installationManual":"<p>After the plugin zip file has been successfully uploaded, installed and activated in the Shopware backend, the initial setup can begin.&nbsp;</p><h3><b>Please note:</b></h3>• Shopware administrator rights are required for installation and configuration.&nbsp;<p>•&nbsp;A Trustpilot business account is required. If you don't have one yet, you can register during the plugin setup.</p><h3><b>1. Connect:&nbsp;</b></h3><p>Please connect to your Trustpilot business account.&nbsp;After a successful connection, the plugin can be configured.</p><h3><b>2. Configuration:&nbsp;</b></h3><p>After a successful initial setup, the configuration can also be changed later under: Shopware &gt; Extensions &gt; My Extensions &gt; Trustpilot Reviews Plugin &gt; \"•••\" -&gt;Configuration.&nbsp;</p><p><b>Sales channels: </b>Each sales channel can be configured independently. Settings for \"All sales channels\" apply across all sales channels. For individual configuration of a specific sales channel it is necessary to remove \"Inheritance\" to parent settings of all sales channels. The state of \"Inheritance\" can be adjusted individually for each setting by enabling/disabling the inheritance bracket.&nbsp;</p><p><b>Basic settings:</b> In the basic settings, general settings for sending service review and product review invitations can be made. Due to the possibility to send the invitations manually as well (point 3. Invitations), automatic sending is initially deactivated by default. For both types of invitations you can choose a trigger and specify&nbsp;the days after the customer's order, when the invitations should be sent out.&nbsp;</p><p>The correct sending of the invitations can be checked by:</p><p>I. In Shopware &gt; Orders &gt; View order XY &gt; Additional fields &gt; Trustpilot&nbsp;</p><p>II. In Trustpilot &gt; Ratings &gt; Service ratings / Product ratings&nbsp;</p><p><b>Enable Sender email Configuration:</b>&nbsp;In addition to sending out invitations via default sender (Trustpilot) it is possible to add custom “From” and “Reply-to” email addresses in the plugin. To set it up correctly, please follow the instructions:</p><p></p><ul><li>Add Trustpilot to your SPF record as described here: https://support.trustpilot.com/hc/de/articles/201814737</li><li>Contact Trustpilot for adding the domain as an authorized sender domain on Trustpilot side</li><li>Make sure that the “Reply-to” email address in the plugin is added as a verified “Reply-to” email in your Trustpilot business account (Trustpilot &gt; Get reviews &gt; Invitation settings &gt; Email settings &gt; Manage your Reply-to emails)</li></ul><p></p><p><b>Business unit configuration: </b>custom email templates can be used for each business unit. These templates can be configured in the template editor of the Trustpilot business app. If this option is disabled, the default email templates will be used.&nbsp;</p><p><b>Footer widget: </b>When this option is enabled, the micro-review count widget is included in the storefront footer.&nbsp;</p><p><b>Customized templates: </b>The widget can also be used in customized templates by including the following block:&nbsp;</p><p>{% include '@EcocodeTrustpilot/storefront/component/widget/micro-review-count.html.twig' %} Additionally, the following code must be added to the base template:&nbsp;&lt;script type=\"text/javascript\" src=\"//widget.trustpilot.com/bootstrap/v5/tp.widget.bootstrap.min.js\" defer&gt;&lt;/script&gt;</p><h3><b>3. Invitations:&nbsp;</b></h3><p>In the initial setup, a setting can be made to automatically send review invitations to existing customers with orders within the last 90 days (or less). This setting is not necessary for a successful setup and can be skipped. Sending invitations to existing customers with orders within the last 90 days is also possible at a later time.&nbsp;</p><p>To do that, go to: Shopware &gt; Sales Channel &gt; Trustpilot.&nbsp;</p>","shortDescription":"Automatically collect reviews from your customers and embed them into your website. Improve the conversion rate, marketing and SEO of your Shopware store.","highlights":"Build a trusted storefront: attract traffic to your Shopware store with real user-generated content collected through verified reviews.\nDrive purchasing and revenue: with social proof gained by showcasing your service and product reviews, buyers have the confidence to convert at pivotal points.\nIncrease customer retention: maximize lifetime value by leveraging review insights to take your eCommerce business from good to exceptional.","features":"Automatically trigger service and product review invitations to customers\nSend review reminder emails to increase the response rate\nInvite past customers to leave a review to boost your review count quickly\nAdd a TrustBox widget in your site footer to showcase your store's ratings and total reviews"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163000,"bookingKey":"eco8644526753394","bookingText":"","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpA38edR","preview":true,"priority":80,"id":65509},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZj7fdF","preview":false,"priority":70,"id":65502},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQiGh0t","preview":false,"priority":60,"id":65503},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpF1hJVF","preview":false,"priority":50,"id":65504},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpx8DTFs","preview":false,"priority":40,"id":65505},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxD6x09","preview":false,"priority":30,"id":65506},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnLP3zQ","preview":false,"priority":20,"id":65508},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEGVI5t","preview":false,"priority":10,"id":65507}],"comments":[{"authorName":"Ronny Berger","text":"Vielen Dank für die telefonische Beratung und die gute Erklärung. Lieferung erfolgte gut verpackt mit der Spedition.","headline":"schnelle Lieferung &amp; Top Kaminanlage","creationDate":{"date":"2023-05-08 15:50:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Leonard","text":"Dieses Features schafft Vertrauen bei den Kunden und ist meiner Meinung nach sehr nützlich. Das Support-Team ist sehr schnell und haben die kleinen Problemchen immer sehr schnell und kompetent gelöst. Wir nutzen die kostenlose Version.\nVielen Dank","headline":"Sehr nützliche Erweiterung und sehr hilfsbereite Support","creationDate":{"date":"2023-03-29 15:12:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Polaris Admin","text":"Ecocode helped us out to investigate the issue and proposed the necessary solutions. \nI believe the issue is now resolved and I thank Ecocode for the way they've handled this issue.","headline":"Plugin does not work (confirmed by Trustpilot)","creationDate":{"date":"2022-06-22 12:35:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Giulio Ramundo","text":"We are really happy with the plugin. Ecocode helpes with the implementation and also in making some changes. Very very good service, Ecocode is no. 1. Thanks for everything guys.","headline":"Very helpful plugin and awesome service","creationDate":{"date":"2022-05-31 16:13:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Ilja naroska","text":"Ich bin entzückt!","headline":"Super Ware!","creationDate":{"date":"2021-08-17 14:09:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Trustpilot Bewertungen","description":"<p>Trustpilot ist ein Bewertungsportal, das allen offensteht und auf dem Unternehmen den Verbrauchern zuhören und sich deren Vertrauen verdienen können. Steigern Sie Ihren Unternehmenserfolg mit authentischem Content von den Menschen, die für Sie am wichtigsten sind: Ihre Kunden. </p><h3><b>Trustpilot für Shopware </b></h3><p>Mit dem Trustpilot-Plug-in für Shopware können Händler ihre Kunden automatisch zur Bewertungsabgabe einladen und die Bewertungen mithilfe eines Drag-and-drop-Tools direkt auf ihrer Website präsentieren. Lesen Sie weiter, um zu erfahren, welche weiteren Vorteile Ihnen ein Trustpilot-Account bietet. </p><h3><b>Stärken Sie das Vertrauen in Ihre Marke</b></h3><p>• Laden Sie Ihre Kunden zum idealen Zeitpunkt zur Bewertungsabgabe ein. Authentische, von Ihren Kunden generierte Inhalte helfen Ihnen, Ihr Suchmaschinen-Ranking zu verbessern und mehr Traffic auf Ihre Website zu ziehen.</p><p>• Mit 70 Millionen Bewertern ist Trustpilot eine der weltweit meistbesuchten Websites. Unternehmensprofile auf Trustpilot erscheinen häufig auf der ersten Seite der Suchergebnisse.</p><p>• Optimieren Sie Ihre Präsenz auf Google – mit verifizierten Bewertungen, die in Ihre Google-Verkäuferbewertungen einfließen. Produktbewertungen bereichern Ihre Produktseiten und helfen diesen, sich für Rezensions-Snippets in der organischen Suche zu qualifizieren.</p><h3><b>Steigern Sie Ihre Conversions und Ihren Umsatz</b></h3><p>• Verwandeln Sie echte Bewertungen von echten Kunden in einen echten Conversion-Motor. Präsentieren Sie Bewertungen an allen relevanten Stellen auf Ihrer Website, um Verbraucher in ihren Kaufentscheidungen zu bestärken.</p><p>• Nutzen Sie die Stimme Ihrer Kunden, indem Sie Ihre Bewertungen überall dort präsentieren, wo Sie mit Verbrauchern in Kontakt treten – in Google-Anzeigen, E-Mails, sozialen Netzwerken und in der Außenwerbung. Geben Sie potenziellen Kunden das Vertrauen, das sie im Laufe ihrer Customer-Journey benötigen. </p><p>• Rücken Sie Ihre Lieblingsbewertungen mithilfe unseres Bildgenerators kreativ ins rechte Licht – ganz ohne Designkenntnisse. 87 % der Verbraucher in Großbritannien und den USA halten Werbeanzeigen mit dem Trustpilot-Logo und Trustpilot-Sternen für vertrauenswürdiger als ohne (Sirkin Research, „Trustpilot’s Impact on Advertisements“, September 2018).</p><h3><b>Stärken Sie Ihre Kundenbindung und maximieren Sie den Customer-Lifetime-Value</b></h3><p>• Lernen Sie von Ihren Kunden, um Ihren Service und Ihre Produkte weiter zu verbessern und zu optimieren. Erkennen Sie Trends in der Kundenstimmung in Bezug auf Ihre Produktauswahl, Ihren Kundenservice, Versand, Preise und mehr. </p><p>• Antworten Sie auf Ihre Bewertungen, zeigen Sie, dass Sie das Feedback Ihrer Kunden ernst nehmen, und machen Sie dadurch Erstkäufer zu Stammkunden und Ihren größten Fürsprechern. </p><p>• Liefern Sie Ihren Kunden in Form einer kontinuierlich optimierten Produktauswahl einen Grund, immer wieder zu Ihnen zurückzukehren. Bewertungen von Produktmerkmalen helfen Ihnen, Ihre Produkte mit den Augen Ihrer Kunden zu sehen.</p><p><br /></p><h3><b>Starten Sie mit dem kostenfreien Free-Paket</b></h3><p>• Versenden Sie jeden Monat 100 Bewertungseinladungen.</p><p>• Laden Sie frühere Kunden zur Bewertungsabgabe ein.</p><p>• Nutzen Sie zwei TrustBox-Widgets, um die Anzahl Ihrer Bewertungen auf Ihrer Website zu präsentieren und Besucher Ihrer Site zur Bewertungsabgabe zu animieren.</p><p>• Antworten Sie auf Ihre Bewertungen.</p><p>• Qualifizieren Sie sich für Google-Verkäuferbewertungen.</p><p>• Greifen Sie auf einfache Performanceberichte zu.</p><p>• Erhalten Sie Kundensupport per E-Mail und nutzen Sie unser Support-Center.</p><p><br /></p><p>Durch ein Upgrade auf unser Standard-Paket erhalten Sie Zugang zu einem optimierten Unternehmensprofil mit zusätzlichen Anpassungsmöglichkeiten, einer höheren Anzahl von Bewertungseinladungen, Unterstützung durch unser Customer-Success-Team, detaillierten Bewertungsanalysen, zusätzlichen TrustBox-Widgets für Ihre Website, Marketingmaterialien und mehr.</p>","installationManual":"<p>Nachdem die Plugin-Zip-Datei erfolgreich hochgeladen, installiert und im Shopware-Backend aktiviert wurde, kann die Ersteinrichtung beginnen. </p><h3><b>Bitte beachten Sie:</b></h3><p>• Für die Installation und Konfiguration werden Shopware-Administratorrechte benötigt. </p><p>• Ein Trustpilot-Geschäftskonto ist erforderlich. Falls Sie noch keins haben, können Sie sich während der Plugin-Einrichtung registrieren.</p><h3><b>1. Verbinden: </b></h3><p>Bitte verbinden Sie sich mit Ihrem Trustpilot-Geschäftskonto. Nach einer erfolgreichen Verbindung kann das Plugin konfiguriert werden.</p><h3><b>2. Konfiguration: </b></h3><p>Nach erfolgreicher Ersteinrichtung kann die Konfiguration auch nachträglich geändert werden unter: Shopware &gt; Erweiterungen &gt; Meine Erweiterungen &gt; Trustpilot Reviews Plugin &gt; \"---\" &gt; Konfiguration. </p><p><b>Verkaufskanäle: </b>Jeder Verkaufskanal kann unabhängig konfiguriert werden. Einstellungen für \"Alle Verkaufskanäle\" gelten für alle Verkaufskanäle. Für die individuelle Konfiguration eines bestimmten Vertriebskanals ist es notwendig, die \"Vererbung\" auf übergeordnete Einstellungen aller Vertriebskanäle zu entfernen. Der Zustand der \"Vererbung\" kann für jede Einstellung individuell angepasst werden, indem die Vererbungsklammer aktiviert/deaktiviert wird. </p><p><b>Grundeinstellungen: </b>In den Grundeinstellungen können allgemeine Einstellungen für das Versenden von Einladungen zu Service-Reviews und Produkt-Reviews vorgenommen werden. Aufgrund der Möglichkeit, die Einladungen auch manuell zu versenden (Punkt 3. Einladungen), ist das automatische Versenden zunächst standardmäßig deaktiviert. Für beide Arten von Einladungen können Sie einen Auslöser wählen und die Tage nach der Kundenbestellung festlegen, an denen die Einladungen verschickt werden sollen. </p><p>Das korrekte Versenden der Einladungen kann hier überprüft werden:</p><p>I. In Shopware &gt; Bestellungen &gt; Ansicht Bestellung XY &gt; Zusätzliche Felder &gt; Trustpilot </p><p>II. In Trustpilot &gt; Bewertungen &gt; Servicebewertungen / Produktbewertungen</p><p><b>Konfiguration der Absender-E-Mail:</b> Zusätzlich zum Versand von Einladungen über den Standardabsender (Trustpilot) ist es möglich, benutzerdefinierte Absender- und Antwortadressen im Plugin hinzuzufügen. Um dies korrekt einzurichten, folgen Sie bitte den Anweisungen:</p><p></p><ul><li>Fügen Sie Trustpilot zu Ihrem SPF-Eintrag hinzu, wie hier beschrieben: https://support.trustpilot.com/hc/de/articles/201814737</li><li>Wenden Sie sich an Trustpilot, um die Domain als autorisierte Absender-Domain auf deren Seite hinzuzufügen</li><li>Stellen Sie sicher, dass die im Plugin hinzugefügte Antwortadresse als verifizierte \"Reply-to\"-E-Mail in Ihrem Trustpilot-Geschäftskonto hinterlegt ist (Trustpilot &gt; Bewertungen erhalten &gt; Einladungs-Einstellungen &gt; E-Mail-Einstellungen &gt; Antwortadressen verwalten)</li></ul><p><b>Konfiguration der Geschäftseinheit</b>: Für jede Geschäftseinheit können eigene E-Mail-Vorlagen verwendet werden. Diese Vorlagen können im Vorlagen-Editor der Trustpilot-Business-App konfiguriert werden. Wenn diese Option deaktiviert ist, werden die Standard-E-Mail-Vorlagen von Trustpilot verwendet. </p><p><b>Fußzeilen-Widget: </b>Wenn diese Option aktiviert ist, wird das Micro-Review-Count-Widget  in die Fußzeile des Geschäftsbereichs eingefügt. <br /><b>Benutzerdefinierte Vorlagen: </b>Das Widget kann auch in benutzerdefinierten Vorlagen verwendet werden, indem der folgende Block eingefügt wird: </p><p>{% include '@EcocodeTrustpilot/storefront/component/widget/micro-review-count.html.twig' %} Außerdem muss die folgende Zeile im Base-Template eingefügt werden: &lt;script type=\"text/javascript\" src=\"//widget.trustpilot.com/bootstrap/v5/tp.widget.bootstrap.min.js\" defer&gt;&lt;/script&gt;</p><h3><b>3. Einladungen: </b></h3><p>In der Ersteinrichtung kann eingestellt werden, dass an bestehende Kunden mit Bestellungen innerhalb der letzten 90 Tage (oder weniger) automatisch Review-Einladungen verschickt werden. Diese Einstellung ist für eine erfolgreiche Einrichtung nicht notwendig und kann übersprungen werden. </p><p>Das Versenden von Einladungen an Bestandskunden mit Bestellungen innerhalb der letzten 90 Tage ist auch zu einem späteren Zeitpunkt hier möglich: Shopware &gt; Verkaufskanal &gt; Trustpilot. </p>","version":"1.2.0","changelog":[{"version":"1.2.0","text":"<p>New app version, compatible with Shopware version 6.5 and higher</p>","creationDate":{"date":"2023-06-29 13:38:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p></p><ul><li>Fix for additionally offered services that are not available in the shop and therefore do not have their own shop url</li></ul>","creationDate":{"date":"2023-05-08 10:47:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Bug fixing and refactoring of the functionality for sending review invitations to past customers<br /></p>","creationDate":{"date":"2023-03-17 15:24:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"Preventing an error when handling product review invitationsSaving of new refresh token when api call fails fixed<br />","creationDate":{"date":"2023-02-22 12:42:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<p>- get host name on token refresh</p>","creationDate":{"date":"2023-01-23 11:58:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>fix association names</p>","creationDate":{"date":"2022-11-25 12:14:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>Bugfix for custom admin url</p>","creationDate":{"date":"2022-08-12 13:39:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- Transmission of product cover image url as \"Product image URL\" (instead of first listed product image)</p><p>- Transmission of additional product properties: GTIN /EAN and MPN<br /></p><p>- Bug fix for sending empty values if oder item is product variant</p>","creationDate":{"date":"2022-05-30 16:56:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<ul><li>Possible wrong product url generation, when product is available on multiple sales channels</li></ul>","creationDate":{"date":"2022-05-19 17:11:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p></p><ul><li>Shopware 6.4.10 compatibility</li></ul>","creationDate":{"date":"2022-04-13 01:11:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p></p><ul><li>additional info messages for sender email configuration added</li><li>API model property type strictness eased</li><li>bugfix for custom template synchronisation</li></ul>","creationDate":{"date":"2022-01-27 15:57:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>fix for the usage of custom templates<br /></li></ul>","creationDate":{"date":"2021-09-01 09:07:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><ul><li>bug fix: missing inheritance for \"Sender Email Configuration\" and \"Business Unit Configuration\"</li><li>bug fix: missing footer widget on system pages (cart, account, product detail view)</li><li>plugin compatability assurance for Shopware version 6.3.5.4 and 6.4.1.2</li></ul>","creationDate":{"date":"2021-07-01 20:39:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>bug fix for error \"The type of the \"referralEmail\" attribute for class \"Ecocode\\Trustpilot\\Model\\Review\" must be one of \"string\" (\"null\" given).\"</li></ul>","creationDate":{"date":"2021-06-25 15:02:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial version of the plugin</p>","creationDate":{"date":"2021-04-27 18:20:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=eco8644526753394","redirectToStore":false,"lowestPriceValue":0}