{"id":13383,"name":"CbaxModulCrossSelling","code":"cbax670444287112","lastChange":{"date":"2023-07-18 11:16:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphqgURV","examplePageUrl":"","moduleKey":"CbaxModulCrossSelling","creationDate":{"date":"2021-04-27 15:33:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-12-14 14:25:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-13 14:11:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":429,"prefix":"cbax","name":"coolbax","website":"//www.coolbax.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpff89q3"},"infos":[{"id":23295,"name":"Cross Selling / Zubehör Professionell | Pro","description":"<h3>Cross Selling / Zubehör Professionell | Pro</h3><p>Mit&nbsp; unserem Plugin positionieren Sie ähnliche und/oder Zubehörprodukte prominent auf&nbsp; der Detailseite bzw. im Warenkorb. Die erhöhte Aufmerksamkeit, welche diese Produkte&nbsp; anschließend erfahren, kann ihren Umsatz merklich steigern. Die richtige&nbsp; Zuordnung und Untergliederung sind hier auschlaggebend. </p><p>Viele Onlinehändler machen den meisten Umsatz über das&nbsp; Zubehör, jedoch werden diese Produkte in Shopware 6 nicht ausreichend beworben. Mit unserem Plugin haben Sie nun die Möglichkeit das Zubehör nicht nur auf der Detailseite, sondern auch direkt im Warenkorb anzeigen zu lassen. Alle zugewiesenen Zubehörartikel werden unterhalb des Warenkorbs in Slidern eingeblendet und so in Taps unterteilt, wie Sie diese angelegt haben. Ihre Kunden können sich somit alle Zubehörprodukte ansehen, welche, zu Ihren im Warenkorb gelegten Artikeln, passen.</p><p>Ähnliche Produkte können Sie wiederum auf der Detailseite unter oder über dem Warenkorb erscheinen lassen. Verbinden Sie somit Artikel miteinander, welche Sie normalerweise als Variante in Farbe, Form oder Material anlegen müssten. Mittels der Taps, haben Sie die Möglichkeit mehrere Varianten eines Artikels einfach und verständlich zu unterteilen, sodass ihre Kunden genau das finden, was Sie suchen.</p><p><a href=\"https://demo-6-2.coolbax.com/Shishimi-Togarashi-Feinstes-IKARIMI-Lachs-Loin/SW10082\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Demoshop testen</strong></a><br><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p><h3>Funktionsumfang &amp; Vorteile</h3><ul><li>Prominente Positionierung der ähnlichen Artikel</li><li>Einfache Zuweisung der Artikel im Backend</li><li>Anlage der Gruppen erfolgt unter dem Reiter \"Cross Selling\" </li><li>Zubehör direkt im Warenkorb einblenden lassen</li><li>Ähnliche sowie Zubehörprodukte können mit Tab-Gruppen&nbsp; unterteilt werden</li><li>Tab-Gruppen können von Standardanzeige ausgeschlossen werden</li><li>Aktuell im Warenkorb eingefügter Artikel kann im modaler Fenster eingeblendet werden (modaler Warenkorb)</li><li>Sie haben die Möglichkeit Zubehör im modaler Warenkorb anzubieten</li><li><b>NEU:</b> Anzeige von Produkten, welche sich der Kunde zuletzt angesehenen&nbsp;hat (als Slider am Ende der Seite)</li><li><b>NEU:</b>\"Kunden haben auch gesehen\" - Funktion - Produktdetailseite: Anzeige von Produkten die andere Kunden sic ebenfalls angesehen haben ()></li><li><b>NEU:</b>\"Kunden haben auch gekauft\" - Funktion - Anzeige von Produkten, welche gleichzeitig&nbsp;mit dem angesehenen Produkt gekauft wurden</li></ul><p>EINSTELLUNG FÜR ÄHNLICHE ARTIKEL:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Position (über oder unter dem Warenkorb)</li><li>maximale Anzahl der ähnlichen Artikel</li><li>Headline für ähnliche Artikel anzeigen</li><li>Ähnliche Artikel öffnen (im Quickview Modul oder direkt auf die Artikelseite)</li><li>Cross Selling Tab für ähnliche Artikel ausblenden</li></ul><p>EINSTELLUNG FÜR ZUBEHÖR AUF DER DETAILSEITE:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Quickview Button im Zubehör Slider anzeigen</li><li>Produktbeschreibungen im Zubehör Slider anzeigen</li><li>Cross Selling Tab für Zubehör ausblenden</li></ul><p>EINSTELLUNG \"KUNDEN-KAUFTEN-AUCH\" UND \"KUNDEN-HABEN-AUCH-GESEHEN\":</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Maximale Anzahl definieren</li><li>Definition, wo die Produkte angezeigt werden sollen</li></ul><p>EINSTELLUNG FÜR ZULETZT GESEHENE PRODUKTE:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Maximale Anzahl definieren</li><li>Definition, der Seiten wo die Produkte angezeigt werden sollen</li></ul><p>EINSTELLUNG FÜR ZUBEHÖR AUF DER WARENKORBSEITE:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Headline für Zubehör anzeigen</li><li>Quickview Button im Zubehör Slider anzeigen</li><li>Produktbeschreibungen im Zubehör Slider anzeigen</li></ul><p>EINSTELLUNG FÜR MODALEN WARENKORBSEITE:</p><ul><li>Aktiv- oder inaktiv schalten des modalen Warenkorbs </li><li>Slider mit ähnlichen oder Zubehörartikeln anzeigen</li><li>Kaufen-Button im Slider ein- oder ausblenden</li><li>Preis im Slider ein- oder ausblenden</li><li>Box Layout im Slider auswählen (minimal oder Standard)</li><li>Festlegung der maximalen Anzahl der im Slider angezeigten Artikel</li></ul><h3>Tab-Gruppen von Shopware Standardanzeige ausschließen</h3><p>Standardmäßig werden alle angelegten Cross-Selling Gruppen unterhalb der Beschreibung auf der Detailseite angezeigt. Sollten Sie Ihre&nbsp; angelegten Gruppen nicht auch dort noch anzeigen lassen wollen, können Sie das&nbsp; bequem über die Plugin Einstellungen unterbinden. Diese Einstellung gilt für die Ähnlichen Artikel und die Zubehör Artikel.</p><h3>\"Kunden haben auch gekauft\" und \"Kunden haben auch gesehen\" - Funktion</h3><p>Sie möchten Ihren Kunden anzeigen, was sich andre Kunden angesehen haben, als diese den Aktuellen Artikel betrachten haben oder was die Kunden zusammen mit den aktuellen Artikel gekauft haben? Mit den beiden Funktionen \"Kunden haben auch gekauft\" und \"Kunden haben auch gesehen\" können Sie dies nun zuschalten bzw. das entsprechende Einkaufswelten Element hinzufügen.</p><h3>Zuletzt angesehene Produkte - Funktion</h3><p>Eine ebenfalls beliebte Funktion, welche es bereits in Shopware 5 gab und jetzt auch in dieses Plugin eingeflossen ist, ist die Funktion: Zuletzt angesehene Produkte. Artikel welche Sich ihr Kunde gerade angesehen hat, werden können auf den Seiten: Produkt-, Kategorie-, Landingpagseiten und in den Suchergebnissen am Ende der Seite eingeblendet werden. Ihre Kunden haben somit schnell die Möglichkeit zu den letzten angeschauten Produkten zurückzukehren.</p><p><strong>Fragen</strong><br>\n\n\n\n\nSie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","shortDescription":"Automatisches CrossSelling. Anzeige von – Kunden haben auch gesehen, Kunden haben auch gekauft – Zubehör, Ähnliche Produkte, modaler Warenkorb mit Zubehör und vieles mehr","highlights":"Prominente Positionierung der ähnlichen Artikel\nZubehör jetzt direkt im Warenkorb einblenden lassen\nPräsentation von empfohlenen Produkte im modalen Warenkorb\n\"Kunden haben auch gesehen\" und \"Kunden haben auch gekauft\" Funktion\nZuletzt angesehene Produkte unterhalb der Seiten einblenden","features":"Weisen Sie die Ähnlichen Artikel und/oder Zubehör Artikel einfach im Backend zu\nDie Anlage der Gruppen erfolgt unter dem Reiter „Cross Selling“\nErweiterung der Ähnliche Artikel, Zubehör auf der Detail bzw. im Warenkorb können einzeln an- und abgeschalten werden\nBestimmen Sie die Anzeigeposition der Artikel (über oder unter dem Warenkorb)\nBegrenzen Sie die Anzahl der Ähnlichen Artikel für die Erweiterung\nEntscheiden Sie, ob die Headline für ähnliche Artikel anzeigen werden soll\nWie sollen der Kunde die Ähnlichen Artikel sehen (im Quickview Modul oder direkt auf die Artikelseite)\nBlenden Sie den Shopware Standard Cross Selling Tab für ähnliche Artikel aus\nSoll der Quickview Button im Zubehör Slider auf der Detail- und oder im Warenkorb angezeigt werden\nSoll die Produktbeschreibungen im Zubehör Slider auf der Detail- und oder im Warenkorb anzeigen\nEntscheiden Sie, ob die Headline im Warenkorb für Zubehör anzeigen werden soll\nLassen Sie den Cross Selling Tab für Zubehör auf der Detailseite ausblenden\nAktuell im Warenkorb eingefügter Artikel kann im modaler Fenster eingeblendet werden (modaler Warenkorb)\nSie haben die Möglichkeit Zubehör im modaler Warenkorb anzubieten\nÄhnliche und Zubehörprodukte können mit Tab-Gruppen unterteilt werden"},{"id":23296,"name":"Cross Selling Professionall | Pro","description":"<h3>Cross Selling Professionall | Pro</h3><p>With our plug-in, you can position similar and / or accessory products prominently on the detail page or in the shopping cart. The increased attention these products receive afterwards can markedly increase their sales. Correct allocation and subdivision are crucial here.</p><p>Many online retailers make most of their sales through accessories, but these products are not sufficiently advertised in Shopware 6. With our plug-in you now have the option of displaying the accessories not only on the detail page, but also directly in the shopping cart. All assigned accessories are displayed in sliders below the shopping cart and divided into taps as you created them. Your customers can thus view all the accessory products that match the items in the shopping cart.</p><p>You can have similar products appear on the detail page below or above the shopping cart. Connect articles with each other, which you would normally have to create as a variant in color, shape or material. With the help of the taps, you have the possibility to subdivide several variants of an article in a simple and understandable way so that your customers can find exactly what they are looking for.</p><p><a href=\"https://demo-6-2.coolbax.com/en/detail/c9b578c958d648288e8f4f423e9a1954\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Test in the demo shop</strong></a><br><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong> View manual (in German)</strong></a></p><h3>Features &amp; Benefits</h3><ul><li> Prominent positioning of the similar articles </li><li> Simple assignment of the articles in the backend </li><li> The groups are created under the \"Cross Selling\" tab </li><li> Accessories show directly in the shopping cart </li><li> Similar and accessory products can be displayed with tab groups &amp; nbsp; </li><li> Tab groups can be excluded from the standard display </li><li>Article currently added to the shopping cart can be displayed in the modal window (modal shopping cart)</li><li>You have the option of accessories in the modal offer shopping cart</li><li><b>NEW:</b> Display of products, which the customer last viewed (as a slider at the end of the page)</li><li><b>NEW:&nbsp;</b>\"Customers have also viewed\" function - Product detail page: Display of products that other customers have also viewed</li><li><b>NEW:&nbsp;</b>\"Customers also bought\" function - Display of products that were purchased at the same time&nbsp;with the viewed product</li></ul><p> SETTING FOR SIMILAR ARTICLES: </p><ul><li> Activate or inactive li&gt;</li><li> Position (above or below the shopping cart) </li><li> Maximum number&nbsp;of similar articles </li><li> Show headline for similar articles </li><li> Open similar articles (in Quickview Module or directly to the article page) </li><li> Hide cross selling tab for similar articles </li></ul><p> SETTING FOR ACCESSORIES ON THE DETAIL PAGE: </p><ul><li> Active - or switch to inactive </li><li> Show Quickview button in accessories slider </li><li> Show product descriptions in accessories slider </li><li> Hide cross selling tab for accessories </li></ul><p>SETTING \"CUSTOMERS ALSO BOUGHT\" AND \"CUSTOMERS ALSO SEEN\":</p><ul><li>Switch active or inactive</li><li>Define maximum number</li><li>Define where the products should be displayed</li></ul><p>SETTING FOR LAST SEEN PRODUCTS:</p><ul><li>Switch active or inactive</li><li>Define maximum number</li><li>Definition of the pages where the products should be displayed</li></ul><p> SETTING FOR ACCESSORIES ON THE CART PAGE: </p><ul><li> Activate or inactive </li><li> Show headline for accessories </li><li> Show quick view button in accessories slider &lt; / li&gt;</li><li> Show product descriptions in the accessories slider </li></ul><p>SETTING FOR MODAL SHOPPING CART PAGE:</p><ul><li>Activate or deactivate the modal shopping cart </li><li>Show slider with similar or accessory items</li><li>Buy button in Show or hide slider</li><li>Show or hide price in slider</li><li>Choose box layout in slider (minimum or standard)</li><li>Define the maximum number of boxes in the slider displayed item</li></ul><h3>Exclude tab groups from Shopware standard display</h3><p>By default, all created cross-selling groups are displayed below the description on the detail page. Should your &amp; nbsp; you do not want to have created groups displayed there as well, you can &amp; nbsp; conveniently suppress via the plugin settings. This setting applies to the similar articles and the accessory articles. </p><h3>\"Customers also bought\" and \"Customers also viewed\" function</h3><p>You would like to show your customers what other customers were looking at when they were looking at the current article or what the customers bought together with the current article? With the two functions \"Customers have also bought\" and \"Customers have also seen\" you can now activate this or add the corresponding shopping world element.</p><h3>Recently Viewed Products - Function</h3><p>An equally popular function, which already existed in Shopware 5 and has now also been incorporated into this plugin, is the function: Recently viewed products. Articles that your customer has just viewed can be displayed on the pages: product, category, landing page and in the search results at the bottom of the page. Your customers can therefore quickly return to the products they last viewed.</p><p></p><p><strong>Ask questions</strong><br>\n\n\n\n\nDo you have any questions about the plugin or the setup? Then take a look at our <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"> manual (in German) </a> or write to us directly at: info@coolbax.de </p>","installationManual":"<p> The installation takes place via the Plugin Manager. </p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong> View manual (in German)</strong></a></p>","shortDescription":"Dynamic automatic cross-selling. Display of - Customers also viewed, Customers also bought - Accessories, Similar products, modal cart with accessories and much more","highlights":"Prominent positioning of similar items\nAccessories can now be displayed directly in the shopping cart\nPresentation of recommended products in the modal shopping cart\n\"Customers also viewed\" and \"Customers also bought\" function\nShow recently viewed products below the pages","features":"Simply assign the similar items and/or accessory items in the backend\nThe groups are created under the \"Cross Selling\" tab\nExtension of the similar articles, accessories on the detail or in the shopping cart can be switched on and off individually\nDetermine the display position of the items (above or below the shopping cart)\nLimit the number of similar items for the extension\nDecide whether the headline should be displayed for similar articles\nHow should the customer see the similar items (in the quick view module or directly on the item page)\nHide the Shopware Standard Cross Selling Tab for similar items\nShould the quick view button be displayed in the accessories slider on the detail and/or in the shopping cart\nShould display the product descriptions in the accessories slider on the detail and/or in the shopping cart\nDecide whether the headline should be displayed in the shopping cart for accessories\nHide the cross-selling tab for accessories on the detail page\nArticle currently added to the shopping cart can be displayed in the modal window (modal shopping cart)\nYou have the option to offer accessories in the modal shopping cart\nSimilar and accessory products can be divided into tab groups"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164590,"bookingKey":"cbax670444287112","bookingText":"Cross Selling Professionall","price":69.9,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":164589,"bookingKey":"cbax670444287112_M","bookingText":"Cross Selling Professionall","price":5.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169065,"bookingKey":"cbax670444287112_M12","bookingText":"Cross Selling Professionall | Pro","price":60,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptkOLYU","preview":true,"priority":0,"id":76343},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQdqDyE","preview":false,"priority":15,"id":76694},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpc7lB4D","preview":false,"priority":14,"id":76689},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php72ncYi","preview":false,"priority":13,"id":76692},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDT6fn0","preview":false,"priority":12,"id":76691},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgzBOJn","preview":false,"priority":11,"id":82146},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBkDE9F","preview":false,"priority":10,"id":82147},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEXNGVX","preview":false,"priority":9,"id":76693},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwnWyFx","preview":false,"priority":8,"id":95165},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0AfAuh","preview":false,"priority":7,"id":95164},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvHaUYV","preview":false,"priority":6,"id":95166},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZsAgt7","preview":false,"priority":5,"id":95167},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxjujQV","preview":false,"priority":4,"id":95168},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpooyGlC","preview":false,"priority":3,"id":95169},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpR7xp3F","preview":false,"priority":2,"id":95170},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpisouJo","preview":false,"priority":1,"id":95171}],"comments":[{"authorName":"Steffen Methling","text":"Die Schwarmintelligenz meiner Kunden übertrifft mich deutlich. Dieses Plugin nutzt diese für passende Empfehlungen. Klassische Empfehlungskinos zu \"andere Kunden interessierte auch\" und \"andere Kunden kauften auch\" sind Klasse, um Artikelkombinationen aufzuspüren, die Kunden selber gern einsetzen, völlig ohne Pflegeaufwand im Shop-Backend. Das Team von Coolbax ist ja Statistikexperte, ich nutze schon seit vielen Monaten ihr Statistikplugin für meine Umsätze und Produktanteile etc.. Es ist eine große Hilfe. Auf dieses Cross-Selling-Plugin bin ich durch das Statistik-Paket aufmerksam geworden. Es ist eng damit verknüpft, da auch für das Cross-Selling passende Statistiken zu Sessions und Verbundkäufen erhoben werden müssen.\n\nAch ja, der Support von Coolbax ist auch super. Sogar eine Wechselwirkung mit einem Plugin von Frosh wurde behoben. Das ist Spitze.","headline":"Tolles Plugin für Kunden und mich","creationDate":{"date":"2022-11-02 20:31:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Nicolas Fleischmann","text":"Das Plugin funktioniert einwandfrei und wurde an unser Theme angepasst. Dafür bin ich dem erstklassigen Support von coolbax sehr dankbar. Ich kann diese Erweiterung uneingeschränkt empfehlen und freue mich schon auf das angekündigte Update (Produkte im Warenkorb werden im Warenkorb-Cross-Selling dann nicht mehr angezeigt). Herzlich, Nicolas","headline":"Top Plugin, top Support","creationDate":{"date":"2021-12-21 14:22:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Cross Selling / Zubehör Professionell | Pro","description":"<h3>Cross Selling / Zubehör Professionell | Pro</h3><p>Mit  unserem Plugin positionieren Sie ähnliche und/oder Zubehörprodukte prominent auf  der Detailseite bzw. im Warenkorb. Die erhöhte Aufmerksamkeit, welche diese Produkte  anschließend erfahren, kann ihren Umsatz merklich steigern. Die richtige  Zuordnung und Untergliederung sind hier auschlaggebend. </p><p>Viele Onlinehändler machen den meisten Umsatz über das  Zubehör, jedoch werden diese Produkte in Shopware 6 nicht ausreichend beworben. Mit unserem Plugin haben Sie nun die Möglichkeit das Zubehör nicht nur auf der Detailseite, sondern auch direkt im Warenkorb anzeigen zu lassen. Alle zugewiesenen Zubehörartikel werden unterhalb des Warenkorbs in Slidern eingeblendet und so in Taps unterteilt, wie Sie diese angelegt haben. Ihre Kunden können sich somit alle Zubehörprodukte ansehen, welche, zu Ihren im Warenkorb gelegten Artikeln, passen.</p><p>Ähnliche Produkte können Sie wiederum auf der Detailseite unter oder über dem Warenkorb erscheinen lassen. Verbinden Sie somit Artikel miteinander, welche Sie normalerweise als Variante in Farbe, Form oder Material anlegen müssten. Mittels der Taps, haben Sie die Möglichkeit mehrere Varianten eines Artikels einfach und verständlich zu unterteilen, sodass ihre Kunden genau das finden, was Sie suchen.</p><p><a href=\"https://demo-6-2.coolbax.com/Shishimi-Togarashi-Feinstes-IKARIMI-Lachs-Loin/SW10082\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Demoshop testen</strong></a><br /><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p><h3>Funktionsumfang &amp; Vorteile</h3><ul><li>Prominente Positionierung der ähnlichen Artikel</li><li>Einfache Zuweisung der Artikel im Backend</li><li>Anlage der Gruppen erfolgt unter dem Reiter \"Cross Selling\" </li><li>Zubehör direkt im Warenkorb einblenden lassen</li><li>Ähnliche sowie Zubehörprodukte können mit Tab-Gruppen  unterteilt werden</li><li>Tab-Gruppen können von Standardanzeige ausgeschlossen werden</li><li>Aktuell im Warenkorb eingefügter Artikel kann im modaler Fenster eingeblendet werden (modaler Warenkorb)</li><li>Sie haben die Möglichkeit Zubehör im modaler Warenkorb anzubieten</li><li><b>NEU:</b> Anzeige von Produkten, welche sich der Kunde zuletzt angesehenen hat (als Slider am Ende der Seite)</li><li><b>NEU:</b>\"Kunden haben auch gesehen\" - Funktion - Produktdetailseite: Anzeige von Produkten die andere Kunden sic ebenfalls angesehen haben ()&gt;</li><li><b>NEU:</b>\"Kunden haben auch gekauft\" - Funktion - Anzeige von Produkten, welche gleichzeitig mit dem angesehenen Produkt gekauft wurden</li></ul><p>EINSTELLUNG FÜR ÄHNLICHE ARTIKEL:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Position (über oder unter dem Warenkorb)</li><li>maximale Anzahl der ähnlichen Artikel</li><li>Headline für ähnliche Artikel anzeigen</li><li>Ähnliche Artikel öffnen (im Quickview Modul oder direkt auf die Artikelseite)</li><li>Cross Selling Tab für ähnliche Artikel ausblenden</li></ul><p>EINSTELLUNG FÜR ZUBEHÖR AUF DER DETAILSEITE:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Quickview Button im Zubehör Slider anzeigen</li><li>Produktbeschreibungen im Zubehör Slider anzeigen</li><li>Cross Selling Tab für Zubehör ausblenden</li></ul><p>EINSTELLUNG \"KUNDEN-KAUFTEN-AUCH\" UND \"KUNDEN-HABEN-AUCH-GESEHEN\":</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Maximale Anzahl definieren</li><li>Definition, wo die Produkte angezeigt werden sollen</li></ul><p>EINSTELLUNG FÜR ZULETZT GESEHENE PRODUKTE:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Maximale Anzahl definieren</li><li>Definition, der Seiten wo die Produkte angezeigt werden sollen</li></ul><p>EINSTELLUNG FÜR ZUBEHÖR AUF DER WARENKORBSEITE:</p><ul><li>Aktiv- oder inaktiv schalten</li><li>Headline für Zubehör anzeigen</li><li>Quickview Button im Zubehör Slider anzeigen</li><li>Produktbeschreibungen im Zubehör Slider anzeigen</li></ul><p>EINSTELLUNG FÜR MODALEN WARENKORBSEITE:</p><ul><li>Aktiv- oder inaktiv schalten des modalen Warenkorbs </li><li>Slider mit ähnlichen oder Zubehörartikeln anzeigen</li><li>Kaufen-Button im Slider ein- oder ausblenden</li><li>Preis im Slider ein- oder ausblenden</li><li>Box Layout im Slider auswählen (minimal oder Standard)</li><li>Festlegung der maximalen Anzahl der im Slider angezeigten Artikel</li></ul><h3>Tab-Gruppen von Shopware Standardanzeige ausschließen</h3><p>Standardmäßig werden alle angelegten Cross-Selling Gruppen unterhalb der Beschreibung auf der Detailseite angezeigt. Sollten Sie Ihre  angelegten Gruppen nicht auch dort noch anzeigen lassen wollen, können Sie das  bequem über die Plugin Einstellungen unterbinden. Diese Einstellung gilt für die Ähnlichen Artikel und die Zubehör Artikel.</p><h3>\"Kunden haben auch gekauft\" und \"Kunden haben auch gesehen\" - Funktion</h3><p>Sie möchten Ihren Kunden anzeigen, was sich andre Kunden angesehen haben, als diese den Aktuellen Artikel betrachten haben oder was die Kunden zusammen mit den aktuellen Artikel gekauft haben? Mit den beiden Funktionen \"Kunden haben auch gekauft\" und \"Kunden haben auch gesehen\" können Sie dies nun zuschalten bzw. das entsprechende Einkaufswelten Element hinzufügen.</p><h3>Zuletzt angesehene Produkte - Funktion</h3><p>Eine ebenfalls beliebte Funktion, welche es bereits in Shopware 5 gab und jetzt auch in dieses Plugin eingeflossen ist, ist die Funktion: Zuletzt angesehene Produkte. Artikel welche Sich ihr Kunde gerade angesehen hat, werden können auf den Seiten: Produkt-, Kategorie-, Landingpagseiten und in den Suchergebnissen am Ende der Seite eingeblendet werden. Ihre Kunden haben somit schnell die Möglichkeit zu den letzten angeschauten Produkten zurückzukehren.</p><p><strong>Fragen</strong><br />\n\n\n\n\nSie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-cross-selling/zubehoer-professionall-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","version":"3.0.3","changelog":[{"version":"3.0.3","text":"<p>Bug fixes for the Shopware 6.5 adaption</p>","creationDate":{"date":"2023-07-04 09:16:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>Localisation bug in modal window fixed</p>","creationDate":{"date":"2023-06-12 09:46:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>Adjustments to the add-to-cart modal window for 'Repeat Order'</p>","creationDate":{"date":"2023-06-05 11:08:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>- Adjustments to Shopware 6.5</p>","creationDate":{"date":"2023-04-21 09:21:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"<p></p><ul><li>Localisation bug in modal window fixed</li><li>Adjustments to the add-to-cart modal window for 'Repeat Order'</li></ul>","creationDate":{"date":"2023-06-12 09:42:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"<p>Bug Fix for an error during the getting of the product id from the request</p>","creationDate":{"date":"2023-03-14 14:29:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p></p><ul><li>Possible exception when saving customers also bought/have also viewed products catched</li><li>Option to display the recommendation slider on the shopping cart page also on smartphone</li></ul><p><br /></p>","creationDate":{"date":"2023-03-13 12:13:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p>Inkompatibility bug with custom products of the SW Custom Products plugin fixed</p>","creationDate":{"date":"2023-02-13 10:42:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>Improvement of the display of customers also viewed/bought data</p>","creationDate":{"date":"2022-11-02 15:09:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p>Fixed a bug with shops with subdirectories in the url</p>","creationDate":{"date":"2022-09-14 14:32:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p>Improvements for the plugin settings</p>","creationDate":{"date":"2022-08-12 14:40:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p></p><ul><li>New option: Saving and displaying the products last viewed by the customer as a slider at the bottom of the page or as a new element that can be freely placed on pages with a CMS layout</li><li>New option: For product pages - save and display the products that customers who viewed the product on the page also visited</li><li>New option: For product pages - save and display the products that customers who bought the page's product also bought in the same order</li><li>The latter 2 options as a slider in additional tabs of the Shopware CrossSelling element or as a separate element (this can also be freely placed as a new element in the CMS page layout)</li></ul><p><br /></p>","creationDate":{"date":"2022-08-10 14:57:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p>Adjustments for the add-to-cart modal funktionality for compability with the SW paypal plugin </p>","creationDate":{"date":"2022-06-16 10:20:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>Adjusted the color in the modal window for the Quickview view</p>","creationDate":{"date":"2022-06-08 10:59:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p>Use of LanguageLocaleCodeProvider deleted, because its availibility only from SW 6.4.6</p>","creationDate":{"date":"2022-05-27 10:15:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>Inkompatibility bug of modal windows fixed</p>","creationDate":{"date":"2022-05-25 14:03:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Adjustments for Shopware 6.4.11 Update</p><p>Language in add-to-cart modal fixed</p>","creationDate":{"date":"2022-05-12 14:41:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p></p><ul><li>Additional options for slider in cart page</li><li>Option for modal window with recommandations instead of off-canvas cart</li></ul>","creationDate":{"date":"2022-01-31 16:12:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>First version of the Plugin for Shopware 6</p>","creationDate":{"date":"2021-12-01 15:27:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=cbax670444287112","redirectToStore":true,"lowestPriceValue":5.99}