{"id":13473,"name":"TmmsTopBarNotifications","code":"Tmms554377181152","lastChange":{"date":"2023-07-19 08:09:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXf1Hp6","examplePageUrl":"","moduleKey":"TmmsTopBarNotifications","creationDate":{"date":"2021-05-17 13:22:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-05-19 16:36:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-05-17 13:31:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3293,"prefix":"Tmms","name":"Deutsche Telekom MMS GmbH","website":"//www.telekom-mms.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3293_telekom_logo.png"},"infos":[{"id":23442,"name":"Leiste für Informations- und Hinweistexte oder Meldungen","description":"<h2>Support</h2><p>Treten Sie bei Fragen, wenn diese nicht bereits im Bereich \"<b>Häufig gestellte Fragen</b>\" beantwortet wurden, einfach über die E-Mail <b>shopware-apps-support@t-systems-mms.com</b> mit uns in Kontakt und wir helfen Ihnen gerne weiter. </p><h2>Beschreibung der App</h2><p>\nDie App \"Leiste für Informations- und Hinweistexte oder Meldungen\" ermöglicht unter anderem eine <b>Leiste für Informations- und Hinweistexte oder Meldungen</b>, beispielsweise für Versand- und Rückgabeinformationen oder die eigene Service - Hotline. Bis zu <b>4 eigene Bereiche</b> sind dabei möglich, die sowohl Text als auch Icons (von Shopware oder eigene) enthalten und je Auflösung ein- oder ausgeblendet werden können. Alternativ kann auch nur ein einziger Hinweistext<b></b>angezeigt werden beispielsweise für eine Urlaubsmeldung. Das Aussehen der Bereiche kann dabei innerhalb der Konfiguration beeinflusst werden. Falls der jeweilige Bereich verlinkt werden soll, kann er entweder einen Direktlink oder eine Modalbox (dessen Inhalt aus der selbst hinterlegten Erlebniswelt stammt) öffnen.</p><p>\nDie <b>Leiste kann</b> entweder <b>in der Topbar</b> oder <b>in der Footerbar</b> oder auch <b>oberhalb</b> oder <b>unterhalb der Brotkrumennavigation angezeigt werden</b>.\n</p><p>\nZusätzlich ist es möglich, den <b>Sprach- und Währungsauswahlbereich mit in die Topbar zu verschieben</b>.\n</p><p><b>Innerhalb der Konfiguration kann für die Leiste folgendes festgelegt werden:</b></p><ul><li>die Festlegung, ob der neue Bereich in einer Top- oder Footerbar oder oberhalb oder unterhalb der Brotkrumennavigation angezeigt werden soll</li><li>die Festlegung der Einheit des Außenabstandes</li><li>die Festlegung des Außenabstandes nach oben und unten</li><li>die Festlegung der Einheit des Innenabstandes</li><li>die Festlegung des Innenabstandes nach oben und unten</li><li>die Festlegung der Hintergrundfarbe</li><li>die Festlegung des Schattens</li><li>die Festlegung, ob in der Auflösung Smartphone Querformat (SM) die Breite der Bereiche auf 50% gesetzt werden soll\n</li></ul><p><b>Für jeden der 4 Bereiche kann innerhalb der Konfiguration folgendes festgelegt werden:</b></p><ul><li>die Festlegung, ob der Bereich angezeigt werden soll</li><li>die Auswahl der Auflösungen, in denen der Bereich angezeigt werden soll</li><li>die Festlegung, ob das Icon aus dem Auswahlfeld oder einem Textbaustein bezogen werden soll</li><li>die Festlegung des Icons über das Auswahlfeld (Vorschau https://component-library.shopware.com/icons/ ) oder den Textbaustein</li><li>die Festlegung der Farbe und der Hover-Farbe des Icons</li><li>die Festlegung der Breite und der Höhe des Icons in Pixeln</li><li>die Festlegung der Position des Inhalts und des Icons, beispielsweise ob das Icon links und der Inhalt rechts oder das Icon rechts und der Inhalt links angezeigt werden soll</li><li>die Festlegung der Ausrichtung des Inhalts und des Icons (links, mittig oder rechts)</li><li>die Festlegung der Einheit der Außenabstände</li><li>die Festlegung des Außenabstandes des Inhalts oder Icons zum Bereich (je nach Position nach links oder rechts)</li><li>die Festlegung des Außenabstandes des Icons zum Inhalt (je nach Position nach links oder rechts)</li><li>die Festlegung des Außenabstandes des Inhalts nach links und rechts</li><li>die Festlegung der Schriftfarbe, der Hover-Schriftfarbe und der Schriftgröße des Inhalts</li><li>die Festlegung, ob der Inhalt aus dem Texteditor - Feld oder einem Textbaustein bezogen werden soll</li><li>die Festlegung des Inhalts über das Texteditor - Feld oder den Textbaustein</li><li>die Festlegung eines Links</li><li>die Festlegung eines Titels für den Link</li><li>die Festlegung des Linkziels (im gleichen Fenster, in einem neuen Fenster oder in einer Modalbox)</li></ul><p><b>Für den Sprach- und Währungsauswahlbereich kann innerhalb der Konfiguration folgendes festgelegt werden:</b></p><ul><li>die Festlegung, ob der Bereich ab 992 Pixeln mit in der Topbar angezeigt werden soll</li><li>die Festlegung der Ausrichtung des Bereichs (links, mittig oder rechts)</li></ul><p><br><b>Die verfügbaren Textbausteine zum Individualisieren sind:</b></p><ul><li><b>tmms.topbarnotifications.Area1ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 1 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area2ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 2 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area3ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 3 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area4ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 4 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area1Content:</b> der Standardwert, wenn der Inhalt des Bereichs 1 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area2Content:</b> der Standardwert, wenn der Inhalt des Bereichs 2 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area3Content:</b> der Standardwert, wenn der Inhalt des Bereichs 3 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area4Content:</b> der Standardwert, wenn der Inhalt des Bereichs 4 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area1Icon:</b> der Standardwert, wenn das Icon des Bereichs 1 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area2Icon:</b> der Standardwert, wenn das Icon des Bereichs 2 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area3Icon:</b> der Standardwert, wenn das Icon des Bereichs 3 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area4Icon:</b> der Standardwert, wenn das Icon des Bereichs 4 aus einem Textbaustein bezogen wird</li></ul>","installationManual":"<ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Melden Sie sich in Ihren Shopware 6 Administrationsbereich an und navigieren Sie zu dem Menüpunkt Erweiterungen -&gt; Meine Erweiterungen</li><li>Klicken Sie rechts oben auf \"Erweiterung hochladen\" und wählen Sie die heruntergeladene Erweiterung aus</li><li>Verwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung zu installieren und den Schalter links, um sie zu aktivieren</li><li>\nVerwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung nach den eigenen Wünschen zu konfigurieren</li></ol>","shortDescription":"Die App ermöglicht Informationstexte oder Meldungen in bis zu 4 eigenen Bereichen entweder in der Topbar oder Footerbar oder auch oberhalb oder unterhalb der Brotkrumennavigation.","highlights":"bis zu 4 eigene Bereiche für Informations- und Hinweistexte oder Meldungen\ndie entweder in der Topbar oder in der Footerbar oder auch oberhalb oder unterhalb der Brotkrumennavigation angezeigt werden können\nbei denen jeweils ein Icon und ein Text angezeigt werden kann\nund es kann beim Anklicken des Textes sich entweder ein Link (im gleichen Fenster oder in einem neuen Fenster) oder sich der Inhalt einer selbst festlegten Erlebniswelt in einer Modalbox öffnen\nzusätzlich kann der Sprach- und Währungsauswahlbereich in die Topbar verschoben werden","features":""},{"id":23443,"name":"bar for information and notification texts or messages","description":"<h2>Support</h2><p>If you have any questions and if they have not already been answered in the area \"<b>Frequently Asked Questions</b>\", simply contact us via the email <b>shopware-apps-support@t-systems-mms.com</b> and we will be happy to help you.</p><h2>Description of the app</h2><p>\n\nThe app \"bar for information and notification texts or messages\" enables, among other things, <b>information and notification texts or messages</b>, for example for shipping and return information or your own service hotline. Up to 4 own areas are possible, which contain both text and icons (from Shopware or your own) and can be shown or hidden depending on the viewport. Alternatively, even only one single information text can be displayed, for example for a vacation message. The appearance of the areas can be specified within the configuration. If the area should be linked, it can either open a direct link or a modal box (the content comes from the self defined shopping world).\n\n</p><p>\n\nThe <b>bar can be displayed</b> either <b>in the top bar</b> or <b>in the footer bar</b> or also <b>above</b> or <b>below the breadcrumb navigation</b>.\n\n</p><p>\n\nIn addition, it is possible to <b>move the language and currency selection area to the top bar</b>.\n\n</p><p><b>Within the configuration, the following can be specified for the bar:</b></p><ul><li>the establishment of whether the area should be shown in a top or footer bar or above or below the breadcrumb navigation</li><li>the selection of the unit of the outer distances</li><li>the definition of the outer distance of the area up- and downwards</li><li>the selection of the unit of the inner distances</li><li>the definition of the inner distance of the area up- and downwards</li><li>the definition of the background color</li><li>the definition of the shadow</li><li>the selection, if the width of the areas should be set to 50 percent in the viewport smartphone landscape (SM)</li></ul><p><b>For each of the 4 areas, the following can be specified within the configuration:</b></p><ul><li>the establishment of whether the area should be shown</li><li>the selection of the viewports in which the area should be shown</li><li>the selection, if the icon should obtain from the select field or a snippet</li><li>the definition of the icon via the selection field (previews: https://component-library.shopware.com/icons/ ) or the snippet</li><li>the definition of the color and the hover color of the icon</li><li>the definition of the width and the height of the icon in pixels</li><li>the selection of the position of the content and the icon, for example icon on the left and content on the right or icon on the right and content on the left</li><li>the selection of the orientation of the content and the icon (left, center or right)</li><li>the selection of the unit of the outer distances</li><li>the definition of the outer distance of the content or the icon to the area</li><li>the definition of the outer distance of the icon to the content</li><li>the definition of the outer distance of the content to the left and to the right</li><li>the definition of the font color, the hover font color and the font size of the content</li><li>the selection, if the content should obtain from the text editor or a snippet</li><li>the definition of the content via the text editor or the snippet</li><li>the definition of a link</li><li>the definition of a title for the link</li><li>the selection of the link target, for example in the current tab, in a new tab or in a modal box</li></ul><p><b>The following can be specified for the language and currency selection area within the configuration:</b></p><ul><li>the establishment of whether the area should be shown from 992 pixels in the top bar</li><li>the selection of the orientation of the area (left, center or right)</li></ul><p><br><b>The available snippets for customizing are:</b></p><ul><li><b>tmms.topbarnotifications.Area1ContentTextEditor:</b> the default value if the content of area 1 is obtained from a text editor field</li><li><b>tmms.topbarnotifications.Area2ContentTextEditor:</b> the default value if the content of area 2 is obtained from a text editor field</li><li><b>tmms.topbarnotifications.Area3ContentTextEditor:</b> the default value if the content of area 3 is obtained from a text editor field</li><li><b>tmms.topbarnotifications.Area4ContentTextEditor:</b> the default value if the content of area 4 is obtained from a text editor field</li><li><b>tmms.topbarnotifications.Area1Content:</b> the default value if the content of area 1 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area2Content:</b> the default value if the content of area 2 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area3Content:</b> the default value if the content of area 3 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area4Content:</b> the default value if the content of area 4 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area1Icon:</b> the default value if the icon of area 1 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area2Icon:</b> the default value if the icon of area 2 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area3Icon:</b> the default value if the icon of area 3 is obtained from a snippet</li><li><b>tmms.topbarnotifications.Area4Icon:</b> the default value if the icon of area 4 is obtained from a snippet</li></ul>\n","installationManual":"<ol><li>Download the app from the store</li><li>Log in into your Shopware 6 administration area and navigate to extensions -&gt; my extensions</li><li>Click on the right side on \"Upload extension\" and select the downloaded extension</li><li>Use the context menu on the right side of the extension to install the extension and the switch button on the left side to activate it</li><li>Use the context menu on the right side of the extension to configure the extension according to your own requirements</li></ol>","shortDescription":"The app enables information texts or messages in up to 4 own areas either in the top bar or in the footer bar or also above or below the breadcrumb navigation.","highlights":"up to 4 own areas for information and notification texts or messages\nwhich can be displayed either in the top bar or in the footer bar or also above or below the breadcrumb navigation\nin each of this an icon and a text can be displayed\nand when you click on the text, either a link (in the current or in a new tab) or the content of a self-defined shopping experience can open in a modal box\nin addition, the language and currency selection area can be moved to the top bar","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163355,"bookingKey":"Tmms554377181152","bookingText":"information or notification texts in a top or footer bar","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0Eaeln","preview":true,"priority":30,"id":65812},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvnOHjF","preview":false,"priority":29,"id":65813},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSqeqpy","preview":false,"priority":28,"id":65814},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUz2yDW","preview":false,"priority":27,"id":65815},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZQ9KVZ","preview":false,"priority":26,"id":65816},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbuPA8Y","preview":false,"priority":25,"id":80746},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptHQKNF","preview":false,"priority":24,"id":80747},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8DJFyE","preview":false,"priority":23,"id":80748},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBoaZDJ","preview":false,"priority":22,"id":99442},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgOX237","preview":false,"priority":21,"id":99443},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8YL3J4","preview":false,"priority":20,"id":99444},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeZaQna","preview":false,"priority":19,"id":99445},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkJg1Ci","preview":false,"priority":18,"id":99446},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBAD7SC","preview":false,"priority":17,"id":99447},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxk55w9","preview":false,"priority":16,"id":65823},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRt393r","preview":false,"priority":16,"id":99448}],"comments":[{"authorName":"Roman H.","text":"Tolles Plugin mit vielen Einstellmöglichkeiten! Und dazu noch kostenlos. Vielen Dank!","headline":"Tolles Plugin mit vielen Einstellmöglichkeiten!","creationDate":{"date":"2023-03-22 21:32:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Leinweber Landtechnik","text":"Funktionalität genau wie beschrieben und ein kleiner Helfer für uns Shopbetreiber. Eigentlich eine kleine aber feine Funktion, die Shopware 6 als Basisfunktion fehlt, aber nahezu jeder gebrauchen kann. Umso besser, dass T-System sich dem angenommen hat und dies als kostenfreie Erweiterung zur Verfügung stellt.\nDie Pflege erfolgt sehr komfortabel über das Backend.","headline":"Genau wie beschrieben und fehlerfrei","creationDate":{"date":"2023-01-26 07:40:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Jörg Reisslein","text":"Vielen Dank für dieses super Plugin, das ist genau das was ich brauche um auf Abwesenheiten hinzuweisen!","headline":"Super Plugin","creationDate":{"date":"2022-10-04 17:45:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Joachim K.","text":"Nützliches Plugin mit vielen Konfigurationsmöglichkeiten. Alle Einstellungen sind gut beschrieben. Den Support habe ich bis jetzt nicht gebraucht. Freue mich auf viele weitere nützliche Plugins.","headline":"Nützliches Plugin","creationDate":{"date":"2022-09-30 14:15:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"true_drive GbR","text":"Ein klasse Plugin, welches unseren Wünschen gänzlich entspricht. \nDie Inhalte lassen sich unabhängig von einander konfigurieren und das in etlichen Einstellungen.\n\nVielen Dank für dieses tolle und kostenlose Plugin!","headline":"Ein tolles Plugin mit vielen Einstellungsmöglichkeiten","creationDate":{"date":"2022-08-21 18:48:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Leiste für Informations- und Hinweistexte oder Meldungen","description":"<h2>Support</h2><p>Treten Sie bei Fragen, wenn diese nicht bereits im Bereich \"<b>Häufig gestellte Fragen</b>\" beantwortet wurden, einfach über die E-Mail <b>shopware-apps-support@t-systems-mms.com</b> mit uns in Kontakt und wir helfen Ihnen gerne weiter. </p><h2>Beschreibung der App</h2><p>\nDie App \"Leiste für Informations- und Hinweistexte oder Meldungen\" ermöglicht unter anderem eine <b>Leiste für Informations- und Hinweistexte oder Meldungen</b>, beispielsweise für Versand- und Rückgabeinformationen oder die eigene Service - Hotline. Bis zu <b>4 eigene Bereiche</b> sind dabei möglich, die sowohl Text als auch Icons (von Shopware oder eigene) enthalten und je Auflösung ein- oder ausgeblendet werden können. Alternativ kann auch nur ein einziger Hinweistext<b></b>angezeigt werden beispielsweise für eine Urlaubsmeldung. Das Aussehen der Bereiche kann dabei innerhalb der Konfiguration beeinflusst werden. Falls der jeweilige Bereich verlinkt werden soll, kann er entweder einen Direktlink oder eine Modalbox (dessen Inhalt aus der selbst hinterlegten Erlebniswelt stammt) öffnen.</p><p>\nDie <b>Leiste kann</b> entweder <b>in der Topbar</b> oder <b>in der Footerbar</b> oder auch <b>oberhalb</b> oder <b>unterhalb der Brotkrumennavigation angezeigt werden</b>.\n</p><p>\nZusätzlich ist es möglich, den <b>Sprach- und Währungsauswahlbereich mit in die Topbar zu verschieben</b>.\n</p><p><b>Innerhalb der Konfiguration kann für die Leiste folgendes festgelegt werden:</b></p><ul><li>die Festlegung, ob der neue Bereich in einer Top- oder Footerbar oder oberhalb oder unterhalb der Brotkrumennavigation angezeigt werden soll</li><li>die Festlegung der Einheit des Außenabstandes</li><li>die Festlegung des Außenabstandes nach oben und unten</li><li>die Festlegung der Einheit des Innenabstandes</li><li>die Festlegung des Innenabstandes nach oben und unten</li><li>die Festlegung der Hintergrundfarbe</li><li>die Festlegung des Schattens</li><li>die Festlegung, ob in der Auflösung Smartphone Querformat (SM) die Breite der Bereiche auf 50% gesetzt werden soll\n</li></ul><p><b>Für jeden der 4 Bereiche kann innerhalb der Konfiguration folgendes festgelegt werden:</b></p><ul><li>die Festlegung, ob der Bereich angezeigt werden soll</li><li>die Auswahl der Auflösungen, in denen der Bereich angezeigt werden soll</li><li>die Festlegung, ob das Icon aus dem Auswahlfeld oder einem Textbaustein bezogen werden soll</li><li>die Festlegung des Icons über das Auswahlfeld (Vorschau https://component-library.shopware.com/icons/ ) oder den Textbaustein</li><li>die Festlegung der Farbe und der Hover-Farbe des Icons</li><li>die Festlegung der Breite und der Höhe des Icons in Pixeln</li><li>die Festlegung der Position des Inhalts und des Icons, beispielsweise ob das Icon links und der Inhalt rechts oder das Icon rechts und der Inhalt links angezeigt werden soll</li><li>die Festlegung der Ausrichtung des Inhalts und des Icons (links, mittig oder rechts)</li><li>die Festlegung der Einheit der Außenabstände</li><li>die Festlegung des Außenabstandes des Inhalts oder Icons zum Bereich (je nach Position nach links oder rechts)</li><li>die Festlegung des Außenabstandes des Icons zum Inhalt (je nach Position nach links oder rechts)</li><li>die Festlegung des Außenabstandes des Inhalts nach links und rechts</li><li>die Festlegung der Schriftfarbe, der Hover-Schriftfarbe und der Schriftgröße des Inhalts</li><li>die Festlegung, ob der Inhalt aus dem Texteditor - Feld oder einem Textbaustein bezogen werden soll</li><li>die Festlegung des Inhalts über das Texteditor - Feld oder den Textbaustein</li><li>die Festlegung eines Links</li><li>die Festlegung eines Titels für den Link</li><li>die Festlegung des Linkziels (im gleichen Fenster, in einem neuen Fenster oder in einer Modalbox)</li></ul><p><b>Für den Sprach- und Währungsauswahlbereich kann innerhalb der Konfiguration folgendes festgelegt werden:</b></p><ul><li>die Festlegung, ob der Bereich ab 992 Pixeln mit in der Topbar angezeigt werden soll</li><li>die Festlegung der Ausrichtung des Bereichs (links, mittig oder rechts)</li></ul><p><br /><b>Die verfügbaren Textbausteine zum Individualisieren sind:</b></p><ul><li><b>tmms.topbarnotifications.Area1ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 1 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area2ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 2 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area3ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 3 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area4ContentTextEditor:</b> der Standardwert, wenn der Inhalt des Bereichs 4 aus einem Texteditor - Feld bezogen wird</li><li><b>tmms.topbarnotifications.Area1Content:</b> der Standardwert, wenn der Inhalt des Bereichs 1 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area2Content:</b> der Standardwert, wenn der Inhalt des Bereichs 2 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area3Content:</b> der Standardwert, wenn der Inhalt des Bereichs 3 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area4Content:</b> der Standardwert, wenn der Inhalt des Bereichs 4 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area1Icon:</b> der Standardwert, wenn das Icon des Bereichs 1 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area2Icon:</b> der Standardwert, wenn das Icon des Bereichs 2 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area3Icon:</b> der Standardwert, wenn das Icon des Bereichs 3 aus einem Textbaustein bezogen wird</li><li><b>tmms.topbarnotifications.Area4Icon:</b> der Standardwert, wenn das Icon des Bereichs 4 aus einem Textbaustein bezogen wird</li></ul>","installationManual":"<ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Melden Sie sich in Ihren Shopware 6 Administrationsbereich an und navigieren Sie zu dem Menüpunkt Erweiterungen -&gt; Meine Erweiterungen</li><li>Klicken Sie rechts oben auf \"Erweiterung hochladen\" und wählen Sie die heruntergeladene Erweiterung aus</li><li>Verwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung zu installieren und den Schalter links, um sie zu aktivieren</li><li>\nVerwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung nach den eigenen Wünschen zu konfigurieren</li></ol>","version":"1.1.2","changelog":[{"version":"1.1.2","text":"Removed option \"Compile the theme while saving the extension settings\" for compatibility reasons.","creationDate":{"date":"2023-07-03 17:11:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"Replaced data-toggle=\"modal\" with data-ajax-modal=\"true\".","creationDate":{"date":"2023-06-26 06:46:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Established the compatibility with Shopware from version 6.5.0.0.</p>","creationDate":{"date":"2023-05-22 13:56:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Refactoring the code to convert plugin config values to SCSS variables.</p>","creationDate":{"date":"2023-04-17 14:20:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>You can now set the content of the snippet for the icon of each area within the configuration.</p><p>You can now set the content of the snippet for the content of each area within the configuration.</p>","creationDate":{"date":"2022-10-04 08:25:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"You can now set the font size of the content in pixels for each area. <p>The compatibility with Shopware from version 6.5.0.0 has been improved.</p>","creationDate":{"date":"2022-08-22 11:40:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>You can now select the values \"above the breadcrumb navigation\" and \"below the breadcrumb navigation\" in addition to \"in the top bar\" and \"in the footer bar\" when selecting \"show area\".</p><p>You can now set a shadow for the area.</p>","creationDate":{"date":"2022-01-24 11:09:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release of the app</p>","creationDate":{"date":"2021-05-17 13:49:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Tmms554377181152","redirectToStore":false,"lowestPriceValue":0}