{"id":13484,"name":"DvsnBundle","code":"dvsn965998642437","lastChange":{"date":"2023-07-25 08:00:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php77djGd","examplePageUrl":"","moduleKey":"DvsnBundle","creationDate":{"date":"2021-05-22 11:44:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-05-28 08:25:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-04-30 16:22:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":23462,"name":"Produkt Bundles / Sets","description":"\n\n\n\n\n\n\n<h2>\n    Artikel Bundles\n</h2><p>\n\nKombinieren Sie Artikel in Ihrem Shop und bieten Sie sie als Bundle zu einem vergünstigten Preis an.\nVerpacken Sie so passende Produkte zu einem Paket und lassen Sie Ihren Kunden neue Produkte entdecken.\n\n</p><p>\n\nMit der Bundle Erweiterung können Sie auch Promotion-Boxen, ähnlich der Amazon-Promotion Box\n\"Wird oft zusammen gekauft\", nachbauen. Dabei können Sie das Augenmerk auf Artikel richten,\nwelche sich vielleicht nicht so gut verkaufen oder einen hohen Lagerbestand aufweisen.\nAuch Abverkaufs-Artikel können so gesondert beworben werden.\n\n</p><p>\n\nSie können beliebig viele Produkte als Bestandteile eines Bundles auswählen. Zudem können\nSie die Stückzahl aller Produkte des Bundles definieren\nSie können bei Varianten-Produkten entweder den Vater oder eine spezifische Variante wählen.\nWenn Sie den Vater wählen, dann kann der Kunde eine Variante auswählen\n</p><h4>Allgemeine und spezifische Bundles</h4><p>\n\n\nSie haben die Möglichkeit entweder allgemeine Bundles zu definieren und diese mehreren Produkten\nzuzuweisen. So können Sie z.B. ein Bundle definieren, das immer aus \"Schnürsenkeln\", \"Socken\" und\n\"Leder-Pflege\" besteht und dieses Bundle jedem Schuh zuweisen. So müssten Sie das Bundle nur\neinmalig definieren und können es bei beliebig vielen Produkten zur Verfügung stellen.\n\n\n\n\n</p>\n\n\nAlternativ können Sie spezifische Bundles pro Produkt definieren. Dazu finden Sie im\nReiter \"Bundles\" in der Administration von Produkten eine Liste von Bundles für das\naktuell ausgewählte Produkt. Hier können Sie individuelle Bundles pflegen, die\nnur für dieses Produkt gültig sind.\n\n<p></p><h4>Konfiguration</h4><p>\n\n\n\nIn der Konfiguration der Erweiterung können Sie die Anzeige der Stückzahl\nin der Übersicht des Bundles deaktivieren und die Vater-Kind Beziehung der\neinzelnen Produkte auflösen. Das kann sinnvoll sein, wenn Sie ein Drittsystem\nangeschlossen haben (z.B. externe Warenwirtschaft), das flache Produkte benötigt.\n\n\n\n\n</p><h4>Anleitung - spezifische Bundles</h4><ul><li>in der Administration von Produkten im Reiter \"Bundles\" können Sie beliebige Bundles definieren</li><li>geben Sie pro Bundle einen beliebigen prozentualen Rabatt an und definieren Sie die zusätzlichen Bestandteile (Produkte) des Bundles</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul><h4>Anleitung - allgemeine Bundles</h4><ul><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Bundles\"</li><li>legen Sie ein neues Bundle an</li><li>nach dem Neuladen des Bundles können Sie \"Produkte\" anlegen</li><li>definieren Sie die Produkte des Bundles (inkl. Stückzahl)</li><li>speichern Sie das Bundle</li><li>öffnen Sie ein beliebiges Produkt in der Administration</li><li>in den Zusatzfeldern im Reiter \"Bundles\" können Sie bis zu drei Bundles auswählen</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"\n<h4>Anleitung - spezifische Bundles</h4><ul><li>in der Administration von Produkten im Reiter \"Bundles\" können Sie beliebige Bundles definieren</li><li>geben Sie pro Bundle einen beliebigen prozentualen Rabatt an und definieren Sie die zusätzlichen Bestandteile (Produkte) des Bundles</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul><h4>Anleitung - allgemeine Bundles</h4><ul><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Bundles\"</li><li>legen Sie ein neues Bundle an</li><li>nach dem Neuladen des Bundles können Sie \"Produkte\" anlegen</li><li>definieren Sie die Produkte des Bundles (inkl. Stückzahl)</li><li>speichern Sie das Bundle</li><li>öffnen Sie ein beliebiges Produkt in der Administration</li><li>in den Zusatzfeldern im Reiter \"Bundles\" können Sie bis zu drei Bundles auswählen</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul>\n\n","shortDescription":"Kombinieren Sie Produkte in Ihrem Shop und bieten Sie sie als Bundle zu einem vergünstigten Preis an. Verpacken Sie so passende Produkte zu einem maßgeschneiderten Paket für Ihre Kunden","highlights":"","features":""},{"id":23463,"name":"Article bundles","description":"<h2>\n    Article bundles\n</h2><p>\n\nCombine items in your shop and offer them as a bundle at a reduced price.\nPack matching products into a package and let the customer discover new products.\n\n</p><p>\n\nWith the bundle extension, you can also recreate promotion boxes, similar to the Amazon promotion box\n\"Is often bought together\". In doing so, you can focus attention on items,\nwhich are perhaps not selling so well or have a high stock level.\nSale items can also be promoted separately in this way.\n\n</p><p>\n\nYou can select as many products as you like as components of a bundle. You can also\ndefine the number of pieces of all products in the bundle.\nYou can select either the father or a specific variant for variant products.\nIf you select the father, then the customer can select a variant\n</p><p>\n\n\n\nIn the configuration of the extension you can deactivate the display of the number of pieces in the overview of the bundle.\nin the overview of the bundle and dissolve the father-child relationship of the individual products.\nof the individual products. This can be useful if you have connected a third party system\n(e.g. external merchandise management) that requires flat products.\n\n\n\n\n</p><h4>Instructions</h4><ul><li>install the extension</li><li>In the administration under \"Catalogues\" you will find the new menu item \"Bundles\"</li><li>create a new bundle (name is mandatory) and save it</li><li>after reloading the bundle, you can create \"products\"</li><li>define the products of the bundle (incl. quantity)</li><li>save the bundle</li><li>open any product in the administration</li><li>in the additional fields in the \"Bundles\" tab you can select up to three bundles</li><li>When you now call up this article in the shop, the bundles are displayed for this product</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"<h4>Instructions</h4><ul><li>install the extension</li><li>In the administration under \"Catalogues\" you will find the new menu item \"Bundles\"</li><li>create a new bundle (name is mandatory) and save it</li><li>after reloading the bundle, you can create \"products\"</li><li>define the products of the bundle (incl. quantity)</li><li>save the bundle</li><li>open any product in the administration</li><li>in the additional fields in the \"Bundles\" tab you can select up to three bundles</li><li>When you now call up this article in the shop, the bundles are displayed for this product</li></ul>","shortDescription":"Combine items in your shop and offer them as a bundle at a reduced price.\nPack matching products into a package and let the customer discover new products.","highlights":"","features":""}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163370,"bookingKey":"dvsn965998642437","bookingText":"Article bundles","price":269.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":163369,"bookingKey":"dvsn965998642437_M","bookingText":"Article bundles","price":49,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXVMu8Z","preview":true,"priority":9800,"id":90801},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1Rl0f6","preview":false,"priority":9700,"id":90802},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXwT384","preview":false,"priority":9600,"id":90803},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCfsNRn","preview":false,"priority":9500,"id":90804},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwKiwDV","preview":false,"priority":8500,"id":90805},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgWJAMk","preview":false,"priority":5900,"id":90809},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnkiO7S","preview":false,"priority":5800,"id":92083},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVYZ813","preview":false,"priority":5500,"id":90806},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6EXFnl","preview":false,"priority":5400,"id":90807},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1QmqTY","preview":false,"priority":5300,"id":90808},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiLXuj0","preview":false,"priority":3500,"id":66183},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQBz9ej","preview":false,"priority":2500,"id":66182}],"comments":[{"authorName":"MNTC","text":"Das Plugin macht grundsätzlich was es soll und wir konnten damit fast alle benötigten Sets / Bundles abbilden. Der Support für das Plugin ist sehr schnell und freundlich. Eine benötigte Funktion ist leider nicht implementiert. Und zwar kann der Vaterartikel, für den die Bundles angelegt werden, im Bundle nicht mehrfach vorkommen. Das Plugin ist in einem Shop für Solar und PV Zubehör im Einsatz und hier ist es zur Skalierung der Bundles manchmal nötig das Hauptprodukt mehrfach in einem Set einzubinden. Die Zuordnung der \"allgemeinen Bundles\" zu einem Produkt ist zudem etwas versteckt unter Spezifikation &gt; Zusatzfelder &gt; Bundles und würde im eigentlichen Reiter Bundles mehr Sinn machen. Abgesehen davon, ein sehr gutes Plugin.","headline":"Sehr gutes Plugin - Erweiterung möglich","creationDate":{"date":"2023-07-12 15:31:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Konstantin Roth","text":"Jetzt funktioniert alles, wie es sein soll. \nDie anfänglichen Fehler wurden schnell und unkompliziert aufgenommen und extrem schnell behoben. \nSowohl die Bedienung als auch die optische Darstellung des Plugins finde ich sehr gelungen, Daumen hoch, weiter so!","headline":"Super schneller kompetenter Service","creationDate":{"date":"2023-06-30 15:12:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"TorbenJ","text":"Always a great relief when you find extensions, that have truly been thought through by the developer to handle professional requirements. In our case we do cosmetics, and therefore have product variants (colors) - and this extension handles that in a very user friendly way. Whenever a bundle is added to the basket, customer is prompted to select which variant colors to include - perfect! We had a couple of technical oddities with our implementation + some important feature requests, and Tobias just gets problems solved and wishlist improvements implemented! Will be happy to buy more extensions from this developer in the future.","headline":"A joy to use, handles variants superbly, looks cool + excellent support!","creationDate":{"date":"2023-02-11 15:08:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Timo Trautner","text":"Warum zum Drucker nicht gleich Tinte mitbestellen? Oder Papier? Alles zu einem attraktiven Bundle-Rabatt! Welcher Kunde nutzt dieses nicht gerne? \nDieses Plugin macht es möglich. Wir freuen uns darauf, es bald einsetzen zu können.","headline":"Darf's etwas mehr sein?","creationDate":{"date":"2023-02-02 15:37:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"p574863 User","text":"Vielen Dank für die schnelle Klärung aller Anliegen. Der Support ist großartig und das Plugin für Produktbundles mit Rabatt sehr zu empfehlen.","headline":"Tolles Plugin, hervorragender Support","creationDate":{"date":"2022-10-27 21:22:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Vincent Bourgonje","text":"Dieses Plugin bietet nicht nur die Funktionalität für Upselling durch Bundles, sondern auch einen hervorragenden Support. Bei Fragen zu Erweiterungen oder funktionalen Änderungen/Ergänzungen ist der Support immer sehr schnell und die Lösungen sind es auch. Das macht das Bundles Plugin nicht nur zu einem empfehlenswerten Plugin, sondern auch Digitvision als Anbieter.","headline":"Ein Plugin ist nur so gut wie die Unterstützung, die dabei geliefert wird...","creationDate":{"date":"2022-10-17 16:21:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marcus Strobel","text":"Vielen Dank an den extrem schnellen und hilfsbereiten Support.\n\nBesonders gut gefällt mir, dass mit dem Plugin auch die korrekte MwSt-Steuer ausgewiesen wird, wenn in einem Set Artikel mit unterschiedlicher MwSt enthalten sind. Dafür ein großes Lob.\n\nMein nächstes Wunschfeature wäre aber noch ein Set/Bundles auf einer eigenen PDP darstellen zu können.\nGerade bei Artikeln mit mehr rechtlichen Hinweis- und Kennzeichnungspflichten würde das noch einiges vereinfachen.","headline":"Tolles Plugin mit korrekter MwSt-Berechnung","creationDate":{"date":"2022-08-04 09:11:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Simona Corso","text":"Diese App ist toll und die Bedienung ist gut durchdacht! Es ist mir wichtig, dass Form und Handling eines Plug-ins intuitiv und »schön« ist. Das Arbeiten muss damit Spaß machen – und es macht Spaß! \n\nAuch wenn in der Beschreibung steht, dass dieses Plug-in in erster Linie mit dem Shopware Standard Theme kompatibel ist, hat es keine Probleme mit meinem Theme von »ThemeWare« gemacht. Mit einem anderen, kleinen Plug-in hat es Probleme gegeben – aber das hatten wir schnell im Griff. Der Support ist fix und lösungsorientiert. Ich hatte von didtvision eine schnelle »Eingrenzung« des Problems erhalten und konnte somit das inkompatible Plug-in eines anderen Anbieters als »Problem« identifizieren. \n\nDie Bundle-Verwaltung ist einfach und verständlich! Es macht wirklich Spaß!\n\nEine Kleinigkeit fehlt mir noch, für meine absolute Glückseligkeit: \nDie Funktion aus allen Bundle-Produkten eine »Dynamische Produktgruppe« zu bilden, damit meine Kunden alle Bundles auf einen Blick sehen. Vielleicht gibt es dazu bald ein kleines »Howto« oder einen Denkanstoß.\n\nDanke für dieses Plug-in!","headline":"WOW… Das ist ein echter Gamechanger!","creationDate":{"date":"2022-06-27 18:40:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Produkt Bundles / Sets","description":"<h2>\n    Artikel Bundles\n</h2><p>\n\nKombinieren Sie Artikel in Ihrem Shop und bieten Sie sie als Bundle zu einem vergünstigten Preis an.\nVerpacken Sie so passende Produkte zu einem Paket und lassen Sie Ihren Kunden neue Produkte entdecken.\n\n</p><p>\n\nMit der Bundle Erweiterung können Sie auch Promotion-Boxen, ähnlich der Amazon-Promotion Box\n\"Wird oft zusammen gekauft\", nachbauen. Dabei können Sie das Augenmerk auf Artikel richten,\nwelche sich vielleicht nicht so gut verkaufen oder einen hohen Lagerbestand aufweisen.\nAuch Abverkaufs-Artikel können so gesondert beworben werden.\n\n</p><p>\n\nSie können beliebig viele Produkte als Bestandteile eines Bundles auswählen. Zudem können\nSie die Stückzahl aller Produkte des Bundles definieren\nSie können bei Varianten-Produkten entweder den Vater oder eine spezifische Variante wählen.\nWenn Sie den Vater wählen, dann kann der Kunde eine Variante auswählen\n</p><h4>Allgemeine und spezifische Bundles</h4><p>\n\n\nSie haben die Möglichkeit entweder allgemeine Bundles zu definieren und diese mehreren Produkten\nzuzuweisen. So können Sie z.B. ein Bundle definieren, das immer aus \"Schnürsenkeln\", \"Socken\" und\n\"Leder-Pflege\" besteht und dieses Bundle jedem Schuh zuweisen. So müssten Sie das Bundle nur\neinmalig definieren und können es bei beliebig vielen Produkten zur Verfügung stellen.\n\n\n\n\n</p>\n\n\nAlternativ können Sie spezifische Bundles pro Produkt definieren. Dazu finden Sie im\nReiter \"Bundles\" in der Administration von Produkten eine Liste von Bundles für das\naktuell ausgewählte Produkt. Hier können Sie individuelle Bundles pflegen, die\nnur für dieses Produkt gültig sind.\n\n<p></p><h4>Konfiguration</h4><p>\n\n\n\nIn der Konfiguration der Erweiterung können Sie die Anzeige der Stückzahl\nin der Übersicht des Bundles deaktivieren und die Vater-Kind Beziehung der\neinzelnen Produkte auflösen. Das kann sinnvoll sein, wenn Sie ein Drittsystem\nangeschlossen haben (z.B. externe Warenwirtschaft), das flache Produkte benötigt.\n\n\n\n\n</p><h4>Anleitung - spezifische Bundles</h4><ul><li>in der Administration von Produkten im Reiter \"Bundles\" können Sie beliebige Bundles definieren</li><li>geben Sie pro Bundle einen beliebigen prozentualen Rabatt an und definieren Sie die zusätzlichen Bestandteile (Produkte) des Bundles</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul><h4>Anleitung - allgemeine Bundles</h4><ul><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Bundles\"</li><li>legen Sie ein neues Bundle an</li><li>nach dem Neuladen des Bundles können Sie \"Produkte\" anlegen</li><li>definieren Sie die Produkte des Bundles (inkl. Stückzahl)</li><li>speichern Sie das Bundle</li><li>öffnen Sie ein beliebiges Produkt in der Administration</li><li>in den Zusatzfeldern im Reiter \"Bundles\" können Sie bis zu drei Bundles auswählen</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung - spezifische Bundles</h4><ul><li>in der Administration von Produkten im Reiter \"Bundles\" können Sie beliebige Bundles definieren</li><li>geben Sie pro Bundle einen beliebigen prozentualen Rabatt an und definieren Sie die zusätzlichen Bestandteile (Produkte) des Bundles</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul><h4>Anleitung - allgemeine Bundles</h4><ul><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Bundles\"</li><li>legen Sie ein neues Bundle an</li><li>nach dem Neuladen des Bundles können Sie \"Produkte\" anlegen</li><li>definieren Sie die Produkte des Bundles (inkl. Stückzahl)</li><li>speichern Sie das Bundle</li><li>öffnen Sie ein beliebiges Produkt in der Administration</li><li>in den Zusatzfeldern im Reiter \"Bundles\" können Sie bis zu drei Bundles auswählen</li><li>wenn Sie diesen Artikel nun im Shop aufrufen, dann werden bei diesem Produkt die Bundles angezeigt</li></ul>","version":"3.0.9","changelog":[{"version":"3.0.9","text":"- fixed saving an order without dissolving the father-child relationship","creationDate":{"date":"2023-07-15 10:09:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.8","text":"- added from-price for variant products without a selected variant","creationDate":{"date":"2023-07-10 15:12:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.7","text":"- fixed invalid bundles for unavailable parent products","creationDate":{"date":"2023-06-30 13:32:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.6","text":"- added product tags to bundle line items","creationDate":{"date":"2023-06-28 19:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.5","text":"- fixed faulty template blocks for custom layouts","creationDate":{"date":"2023-06-23 16:48:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"- added app configuration to enable default product custom fields within a bundle line item","creationDate":{"date":"2023-04-28 21:28:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"- fixed comments and formatting\n\n<br />\n- fixed setup components\n<br />\n- fixed UUIDs for custom bundle line items","creationDate":{"date":"2023-04-27 13:02:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"- added shopware 6.5 compatibility","creationDate":{"date":"2023-03-28 12:37:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.16","text":"- fixed invalid bundles for unavailable parent products","creationDate":{"date":"2023-06-30 13:53:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.15","text":"- added product tags to bundle line items","creationDate":{"date":"2023-06-28 19:19:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.14","text":"<p>- added app configuration to enable default product custom fields within a bundle line item (shopware 6.4.x)</p>","creationDate":{"date":"2023-06-21 19:10:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.13","text":"- added product states (physical, download) to bundles products and their children","creationDate":{"date":"2023-02-15 18:59:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.12","text":"- added bundle children quantity to offcanvas cart<br />\n- added variant text to bundle children with selected variant","creationDate":{"date":"2023-02-02 13:49:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.11","text":"- added scheduled tasks to clean faulty bundles within translations","creationDate":{"date":"2022-11-16 11:04:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.10","text":"- added reference prices to bundle components on product detail page","creationDate":{"date":"2022-10-14 16:48:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"- fixed missing translations\n\n<br />\n\n- added support for context prices","creationDate":{"date":"2022-10-07 09:37:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"- fixed invalid bundles for unavailable products (e.g. offline) and changed app configuration \"Behaviour when products are not available\" accordingly","creationDate":{"date":"2022-08-23 15:19:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"- removed jquery dependency","creationDate":{"date":"2022-07-16 22:18:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"- added app configuration to drop parent container product when saving an order\n\n<br />\n\n- added html id to outer bundle container to support anchors \n\n\n<br />\n\n- added app configuration to drop bundles if it contains a sold-out product\n\n\n<br />\n\n- fixed quantity and unit price of discount position (for third party erp systems)","creationDate":{"date":"2022-07-05 21:40:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"- fixed loading bundles within administration","creationDate":{"date":"2022-05-29 11:47:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"- added bundles tab to product details within the administration to add custom bundles per product<br />\n- removed app configuration for lazy-loading<br />\n\n\n- fixed app configuration for hiding quantity lower than two","creationDate":{"date":"2022-05-29 10:38:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"- fixed removal of unavailable products and invalid bundles","creationDate":{"date":"2022-05-12 14:17:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"- changed rebate from integer to float","creationDate":{"date":"2022-04-10 14:36:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"- changed custom field type of bundle selection from json to string","creationDate":{"date":"2021-10-27 13:43:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"- fixed invalid bundles to be removed from the cart","creationDate":{"date":"2021-08-03 08:59:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"- fixed order of bundles","creationDate":{"date":"2021-08-02 08:49:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- added support for shopware 6.4.2","creationDate":{"date":"2021-07-13 09:04:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- added support for custom product layouts","creationDate":{"date":"2021-07-07 15:33:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"- fixed plugin configuration to enable/disable lazy loading","creationDate":{"date":"2021-06-30 08:34:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- added plugin configuration to enable/disable lazy loading","creationDate":{"date":"2021-06-29 15:00:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- added image lazy loading<br />\n- fixed faulty plugin configuration<br />\n- added check for valid rebate","creationDate":{"date":"2021-06-02 09:31:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2021-05-22 13:42:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn965998642437","redirectToStore":false,"lowestPriceValue":49}