{"id":13488,"name":"OvrMultiTracker","code":"Ovr1820067800337","lastChange":{"date":"2023-07-18 11:16:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXe9zef","examplePageUrl":"","moduleKey":"OvrMultiTracker","creationDate":{"date":"2021-05-25 02:50:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-06-09 16:24:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-06-11 14:39:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3226,"prefix":"Ovr","name":"OVR Engineering","website":"//ovrengineering.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3226_logo_black_bg.png"},"infos":[{"id":23470,"name":"Multi Tracker | Pixel Integration inkl. E-Commerce & Event Tracking","description":"<h2>Was bringt mir das Multi Tracker Plugin?</h2><p>Für die Einrichtung von Tracking Tools ist es erforderlich, verschiedene Code Snippets an vordefinierte Stellen im Shop einzufügen. Das ist aufwendig und oft nur mit Hilfe eines Entwicklers möglich.</p><p>Das Multi Tracker Plugin ermöglicht Dir ohne jeglichen Entwicklungsaufwand eine Vielzahl an bekannten Trackern in deinen Shopware 6 Shop zu integrieren. Auch das für einige Tracker relevante Event- bzw. E-Commerce-Tracking ist bereits vorkonfiguriert. Du musst nur noch deine Tracking-ID eintragen - den Rest erledigt das Plugin.</p><p>Du sparst Dir nicht nur Zeit &amp; Kosten für die Einrichtung, sondern kannst auch jederzeit ohne einen Entwickler weitere Tracker aktivieren.&nbsp;</p><h2>Welche Tracker kann ich über das Plugin einrichten?</h2><p>Über das Plugin können <b>aktuell 11 verschiedene Tracker</b> integriert werden:</p><h3>Google Analytics 4 oder Google Universal Analytics [inkl. Eventtracking]</h3><p>Verwende Google Analytics um kontinuierliche Analysen und statistische Auswertungen für deinen Onlineshop durchzuführen.\nDas Plugin erweitert und ergänzt die Einbindung von Shopware um alle relevanten Produktdaten für das E-Commerce Tracking.</p><h3>Google Ads Conversion Tracking [inkl. Eventtracking]</h3><p>Optimiere deine Google Ads durch das Tracken von Conversions und deren Umsätze.</p><h3>Google Ads Remarketing [inkl. Eventtracking]</h3><p>Erstelle durch die Ads Remarketing Tags eigene Zielgruppen und sprich Deine Besucher nachträglich über Google Ads gezielt an.</p><h3>Facebook Pixel [inkl. Eventtracking]</h3><p>Nutze den Facebook Pixel, um Deine Anzeigen auf Facebook besser und zielgerichteter zu schalten.</p><h3>Hotjar</h3><p>Werte das Verhalten Deiner Nutzer durch Mousetracking, Heatmaps und spezifische Nutzerumfragen aus.</p><h3>Microsoft Clarity</h3><p>Mit der kostenlosen Alternative zu Hotjar kannst Du das Verhalten Deiner Nutzer u.a. durch Mousetracking oder Heatmaps analysieren&nbsp;</p><h3>Google Optimize [kein Seitenflackern]</h3><p>Optimiere deinen Shop mit A/B- und multivariaten Tests.\nDurch manuelle Einbindung im HTML-HEAD wird verhindert, dass die Seite “flackert”.&nbsp;</p><h3>Google Tag Manager</h3><p>Verwende den Google Tag Manager, um in deinem Shop individuelle Code Snippets einzubauen - ohne dabei in den Quellcode eingreifen zu müssen. <br></p><h3>Bing Ads Conversion Tracking [inkl. Eventtracking]</h3><p>Optimiere deine Bing Ads durch das Tracken von Conversions und deren Umsätze.</p><h3>Bing Ads Remarketing [inkl. Eventtracking]</h3><p>Erstelle durch die Ads Remarketing Tags eigene Zielgruppen und sprich Deine Besucher nachträglich über Bing Ads gezielt an.</p><p><br></p><p><b>Hinweis:</b> Das Plugin wird fortlaufend um neue Tracker erweitert. Dir fehlt ein Tracker? Schreib uns gerne eine Mail an:&nbsp;info@ovrengineering.de</p><h2>Implementiert das Plugin auch das Tracking der E-Commerce-Events?</h2><p>Ja, für Google Analytics 4 / Universal Analytics, Google Ads Conversion Tracking / Remarketing, Bing Ads Conversion Tracking / Remarketing sowie den Facebook Pixel werden zusätzlich zu den Seitenaufrufen auch alle relevanten E-Commerce-Events wie addToCart oder beginCheckout getrackt.&nbsp;</p><h3>Google Analytics 4 oder Google Universal Analytics</h3><p></p><ul><li><b>View Item List:</b> Ein Benutzer besucht eine Kategorieseite</li><li><b>Select Item:</b> Ein Benutzer klickt auf einer Kategorieseite ein Produkt an</li><li><b>View Item:</b> Ein Benutzer besucht eine Produkt-Detailseite</li><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Remove from Cart:</b> Ein Benutzer entfernt einen Artikel aus seinem Warenkorb</li><li><b>Begin Checkout:</b> Ein Benutzer beginnt den Checkout-Prozess</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li></ul><h3>Google Ads Conversion Tracking</h3><p></p><ul><li><b>Allgemeine Website-Tag:</b> Mit dem allgemeinen Website-Tag werden Besucher zu Ihrer Remarketing-Liste \"Alle Besucher\" hinzugefügt</li><li><b>Conversion-Tracking-Tag:</b> Hierüber können Conversions Ihrer Google Ads-Kampagne zugeordnet werden</li></ul><h3>Google Ads dynamisches Remarketing</h3><p></p><ul><li><b>View Item List:</b> Ein Benutzer besucht eine Kategorieseite</li><li><b>View Item:</b> Ein Benutzer besucht eine Produkt-Detailseite</li><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li><li><b>View Search Result:</b> Ein Benutzer verwendet die Shop-Suchfunktion</li></ul><h3>Facebook Pixel</h3><p></p><ul><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Add to Wishlist:</b> Ein Benutzer fügt einen Artikel seiner Merkliste hinzu</li><li><b>Complete Registration:</b> Ein Benutzer erstellt ein Konto</li><li><b>Customize Product:</b> Ein Benutzer verwendet die Varianten-Auswahl</li><li><b>Initiate Checkout:</b> Ein Benutzer beginnt den Checkout-Prozess</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li><li><b>Search: </b>Ein Benutzer verwendet die Shop-Suchfunktion <br></li></ul><h3>Bing Ads Conversion Tracking</h3><ul><li><b>Allgemeine Website-Tag:</b> Mit dem allgemeinen Website-Tag werden Besucher zu Ihrer Remarketing-Liste \"Alle Besucher\" hinzugefügt</li><li><b>Conversion-Tracking-Tag:</b> Hierüber können Conversions Ihrer Bing Ads-Kampagne zugeordnet werden</li></ul><h3>Bing Ads dynamisches Remarketing</h3><ul><li><b>View Home:</b> Ein Benutzer besucht die Startseite</li><li><b>View Category:</b> Ein Benutzer besucht eine Kategorieseite</li><li><b>View Product:</b> Ein Benutzer besucht eine Produkt-Detailseite</li><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li><li><b>View Search Result:</b> Ein Benutzer verwendet die Shop-Suchfunktion</li></ul><h2>Ist das Plugin DSGVO konform?</h2><p>Ja, das Plugin ist bei Verwendung des Cookie Consent Tool von Shopware DSGVO konform. Alle Skripte werden im Standard erst nach Zustimmung durch den Nutzer geladen, um zu verhindern, dass die IP Adresse deiner Nutzer bereits vorher an Dritte übermittelt wird.<br></p><p>Zusätzlich hast Du die Möglichkeit, die Integration in das Cookie Consent Tools zu deaktivieren und ohne explizite Einwilligung im Shop zu tracken - bspw. bei B2B Shops mit vorheriger Einwilligung der Nutzer oder in Ländern, in denen die DSGVO nicht gilt. Beachte, dass dies bei unsachgemäßer Benutzung möglicherweise nicht den geltenden Datenschutz-Vorschriften entspricht.</p><h2>Feedback &amp; Bewertung</h2><p>Du hast einen Verbesserungsvorschlag, einen Fehler gefunden oder wünscht Dir einen weiteren Tracker? Schreib uns gerne eine Mail an: info@ovrengineering.de</p><p><br></p><p><b>Haftungsausschluss:</b> Das Plugin “Multi Tracker” bietet die technische Möglichkeit, verschiedene Tracking-Systeme in das Cookie Consent Tool von Shopware zu integrieren. Bei Verstößen gegen länderspezifische Datenschutzrichtlinien haftet der Hersteller nicht. Alle Shopbetreiber handeln bei Verwendung eigenverantwortlich und sollten mit ihrem Datenschutzbeauftragten oder Rechtsbeistand die korrekte Einbindung absichern. Unsere Mitarbeiter können und dürfen keine Rechtsberatung übernehmen oder ersetzen.</p>","installationManual":"<p>Eine ausführliche Beschreibung findest du in unserer <a href=\"https://docs.ovrengineering.de/multi-tracker/\" target=\"_blank\" rel=\"noopener\">Dokumentation.</a></p><p>Für die Integration des Plugins benötigst Du keine Code-Kenntnisse. Alles bis auf Deine Tracking-IDs ist bereits vorkonfiguriert.&nbsp;</p><p>Das Plugin ist in&nbsp;<b>&lt; 5 Minuten</b>&nbsp;einsatzbereit:</p><p></p><ol><li>Lade das Plugin herunter und installiere es.</li><li>Im Verkaufskanal-Tab Analytics findest du nun für jeden Tracker die Möglichkeit, deine individuelle Tracking-IDs einzufügen und den Tracker zu aktivieren.</li><li><b>Fertig!&nbsp;</b>Dein Tracker ist aktiv und übermittelt, nach Zustimmung der Besucher deines Shops, die gesammelten Daten.&nbsp;</li></ol>","shortDescription":"Binde mit dem Multi Tracker verschiedenste Tracking Pixel inkl. E-Commerce-Event Tracking ein. Unterstützt externe CMPs wie Usercentrics und consentmanager.net","highlights":"<b>Umfangreiche Analysen</b> – Verschiedene Tracking Tools mit nur einem Plugin einbinden\n<b>Event-Tracking</b> – Vorkonfiguriert für Google Analytics, Google Ads, Bing Ads und Facebook Pixel\n<b>Einfache Einrichtung</b> – Nur wenige Klicks, keine Code-Kenntnisse notwendig\n<b>DSGVO-konform</b> – Integriert in das Cookie Consent Tool von Shopware\n<b>Unterstützt externe CMPs</b> - Eingebaute Integration für Usercentrics und consentmanager.net","features":"<b>Integrierte Tracker (11):</b> Google Analytics 4, Google Universal Analytics, Google Tag Manager, Google Optimize, Google Ads Conversion Tracking, Google Ads Remarketing, Bing Ads Conversion Tracking, Bing Ads Remarketing, Facebook Pixel, Hotjar sowie Microsoft Clarity\n<b>Vollständiges E-Commerce Event Tracking (7):</b> Google Analytics 4, Google Universal Analytics, Google Ads Conversion und Remarketing, Bing Ads Conversion und Remarketing sowie für den Facebook Pixel\nAlle Tracker können individuell aktiviert bzw. deaktiviert werden\nKein Programmieren notwendig - einfach Tracking-ID hinterlegen und loslegen\nNahtlos in das Cookie Consent Tool von Shopware integriert\nAlle Textbausteine sind auf Deutsch und Englisch vorhanden\nOptional können die Tracker auch direkt und ohne Zustimmung aktiviert werden - bspw. in B2B-Shops mit vorheriger Zustimmung außerhalb des Shops\nPro Verkaufskanal individuell einstellbar"},{"id":23475,"name":"Multi Tracker | Pixel Integration incl. E-Commerce & Event Tracking","description":"<h2>What are the benefits of the Multi Tracker Plugin?</h2><p>To set up tracking tools, it is necessary to implement various code snippets in predefined places in the shop. This is time-consuming and often only possible with the help of a developer.</p><p>The Multi Tracker Plugin allows you to integrate a variety of well-known trackers into your Shopware 6 shop without any development effort. The event or e-commerce tracking that is relevant for some trackers is also already preconfigured. All you have to do is enter your tracking ID - the plugin does the rest.&nbsp;</p><p>Not only do you save time and costs for the setup, you can also activate additional trackers at any time without a developer.&nbsp;</p><h2>Which trackers can I set up using the plugin?</h2><p>Currently, <b>11 different trackers</b> can be integrated using the plugin:</p><h3>Google Analytics 4 or Google Universal Analytics [incl. event tracking]</h3><p>Use Google Analytics to perform continuous analyses and statistical evaluations for your online shop. The plugin extends and enhances the integration of Shopware with all relevant product data for e-commerce tracking.</p><h3>Google Ads Conversion Tracking [incl. event tracking]&nbsp;</h3><p>Optimise your Google Ads by tracking conversions and their revenues.</p><h3>Google Ads Remarketing [incl. event tracking]</h3><p>Create your own target groups with the Ads Remarketing tags and target your visitors afterwards with Google Ads.</p><h3>Facebook Pixel [incl. event tracking]</h3><p>Use the Facebook pixel to better target your ads on Facebook.</p><h3>Hotjar</h3><p>Evaluate the behaviour of your users through mouse tracking, heat maps and specific user surveys.</p><h3>Microsoft Clarity</h3><p>With the free alternative to Hotjar, you can analyse the behaviour of your users through mouse tracking or heatmaps, among other things.</p><h3>Google Optimize [no page flickering]</h3><p>Optimise your shop with A/B and multivariate tests. Manual integration in the HTML-head prevents the page from \"flickering\".</p><h3>Google Tag Manager</h3><p>Use the Google Tag Manager to integrate individual code snippets in your shop - without having to modify the source code. <br></p><h3>Bing Ads Conversion Tracking [incl. event tracking]&nbsp;</h3><p>Optimise your Bing Ads by tracking conversions and their revenues.</p><h3>Bing Ads Remarketing [incl. event tracking]</h3><p>Create your own target groups with the Ads Remarketing tags and target your visitors afterwards with Bing Ads.</p><p><br></p><p><b>Note:</b> The plugin is constantly being updated with new trackers. Are you missing a tracker? Feel free to send us an email to: info@ovrengineering.de</p><h2>Does the plugin also implement the tracking of e-commerce events?</h2><p>Yes, for Google Analytics 4 / Universal Analytics, Google Ads Conversion Tracking / Remarketing, Bing Ads Conversion Tracking / Remarketing and the Facebook Pixel, all relevant e-commerce events such as addToCart or beginCheckout are tracked in addition to the page views.</p><h3>Google Analytics 4 or Google Universal Analytics</h3><p></p><ul><li><b>View Item List:</b> A user visits a category page</li><li><b>Select Item:</b> A user clicks on a product on a category page</li><li><b>View Item:</b> A user visits a product detail page</li><li><b>Add to Cart:</b> A user adds an item to the shopping cart</li><li><b>Remove from Cart:</b> A user removes an item from the shopping cart</li><li><b>Begin Checkout:</b> A user begins the checkout process</li><li><b>Purchase:</b> A user completes the checkout process</li></ul><h3>Google Ads Conversion Tracking</h3><p></p><ul><li><b>General website tag:</b> The general website tag is used to add visitors to your \"All visitors\" remarketing list.</li><li><b>Conversion tracking tag:</b> Allows conversions to be assigned to your Google Ads campaign</li></ul><h3>Google Ads Dynamic Remarketing</h3><ul><li><b>View Item List:</b> A user visits a category page</li><li><b>View Item:</b> A user visits a product detail page</li><li><b>Add to Cart:</b> A user adds an item to the shopping cart</li><li><b>Purchase:</b> A user completes the purchase process</li><li><b>View Search Result:</b> A user uses the shop search function</li></ul><h3>Facebook Pixel</h3><p></p><ul><li><b>Add to Cart:</b> A user adds an item to the shopping cart</li><li><b>Add to Wishlist:</b> A user adds an item to the wishlist</li><li><b>Complete Registration:</b> A user creates an account</li><li><b>Customize Product:</b> A user uses the variant selection</li><li><b>Initiate Checkout:</b> A user begins the checkout process</li><li><b>Purchase:</b> A user completes the purchase process</li><li><b>Search:</b> A user uses the shop search function</li></ul><h3>Bing Ads Conversion Tracking</h3><ul><li><b>General website tag:</b> The general website tag is used to add visitors to your \"All visitors\" remarketing list.</li><li><b>Conversion tracking tag:</b> Allows conversions to be assigned to your Bing Ads campaign <br></li></ul><h3>Bing Ads Dynamic Remarketing</h3><ul><li><b>View Home:</b> A user visits the home page</li><li><b>View Category</b>: A user vists a category page<br></li><li><b>View Product:</b> A user visits a product detail page</li><li><b>Add to Cart:</b> A user adds an item to the shopping cart</li><li><b>Purchase:</b> A user completes the purchase process</li><li><b>View Search Result:</b> A user uses the shop search function</li></ul><h2>Is the plugin compliant with the GDPR?</h2><p>Yes, the plugin is compliant with the GDPR when using the Cookie Consent Tool from Shopware. All scripts are loaded by default only after the user's consent, which ensures that their IP Address isn't transfered before the consent already.<br></p><p>In addition, you have the option of deactivating the integration in the Cookie Consent Tool and tracking in the shop without explicit consent - e.g. in B2B shops with prior consent of the users or in countries where the GDPR does not apply. Note that this may not comply with the applicable data protection regulations if used improperly.</p><h2>Feedback</h2><p>You have a suggestion for improvement, found a bug or would like to see another tracker? Feel free to send us an email to: info@ovrengineering.de&nbsp;</p><p><br></p><p><b>Disclaimer: </b>The plugin \"Multi Tracker\" offers the technical possibility to integrate different tracking systems into the Cookie Consent Tool of Shopware. The manufacturer is not liable for violations of country-specific data protection guidelines. All shop owners act on their own responsibility when using the tool and should consult their data protection officer or legal advisor to ensure correct integration. Our employees cannot and must not provide or replace legal advice.\n</p>","installationManual":"<p>You can find a more in-depth manual in our <a href=\"https://docs.ovrengineering.de/multi-tracker/\" target=\"_blank\" rel=\"noopener\">documentation</a>.</p><p>You don't need any code knowledge to use the plugin. Everything except your tracking IDs is already pre-configured.</p><p>The plugin is&nbsp;<b>ready to use in &lt; 5 minutes</b>:</p><p></p><ol><li>Download and install the plugin.</li><li>In the Analytics sales channel tab, you will now find the option to insert your individual tracking IDs for each tracker and activate the tracker.</li><li>Done! Your tracker is active and transmits the collected data after the visitors of your shop have given their consent.</li></ol><p></p>","shortDescription":"Integrate various tracking pixels incl. e-commerce event tracking with the Multi Tracker. Supports external CMPs like Usercentrics and consentmanager.net","highlights":"<b>Advanced analytics</b> - Integrate various tracking tools with just one plugin\n<b>Event tracking</b> - Preconfigured for Google Analytics, Google Ads, Bing Ads and Facebook Pixel\n<b>Easy setup</b> - Only a few clicks, no code knowledge necessary\n<b>DSGVO compliant</b> - Integrated with Shopware's Cookie Consent Tool\n<b>Supports external CMPs</b> - Built-In support for Usercentrics and consentmanager.net","features":"<b>Integrated trackers (11):</b> Google Analytics 4, Google Universal Analytics, Google Tag Manager, Google Optimize, Google Ads Conversion Tracking, Google Ads Remarketing, Bing Ads Conversion Tracking, Bing Ads Remarketing, Facebook Pixel, Hotjar and Microsoft Clarity.\n<b>Complete e-commerce event tracking (7):</b> Google Analytics 4, Google Universal Analytics, Google Ads Conversion and Remarketing, Bing Ads Conversion and Remarketing as well as for the Facebook Pixel.\nAll trackers can be individually activated or deactivated\nNo programming necessary - simply enter a tracking ID and get started\nSeamlessly integrated into Shopware's Cookie Consent Tool\nAll snippets are available in German and English\nOptionally, the trackers can also be activated directly and without consent - e.g. in B2B shops with prior consent outside the shop\nIndividually configurable per sales channel"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163389,"bookingKey":"Ovr1820067800337","bookingText":"Multi Tracker | Pixel Integration incl. E-Commerce & Event Tracking","price":49.95,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":163507,"bookingKey":"Ovr1820067800337_M","bookingText":"Multi Tracker | Pixel Integration incl. E-Commerce & Event Tracking","price":9.95,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyCbZRL","preview":true,"priority":0,"id":101631},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJX7IlP","preview":false,"priority":50,"id":67821},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpScyDje","preview":false,"priority":10,"id":67825}],"comments":[{"authorName":"Anna","text":"","headline":"Der Support ist super","creationDate":{"date":"2021-07-29 14:05:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Multi Tracker | Pixel Integration inkl. E-Commerce & Event Tracking","description":"<h2>Was bringt mir das Multi Tracker Plugin?</h2><p>Für die Einrichtung von Tracking Tools ist es erforderlich, verschiedene Code Snippets an vordefinierte Stellen im Shop einzufügen. Das ist aufwendig und oft nur mit Hilfe eines Entwicklers möglich.</p><p>Das Multi Tracker Plugin ermöglicht Dir ohne jeglichen Entwicklungsaufwand eine Vielzahl an bekannten Trackern in deinen Shopware 6 Shop zu integrieren. Auch das für einige Tracker relevante Event- bzw. E-Commerce-Tracking ist bereits vorkonfiguriert. Du musst nur noch deine Tracking-ID eintragen - den Rest erledigt das Plugin.</p><p>Du sparst Dir nicht nur Zeit &amp; Kosten für die Einrichtung, sondern kannst auch jederzeit ohne einen Entwickler weitere Tracker aktivieren. </p><h2>Welche Tracker kann ich über das Plugin einrichten?</h2><p>Über das Plugin können <b>aktuell 11 verschiedene Tracker</b> integriert werden:</p><h3>Google Analytics 4 oder Google Universal Analytics [inkl. Eventtracking]</h3><p>Verwende Google Analytics um kontinuierliche Analysen und statistische Auswertungen für deinen Onlineshop durchzuführen.\nDas Plugin erweitert und ergänzt die Einbindung von Shopware um alle relevanten Produktdaten für das E-Commerce Tracking.</p><h3>Google Ads Conversion Tracking [inkl. Eventtracking]</h3><p>Optimiere deine Google Ads durch das Tracken von Conversions und deren Umsätze.</p><h3>Google Ads Remarketing [inkl. Eventtracking]</h3><p>Erstelle durch die Ads Remarketing Tags eigene Zielgruppen und sprich Deine Besucher nachträglich über Google Ads gezielt an.</p><h3>Facebook Pixel [inkl. Eventtracking]</h3><p>Nutze den Facebook Pixel, um Deine Anzeigen auf Facebook besser und zielgerichteter zu schalten.</p><h3>Hotjar</h3><p>Werte das Verhalten Deiner Nutzer durch Mousetracking, Heatmaps und spezifische Nutzerumfragen aus.</p><h3>Microsoft Clarity</h3><p>Mit der kostenlosen Alternative zu Hotjar kannst Du das Verhalten Deiner Nutzer u.a. durch Mousetracking oder Heatmaps analysieren </p><h3>Google Optimize [kein Seitenflackern]</h3><p>Optimiere deinen Shop mit A/B- und multivariaten Tests.\nDurch manuelle Einbindung im HTML-HEAD wird verhindert, dass die Seite “flackert”. </p><h3>Google Tag Manager</h3><p>Verwende den Google Tag Manager, um in deinem Shop individuelle Code Snippets einzubauen - ohne dabei in den Quellcode eingreifen zu müssen. <br /></p><h3>Bing Ads Conversion Tracking [inkl. Eventtracking]</h3><p>Optimiere deine Bing Ads durch das Tracken von Conversions und deren Umsätze.</p><h3>Bing Ads Remarketing [inkl. Eventtracking]</h3><p>Erstelle durch die Ads Remarketing Tags eigene Zielgruppen und sprich Deine Besucher nachträglich über Bing Ads gezielt an.</p><p><br /></p><p><b>Hinweis:</b> Das Plugin wird fortlaufend um neue Tracker erweitert. Dir fehlt ein Tracker? Schreib uns gerne eine Mail an: info@ovrengineering.de</p><h2>Implementiert das Plugin auch das Tracking der E-Commerce-Events?</h2><p>Ja, für Google Analytics 4 / Universal Analytics, Google Ads Conversion Tracking / Remarketing, Bing Ads Conversion Tracking / Remarketing sowie den Facebook Pixel werden zusätzlich zu den Seitenaufrufen auch alle relevanten E-Commerce-Events wie addToCart oder beginCheckout getrackt. </p><h3>Google Analytics 4 oder Google Universal Analytics</h3><p></p><ul><li><b>View Item List:</b> Ein Benutzer besucht eine Kategorieseite</li><li><b>Select Item:</b> Ein Benutzer klickt auf einer Kategorieseite ein Produkt an</li><li><b>View Item:</b> Ein Benutzer besucht eine Produkt-Detailseite</li><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Remove from Cart:</b> Ein Benutzer entfernt einen Artikel aus seinem Warenkorb</li><li><b>Begin Checkout:</b> Ein Benutzer beginnt den Checkout-Prozess</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li></ul><h3>Google Ads Conversion Tracking</h3><p></p><ul><li><b>Allgemeine Website-Tag:</b> Mit dem allgemeinen Website-Tag werden Besucher zu Ihrer Remarketing-Liste \"Alle Besucher\" hinzugefügt</li><li><b>Conversion-Tracking-Tag:</b> Hierüber können Conversions Ihrer Google Ads-Kampagne zugeordnet werden</li></ul><h3>Google Ads dynamisches Remarketing</h3><p></p><ul><li><b>View Item List:</b> Ein Benutzer besucht eine Kategorieseite</li><li><b>View Item:</b> Ein Benutzer besucht eine Produkt-Detailseite</li><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li><li><b>View Search Result:</b> Ein Benutzer verwendet die Shop-Suchfunktion</li></ul><h3>Facebook Pixel</h3><p></p><ul><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Add to Wishlist:</b> Ein Benutzer fügt einen Artikel seiner Merkliste hinzu</li><li><b>Complete Registration:</b> Ein Benutzer erstellt ein Konto</li><li><b>Customize Product:</b> Ein Benutzer verwendet die Varianten-Auswahl</li><li><b>Initiate Checkout:</b> Ein Benutzer beginnt den Checkout-Prozess</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li><li><b>Search: </b>Ein Benutzer verwendet die Shop-Suchfunktion <br /></li></ul><h3>Bing Ads Conversion Tracking</h3><ul><li><b>Allgemeine Website-Tag:</b> Mit dem allgemeinen Website-Tag werden Besucher zu Ihrer Remarketing-Liste \"Alle Besucher\" hinzugefügt</li><li><b>Conversion-Tracking-Tag:</b> Hierüber können Conversions Ihrer Bing Ads-Kampagne zugeordnet werden</li></ul><h3>Bing Ads dynamisches Remarketing</h3><ul><li><b>View Home:</b> Ein Benutzer besucht die Startseite</li><li><b>View Category:</b> Ein Benutzer besucht eine Kategorieseite</li><li><b>View Product:</b> Ein Benutzer besucht eine Produkt-Detailseite</li><li><b>Add to Cart:</b> Ein Benutzer legt einen Artikel in seinen Warenkorb</li><li><b>Purchase:</b> Ein Benutzer schließt den Kaufvorgang ab</li><li><b>View Search Result:</b> Ein Benutzer verwendet die Shop-Suchfunktion</li></ul><h2>Ist das Plugin DSGVO konform?</h2><p>Ja, das Plugin ist bei Verwendung des Cookie Consent Tool von Shopware DSGVO konform. Alle Skripte werden im Standard erst nach Zustimmung durch den Nutzer geladen, um zu verhindern, dass die IP Adresse deiner Nutzer bereits vorher an Dritte übermittelt wird.<br /></p><p>Zusätzlich hast Du die Möglichkeit, die Integration in das Cookie Consent Tools zu deaktivieren und ohne explizite Einwilligung im Shop zu tracken - bspw. bei B2B Shops mit vorheriger Einwilligung der Nutzer oder in Ländern, in denen die DSGVO nicht gilt. Beachte, dass dies bei unsachgemäßer Benutzung möglicherweise nicht den geltenden Datenschutz-Vorschriften entspricht.</p><h2>Feedback &amp; Bewertung</h2><p>Du hast einen Verbesserungsvorschlag, einen Fehler gefunden oder wünscht Dir einen weiteren Tracker? Schreib uns gerne eine Mail an: info@ovrengineering.de</p><p><br /></p><p><b>Haftungsausschluss:</b> Das Plugin “Multi Tracker” bietet die technische Möglichkeit, verschiedene Tracking-Systeme in das Cookie Consent Tool von Shopware zu integrieren. Bei Verstößen gegen länderspezifische Datenschutzrichtlinien haftet der Hersteller nicht. Alle Shopbetreiber handeln bei Verwendung eigenverantwortlich und sollten mit ihrem Datenschutzbeauftragten oder Rechtsbeistand die korrekte Einbindung absichern. Unsere Mitarbeiter können und dürfen keine Rechtsberatung übernehmen oder ersetzen.</p>","installationManual":"<p>Eine ausführliche Beschreibung findest du in unserer <a href=\"https://docs.ovrengineering.de/multi-tracker/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation.</a></p><p>Für die Integration des Plugins benötigst Du keine Code-Kenntnisse. Alles bis auf Deine Tracking-IDs ist bereits vorkonfiguriert. </p><p>Das Plugin ist in <b>&lt; 5 Minuten</b> einsatzbereit:</p><p></p><ol><li>Lade das Plugin herunter und installiere es.</li><li>Im Verkaufskanal-Tab Analytics findest du nun für jeden Tracker die Möglichkeit, deine individuelle Tracking-IDs einzufügen und den Tracker zu aktivieren.</li><li><b>Fertig! </b>Dein Tracker ist aktiv und übermittelt, nach Zustimmung der Besucher deines Shops, die gesammelten Daten. </li></ol>","version":"1.8.1","changelog":[{"version":"1.8.1","text":"<ul><li>Added new events for Google Analytics 4 (AddToWishlist, ViewCart)</li><li>In the plugin config, you can now configurate if the shipping cost should be included in the calculation of the total cart value<br /></li></ul>","creationDate":{"date":"2023-07-03 20:08:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.0","text":"<p>Compatibility with Shopware 6.5<br /></p>","creationDate":{"date":"2023-04-02 21:52:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.1","text":"<p>Improved compatibility with older Shopware versions<br /></p>","creationDate":{"date":"2022-10-20 01:57:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"<p>Added an option to fill the Google Tag Manager dataLayer with ecommerce data<br /></p>","creationDate":{"date":"2022-10-10 20:58:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"<p>Fixed an issue where valid tag manager ids were shown as incorrect<br /></p>","creationDate":{"date":"2022-07-21 19:08:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<p>Added support for usercentrics<br /></p>","creationDate":{"date":"2022-07-20 01:11:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<p>Fixen an issue that caused items to be submitted twice in purchase events<br /></p>","creationDate":{"date":"2022-07-08 15:52:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<p>Added missing translation snippet<br /></p>","creationDate":{"date":"2022-06-27 16:26:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<p>Fixed issue with older shopware versions<br /></p>","creationDate":{"date":"2022-06-24 20:49:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Improved compatibility with other plugins<br /></p>","creationDate":{"date":"2022-06-24 20:47:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Added support for ConsentManager.net</li><li>Added debug mode, which logs tracking &amp; event data in the console</li><li>Improved compatibility with other plugins<br /></li></ul>","creationDate":{"date":"2022-06-24 20:40:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<ul><li>Added validation to catch invalid tracking ids</li><li>Improved compatibility with other plugins<br /></li></ul>","creationDate":{"date":"2022-06-07 16:32:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>Added danish translations<br /></p>","creationDate":{"date":"2022-05-19 22:15:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>Improved compatibility with other plugins<br /></p>","creationDate":{"date":"2022-05-12 13:11:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>Fixed an issue caused by products without a category<br /></p>","creationDate":{"date":"2022-05-12 11:25:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>It's now possible to simultaneously use Google Analytics 4 and Google Universal Analytics<br /></p>","creationDate":{"date":"2022-05-02 18:13:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>E-Commerce Events are now being triggered directly once users agree <br /></li></ul><ul><li>Prevent orders from being submitted multiple times when users visit the thank you page again<br /></li><li>Improved help texts in admin<br /></li></ul>","creationDate":{"date":"2022-02-21 19:57:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p>Fixed an issue where products without an assigned category could cause an error.<br /></p>","creationDate":{"date":"2021-12-12 15:55:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>The Bing default event for purchases now also tracks revenue<br /></p>","creationDate":{"date":"2021-08-18 12:44:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>Added ViewContent Facebook Pixel event<br /></p>","creationDate":{"date":"2021-08-10 18:43:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>Fixed an issue caused by non-available products<br /></p>","creationDate":{"date":"2021-07-29 15:36:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>Fixed an issue that caused a dummy id to be used for bing conversion tracking<br /></p>","creationDate":{"date":"2021-07-29 13:37:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Fixen an javascript issue caused by a disabled wishlist<br /></p>","creationDate":{"date":"2021-07-12 16:16:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Added support for product detail pages with cms layout<br /></p>","creationDate":{"date":"2021-07-12 15:10:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Improved validation in admin<br /></p>","creationDate":{"date":"2021-06-15 14:33:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release</p><p>Compatible with Shopware 6.3 - 6.4<br /></p>","creationDate":{"date":"2021-06-02 04:47:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Ovr1820067800337","redirectToStore":false,"lowestPriceValue":9.95}