{"id":13501,"name":"AppflixDewaShop","code":"Appfl57695012045","lastChange":{"date":"2023-07-18 11:16:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6ILmRu","examplePageUrl":"","moduleKey":"AppflixDewaShop","creationDate":{"date":"2021-05-27 16:15:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-06-09 09:44:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-05-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-20 03:38:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3336,"prefix":"Appflix","name":"Appflix UG","website":"//app-flix.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3336_appflix-logo-account-2.jpg"},"infos":[{"id":23492,"name":"DeliveryWare | All-In-One Software für Lieferdienste","description":"<p><b>&gt;&gt;&gt; Hinweis:</b> DeliveryWare benötigt für den Betrieb die kostenlose moori - Foundation Erweiterung:<br><a href=\"https://store.shopware.com/moorl50852475974f/foundation-basis-version.html\" target=\"_blank\" rel=\"noreferrer\">https://store.shopware.com/moorl50852475974f/foundation-basis-version.html</a><br></p><p><br></p><p></p><h4>Hinweis für Speisen mit Varianten/Staffelungen</h4><p>Die Preisberechnung in DeliveryWare folgt festen Regeln. Diese richtet sich nach einem Grundpreis und Faktoren, die mit dem Grundpreis multipliziert werden. Wenn Du z.B. zwei Pizzen hast, die denselben Grundpreis, aber unterschiedliche Preise für größere Exemplare haben, ist DeliveryWare nicht für Dich geeignet. Die Preise können von 1 Euro-Cent bis auf 1 Euro gerundet werden.</p><h4>Hinweis zur Besteuerung</h4><p>Falls nicht anders angegeben, richten wir Deinen Shop mit der 19 % Regel ein. Auf Wunsch werden die Speisen nach der 7 % Regel und die Getränke nach der 19 % Regel eingerichtet. Lieferkosten werden mit 7 % besteuert, sofern die Hauptleistung (Speisen) die Nebenleistung (Lieferung + Getränke) übersteigt.</p><h4>Hinweis zu Pfand</h4><p>Optional kann man Pfandbeträge ausweisen, werden in diesem Falle aber nicht auf die Rundung der Preise berücksichtigt. Ein Getränk mit einem Preis von 2,00 € und 0,25 € Pfand kostet 2,25 €.</p><h3>Individuelle Anpassungen?</h3><p>Sofern generelle Anpassungen an DeliveryWare einen allgemeinen Mehrwert haben, können auf Wunsch Anpassungen zu einem vergünstigten Stundensatz angeboten werden. Davon ausgeschlossen: Anpassungen am Theme.</p><p><br></p><p>DeliveryWare ist eine All-In-One Lösung für Deinen Online-Lieferdienst. Egal welche Form des Gastronomiebetriebs, DeliveryWare bietet Dir mit nur wenig Einrichtungsaufwand, direkt in den Lieferdienst zu starten! Umfangreiche Funktionen unterstützen Dich für den optimalen Workflow bei der Abwicklung Deiner Bestellungen.</p><p>Öffne die offizielle <a href=\"https://deliveryware.de/\" rel=\"noopener\">Produktbeschreibung von DeliveryWare</a>, um mehr Details zu erfahren.</p><h2>Schnittstellenfeatures im Überblick</h2><p><b>POS Terminal für die Verwaltung deiner Bestellungen</b><br>\nDu möchtest deine Bestellungen sicherlich auch vor Ort in deinem Geschäft verwalten und ausdrucken. Dafür haben wir eine Lösung.\n</p><p>➤ Kabelloses POS Terminal mit integriertem Bondrucker</p><p>➤ Lieferung und Selbstabholung problemlos einstellbar</p><p>➤ Gerät inkl. Einrichtung und Versand für einmalig 299,00€ zzgl. MwSt.</p><br><p><b>Restaurant - Suchportal</b><br>\nDas Suchportal ist eine eigenständige Suchmaschine für alle Shops, die DeliveryWare nutzen. Als Shopbetreiber profitierst Du durch mehr Reichweite, da das Portal alle Shops listet, die mit dem Suchradius des Kunden übereinstimmen.</p><p>\nDie Aufnahme in das Restaurant - Suchportal ist optional. Du musst Deinen Shop also nicht listen lassen, wenn du nicht möchtest. Aber wer hat schon etwas gegen mehr Reichweite?\n</p><p>\n➤ Die Informationen für das Händlerportal werden automatisch erkannt<br>\n➤ Du profitierst passiv von unseren Marketingkampagnen<br>\n➤ Das Händlerportal wird permanent verbessert und Du profitierst<br>\n➤ Du hast keinen Aufwand und profitierst vollautomatisch<br>\n➤ 100% kostenlos für Kunden von DeliveryWare\n</p><br><h2>Interessant für Freelancer und Agenturen</h2><p><b>Für das \"Restaurant um die Ecke\"</b><br>\nErstelle einen kompletten Lieferservice für Dein Lieblingsrestaurant. Sie freuen sich!\n</p><p><b>Umsetzung einer Lieferkette geplant?</b><br>\nMit DeliveryWare ist es möglich, mehrere Shops und Standorte zu verwalten. Sprich mit uns und wir helfen Dir.\n</p><p><b>Darf es etwas mehr sein?</b><br>\nDeliveryWare basiert auf Shopware 6 und ist somit, wie du sicherlich weißt, grenzenlos erweiterbar.\n</p><p><b>Sprich mit uns ganz offen</b><br>\nWir freuen uns über Kooperationen! Nutze DeliveryWare und wir revanchieren uns.\n</p><p><b>Provisions- und Vergütungsmodelle</b><br>\nDu möchtest gleich mehrere Shops mit DeliveryWare umsetzen? Dann profitierst du selbstverständlich mit.\n</p><p><b>Arbeite effektiv mit uns zusammen</b><br>\nWir möchten DeliveryWare in den Gastronomiebetrieb integrieren und freuen uns über viele Kooperationen an vielen Standorten.\n</p>","installationManual":"<p>Sobald Du das Theme aus dem Shopware Store bezogen hast, kannst Du es in Deinem Shopware Store installieren und aktivieren. Weise das Theme noch deinem Verkaufskanal zu und installiere ggf. noch ein Demopaket.</p><p>Für weitere Informationen, schaue einfach in unsere <a href=\"https://docs.deliveryware.de/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentationen</a></p><p><b>Demopakete sind hier verfügbar:</b></p><p><a href=\"https://www.deliveryware.de/index.html#services\" target=\"_blank\" rel=\"noreferrer\">https://www.deliveryware.de/index.html#services</a><br></p><p><b>Android POS App im PlayStore:</b></p><p><a href=\"https://play.google.com/store/apps/details?id=de.tappeit.dewa_app&amp;hl=de\" target=\"_blank\" rel=\"noreferrer\">https://play.google.com/store/apps/details?id=de.tappeit.dewa_app&amp;hl=de</a><br></p>","shortDescription":"DeliveryWare ist eine All-In-One Lösung für Deinen Online-Lieferdienst. Egal welche Form des Gastronomiebetriebs, DeliveryWare ist universell einsetzbar und per 1-Click zu installieren.","highlights":"<b>Wir richten Deinen Shop ein</b> - Zum Pauschalpreis von 499€ Netto inkl. Startseite und Speisekarte. Sprich uns an: <a href='mailto:info@app-flix.de?subject=Einrichtungsservice\"'>info@app-flix.de</a>\n<b>Multi-Store-Funktion</b> - Verwalte mehrere Standorte mit jeweils eigenem Auslieferungs-Radius, eigenen Öffnungszeiten und Angeboten\n<b>Wunschlieferzeit/Wunschabholzeit</b> - Ermögliche Deinen Kunden, selbst zu entscheiden, wann er/sie seine/ihre Bestellung erhält\n<b>Automatische Validierung nach Öffnungszeiten und Umkreis</b> - Deine Kunden können nur in Deinem gewählten Umkreis und Uhrzeit bestellen\n<b>POS Terminal</b> - Verwalte deine Filiale und Bestellungen einfach mit unserem hauseigenen POS Terminal - https://play.google.com/store/apps/details?id=de.tappeit.dewa_app&hl=de","features":"<b>Erlebniswelt \"Speisekarte\"</b> - Einfach über die Shopware Erlebniswelten zuweisen und schon können Deine Kunden ihre Lieblingsspeisen bestellen.\n<b>Shop-Auswahl im Checkout</b> - Vor Abschluss der Bestellung können sich Deine Kunden den Shop ihrer Wahl aussuchen\n<b>Verschiedene Produkte pro Shop</b> -  Du kannst deine Speisekarten für alle Shops gleich aufsetzen, oder auch gewisse Produkte ausschließen\n<b>Lagerbestand in freien Intervallen auffüllbar</b> - Falls gewisse Lebensmittel täglich nur in begrenzter Menge verfügbar sind, kannst Du individuelle Auffüllintervalle einstellen\n<b>Konfigurieren von \"Bagdes\"</b> - Hebe Produkte mittels Icons hervor (Peperoni/Scharf, Blatt/Vegan ...). Filterungen in der Speisekarte und das Hochladen eigener Icon-Sets sind ebenfalls möglich.\n<b>Konfigurieren von Inhaltsstoffen</b> - Informationen zu bspw. Allergenen sind pro Produkt und pro Zusatzoption einstellbar\n<b>Konforme Preis-pro-Brechnung</b> - Zeige deinen Kunden bei der Konfiguration der Gerichte immer einen Referenzpreis an - z.B. Brot: 750g, 6,67€ pro 1Kg\n<b>Globale Suchfunktion</b> - Eine Grunderneuerung der Suche für Shopware 6 lässt Deine Kunden global nach allen Speisen und Produkten suchen\n<b>Login/Registrierung</b> - Gastbestellungen sind selbstverständlich möglich. Der Login-Flow wurde optimiert und auf die wesentlichen Infos eingeschränkt. Perfekte Usability!\n<b>Zubereitungszeit/Lieferzeit</b> - Lege Dein Zeitmanagement fest. Je nach Einstellung erhalten Deine Kunden im Checkout die voraussichtlichen Ankunftszeiten im Checkout präsentiert\n<b>Karte und Countdown bei der Bestellung</b> - Zeige deinen Kunden wie lange die Zubereitung dauert, den Status der Bestellung und den Stand der Lieferung in einer Karte an\n<b>Echtzeit Verwaltungsdashboard für Bestellungen</b> - DeliveryWare bietet Dir ein für deinen Lieferdienst optimiertes Verwaltungsdashboard - in Echtzeit!\n<b>Installation von Democontent</b> - Wir bieten Dir eine breit gefächerte Auswahl an Demopaketen, die du mittels 1-Click Installation direkt in Deinen Shop laden kannst\n<b>Behalte deine Umsätze im Blick!</b> - Mit unserem POS Terminal kannst du Tages- oder Zeitraumbasierte Umsätze für deinen Steuerberater ausdrucken\n<b>Restaurant - Suchportal</b> - Unsere Suchmaschine listet Deinen Shop und Du wirst lokal gefunden! Du kannst diesen Service optional und 100% kostenlos nutzen."},{"id":23493,"name":"DeliveryWare | All-in-One Software for Delivery Services","description":"<p><b>&gt;&gt;&gt; Note:</b> DeliveryWare requires the free moori - Foundation extension for operation:<br><a href=\"https://store.shopware.com/moorl50852475974f/foundation-basis-version.html\" target=\"_blank\" rel=\"noreferrer\">https://store.shopware.com/moorl50852475974f/foundation-basis-version.html</a><br></p><p><br></p><p></p><h4>Note for dishes with variants/scales:</h4><p>The price calculation in DeliveryWare follows fixed rules. This is based on a base price and factors that are multiplied by the base price. For example, if you have two pizzas that have the same base price but different prices for larger copies, DeliveryWare is not for you. Prices can be rounded from 1 euro cent to 1 euro.</p><h4>Note on taxation:</h4><p>Unless otherwise stated, we will set up your store with the 19% rule. If you wish, the food will be set up with the 7% rule and the drinks with the 19% rule. Delivery charges are taxed at 7% if the main service (food) exceeds the ancillary service (delivery + beverages).</p><h4>Note on deposits:</h4><p>Optionally, you can show deposit amounts, but in this case they are not taken into account on the rounding of prices. A drink with a price of 2,00 € and 0,25 € deposit costs 2,25 €.</p><h4>Optionally you need the receipt printer</h4><p>https://star-emea.com/products/mc-print2/</p><h3>Individual adjustments?</h3><p>If general customizations to DeliveryWare have a general added value, customizations can be offered on request at a discounted hourly rate. Excluded from this: Customizations to the theme.</p><p><br></p><p>DeliveryWare is an all-in-one solution for your online delivery service. No matter what form of catering business, DeliveryWare offers you with little setup effort to start directly into the delivery service! Extensive functions support you for the optimal workflow in the processing of your orders.</p><p>Open the official <a href=\"https://deliveryware.de/\" rel=\"noopener\">Product-Description of DeliveryWare</a>, to find out more details.</p><h2>API features at a glance</h2><p><b>Receipt printer API</b><br>\nYou surely want to print your orders on the spot in your store. For this purpose, we have created a receipt printer interface that automatically prints your orders as desired.\n</p><p>\n➤ Easy configuration of the printer in the network<br>\n➤ Further receipt printers can be integrated without any problems<br>\n➤ This service is 100% free of charge for DeliveryWare customers</p><br><p><b>Restaurant - search portal (to follow)</b><br>\nThe search portal is an independent search engine for all stores that use DeliveryWare. As a store owner, you benefit from more reach, as the portal lists all stores that match the customer's search radius.\n</p><p>\nInclusion in the restaurant search portal is optional. So you don't have to list your store if you don't want to. But who has anything against more reach?\n</p><p>\n➤ The information for the dealer portal is automatically detected<br>\n➤ You benefit passively from our marketing campaigns<br>\n➤ The dealer portal is permanently improved and you benefit from<br>\n➤ You have no effort and benefit fully automatically<br>\n➤ 100% free of charge for DeliveryWare customers\n</p><br><h2>Interesting for freelancers and agencies</h2><p><b>For the \"restaurant around the corner</b><br>\nCreate a complete delivery service for your favorite restaurant. You will be happy!\n</p><p><b>Implementation of a supply chain planned?</b><br>\nWith DeliveryWare it is possible to manage multiple stores and locations. Talk to us and we will help you.\n</p><p><b>May it be a little more?</b><br>\nDeliveryWare is based on Shopware 6 and is therefore, as you surely know, limitlessly extensible.\n</p><p><b>Talk to us straight</b><br>\nWe are happy about cooperations! Use DeliveryWare and we will return the favor.\n</p><p><b>Commission and remuneration models</b><br>\nYou want to implement several stores with DeliveryWare? Then you will of course benefit as well.\n</p><p><b>Work effectively with us</b><br>\nWe would like to integrate DeliveryWare into the restaurant business and look forward to many collaborations at many locations.\n</p>","installationManual":"<p>Once you have obtained the theme from the Shopware Store, you can install and activate it in your Shopware Store. Assign the theme to your sales channel and install a demo package if necessary.</p><p>For more information, just take a look at our <a href=\"https://docs.deliveryware.de/\" target=\"_blank\" rel=\"noreferrer noopener\">Documentations</a></p>","shortDescription":"DeliveryWare is an all-in-one solution for your online delivery service. No matter what form of catering business, DeliveryWare is universal and 1-click to install.","highlights":"<b>Multi-Store-Functionality</b> - Manage multiple locations, each with its own delivery radius, opening hours and offerings\n<b>Desired delivery time / Desired collection time</b> - Allow your customers to decide when he/she will receive their order\n<b>Marketplace Module on Request</b> - You want to create your own DeliveryWare - Marketplace? Contact us: <a href='mailto:info@app-flix.de?subject=DeliveryWare%20Marketplace\"'>info@app-flix.de</a>\n<b>Automatic validation by opening hours and radius</b> - Your customers can order only in your selected area and time\n<b>Receipt printer connection</b> - Per integrated interface to the <b>mC-Print2</b> you can print all incoming orders without additional software","features":"<b>Shopping Experiences \"Menu\"</b> - Simply assign it via the Shopping Experiences and your customers can order their favorite dishes.\n<b>Shop selection in checkout</b> - Before completing the order, your customers can choose the store of their choice\n<b>Various products per shop</b> - You can set up your menus the same for all stores, or exclude certain products as well\n<b>Stock replenishable at free intervals</b> - If certain foods are only available in limited quantities on a daily basis, you can set individual replenishment intervals\n<b>Configure \"Bagdes\"</b> - Highlight products by means of icons (hot pepper/hot, leaf/vegan ...). Filtering in the menu and uploading your own icon sets are also possible.\n<b>Configuring ingredients</b> - information on e.g. allergens can be set per product and per additional option\n<b>Compliant price-per-bill</b> - Always show your customers a reference price when configuring dishes - e.g. bread: 750g, 6,67€ per 1Kg\n<b>Global search</b> - A major overhaul of search for Shopware 6 lets your customers search globally for all dishes and products\n<b>Login/Registration</b> - Guest orders are of course possible. The login flow has been optimized and limited to the essential info. Perfect usability!\n<b>Preparation time/Delivery time</b> - Set your time management. Depending on the setting, your customers will be presented with the estimated arrival times in the checkout.\n<b>Map and countdown when ordering</b> - Show your customers how long it will take to prepare, the status of the order and the status of the delivery in a map\n<b>Real-time order management dashboard</b> - DeliveryWare provides you with a management dashboard optimized for your delivery service - in real time!\n<b>Installation of demo content</b> - We offer you a wide range of demo packages, which you can load directly into your store via 1-click installation.\n<b>Restaurant - Search Portal</b> - Our search engine lists your store and you will be found locally! You can use this service optionally and 100% free of charge."}],"addons":["emotionPreset"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167388,"bookingKey":"Appfl57695012045","bookingText":"DeliveryWare | All-in-One Software for Delivery Services","price":349,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":167387,"bookingKey":"Appfl57695012045_M","bookingText":"DeliveryWare | All-in-One Software for Delivery Services","price":50,"duration":1,"trialPhaseIncluded":false,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpU6JDzT","preview":true,"priority":0,"id":66505},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpftvcSs","preview":false,"priority":90000,"id":103473},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpI6sQFb","preview":false,"priority":950,"id":66513},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEeYUts","preview":false,"priority":900,"id":66515},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQExTfO","preview":false,"priority":870,"id":66511},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfwhkv8","preview":false,"priority":850,"id":66512},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbdkJ3r","preview":false,"priority":815,"id":67686},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpW7teO8","preview":false,"priority":800,"id":66518},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfxCGHP","preview":false,"priority":200,"id":66514},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvp1roT","preview":false,"priority":110,"id":103515},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1xL6dK","preview":false,"priority":109,"id":103516},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1WvwDB","preview":false,"priority":106,"id":103514},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2R1MNF","preview":false,"priority":104,"id":103511},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9RsHUC","preview":false,"priority":103,"id":103519},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkrMFEH","preview":false,"priority":101,"id":103513},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnDXyx5","preview":false,"priority":100,"id":103512},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdoVXar","preview":false,"priority":100,"id":103517},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBJR8lM","preview":false,"priority":0,"id":103518},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvi11pK","preview":false,"priority":0,"id":107784},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6ZkoWD","preview":false,"priority":0,"id":107785},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLvuJRu","preview":false,"priority":0,"id":107786}],"comments":[{"authorName":"Patrick Wagner","text":"Eine ganz tolle Erweiterung für Lieferservices aller Art! Eine solche Erweiterung hat bisher noch auf dem Markt gefehlt und kann uneingeschränkt empfohlen werden. Viel Einstellmöglichkeiten und ein toller Funktionsumfang! Aktuell noch ein paar ganz kleine Fehler, die noch in den Kinderschuhen stecken... eine Bedienung und Verwendung ist dadurch aber nicht eingeschränkt. \n\nVielen Dank an den Hersteller!","headline":"Klasse Erweiterung!","creationDate":{"date":"2023-01-17 08:53:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9}],"ratingAverage":9,"label":"DeliveryWare | All-In-One Software für Lieferdienste","description":"<p><b>&gt;&gt;&gt; Hinweis:</b> DeliveryWare benötigt für den Betrieb die kostenlose moori - Foundation Erweiterung:<br /><a href=\"https://store.shopware.com/moorl50852475974f/foundation-basis-version.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://store.shopware.com/moorl50852475974f/foundation-basis-version.html</a><br /></p><p><br /></p><p></p><h4>Hinweis für Speisen mit Varianten/Staffelungen</h4><p>Die Preisberechnung in DeliveryWare folgt festen Regeln. Diese richtet sich nach einem Grundpreis und Faktoren, die mit dem Grundpreis multipliziert werden. Wenn Du z.B. zwei Pizzen hast, die denselben Grundpreis, aber unterschiedliche Preise für größere Exemplare haben, ist DeliveryWare nicht für Dich geeignet. Die Preise können von 1 Euro-Cent bis auf 1 Euro gerundet werden.</p><h4>Hinweis zur Besteuerung</h4><p>Falls nicht anders angegeben, richten wir Deinen Shop mit der 19 % Regel ein. Auf Wunsch werden die Speisen nach der 7 % Regel und die Getränke nach der 19 % Regel eingerichtet. Lieferkosten werden mit 7 % besteuert, sofern die Hauptleistung (Speisen) die Nebenleistung (Lieferung + Getränke) übersteigt.</p><h4>Hinweis zu Pfand</h4><p>Optional kann man Pfandbeträge ausweisen, werden in diesem Falle aber nicht auf die Rundung der Preise berücksichtigt. Ein Getränk mit einem Preis von 2,00 € und 0,25 € Pfand kostet 2,25 €.</p><h3>Individuelle Anpassungen?</h3><p>Sofern generelle Anpassungen an DeliveryWare einen allgemeinen Mehrwert haben, können auf Wunsch Anpassungen zu einem vergünstigten Stundensatz angeboten werden. Davon ausgeschlossen: Anpassungen am Theme.</p><p><br /></p><p>DeliveryWare ist eine All-In-One Lösung für Deinen Online-Lieferdienst. Egal welche Form des Gastronomiebetriebs, DeliveryWare bietet Dir mit nur wenig Einrichtungsaufwand, direkt in den Lieferdienst zu starten! Umfangreiche Funktionen unterstützen Dich für den optimalen Workflow bei der Abwicklung Deiner Bestellungen.</p><p>Öffne die offizielle <a href=\"https://deliveryware.de/\">Produktbeschreibung von DeliveryWare</a>, um mehr Details zu erfahren.</p><h2>Schnittstellenfeatures im Überblick</h2><p><b>POS Terminal für die Verwaltung deiner Bestellungen</b><br />\nDu möchtest deine Bestellungen sicherlich auch vor Ort in deinem Geschäft verwalten und ausdrucken. Dafür haben wir eine Lösung.\n</p><p>➤ Kabelloses POS Terminal mit integriertem Bondrucker</p><p>➤ Lieferung und Selbstabholung problemlos einstellbar</p><p>➤ Gerät inkl. Einrichtung und Versand für einmalig 299,00€ zzgl. MwSt.</p><br /><p><b>Restaurant - Suchportal</b><br />\nDas Suchportal ist eine eigenständige Suchmaschine für alle Shops, die DeliveryWare nutzen. Als Shopbetreiber profitierst Du durch mehr Reichweite, da das Portal alle Shops listet, die mit dem Suchradius des Kunden übereinstimmen.</p><p>\nDie Aufnahme in das Restaurant - Suchportal ist optional. Du musst Deinen Shop also nicht listen lassen, wenn du nicht möchtest. Aber wer hat schon etwas gegen mehr Reichweite?\n</p><p>\n➤ Die Informationen für das Händlerportal werden automatisch erkannt<br />\n➤ Du profitierst passiv von unseren Marketingkampagnen<br />\n➤ Das Händlerportal wird permanent verbessert und Du profitierst<br />\n➤ Du hast keinen Aufwand und profitierst vollautomatisch<br />\n➤ 100% kostenlos für Kunden von DeliveryWare\n</p><br /><h2>Interessant für Freelancer und Agenturen</h2><p><b>Für das \"Restaurant um die Ecke\"</b><br />\nErstelle einen kompletten Lieferservice für Dein Lieblingsrestaurant. Sie freuen sich!\n</p><p><b>Umsetzung einer Lieferkette geplant?</b><br />\nMit DeliveryWare ist es möglich, mehrere Shops und Standorte zu verwalten. Sprich mit uns und wir helfen Dir.\n</p><p><b>Darf es etwas mehr sein?</b><br />\nDeliveryWare basiert auf Shopware 6 und ist somit, wie du sicherlich weißt, grenzenlos erweiterbar.\n</p><p><b>Sprich mit uns ganz offen</b><br />\nWir freuen uns über Kooperationen! Nutze DeliveryWare und wir revanchieren uns.\n</p><p><b>Provisions- und Vergütungsmodelle</b><br />\nDu möchtest gleich mehrere Shops mit DeliveryWare umsetzen? Dann profitierst du selbstverständlich mit.\n</p><p><b>Arbeite effektiv mit uns zusammen</b><br />\nWir möchten DeliveryWare in den Gastronomiebetrieb integrieren und freuen uns über viele Kooperationen an vielen Standorten.\n</p>","installationManual":"<p>Sobald Du das Theme aus dem Shopware Store bezogen hast, kannst Du es in Deinem Shopware Store installieren und aktivieren. Weise das Theme noch deinem Verkaufskanal zu und installiere ggf. noch ein Demopaket.</p><p>Für weitere Informationen, schaue einfach in unsere <a href=\"https://docs.deliveryware.de/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentationen</a></p><p><b>Demopakete sind hier verfügbar:</b></p><p><a href=\"https://www.deliveryware.de/index.html#services\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.deliveryware.de/index.html#services</a><br /></p><p><b>Android POS App im PlayStore:</b></p><p><a href=\"https://play.google.com/store/apps/details?id=de.tappeit.dewa_app&amp;hl=de\" target=\"_blank\" rel=\"noreferrer noopener\">https://play.google.com/store/apps/details?id=de.tappeit.dewa_app&amp;hl=de</a><br /></p>","version":"1.5.0","changelog":[{"version":"1.5.0","text":"<p>In this update we did some breaking changes for DeliveryWare. </p><p>Please take time to reconfigure your shop.</p><p><b>General changes</b></p><p></p><ul><li>Ingredients are removed, additives and allergens are managed by product properties</li><li>Options with price calculation are removed since some prices are not following a factor-logic, please use the product variants for pricing options</li></ul><p><b>Admin changes</b></p><p></p><ul><li>There is a new demo package for additives and allergens, feel free to use them</li></ul><p><b>Storefront changes</b></p><p></p><ul><li>The menu is more compact, the buy-button was removed there</li><li>At the end of the menu, you can see a summary for additives and allergens, every product and option has a sup-line with the shortcodes</li><li>The icons where replaced by SVG</li></ul><p><b>Other changes</b></p><p></p><ul><li>We offer a complete Lieferando/Takeaway migration. Feel free to get in touch with us</li></ul>","creationDate":{"date":"2023-03-17 09:23:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.43","text":"<p><b>Improvements POS Android App</b></p><p></p><ul><li>Login via QR Code possible</li><li>Fixed connection loss error</li><li>Added character encodings for multiple printer models</li><li>The app supports all 58mm Bluetooth Thermal printers</li></ul><p><br /></p><p><b>Improvement Shopware extension</b></p><p></p><ul><li>Download QR Code as PDF</li><li>Adjustments for Shopware 6.4.19</li></ul>","creationDate":{"date":"2023-02-17 21:37:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.37","text":"<p></p><ul><li>Database schema cleaned</li><li>Digital Signage Update (For restaurants with screen menus)</li></ul>","creationDate":{"date":"2023-02-07 08:31:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.28","text":"<p></p><ul><li>Shipping costs and minimum order value according to distance or postcode area</li></ul>","creationDate":{"date":"2023-01-27 20:53:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.26","text":"<p></p><ul><li>Additional information for drinks (price per L, caffeine content, deposit etc)</li></ul>","creationDate":{"date":"2023-01-20 12:02:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.25","text":"<p></p><ul><li>Block orders if no phone number is specified</li></ul>","creationDate":{"date":"2023-01-03 23:18:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.22","text":"<p></p><ul><li>Simplified POS open/close shop</li><li>Auto open shop if admin dashboard or POS device is connected</li><li>Auto close shop if admin not dashboard or POS device is disconnected</li><li>Opening hours will be ignored for cart validation</li></ul>","creationDate":{"date":"2022-10-09 08:25:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.21","text":"<p></p><ul><li>Final adjustments for DeliveryWare search portal</li></ul>","creationDate":{"date":"2022-10-06 17:09:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.19","text":"<p></p><ul><li>Fixed cache bug for multi stores</li><li>Ping and poll to DeliveryWare search portal enabled</li></ul>","creationDate":{"date":"2022-10-02 21:02:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.16","text":"<p></p><ul><li>Fixed error in dashboard</li><li>Added simple bundles</li></ul>","creationDate":{"date":"2022-09-28 03:17:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.14","text":"<p></p><ul><li>Bugfix in order dashboard</li><li>Play sound on placed order</li><li>Use Browser notification</li><li>Clean up code</li></ul>","creationDate":{"date":"2022-09-25 09:10:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.8","text":"<p></p><ul><li>Logs for receipt printer interface</li><li>Daily and monthly summary of turnover</li><li>Tax consultant export to receipt printer</li><li>Small optical adjustments</li></ul>","creationDate":{"date":"2022-09-03 18:33:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p></p><ul><li>Display error in the dashboard fixed</li><li>New setting option: Hide orders with the following payment methods in the dashboard if not paid</li></ul>","creationDate":{"date":"2022-08-31 18:33:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p></p><ul><li>The special delivery methods can now be used optionally for all products</li><li>Optional field for telephone number in the checkout</li></ul>","creationDate":{"date":"2022-07-26 22:06:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>Due to the double maintenance effort for two identical plugins, the Appflix Foundation is now replaced by the moori Foundation. This will allow us to react more flexibly to new Shopware updates. In addition, the functions of both plugins will no longer appear twice in the admin.</p><p>Due to the changeover, there may be display errors in the worlds of experience. The CMS elements \"Brand Slider\" and \"CTA Banner\" have been removed. These elements can be obtained free of charge from the moori Shopare shop between 01.06. and 01.07.2022. Outside this period, the \"CTA Banner\" element is subject to a charge.<br /></p>","creationDate":{"date":"2022-05-07 04:24:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.10","text":"<p></p><ul><li>Bugfix for opening hours</li></ul>","creationDate":{"date":"2022-02-26 17:06:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.9","text":"<p>Bug fixes for Shopware 6.4.8.1</p><p></p><ul><li>Store selections are saved as cookies, saving in session triggers cache error.</li><li>Orders ordered with a direct payment method but not paid are not displayed in the dashboard.</li></ul>","creationDate":{"date":"2022-02-22 19:22:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.8","text":"<p></p><ul><li>Bugfix for character length for receipt printout</li></ul>","creationDate":{"date":"2022-01-05 08:38:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.7","text":"<p></p><ul><li>Customizations for Shopware 6.4.7</li></ul>","creationDate":{"date":"2022-01-05 04:17:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"<p></p><ul><li>Display and calculation of deposit amounts in the configurator</li></ul>","creationDate":{"date":"2021-12-05 05:19:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"<p></p><ul><li>Update for Shopware 6.4.6.x</li><li>Product changes the type of dishes as soon as a menu subcategory is assigned</li><li>Dishes can be deleted again in the admin</li></ul>","creationDate":{"date":"2021-12-02 02:05:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"<p></p><ul><li>Compatibility with the new CMS elements from the Foundation Plugin</li></ul>","creationDate":{"date":"2021-10-21 06:33:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<p></p><ul><li>Receipt printer optimisations / event for custom printout</li><li>Automatic position determination of the shop based on the address (optional) &gt; To readjust the coordinates</li><li>Shopping cart fold-out can be de-/activated in the plug-in settings</li></ul>","creationDate":{"date":"2021-09-27 22:51:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<p></p><ul><li>Correct order and requested delivery times on the receipt printout</li><li>Comment on the order on the receipt printout</li></ul>","creationDate":{"date":"2021-09-25 03:36:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p><b>ATTENTION ATTENTION ATTENTION ATTENTION ATTENTION</b></p><p>This plugin requires the new Appflix Foundation Plugin. Please install and activate the Foundation Plugin first!</p><p><br /></p><p><b>Adjustments Storefront</b></p><p></p><ul><li>Sticky shopping cart for better mobile navigation</li><li>Search field gets autofocus</li><li>When a dish is added to the shopping cart, the modal window closes</li><li>Header with white background possible</li><li>Revision of login / registration</li><li>Drop prices for dishes possible</li><li>Empty menu categories are hidden</li><li>Orders for dishes cannot be repeated</li><li>Improved branch selection for mobile</li><li>Breadcrumb display error on category page fixed</li><li>CMS element: table reservation including e-mail template</li><li>Badge filter optimised</li><li>Categories for dishes are sortable</li><li>When customer logs in, he stays on the same page</li><li>Adaptation/optimisation of colours</li><li>New options for sections: Background colours / Transition graphics / Offset</li><li>New CMS blocks: Grid layouts / Column layouts / Slider</li><li>New options for CMS blocks: Show or hide by viewport</li><li>New CMS Elements: CTA Banner / Accordion / Table Reservation</li><li>New options for CMS elements: Integration of Animate.css - freely configurable</li><li>Mobile navigation for menus adapted</li></ul><p><br /></p><p><b>Adjustments Checkout</b></p><p></p><ul><li>No mixed shopping baskets possible</li><li>Delivery and self-collection only for meals</li><li>Next opening time is displayed for each branch</li><li>Error messages contain more information</li><li>Error message if minimum order value not reached</li><li>Desired delivery times can be configured in great detail in the plugin settings</li></ul><p><br /></p><p><b>Adjustments Core</b></p><p></p><ul><li>Extension of demo data</li><li>Wording stores changed to branches</li><li>Meals can now be discounted via vouchers</li><li>Minimum order value per shop and postcode delivery area possible</li><li>Shop owners receive email with order confirmation</li><li>Shops now have postcode delivery areas</li><li>Time zones configurable per shop</li><li>Performance optimisations</li><li>Shops can contain exclusive products (only visible when shop is selected)</li><li>Branches can be linked to sales channels</li></ul><p><br /></p><p><b>Admin adjustments</b></p><p></p><ul><li>Products can be hidden by day of the week</li><li>Products can receive a percentage discount according to the day of the week</li><li>Simplified navigation</li><li>DeliveryWare configurations have been moved to shop settings</li><li>Demo assistant moved to AppflixFoundation plugin</li><li>Ordering can be done directly from the DeliveryWare Dashboard</li><li>Improved shop overview</li><li>Access control and predefined user roles (installable via demo package)</li></ul>","creationDate":{"date":"2021-09-23 19:39:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.14","text":"<p></p><ul><li>Configuratior direct assignment to the product</li><li>Improvement of demo data import</li><li>Adjustments for Migration Add-On (https://docs.deliveryware.de/migration)</li></ul>","creationDate":{"date":"2021-06-05 21:05:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.11","text":"<p></p><ul><li>Validation checkout if no store configured/available</li></ul>","creationDate":{"date":"2021-05-31 16:14:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.10","text":"<p></p><ul><li>Some final adjustments</li></ul>","creationDate":{"date":"2021-05-28 21:36:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<p></p><ul><li>Further adjustments regarding namespace changes</li></ul>","creationDate":{"date":"2021-05-28 09:17:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<p>- Publication for exam preparation</p>","creationDate":{"date":"2021-05-27 16:21:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Appfl57695012045","redirectToStore":false,"lowestPriceValue":50}