{"id":13556,"name":"TmmsProductCustomerInputs","code":"Tmms299227094335","lastChange":{"date":"2023-07-19 09:57:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphEJJFt","examplePageUrl":"","moduleKey":"TmmsProductCustomerInputs","creationDate":{"date":"2021-06-10 15:39:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-06-24 14:12:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-06-10 15:46:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3293,"prefix":"Tmms","name":"Deutsche Telekom MMS GmbH","website":"//www.telekom-mms.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3293_telekom_logo.png"},"infos":[{"id":23589,"name":"Kundeneingaben oder zusätzliche Felder bei Produkten oder Bestellpositionen","description":"<h2>Support</h2><p>Treten Sie bei Fragen, wenn diese nicht bereits im Bereich \"<b>Häufig gestellte Fragen</b>\" beantwortet wurden, einfach über die E-Mail <b>shopware-apps-support@t-systems-mms.com</b> mit uns in Kontakt und wir helfen Ihnen gerne weiter. </p><h2>Beschreibung der App</h2><p>\nDie App&nbsp;\"Kundeneingaben oder zusätzliche Felder bei Produkten oder Bestellpositionen\"&nbsp;ermöglicht unter anderem <b>bis zu&nbsp;5&nbsp;verschiedene Kundeneingaben bei Produkten oder Bestellpositionen</b>. Die Kundeneingabe kann dabei in der <b>QuickView von Shopware</b>, auf der <b>Produkt-Detailseite</b> (auch beim Zuweisen eines Produktseiten-Layouts), im <b>OffCanvas-Warenkorb</b>, im <b>Warenkorb</b> oder auf der <b>Bestellabschlussseite</b> erfolgen.</p><p>Da diese App und die App \"Custom Products\" ( https://docs.shopware.com/de/shopware-6-de/erweiterungen/customproducts ) für den gleichen Zweck gedacht sind, ist eine Kompatibilität zwischen den beiden Apps nicht vorgesehen, da die App \"Custom Products\" im Gegensatz zu dieser App jedes Mal eine neue Bestellposition erzeugt und die App \"Kundeneingaben oder zusätzliche Felder bei Produkten\" keine eigenständige Bestellposition erzeugt, sondern die Zusatzfelder der bestehenden Bestellposition nutzt. Aus diesem Grund eignet sie sich auch am besten für die freiwillige Eingabe von Informationen direkt an einer Bestellposition.\n\n</p><p>\nBei jedem Produkt kann man <b>je Zusatzfeld - Set bei den Zusatzfeldern</b> folgendes festlegen:\n</p><ul><li>ob eine Produkteingabe möglich sein soll</li><li>den Feldtyp der Produkteingabe - ein <b>ein- oder mehrzeiliges Eingabefeld</b>, ein <b>Nummernfeld</b>, ein <b>Checkboxfeld</b>, ein <b>Datums- und Uhrzeitfeld</b>, ein <b>Datumsfeld</b>, ein <b>Uhrzeitfeld</b> oder ein <b>Auswahlfeld</b></li><li>die Beschriftung vor der Produkteingabe</li><li>den Platzhalter für die Produkteingabe</li><li>ob es sich um ein Pflichtfeld handelt.</li></ul><p>\nFür das <b>Datums- und/oder Uhrzeitfeld kann</b> zusätzlich noch ein <b>Startdatum</b>, ein <b>Enddatum</b>, <b>auszuschließende Daten</b> oder eine <b>Start- und Endzeit gesetzt werden</b>. Die Werte für das Auswahlfeld werden kommasepariert im entsprechenden Feld hinterlegt. Beim Feldtyp <b>Nummernfeld</b> kann zusätzlich noch ein <b>Mindestwert</b>, ein <b>Maximalwert</b> und die <b>Schrittweite festgelegt werden</b> (insofern eine Schrittweite festgelegt wurde, muss auch ein positiver Wert in den Feldern \"Mindestwert im Feld\" und \"Maximale Anzahl an Zeichen oder Maximalwert im Feld\" hinterlegt werden), bei den Feldtypen&nbsp;<b>einzeiliges Eingabefeld</b> und <b>mehrzeiliges Eingabefeld</b> die <b>maximale Anzahl an Zeichen</b>.\n\n</p><p>\nDarüber hinaus kann innerhalb der <b>Konfiguration</b> folgendes ausgewählt werden:\n</p><ul><li>die Festlegung, ob eine Details-Schaltfläche in den Kategorielisten anzeigt werden soll, wenn eine Produkteingabe bei einem Produkt aktiviert wurde (sodass man zuerst die Produkteingaben sieht, bevor man das Produkt in den Warenkorb legen kann)</li><li>die Festlegung, ob unter den Produkteingaben eine Hinweismeldung angezeigt werden soll, beispielsweise mit der Beschreibung des Verhaltens beim erneuten Legen des Produkts in den Warenkorb (in dem Fall, das man die Produkteingabe direkt auf der Produkt-Detailseite oder in der Quickview von Shopware erlaubt)</li><li>die Festlegung, ob die Produkteingabe in der <a href=\"https://store.shopware.com/swag342274855948t/cms-extensions.html\">Quickview von Shopware</a> angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe auf der Produkt - Detailseite angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe im OffCanvas-Warenkorb angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe im Warenkorb angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe auf der Bestellabschlussseite angezeigt werden soll</li><li>die Festlegung, ob eine leere Produkteingabe im Checkout angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe im Checkout änderbar sein soll</li><li>die Festlegung, ob nicht ausgewählte Checkboxfelder als Wert übertragen werden sollen</li><li>die Festlegung, ob ein Trennstrich zwischen Produkt und Produkteingabe im Checkout angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe in einem aufklappbaren Bereich im großen Warenkorb und auf der Bestellabschlussseite angezeigt werden soll</li></ul><p>\nFür das Datums- und Uhrzeitfeld kann innerhalb der <b>Konfiguration</b> folgendes ausgewählt werden:\n</p><ul><li>die Festlegung, ob ein sprachabhängiger Kalender anhand der Lokalisierung verwendet werden soll</li><li>die Festlegung des Datumsformats</li><li>die Festlegung des Datums- und Uhrzeitformats</li><li>die Festlegung, ob manuelle Eingaben erlaubt sind</li><li>die Festlegung, ob die Kalenderwochen angezeigt werden sollen</li><li>die Festlegung, ob das Startdatum oder -Uhrzeit als Standardwert gesetzt werden soll</li></ul><p>\n\nDes weiteren kann innerhalb der <b>Konfiguration</b> für die <b>Pflichtfelder</b> folgendes ausgewählt werden:\n\n</p><ul><li>die Festlegung, ob Pflichtfelder im Warenkorb änderbar sind (das Abfangen des Absendens des Formulars ist aber nicht möglich)</li><li>die Festlegung, ob Pflichtfelder auf der Bestellabschlussseite änderbar sind</li><li>die Festlegung, ob leere Pflichtfelder im Checkout gespeichert werden sollen</li><li>die Festlegung, ob die Pflichtfeldmarkierung farblich hervorgehoben werden soll</li></ul><p><b>Sobald der Kunde eine Eingabe in das Feld vornimmt und das Produkt später auch in den Warenkorb legt, wird die Änderung gespeichert</b>. Die Eingabe wird dabei in der Session gespeichert, sodass die Eingabe für den Kunden solange verfügbar ist, bis der Kunde den Einkauf abschließt oder den Browser-Cache leert. Somit kann der Kunde auch zu einem späteren Zeitpunkt den Kauf fortführen, ohne erneut alles eingeben zu müssen und kann auch eine Änderung des Wertes schnell und einfach durchführen.\n</p><p>\nDie Produkteingaben werden je Bestellposition sowohl auf der <b>Bestellbestätigungsseite</b> und im <b>Kunden-Account</b> im Frontend als auch bei den <b>Bestellpositionen in der Administration</b> und <b>auf den Dokumenten angezeigt</b>. Damit die Produkteingaben auch im E-Mail-Template&nbsp;\"Bestellbestätigung\"&nbsp;angezeigt werden, muss der Schritt aus dem Bereich <b>Ausgabe der Kundeneingaben oder zusätzlichen Felder im E-Mail-Template \"Bestellbestätigung\"</b> im Tab <b>Installationsanleitung</b> durchgeführt werden.&nbsp;\n</p><p>\nEs wird neben der Beschriftung die eigentliche Eingabe und bei einem Checkboxfeld zusätzlich noch der Platzhalter für jede Bestellposition mit übernommen. Bei einem Checkboxfeld wird der Text nach der Checkbox über den Platzhalter bestimmt.\n</p><p>\nDas <b>Abfangen des Absendens des Formulars</b>, <b>insofern</b> die <b>Kundeneingabe ein Pflichtfeld ist</b>, <b>ist nur auf der Produkt - Detailseite und auf der Bestellabschlussseite möglich</b>, da nur auf diesen Seiten ein entsprechendes Formular vorhanden ist und der Warenkorb beispielsweise durch den Kunden mit einem Kundenkonto übersprungen werden kann und die QuickView von Shopware bereits alle Produkte mit dessen Formularen vorlädt.\n\n</p><p><br><b>Die verfügbaren Textbausteine zum Individualisieren sind:</b></p><ul><li><b>tmms.customerInput.titleLabel:</b> der Standardwert der Beschriftung der Produkteingabe</li><li><b>tmms.customerInput.placeholderLabel:</b> der Standardwert des Platzhalters der Produkteingabe</li><li><b>tmms.customerInput.openingRoundBracket:</b> die öffnende Klammer für den Wert des Checkboxfeldes im Checkout</li><li><b>tmms.customerInput.closedRoundBracket:</b> die schließende Klammer für den Wert des Checkboxfeldes im Checkout</li><li><b>tmms.customerInput.selectedValue:</b> der Text, wenn das Checkboxfeld ausgewählt wurde</li><li><b>tmms.customerInput.unselectedValue:</b> der Text, wenn das Checkboxfeld nicht ausgewählt wurde</li><li><b>tmms.customerInput.requiredLabel:</b> der Fehlermeldungstext für das Pflichtfeld</li><li><b>tmms.customerInput.validityNumberStepsLabel:</b> der Fehlermeldungstext, wenn der Wert nicht zwischen dem Mindest- und Maximalwert liegt und die Schrittweite nicht einhält</li><li><b>tmms.customerInput.validityNumberLabel:</b> der Fehlermeldungstext, wenn der Wert nicht zwischen dem Mindest- und Maximalwert liegt</li><li><b>tmms.customerInput.dateTimeFormat:</b> das Datums- und Zeitformat, wenn der sprachabhängige Kalender verwendet wird</li><li><b>tmms.customerInput.dateFormat:</b> das Datumsformat, wenn der sprachabhängige Kalender verwendet wird</li><li><b>tmms.customerInput.informationMessage:</b> der Text der Hinweismeldung, beispielsweise die Beschreibung des Verhaltens beim erneuten Legen des Produkts in den Warenkorb</li><li><b>tmms.customerInput.accordionHeadingLabel:</b> der Text für den aufklappbaren Bereich</li></ul>","installationManual":"<ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Melden Sie sich in Ihren Shopware 6 Administrationsbereich an und navigieren Sie zu dem Menüpunkt Erweiterungen -&gt; Meine Erweiterungen</li><li>Klicken Sie rechts oben auf \"Erweiterung hochladen\" und wählen Sie die heruntergeladene Erweiterung aus</li><li>Verwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung zu installieren und den Schalter links, um sie zu aktivieren</li><li>Verwenden Sie das Kontextmenü&nbsp;rechts neben der Erweiterung um die Erweiterung nach den eigenen Wünschen zu konfigurieren</li><li>Wechseln Sie unter \"Kataloge\" -&gt; \"Produkte\", wählen Sie ein Produkt aus und wechseln Sie über das Tab \"Spezifikationen\" in den Bereich \"Zusatzfelder\", bei dem Sie bei \"Produkteingabe 1\" bis \"Produkteingabe 5\" die entsprechenden Felder festlegen können</li><li>Legen Sie bei Bedarf für Varianten des Produkts eine abweichende Konfiguration fest, indem Sie die Vererbung der Zusatzfelder im Tab \"Varianten\" nach der Auswahl einer Variante über das entsprechende Icon \"Vererbung entfernen\" aufheben, sodass man je Variante eigene Konfigurationen vornehmen kann</li></ol><br><h2>Ausgabe der Kundeneingaben oder zusätzlichen Felder im E-Mail-Template \"Bestellbestätigung\"</h2><p>\n\nDamit die Produkteingaben auch in der E-Mail der Bestellbestätigung ausgegeben werden, muss beim Feld \"<b>HTML</b>\" bei \"<b>Mail-Text</b>\" folgendes ergänzt werden, also&nbsp;beispielsweise vor&nbsp;<b>{% endblock %}</b> (siehe: <a href=\"https://github.com/shopware/platform/blob/trunk/src/Core/Migration/Fixtures/mails/order_confirmation_mail/de-html.html.twig#L89\">hier</a>) innerhalb des Bereichs&nbsp;<b>{% block lineItem %}</b>&nbsp;oder alternativ, wenn Sie diesen Bereich schon bei sich entfernt haben, innerhalb der for-Schleife für die Bestellpositionen (<b>lineItem</b>), speziell vor dem&nbsp;<b>{% endfor %}</b> (siehe: <a href=\"https://github.com/shopware/platform/blob/trunk/src/Core/Migration/Fixtures/mails/order_confirmation_mail/de-html.html.twig#L90\">hier</a>) vom Bereich<b>&nbsp;{% for lineItem in order.nestedLineItems %} </b>oder <b>{% for lineItem in order.lineItems %}</b>:<br>\n\n&lt;tr&gt;<br>\n\n&lt;td&gt;<br>\n\n{% for tmmsCustomerInputCount in 1..5 %}<br>\n\n{% set customFields = lineItem.customFields %}<br>\n\n{% set tmmsCustomerInputValue = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_value' %}<br>\n\n{% set tmmsCustomerInputFieldtype = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_fieldtype' %}<br>\n\n{% set tmmsCustomerInputLabel = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_label' %}<br>\n\n{% set tmmsCustomerInputPlaceholder = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_placeholder' %}<br><br>{% if customFields[tmmsCustomerInputValue] is defined %}<br>\n\n{{ customFields[tmmsCustomerInputLabel] }} {% if customFields[tmmsCustomerInputFieldtype] == \"boolean\" %}&lt;i&gt;\"{{ customFields[tmmsCustomerInputPlaceholder] }}\"&lt;/i&gt; ({{ customFields[tmmsCustomerInputValue] }}){% else %}&lt;i&gt;\"{{ customFields[tmmsCustomerInputValue] }}\"&lt;/i&gt;{% endif %}<br>\n\n&lt;br/&gt;<br>\n\n{% endif %}<br>\n\n{% endfor %}<br>\n\n&lt;/td&gt;<br>\n\n&lt;/tr&gt;\n\n</p>\n","shortDescription":"Die App ermöglicht bis zu 5 verschiedene Kundeneingaben bei Produkten, die in der QuickView, auf der Produktdetailseite, im Warenkorb oder auf der Bestellabschlussseite erfolgen können.","highlights":"\"App of the Week\" Kalenderwoche 30 / 2021 und \"App des Monats - November 2021\" \nbis zu 5 verschiedene Kundeneingaben für jedes Produkt (als ein- oder mehrzeiliges Eingabefeld, Nummernfeld, Checkboxfeld, Datums- und Uhrzeitfeld, Datumsfeld, Uhrzeitfeld oder Auswahlfeld), die man über die Zusatzfelder bei den Produkten konfiguriert\nbei denen die Kundeneingabe in der QuickView von Shopware, auf der Produkt-Detailseite, im OffCanvas-Warenkorb, im Warenkorb oder auf der Bestellabschlussseite erfolgen kann\nund die Kundeneingaben anschließend je Bestellposition sowohl auf der Bestellbestätigungsseite und im Kunden-Account im Frontend als auch bei den Bestellpositionen in der Administration und auf den Dokumenten angezeigt werden\ndie Speicherung der Kundeneingabe in der Session, sodass die Eingabe für den Kunden solange verfügbar ist, bis der Kunde den Einkauf abschließt oder den Browser-Cache leert","features":"Konfiguration über die Zusatzfelder bei den Produkten und somit ein einfacheres Konfigurieren der Felder über die API\nDie Kundeneingabe kann ein ein- oder mehrzeiliges Eingabefeld, Nummernfeld, Checkboxfeld, Datums- und Uhrzeitfeld, Datumsfeld, Uhrzeitfeld oder ein Auswahlfeld sein, wodurch eine Vielzahl an zusätzlichen Eingaben möglich sind, beispielsweise für einen Text für eine Gravur oder einen Gutschein in Form eines Eingabefeldes oder die Auswahl eines gewünschten Abholdatums oder Geburtsjahrs über ein Datumsfeld"},{"id":23590,"name":"Customer inputs or additional fields at products or order line items","description":"<h2>Support</h2><p>If you have any questions and if they have not already been answered in the area \"<b>Frequently Asked Questions</b>\", simply contact us via the email <b>shopware-apps-support@t-systems-mms.com</b> and we will be happy to help you.</p><h2>Description of the app</h2><p>\n\nThe app \"Customer inputs or additional fields at products or order line items\" allows <b>up to 5 different customer inputs at products or order line items</b>. The customer input can be done in the <b>QuickView from Shopware</b>, on the <b>product detail page</b> (also when assigning a product page layout), on the <b>offcanvas cart page</b>, in the <b>shopping cart</b> or on the <b>order confirm page</b>.</p><p>Because our app and the app \"Custom Products\" ( https://docs.shopware.com/en/shopware-6-en/extensions/customproducts ) are intended for the same purpose, compatibility between the two apps is not intended because the app \"Custom Products\", in contrast to our app, creates a new order line item every time. The app \"Customer inputs or additional fields at products\" does not generate an independent order line item, she uses the custom fields of the existing order line item.&nbsp;For this reason, she is best suited for the voluntary input of information directly at an order line item.\n\n</p><p>\n\nFor each product you can set the following things <b>in the custom fields area for each custom field set</b>:\n\n</p><ul><li>the definition, whether a product input should be possible</li><li>the selection of the field type of the product input (a <b>single or multi-line input field</b>, a <b>number field</b>, a <b>checkbox field</b>, a <b>date time field</b>, a <b>date field</b>, a <b>time field</b> or a <b>selection field</b>)</li><li>the definition of the label before the product input</li><li>the definition of the placeholder for the product input</li><li>the definition, whether the field is a required field.</li></ul><p>\n\nA <b>start date</b>, an <b>end date</b>, <b>dates to be excluded</b> or a <b>start and end time can</b> also <b>be set for the date and / or time field</b>. The values for the selection field are separated by commas and set in the corresponding field. At the field type <b>number field</b> a <b>minimum value</b>, a <b>maximum value</b> and the <b>steps can also be specified</b> (if steps have been specified, a positive value must also be entered in the fields \"minimum value in field\" and \"maximum number of characters or maximum value in field\"), at the field types <b>single-line input field</b> and <b>multi-line input field</b> the <b>maximum number of characters</b>.\n\n</p><p>\n\nIn addition, the following can be selected within the <b>configuration</b>:\n\n</p><ul><li>the selection if a details button should be displayed in the navigation when a product input has been activated for a product (so that you first see the product inputs before you can add the product to the shopping cart)</li><li>the selection if a message should be displayed under the product inputs, for example with a description of the behavior when the product is added to the shopping cart again (in the case that the product input is allowed directly on the product detail page or in the Quickview of Shopware)</li><li>the selection if the product input fields should be shown in the <a href=\"https://store.shopware.com/en/swag342274855948t/cms-extensions.html\">quickview from shopware</a></li><li>the selection if the product input fields should be shown on product detail page</li><li>the selection if the product input fields should be shown on the offcanvas cart page</li><li>the selection if the product input fields should be shown on cart page</li><li>the selection if the product input fields should be shown on confirm page</li><li>the selection if empty product input fields should be shown in checkout</li><li>the selection if the product input can be changed in the checkout</li><li>the selection if the unselected checkbox fields should be transferred as a value</li><li>the selection if a dividing line should be shown between the product and the product input in the checkout</li><li>the selection if the product input should be shown in a foldable area in the large shopping cart and on the confirm page</li></ul><p>\n\n\nThe following can be selected for the date and time field within the <b>configuration</b>:\n\n</p><ul><li>the selection if a language-dependent calendar should be used based on the localization</li><li>the selection of the date format</li><li>the selection of the date and time format</li><li>the selection if a manual input in the input field is allowed</li><li>the selection if weeks numbers should be shown</li><li>the selection if the start date or time should be set as the default value</li></ul><p>\nFurthermore, the following can be selected within the <b>configuration</b> for the <b>required fields</b>:\n</p><ul><li>the selection if required fields can be changed in the shopping cart (however, it is not possible to intercept the sending of the form)</li><li>the selection if required fields can be changed on the confirm page</li><li>the selection if empty required fields are saved in the checkout</li><li>the selection if the required fields should be highlighted in color</li></ul><p><b>As soon as the customer makes an input in the field, the change is saved</b>. The input is saved in the session so that the input is available to the customer until the customer completes the purchase or clears the browser cache. Thus, the customer can continue the purchase at a later point in time without having to enter everything again and can also change the value quickly and easily.\n\n</p><p>\n\nThe product inputs are displayed for each line item both on the <b>finish page</b> and in the <b>customer account</b> in the frontend as well as in the <b>line items in the administration</b> and on the documents. So that the product inputs are also displayed in the \"order confirmation\" email template, the step from the <b>Output the customer inputs or custom fields in the \"order confirmation\" email template</b> area from the tab <b>Installation manual</b> must be carried out.\n\n</p><p>\n\nIn addition to the label, the actual input and, in the case of a checkbox field, the placeholder for each line item is also adopted. In the case of a checkbox field, the text after the checkbox is set using the placeholder.\n\n</p><p><b>\n\nIntercepting the sending of the form,</b><b>insofar as</b> the <b>customer input is a required field</b>, <b>is only possible on the product detail page and on the confirm page</b>, because a corresponding form is only available on these pages and the shopping cart can be skipped, for example by the customer with a customer account and the quickview from shopware already preloads all products with its forms.</p><p><br><b>The available snippets for customizing are:</b></p><ul><li><b>tmms.customerInput.titleLabel:</b> the default value of the label of the product entry</li><li><b>tmms.customerInput.placeholderLabel:</b> the default value of the placeholder of the product entry</li><li><b>tmms.customerInput.openingRoundBracket:</b> the opening bracket for the value of the checkbox field in the checkout</li><li><b>tmms.customerInput.closedRoundBracket:</b> the closing bracket for the value of the checkbox field in the checkout</li><li><b>tmms.customerInput.selectedValue:</b> the text if the checkbox field is selected</li><li><b>tmms.customerInput.unselectedValue:</b> the text if the checkbox field was not selected</li><li><b>tmms.customerInput.requiredLabel:</b> the error message text for the required field</li><li><b>tmms.customerInput.validityNumberStepsLabel:</b> the error message text if the value is not between the minimum and maximum value and does not comply with the step value</li><li><b>tmms.customerInput.validityNumberLabel:</b> the error message text if the value is not between the minimum and maximum value</li><li><b>tmms.customerInput.dateTimeFormat:</b> the date and time format if the language-dependent calendar is used</li><li><b>tmms.customerInput.dateFormat:</b> the date format if the language-dependent calendar is used</li><li><b>tmms.customerInput.informationMessage:</b> the text of the information message, for example the description of the behavior when the product is added to the shopping cart again</li><li><b>tmms.customerInput.accordionHeadingLabel:</b> the text for the foldable area</li></ul>","installationManual":"<ol><li>Download the app from the store</li><li>Log in into your Shopware 6 administration area and navigate to extensions -&gt; my extensions</li><li>Click on the right side on \"Upload extension\" and select the downloaded extension</li><li>Use the context&nbsp;menu on the right side of the extension to install the extension and the switch button on the left side to activate it</li><li>Use the context menu on the right side of the extension to configure the extension according to your own requirements</li><li>Switch to \"Catalogues\" -&gt; \"Products\", select a product and switch to the \"Custom fields\" area via the \"Specifications\" tab, where you can configurate the relevant fields at \"product input 1\" to \"product input 5\"</li><li>If necessary, define a different configuration for variants of the product by removing the inheritance of the custom fields in the \"Variants\" tab after selecting a variant using the \"Remove inheritance\" icon so that you can make your own configurations for each variant</li></ol><br><h2>Output the customer inputs or custom fields in the \"order confirmation\" email template</h2><p>So that the product inputs are also output in the order confirmation email, the following should be added in the field \"<b>HTML</b>\" from \"<b>Mail text</b>\", for example before <b>{% endblock %}</b> (see: <a href=\"https://github.com/shopware/platform/blob/trunk/src/Core/Migration/Fixtures/mails/order_confirmation_mail/en-html.html.twig#L88\">here</a>) within the area <b>{% block lineItem %}</b> or, alternatively, if you have already removed this area, within the for-loop of the line items (<b>lineItem</b>), especially before the <b>{% endfor %}</b> (see: <a href=\"https://github.com/shopware/platform/blob/trunk/src/Core/Migration/Fixtures/mails/order_confirmation_mail/en-html.html.twig#L89\">here</a>) of the area&nbsp;<b>{% for lineItem in order.nestedLineItems %}</b> or <b>{% for lineItem in order.lineItems %}</b>:<br>\n\n&lt;tr&gt;<br>\n\n&lt;td&gt;<br>\n\n{% for tmmsCustomerInputCount in 1..5 %}<br>\n\n{% set customFields = lineItem.customFields %}<br>\n\n{% set tmmsCustomerInputValue = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_value' %}<br>\n\n{% set tmmsCustomerInputFieldtype = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_fieldtype' %}<br>\n\n{% set tmmsCustomerInputLabel = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_label' %}<br>\n\n{% set tmmsCustomerInputPlaceholder = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_placeholder' %}<br><br>{% if customFields[tmmsCustomerInputValue] is defined %}<br>\n\n{{ customFields[tmmsCustomerInputLabel] }} {% if customFields[tmmsCustomerInputFieldtype] == \"boolean\" %}&lt;i&gt;\"{{ customFields[tmmsCustomerInputPlaceholder] }}\"&lt;/i&gt; ({{ customFields[tmmsCustomerInputValue] }}){% else %}&lt;i&gt;\"{{ customFields[tmmsCustomerInputValue] }}\"&lt;/i&gt;{% endif %}<br>\n\n&lt;br/&gt;<br>\n\n{% endif %}<br>\n\n{% endfor %}<br>\n\n&lt;/td&gt;<br>\n\n&lt;/tr&gt;\n\n</p>\n","shortDescription":"The app allows up to 5 different customer inputs at products  which can be done in the QuickView, on the product detail page, in the shopping cart or on the order confirm page.","highlights":"\"App of the Week\" calendar week 30/2021 and \"App of the Month - November 2021\" \nup to 5 different customer inputs for each product (as single or multi-line input field,  number field, checkbox field, date time field, date field, time field or selection field), which can be configured via the custom fields at the products\nwhere the customer input can be done in the QuickView from Shopware, on the product detail page, on the offcanvas cart page, in the shopping cart or on the order confirm page\nand the customer inputs are then displayed for each line item both on the finish page and in the customer account in the frontend as well as in the line items in the administration and on the documents\nThe saving of the customer input in the session, so that the input is available to the customer until the customer completes the purchase or clears the browser cache","features":"Configuration via the custom fields at the products and thus easier configuration of the fields via the API\nThe customer input can be a single or multi-line input field, number field, checkbox field, date and time field, date field, time field or a selection field, by which a large number of additional inputs are possible, for example for a text for an engraving or a voucher in the form of an input field or the selection of a desired pick-up date or year of birth via a date field"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163500,"bookingKey":"Tmms299227094335","bookingText":"Customer inputs or additional fields at products","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphso4yk","preview":true,"priority":50,"id":82121},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphtz1H1","preview":false,"priority":49,"id":82122},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpf3Eh1r","preview":false,"priority":48,"id":82123},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQhMulb","preview":false,"priority":47,"id":82124},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSIddYe","preview":false,"priority":46,"id":82125},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphWnJNt","preview":false,"priority":45,"id":82126},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXOzaEu","preview":false,"priority":44,"id":82127},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplm38Wj","preview":false,"priority":43,"id":82128},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpd2XucF","preview":false,"priority":42,"id":82129},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFIIWdO","preview":false,"priority":41,"id":82130},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpht8p2b","preview":false,"priority":40,"id":82131},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpr5lhzk","preview":false,"priority":39,"id":82132},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDqEeuW","preview":false,"priority":38,"id":82133},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsVD38D","preview":false,"priority":37,"id":82134},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKH5e51","preview":false,"priority":36,"id":82135},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvFLrj2","preview":false,"priority":35,"id":82136},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGNKKY8","preview":false,"priority":34,"id":82137},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3l9CZ6","preview":false,"priority":33,"id":82143},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php33OpjZ","preview":false,"priority":32,"id":82144},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php98kCmj","preview":false,"priority":31,"id":82145},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8Zpq9d","preview":false,"priority":30,"id":82138},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRHWxuy","preview":false,"priority":29,"id":82139},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplQKK0S","preview":false,"priority":28,"id":82140},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbxtlDT","preview":false,"priority":27,"id":82141},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpp17oBI","preview":false,"priority":26,"id":82142}],"comments":[{"authorName":"Marcel Wii","text":"Hallo, das Plugin gefällt mir sehr gut. Meine Anforderung wurde damit erfüllt. Allerdings gibt es einen Haken. Ich sehe die Custom-Felder nicht in der CMS-Component Buy-Box. Wie kann man diese da einfügen?","headline":"Gute Erweiterung.","creationDate":{"date":"2022-12-07 22:05:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Ronny John","text":"Die Erweiterung tut genau was sie soll und in Verbindung mit Varianten lassen sich sogar, relativ einfach, Aufpreise  realisieren. Der Support ist unglaublich schnell und sehr kompetent.\n\nDanke!","headline":"Super Erweiterung sowie Support!","creationDate":{"date":"2022-04-26 11:03:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Lutz Kadner","text":"Das Plugin hält, was es verspricht und ist genau das, was man benötigt, wenn man personalisierte Produkte anbieten möchte.\nAber was besonders bemerkenswert ist, ist der Support. \nIch bin absolut begeistert von der Schnelligkeit und Kompetenz!\n\nWenn es 6 Sterne gäbe...","headline":"Ein Top Plugin!","creationDate":{"date":"2022-04-13 09:15:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christopher Weiß","text":"Herr Schreier ist ein toller Ansprechpartner im Support bei  T-Systems. Er konnte mir innerhalb kürzester Zeit eine komplexe Aufgabenstellung, die mit dem Plugin verbunden war, mit ausführlichen Antworten und Beschreibungen lösen. Besten Dank!","headline":"Funktioniert einwandfrei - der Support ist einmalig!","creationDate":{"date":"2022-02-02 20:05:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Admin Admin","text":"Vielen Dank an die Entwickler für dieses tolle Plugin.  Ich finde das Konzept sehr gut durchdacht und die Umsetzung ist gut durchdacht.","headline":"Tolles Plugin!","creationDate":{"date":"2022-01-28 15:10:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Jens Bürger","text":"In dem Shop den ich betreue gibt es Artikel mit über 280 Varianten-Kombinationen, obwohl sich der Preis nicht ändern würde. Durch dieses Plugin konnten wir die Varianten auf nur noch 24 reduzieren, genial! Zusätzlich gibt's auch noch Felder wo Texte eingegeben werden können, konnten wir auch gut gebrauchen! Vielen Dank und weiter so! Einen kleinen Sprechblasen Hinweis, wie bei den AGB, könnte man noch einbauen, als Warnung, wenn man den Artikel in den Warenkorb legen möchte und ein Feld noch nicht ausgefüllt wurde.","headline":"Hier spart man Varianten!","creationDate":{"date":"2022-01-18 09:18:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Constantin Schmedt","text":"Wir nutzen das Plugin hauptsächlich als Möglichkeit für den Kunden Kommentare/ Zusatzhinweise zu einzelnen Warenkorb-Items hinzuzufügen.","headline":"Top Plugin für Kommentare zu Produkten","creationDate":{"date":"2021-11-23 09:23:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sonic","text":"Einem geschenkten Gaul soll man ja bekanntlich nichts ins Maul schauen.\nFür eine mögliche Migration von SW5 zu SW6 benötige ich eine Möglichkeit, Produkte zu \"individualisieren\".\nDa schien mir dieses Plugin recht vielversprechend gewesen zu sein.\n\nAuf den ersten Blick macht es, was es soll!\nAuf den zweiten Blick ist es in dieser Fassung für mich leider absolut unbrauchbar.\nGründe:\n1) Trotz Pflichtfelder lassen sich die Produkte direkt aus dem Listing ohne Eingaben in den Warenkorb legen.\n2) Wird ein Artikel mehrfach mit verschiedenen Eingaben in den Warenkorb gelegt, werden nicht jeweils neue LineItems angelegt, sondern schlicht die \"Stückzahl\" aufaddiert, und nur die letzte Eingabe übernommen. Somit ist ein Artikel mit diesem Plugin nur einmal individualisiert zu kaufen. Das haben vergleichbare PlugIns für SW5 schon besser hinbekommen.\n\nDa ist also noch Luft nach oben ;-)\n\nEDIT: Da ist ja jemand sehr angefasst...\nNun gibt es volle 5 Sterne für die Doku. Werden wirklich ausführlich die Mängel dokumeniert, da war ich wohl blind. So ehrlich muss ich dann doch sein.\n\nMit der Aktuellen Version wurde wohl das Problem mit dem \"aus dem Listing in den Warenkorb legen\" gelöst. Das war aber nicht die Version die ich gestestet habe (Wink nach Schöppingen)!!!","headline":"Recht einfach gestrickt und nicht zu ende gedacht","creationDate":{"date":"2021-11-19 14:57:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Tom Herman","text":"","headline":"Nützliche App die einfach einzurichten ist","creationDate":{"date":"2021-11-07 16:40:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dennis Hebbeler","text":"Schnelle Integration, Super Support.\n\nAlles wie gewünscht.","headline":"Super Hilfe für Personalisierte Informationen pro Produkt.","creationDate":{"date":"2021-10-13 17:31:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Fillip Görbing","text":"Wir haben ein einfaches und günstiges Plugin zum Start unseres Shops gesucht, damit der Kunde die möglichkeit hat sein Produkt zu personalisieren. Hier haben wir es gefunden. Es macht was gewünscht ist. Anfangs hatten wir kleine Probleme mit der einbindung ins E-Mail Temnplate, welche jedoch blitzschnell vom Betreiber der App gelößt wurde, vielen dank!","headline":"Super Plugin und blitzschneller Support!","creationDate":{"date":"2021-07-28 15:20:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Silke Teßmann","text":"Ich bin eine Gründerin, die erstmalig einen Shop aufbauen möchte. Ich habe nur wenig Erfahrungen mit Technik - komme aus dem Bereich Design. Dennoch war es mir möglich, innerhalb kürzester Zeit die Erweiterung zu verstehen und für meine Zwecke zu konfigurieren. Über die Funktionalität im produktiven Betrieb kann ich natürlich noch nichts sagen. Da die Erweiterung kostenlos ist sage ich an dieser Stelle VIELEN DANK!","headline":"Super","creationDate":{"date":"2021-07-16 12:59:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Kundeneingaben oder zusätzliche Felder bei Produkten oder Bestellpositionen","description":"<h2>Support</h2><p>Treten Sie bei Fragen, wenn diese nicht bereits im Bereich \"<b>Häufig gestellte Fragen</b>\" beantwortet wurden, einfach über die E-Mail <b>shopware-apps-support@t-systems-mms.com</b> mit uns in Kontakt und wir helfen Ihnen gerne weiter. </p><h2>Beschreibung der App</h2><p>\nDie App \"Kundeneingaben oder zusätzliche Felder bei Produkten oder Bestellpositionen\" ermöglicht unter anderem <b>bis zu 5 verschiedene Kundeneingaben bei Produkten oder Bestellpositionen</b>. Die Kundeneingabe kann dabei in der <b>QuickView von Shopware</b>, auf der <b>Produkt-Detailseite</b> (auch beim Zuweisen eines Produktseiten-Layouts), im <b>OffCanvas-Warenkorb</b>, im <b>Warenkorb</b> oder auf der <b>Bestellabschlussseite</b> erfolgen.</p><p>Da diese App und die App \"Custom Products\" ( https://docs.shopware.com/de/shopware-6-de/erweiterungen/customproducts ) für den gleichen Zweck gedacht sind, ist eine Kompatibilität zwischen den beiden Apps nicht vorgesehen, da die App \"Custom Products\" im Gegensatz zu dieser App jedes Mal eine neue Bestellposition erzeugt und die App \"Kundeneingaben oder zusätzliche Felder bei Produkten\" keine eigenständige Bestellposition erzeugt, sondern die Zusatzfelder der bestehenden Bestellposition nutzt. Aus diesem Grund eignet sie sich auch am besten für die freiwillige Eingabe von Informationen direkt an einer Bestellposition.\n\n</p><p>\nBei jedem Produkt kann man <b>je Zusatzfeld - Set bei den Zusatzfeldern</b> folgendes festlegen:\n</p><ul><li>ob eine Produkteingabe möglich sein soll</li><li>den Feldtyp der Produkteingabe - ein <b>ein- oder mehrzeiliges Eingabefeld</b>, ein <b>Nummernfeld</b>, ein <b>Checkboxfeld</b>, ein <b>Datums- und Uhrzeitfeld</b>, ein <b>Datumsfeld</b>, ein <b>Uhrzeitfeld</b> oder ein <b>Auswahlfeld</b></li><li>die Beschriftung vor der Produkteingabe</li><li>den Platzhalter für die Produkteingabe</li><li>ob es sich um ein Pflichtfeld handelt.</li></ul><p>\nFür das <b>Datums- und/oder Uhrzeitfeld kann</b> zusätzlich noch ein <b>Startdatum</b>, ein <b>Enddatum</b>, <b>auszuschließende Daten</b> oder eine <b>Start- und Endzeit gesetzt werden</b>. Die Werte für das Auswahlfeld werden kommasepariert im entsprechenden Feld hinterlegt. Beim Feldtyp <b>Nummernfeld</b> kann zusätzlich noch ein <b>Mindestwert</b>, ein <b>Maximalwert</b> und die <b>Schrittweite festgelegt werden</b> (insofern eine Schrittweite festgelegt wurde, muss auch ein positiver Wert in den Feldern \"Mindestwert im Feld\" und \"Maximale Anzahl an Zeichen oder Maximalwert im Feld\" hinterlegt werden), bei den Feldtypen <b>einzeiliges Eingabefeld</b> und <b>mehrzeiliges Eingabefeld</b> die <b>maximale Anzahl an Zeichen</b>.\n\n</p><p>\nDarüber hinaus kann innerhalb der <b>Konfiguration</b> folgendes ausgewählt werden:\n</p><ul><li>die Festlegung, ob eine Details-Schaltfläche in den Kategorielisten anzeigt werden soll, wenn eine Produkteingabe bei einem Produkt aktiviert wurde (sodass man zuerst die Produkteingaben sieht, bevor man das Produkt in den Warenkorb legen kann)</li><li>die Festlegung, ob unter den Produkteingaben eine Hinweismeldung angezeigt werden soll, beispielsweise mit der Beschreibung des Verhaltens beim erneuten Legen des Produkts in den Warenkorb (in dem Fall, das man die Produkteingabe direkt auf der Produkt-Detailseite oder in der Quickview von Shopware erlaubt)</li><li>die Festlegung, ob die Produkteingabe in der <a href=\"https://store.shopware.com/swag342274855948t/cms-extensions.html\">Quickview von Shopware</a> angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe auf der Produkt - Detailseite angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe im OffCanvas-Warenkorb angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe im Warenkorb angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe auf der Bestellabschlussseite angezeigt werden soll</li><li>die Festlegung, ob eine leere Produkteingabe im Checkout angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe im Checkout änderbar sein soll</li><li>die Festlegung, ob nicht ausgewählte Checkboxfelder als Wert übertragen werden sollen</li><li>die Festlegung, ob ein Trennstrich zwischen Produkt und Produkteingabe im Checkout angezeigt werden soll</li><li>die Festlegung, ob die Produkteingabe in einem aufklappbaren Bereich im großen Warenkorb und auf der Bestellabschlussseite angezeigt werden soll</li></ul><p>\nFür das Datums- und Uhrzeitfeld kann innerhalb der <b>Konfiguration</b> folgendes ausgewählt werden:\n</p><ul><li>die Festlegung, ob ein sprachabhängiger Kalender anhand der Lokalisierung verwendet werden soll</li><li>die Festlegung des Datumsformats</li><li>die Festlegung des Datums- und Uhrzeitformats</li><li>die Festlegung, ob manuelle Eingaben erlaubt sind</li><li>die Festlegung, ob die Kalenderwochen angezeigt werden sollen</li><li>die Festlegung, ob das Startdatum oder -Uhrzeit als Standardwert gesetzt werden soll</li></ul><p>\n\nDes weiteren kann innerhalb der <b>Konfiguration</b> für die <b>Pflichtfelder</b> folgendes ausgewählt werden:\n\n</p><ul><li>die Festlegung, ob Pflichtfelder im Warenkorb änderbar sind (das Abfangen des Absendens des Formulars ist aber nicht möglich)</li><li>die Festlegung, ob Pflichtfelder auf der Bestellabschlussseite änderbar sind</li><li>die Festlegung, ob leere Pflichtfelder im Checkout gespeichert werden sollen</li><li>die Festlegung, ob die Pflichtfeldmarkierung farblich hervorgehoben werden soll</li></ul><p><b>Sobald der Kunde eine Eingabe in das Feld vornimmt und das Produkt später auch in den Warenkorb legt, wird die Änderung gespeichert</b>. Die Eingabe wird dabei in der Session gespeichert, sodass die Eingabe für den Kunden solange verfügbar ist, bis der Kunde den Einkauf abschließt oder den Browser-Cache leert. Somit kann der Kunde auch zu einem späteren Zeitpunkt den Kauf fortführen, ohne erneut alles eingeben zu müssen und kann auch eine Änderung des Wertes schnell und einfach durchführen.\n</p><p>\nDie Produkteingaben werden je Bestellposition sowohl auf der <b>Bestellbestätigungsseite</b> und im <b>Kunden-Account</b> im Frontend als auch bei den <b>Bestellpositionen in der Administration</b> und <b>auf den Dokumenten angezeigt</b>. Damit die Produkteingaben auch im E-Mail-Template \"Bestellbestätigung\" angezeigt werden, muss der Schritt aus dem Bereich <b>Ausgabe der Kundeneingaben oder zusätzlichen Felder im E-Mail-Template \"Bestellbestätigung\"</b> im Tab <b>Installationsanleitung</b> durchgeführt werden. \n</p><p>\nEs wird neben der Beschriftung die eigentliche Eingabe und bei einem Checkboxfeld zusätzlich noch der Platzhalter für jede Bestellposition mit übernommen. Bei einem Checkboxfeld wird der Text nach der Checkbox über den Platzhalter bestimmt.\n</p><p>\nDas <b>Abfangen des Absendens des Formulars</b>, <b>insofern</b> die <b>Kundeneingabe ein Pflichtfeld ist</b>, <b>ist nur auf der Produkt - Detailseite und auf der Bestellabschlussseite möglich</b>, da nur auf diesen Seiten ein entsprechendes Formular vorhanden ist und der Warenkorb beispielsweise durch den Kunden mit einem Kundenkonto übersprungen werden kann und die QuickView von Shopware bereits alle Produkte mit dessen Formularen vorlädt.\n\n</p><p><br /><b>Die verfügbaren Textbausteine zum Individualisieren sind:</b></p><ul><li><b>tmms.customerInput.titleLabel:</b> der Standardwert der Beschriftung der Produkteingabe</li><li><b>tmms.customerInput.placeholderLabel:</b> der Standardwert des Platzhalters der Produkteingabe</li><li><b>tmms.customerInput.openingRoundBracket:</b> die öffnende Klammer für den Wert des Checkboxfeldes im Checkout</li><li><b>tmms.customerInput.closedRoundBracket:</b> die schließende Klammer für den Wert des Checkboxfeldes im Checkout</li><li><b>tmms.customerInput.selectedValue:</b> der Text, wenn das Checkboxfeld ausgewählt wurde</li><li><b>tmms.customerInput.unselectedValue:</b> der Text, wenn das Checkboxfeld nicht ausgewählt wurde</li><li><b>tmms.customerInput.requiredLabel:</b> der Fehlermeldungstext für das Pflichtfeld</li><li><b>tmms.customerInput.validityNumberStepsLabel:</b> der Fehlermeldungstext, wenn der Wert nicht zwischen dem Mindest- und Maximalwert liegt und die Schrittweite nicht einhält</li><li><b>tmms.customerInput.validityNumberLabel:</b> der Fehlermeldungstext, wenn der Wert nicht zwischen dem Mindest- und Maximalwert liegt</li><li><b>tmms.customerInput.dateTimeFormat:</b> das Datums- und Zeitformat, wenn der sprachabhängige Kalender verwendet wird</li><li><b>tmms.customerInput.dateFormat:</b> das Datumsformat, wenn der sprachabhängige Kalender verwendet wird</li><li><b>tmms.customerInput.informationMessage:</b> der Text der Hinweismeldung, beispielsweise die Beschreibung des Verhaltens beim erneuten Legen des Produkts in den Warenkorb</li><li><b>tmms.customerInput.accordionHeadingLabel:</b> der Text für den aufklappbaren Bereich</li></ul>","installationManual":"<ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Melden Sie sich in Ihren Shopware 6 Administrationsbereich an und navigieren Sie zu dem Menüpunkt Erweiterungen -&gt; Meine Erweiterungen</li><li>Klicken Sie rechts oben auf \"Erweiterung hochladen\" und wählen Sie die heruntergeladene Erweiterung aus</li><li>Verwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung zu installieren und den Schalter links, um sie zu aktivieren</li><li>Verwenden Sie das Kontextmenü rechts neben der Erweiterung um die Erweiterung nach den eigenen Wünschen zu konfigurieren</li><li>Wechseln Sie unter \"Kataloge\" -&gt; \"Produkte\", wählen Sie ein Produkt aus und wechseln Sie über das Tab \"Spezifikationen\" in den Bereich \"Zusatzfelder\", bei dem Sie bei \"Produkteingabe 1\" bis \"Produkteingabe 5\" die entsprechenden Felder festlegen können</li><li>Legen Sie bei Bedarf für Varianten des Produkts eine abweichende Konfiguration fest, indem Sie die Vererbung der Zusatzfelder im Tab \"Varianten\" nach der Auswahl einer Variante über das entsprechende Icon \"Vererbung entfernen\" aufheben, sodass man je Variante eigene Konfigurationen vornehmen kann</li></ol><br /><h2>Ausgabe der Kundeneingaben oder zusätzlichen Felder im E-Mail-Template \"Bestellbestätigung\"</h2><p>\n\nDamit die Produkteingaben auch in der E-Mail der Bestellbestätigung ausgegeben werden, muss beim Feld \"<b>HTML</b>\" bei \"<b>Mail-Text</b>\" folgendes ergänzt werden, also beispielsweise vor <b>{% endblock %}</b> (siehe: <a href=\"https://github.com/shopware/platform/blob/trunk/src/Core/Migration/Fixtures/mails/order_confirmation_mail/de-html.html.twig#L89\">hier</a>) innerhalb des Bereichs <b>{% block lineItem %}</b> oder alternativ, wenn Sie diesen Bereich schon bei sich entfernt haben, innerhalb der for-Schleife für die Bestellpositionen (<b>lineItem</b>), speziell vor dem <b>{% endfor %}</b> (siehe: <a href=\"https://github.com/shopware/platform/blob/trunk/src/Core/Migration/Fixtures/mails/order_confirmation_mail/de-html.html.twig#L90\">hier</a>) vom Bereich<b> {% for lineItem in order.nestedLineItems %} </b>oder <b>{% for lineItem in order.lineItems %}</b>:<br />\n\n&lt;tr&gt;<br />\n\n&lt;td&gt;<br />\n\n{% for tmmsCustomerInputCount in 1..5 %}<br />\n\n{% set customFields = lineItem.customFields %}<br />\n\n{% set tmmsCustomerInputValue = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_value' %}<br />\n\n{% set tmmsCustomerInputFieldtype = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_fieldtype' %}<br />\n\n{% set tmmsCustomerInputLabel = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_label' %}<br />\n\n{% set tmmsCustomerInputPlaceholder = 'tmms_customer_input_' ~ tmmsCustomerInputCount ~ '_placeholder' %}<br /><br />{% if customFields[tmmsCustomerInputValue] is defined %}<br />\n\n{{ customFields[tmmsCustomerInputLabel] }} {% if customFields[tmmsCustomerInputFieldtype] == \"boolean\" %}&lt;i&gt;\"{{ customFields[tmmsCustomerInputPlaceholder] }}\"&lt;/i&gt; ({{ customFields[tmmsCustomerInputValue] }}){% else %}&lt;i&gt;\"{{ customFields[tmmsCustomerInputValue] }}\"&lt;/i&gt;{% endif %}<br />\n\n&lt;br/&gt;<br />\n\n{% endif %}<br />\n\n{% endfor %}<br />\n\n&lt;/td&gt;<br />\n\n&lt;/tr&gt;\n\n</p>","version":"1.2.0","changelog":[{"version":"1.2.0","text":"<p>Established the compatibility with Shopware from version 6.5.0.0.</p>","creationDate":{"date":"2023-05-24 10:04:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.11","text":"<p>Established the compatibility with Shopware from version 6.4.15.0.</p>","creationDate":{"date":"2022-09-19 15:00:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.10","text":"<p>The annotations of the controller have been replaced with Route defaults.</p>","creationDate":{"date":"2022-05-25 08:33:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<p>You can now select if the enter key should be blocked for the field types \"single-line input field\", \"number field\", \"date and time field\", \"date field\" and \"time field\"</p>","creationDate":{"date":"2022-04-26 08:54:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<p>At the field type \"number field\" the custom field \"steps for the field\" now also supports steps with decimal points</p>","creationDate":{"date":"2022-04-25 09:09:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<p>established the compatibility with Shopware from version 6.4.10.0</p>","creationDate":{"date":"2022-04-13 08:39:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>You can now select if the product input should be shown on the offcanvas cart page.</p><p>You can now select if a dividing line should be shown between the product and the product input in the checkout.</p><p>You can now select if the product input should be shown in a foldable area in the large shopping cart and on the confirm page.</p><p>You can now select if required fields can be changed in the shopping cart (however, it is not possible to intercept the sending of the form).</p><p>You can now select if required fields can be changed on the confirm page.</p><p>You can now select if empty required fields are saved in the checkout.</p>","creationDate":{"date":"2022-02-07 11:03:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>You can now select if a details button should be displayed in the navigation when a product input has been activated for a product. </p><p>You can now select if a message should be displayed under the product inputs, for example with a description of the behavior when the product is added to the shopping cart again. </p><p>You can now select if a language-dependent calendar should be used based on the localization.</p>","creationDate":{"date":"2021-11-22 14:45:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>There is now also the field type \"number field\".</p><p>At the field type \"number field\" a minimum value, a maximum value and the steps can also be specified.</p><p>At the field type \"single-line input field\" and \"multi-line input field\" the maximum number of characters can now also be specified</p>","creationDate":{"date":"2021-10-13 18:52:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>The saving of the custom fields now only consider product line items</p>","creationDate":{"date":"2021-08-17 11:41:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>Adaptation of the own controller for Symfony 6.0</p>","creationDate":{"date":"2021-08-04 08:18:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Adaptation of the version of the require components</p>","creationDate":{"date":"2021-08-02 15:02:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Revision of the output of the customer inputs at the products for line items in the administration for Shopware 6.4.2.0</p>","creationDate":{"date":"2021-07-07 13:55:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release of the app</p>","creationDate":{"date":"2021-06-11 10:58:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Tmms299227094335","redirectToStore":false,"lowestPriceValue":0}