{"id":13707,"name":"ParadoxLabAuthnet","code":"Parad74935465154","lastChange":{"date":"2023-07-18 11:16:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8SbiZ1","examplePageUrl":"","moduleKey":"ParadoxLabAuthnet","creationDate":{"date":"2021-07-16 14:19:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-09-01 14:07:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-07-16 15:25:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3409,"prefix":"ParadoxLab","name":"ParadoxLabs","website":"//www.paradoxlabs.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3409_Webp.net-resizeimage.png"},"infos":[{"id":23865,"name":"Authorize.Net Payments","description":"<p>Authorize.net ist eines der weltweit größten Zahlungs-Gateways und bedient über 400.000 Händler. Ihre Dienste ermöglichen es Ihnen, Zahlungen von Ihren Kunden per Kreditkarte oder eCheck direkt von Ihrer Website aus zu akzeptieren. Sie müssen über ein Authorize.net-Konto verfügen, um diese Erweiterung zu verwenden (Kontogebühren können variieren).</p><p><br></p><p>Diese Erweiterung bringt die Zahlungsabwicklungsdienste von Authorize.net in Ihren Shopware-Shop.</p><p><br></p><p><i>Hinweis: Authorize.Net unterstützt PSD2/SCA nicht. Diese Erweiterung ist für US-Händler gedacht.</i></p><p><i>Hinweis: Durch die Nutzung dieser Erweiterung werden Kunden- und Bestelldaten zur Zahlungsabwicklung und Betrugsprävention an Authorize.net, Ihren Authorize.net-Händler-Dienstleister und den Kreditkartenabwickler des Kunden übertragen.<br></i></p><p><br></p><h2>Wie es funktioniert</h2><p>Wenn ein Kunde zur Kasse geht, hat er eine Kreditkartenoption für die Zahlung. Wenn Sie dies auswählen, werden sie angewiesen, die Bestellung aufzugeben. Nachdem sie auf \"Bestellung aufgeben\" geklickt haben, werden sie zu einer anderen Seite weitergeleitet, um ihre Zahlungsinformationen einzugeben und die Zahlung abzuschließen.</p><p><br></p><p>Das Zahlungsformular verwendet die Accept Hosted iframe-Lösung von Authorize.net, d. h. die Zahlungsinformationen werden direkt bei Authorize.net eingegeben und berühren niemals Ihre Website, ohne dass der Kunde Ihre Website verlässt. Dies bietet Ihnen die bestmögliche Sicherheit, ist aber auch mobil- und reaktionsfreundlich und bietet während des gesamten Prozesses eine konsistente Benutzererfahrung.</p><p><br></p><p>Wenn der Kunde eingeloggt oder registriert ist, hat er auch die Möglichkeit, seine Zahlungsinformationen für die zukünftige Verwendung beim Bezahlen zu speichern. Wenn sie dies tun, können sie bei der nächsten Bestellung ihre gespeicherte Karte auswählen oder eine neue eingeben. Dies erfolgt über den Customer Information Manager-Dienst von Authorize.net, um die Daten in ihrem sicheren und PCI-kompatiblen Netzwerk zu tokenisieren.</p><p><br></p><p>Wenn Sie eine Admin-Bestellung für einen Kunden aufgeben, erhält dieser eine E-Mail, die ihn auf Ihre Website leitet, um Zahlungsinformationen einzugeben, um die Bestellung zu bezahlen.</p><p><br></p><p>Transaktionsänderungen (einschließlich Erfassung, Stornierung, Rückerstattung, Genehmigung/Ablehnung usw.) können im Portal von Authorize.net oder über ein Authorize.net-kompatibles ERP- oder Auftragsmanager vorgenommen werden. Alle Transaktionsänderungen bei Authorize.net werden synchronisiert und aktualisieren automatisch den Zahlungsstatus der Bestellung in Shopware.</p><p><br></p><h2>Vertrauenswürdige</h2><p>ParadoxLabs erstellt und wartet seit 2013 Authorize.net-zertifizierte Lösungen. Unsere Zahlungserweiterungen werden in Tausenden von E-Commerce-Shops verwendet und verarbeiten ein Transaktionsvolumen in Milliardenhöhe pro Jahr.</p><p><br></p><h2>Sichern</h2><p>Die gesamte Kommunikation mit Authorize.net erfolgt mit TLS-Verschlüsselung und es werden keine vertraulichen Karteninhaberdaten auf Ihrem eigenen Server gespeichert. Ein Prozess namens Tokenisierung wird verwendet, um Transaktionen mit gespeicherten Zahlungsinformationen auszuführen. Auf diese Weise können Ihre Kunden mit einer „gespeicherten“ Karte bezahlen, die sich überhaupt nicht auf Ihrem Server befindet.</p><p><br></p><p>Alle Zahlungsinformationen werden über die von Authorize.net gehosteten Zahlungsformulare gesammelt. Auf diese Weise können Kreditkarteninformationen direkt vom Browser Ihrer Kunden an Authorize.Net gesendet werden, ohne Ihre Website zu berühren. Da Ihr Webserver nie die unformatierte Kreditkartennummer sieht, verbessert dies die Sicherheit Ihrer Website und verringert Ihre PCI-Compliance-Anfälligkeit.</p><p><br></p><h2>PCI-konform</h2><p>PCI-Compliance ist ein komplexes und vielschichtiges Thema, das jeden Aspekt Ihres Unternehmens abdeckt. Wir können nicht garantieren, dass Ihr Unternehmen PCI-konform ist. Das hängt von Ihrem Server, Richtlinien, Prozessen, regelmäßigen Sicherheitsscans, anderen angebotenen Zahlungsmethoden und vielem mehr ab. Was wir Ihnen sagen können ist, dass diese Erweiterung Sie nicht daran hindert, PCI-konform zu sein. Wir speichern oder protokollieren keine vertraulichen Karteninhaberdaten.</p><p><br></p><p>Alle Zahlungsinformationen des Kunden werden über gehostete Zahlungsformulare direkt an Authorize.net gesendet. Dadurch ist diese Erweiterung konform mit dem PCI Self-Assessment Questionnaire (SAQ) A, dem einfachsten Compliance-Formular.</p><p><br></p><h2>Bekannte Probleme und Einschränkungen</h2><p>Dies ist eine vorzeitige Veröffentlichung dieser Zahlungsmethode. Die gesamte Zahlungsabwicklung funktioniert wie beschrieben, es gibt jedoch einige Funktionseinschränkungen. Wenn Sie diese benötigen, bekunden Sie bitte Ihr Interesse. Vielen Dank!</p><p><br></p><h4>Wir unterstützen derzeit nicht:</h4><p></p><ul><li>Shopware-Cloud. Shopware Cloud unterstützt nur Zahlungsmethoden vom Redirect-Typ.</li><li>Shopware-APIs.</li><li>PWA und kopflose Schaufenster.</li><li>Mehrere Währungen. Authorize.net unterstützt nur eine Währung pro Konto. Alle Transaktionen müssen in derselben Währung wie Ihr Authorize.net-Konto abgewickelt werden. Derzeit wird keine Währungsumrechnung unterstützt.</li><li>Shopware Admin Zahlungsaktionen. Die gesamte Transaktionsverarbeitung, einschließlich Erfassung, Rückerstattung, Stornierung und Betrugsprüfung, muss über das Authorize.net-Portal oder einen anderen mit Authorize.net verbundenen Dienst durchgeführt werden.</li><li>Teilweise Erfassung oder Rückerstattung. Bestellungen müssen zu diesem Zeitpunkt erfasst, storniert oder vollständig erstattet werden.</li></ul><p></p><p><br></p><p>Mit Ausnahme von Shopware Cloud hoffen wir, diese im Laufe der Zeit je nach Bedarf und Gelegenheit anzugehen.</p>","installationManual":"<p>1. Wenn Sie noch kein Authorize.net-Händlerkonto haben, melden Sie sich zuerst an. Dies beinhaltet einen Genehmigungs- und Bonitätsprüfungsprozess. Mit der Nutzung von Authorize.net-Zahlungsdiensten sind Gebühren verbunden. Sie können sich hier anmelden: http://reseller.authorize.net/application/?resellerId=24716</p><p><br></p><p>2. Kaufen Sie diese Erweiterung im Shopware Store.</p><p><br></p><p>3. Installieren und aktivieren Sie die Erweiterung mit dem Erweiterungsmanager. Gehen Sie zu Admin &gt; Erweiterungen &gt; Meine Erweiterungen, suchen Sie nach \"Authorize.Net Payments\" und klicken Sie auf \"App installieren\".</p><p><br></p><p>4. Klicken Sie auf der Seite \"Meine Erweiterungen\" auf das Menü (...) auf der rechten Seite der App \"Authorize.Net Payments\" und klicken Sie auf \"Konfiguration\".</p><p><br></p><p>5. Geben Sie Ihre Authorize.net-Kontoanmeldeinformationen ein und klicken Sie dann auf die Schaltfläche \"Informationen überprüfen und Webhooks installieren (erforderlich)\". Dadurch erfahren Sie, ob die Anmeldeinformationen gültig sind oder nicht, und initialisiert die Transaktionssynchronisierung über Webhooks. Jedes Mal, wenn Sie Authorize.Net-Kontodaten oder Ihre Shopware-Shop-URL ändern, müssen Sie diese Schaltfläche erneut anklicken.</p><p><br></p><p>Jede Einstellung enthält zusätzliche Informationen im blauen „Hilfe“-Symbol. Klicken Sie auf das Symbol, um mehr über die Einstellung zu erfahren.</p>","shortDescription":"Fügen Sie mit Authorize.Net die Kreditkartenverarbeitung zu Ihrem Geschäft hinzu. Beinhaltet Unterstützung für Kartenspeicherung, Webhooks und Betrugsprüfung .","highlights":"Authorize.net-zertifizierte Lösung\nPCI-SAQ-A-Konformität\nKreditkarten- und ACH-Zahlungsabwicklung\nZahlungsdetails zur einfachen Wiederverwendung speichern","features":"Mobilfreundliches und reaktionsschnelles iframe-Zahlungsformular\nAuthorize.net-Transaktionsänderungen aktualisieren automatisch den Zahlungsstatus Ihrer Shopware-Bestellung\nRechnungsadresse mit Adressverifizierung (AVS) validieren\nSchützen Sie sich vor Betrug mit der Advanced Fraud Detection Suite (AFDS) und der Wartefrist\nErfassen Sie Geld sofort oder autorisieren Sie die Transaktion, um es später zu erfassen"},{"id":23866,"name":"Authorize.Net Payments","description":"<p>Authorize.net is one of the world's largest payment gateways, serving over 400,000 merchants. Their services allow you to accept payment from your customers, by credit card or eCheck, straight from your website. You must have an Authorize.net account to use this extension (account fees will vary).</p><p><br></p><p>This extension brings Authorize.net's payment processing services to your Shopware store.</p><p><br></p><p><i>Note: Authorize.Net does not support PSD2/SCA. This extension is intended for US merchants.</i><br></p><p><i>Note:&nbsp;Use of this extension will transmit customer and order data to Authorize.net, your Authorize.net Merchant Service Provider, and the customer's credit card processor, for payment processing and fraud prevention.</i></p><p><br></p><h2>How it works</h2><p>When a customer goes to checkout, they'll have a Credit Card option for payment. Selecting this will direct them to place the order. After hitting 'place order', they'll be sent to another page to enter their payment information and complete payment.</p><p><br></p><p>The payment form uses Authorize.net's Accept Hosted iframe solution, meaning payment information is entered directly at Authorize.net and never touches your website, without the customer ever leaving your site. This gives you the best possible security, while also being mobile- and responsive-friendly and giving a consistent user experience throughout the process.</p><p><br></p><p>If the customer is logged in or registers, they'll also have the option of saving their payment info for future use when checking out. If they do so, the next time they place an order they'll be able to choose their saved card or enter a new one. This is done using Authorize.net's Customer Information Manager service to tokenize the data in their secure and PCI-compliant network.</p><p><br></p><p>If you place an admin order for a customer, they will receive an email directing them to your website to enter payment information to pay for the order.</p><p><br></p><p>Transaction changes (including capturing, voiding, refunding, approving/denying, etc.) can be done in Authorize.net's portal, or through an Authorize.net-compatible ERP or order manager. All transaction changes at Authorize.net will be synchronized and automatically update the order payment status in Shopware.</p><p><br></p><h2>Trusted</h2><p>ParadoxLabs has been creating and maintaining Authorize.net certified solutions since 2013. Our payment extensions are used on thousands of ecommerce stores, and process billions of dollars in transaction volume per year.</p><p><br></p><h2>Secure</h2><p>All communication with Authorize.net is performed with TLS encryption, and no confidential cardholder data is ever stored on your own server. A process called tokenization is used to run transactions with stored payment information. This lets your customers pay with a 'saved' card that's not on your server at all.</p><p><br></p><p>All payment information is collected via Authorize.net's Accept Hosted payment forms. This allows credit card information to be sent straight from your customers' browsers to Authorize.Net, without touching your website at all. Since your web server never sees the raw credit card number, this improves your website's security and reduces your PCI compliance exposure.</p><p><br></p><h2>PCI Compliant</h2><p>PCI compliance is a complex and multifaceted issue, covering every aspect of your business. We can't guarantee that your business is PCI-compliant. That depends on your server, policies, processes, regular security scans, other payment methods offered, and a lot more. What we can tell you is that this extension will not prevent you from being PCI compliant. We don't store or log confidential cardholder data.</p><p><br></p><p>All customer payment info is sent directly to Authorize.net using hosted payment forms. That makes this extension compliant with PCI Self-Assessment Questionnaire (SAQ) A, the simplest compliance form.<br></p><p><br></p><h2>Known Issues and Limitations</h2><p>This is an early release of this payment method. All payment processing will work as described, however there are some feature limitations. If you need any of these, please express your interest. Thanks!</p><p><br></p><h4><b>We do not currently support:</b></h4><p></p><ul><li>Shopware Cloud. Shopware Cloud only supports redirect-type payment methods.</li><li>Shopware APIs.</li><li>PWA and headless storefronts.</li><li>Multiple currencies. Authorize.net only supports one currency per account. All transactions must be processed in the same currency as your Authorize.net account. No currency conversion is currently supported.</li><li>Shopware Admin payment actions. All transaction processing including capturing, refunding, voiding, and fraud review must be performed through the Authorize.net portal or an other Authorize.net-connected service.</li><li>Partial capturing or refunding. Orders must be captured, voided, or refunded in full at this time.</li></ul><p><br></p><p>With the exception of Shopware Cloud, we hope to address these over time as need and opportunity allow.</p><p></p>","installationManual":"<p>1. If you don't have an Authorize.net merchant account yet, sign up for one first. This involves an approval and credit check process. There are fees associated with using Authorize.net payment services. You can sign up here: http://reseller.authorize.net/application/?resellerId=24716</p><p><br></p><p>2. Purchase this extension from the Shopware Store.</p><p><br></p><p>3. Install and activate the extension using the extension manager. Go to <b>Admin &gt; Extensions &gt; My Extensions</b>, find \"<b>Authorize.Net Payments</b>\", and click \"<b>Install app</b>\".</p><p><br></p><p>4. On the <b>My Extensions</b> page, click the <b>(...) menu</b> on the right side of the \"<b>Authorize.Net Payments</b>\" app, and click \"<b>Configuration</b>\".</p><p><br></p><p>5. Enter your Authorize.net account credentials, and then click the \"<b>Verify Info and Install Webhooks (REQUIRED)</b>\" button. This will tell you if the credentials are valid or not, and initialize transaction syncing via webhooks. Any time you change Authorize.Net account details or your Shopware store URL, you must click this button again.</p><p><br></p><p>Each setting has additional information in the blue 'help' icon. Click the icon to learn more about the setting.</p>","shortDescription":"Add credit card processing to your store with Authorize.Net. Includes support for card storage, webhooks, fraud review, and more, with a highly secure payment form.","highlights":"Authorize.net Certified Solution\nPCI SAQ A compliance\nCredit Card and ACH payment processing\nSave payment details for easy reuse","features":"Mobile-friendly and responsive iframe payment form\nAuthorize.net transaction changes automatically update your Shopware order payment status\nValidate billing address with Address Verification (AVS)\nProtect against fraud with Advanced Fraud Detection Suite (AFDS) and hold-for-review\nCapture money immediately, or authorize the transaction to capture it later"}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":163711,"bookingKey":"Parad74935465154_M","bookingText":"Authorize.Net Payments","price":29,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPTYd71","preview":true,"priority":0,"id":69474},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpque3As","preview":false,"priority":10,"id":69473},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphVs8jT","preview":false,"priority":9,"id":69475},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8vfZDk","preview":false,"priority":8,"id":69470},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSVYfJf","preview":false,"priority":7,"id":69472},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiCJrx9","preview":false,"priority":5,"id":69471},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4OahYf","preview":false,"priority":4,"id":69469}],"comments":[],"ratingAverage":0,"label":"Authorize.Net Payments","description":"<p>Authorize.net ist eines der weltweit größten Zahlungs-Gateways und bedient über 400.000 Händler. Ihre Dienste ermöglichen es Ihnen, Zahlungen von Ihren Kunden per Kreditkarte oder eCheck direkt von Ihrer Website aus zu akzeptieren. Sie müssen über ein Authorize.net-Konto verfügen, um diese Erweiterung zu verwenden (Kontogebühren können variieren).</p><p><br /></p><p>Diese Erweiterung bringt die Zahlungsabwicklungsdienste von Authorize.net in Ihren Shopware-Shop.</p><p><br /></p><p><i>Hinweis: Authorize.Net unterstützt PSD2/SCA nicht. Diese Erweiterung ist für US-Händler gedacht.</i></p><p><i>Hinweis: Durch die Nutzung dieser Erweiterung werden Kunden- und Bestelldaten zur Zahlungsabwicklung und Betrugsprävention an Authorize.net, Ihren Authorize.net-Händler-Dienstleister und den Kreditkartenabwickler des Kunden übertragen.<br /></i></p><p><br /></p><h2>Wie es funktioniert</h2><p>Wenn ein Kunde zur Kasse geht, hat er eine Kreditkartenoption für die Zahlung. Wenn Sie dies auswählen, werden sie angewiesen, die Bestellung aufzugeben. Nachdem sie auf \"Bestellung aufgeben\" geklickt haben, werden sie zu einer anderen Seite weitergeleitet, um ihre Zahlungsinformationen einzugeben und die Zahlung abzuschließen.</p><p><br /></p><p>Das Zahlungsformular verwendet die Accept Hosted iframe-Lösung von Authorize.net, d. h. die Zahlungsinformationen werden direkt bei Authorize.net eingegeben und berühren niemals Ihre Website, ohne dass der Kunde Ihre Website verlässt. Dies bietet Ihnen die bestmögliche Sicherheit, ist aber auch mobil- und reaktionsfreundlich und bietet während des gesamten Prozesses eine konsistente Benutzererfahrung.</p><p><br /></p><p>Wenn der Kunde eingeloggt oder registriert ist, hat er auch die Möglichkeit, seine Zahlungsinformationen für die zukünftige Verwendung beim Bezahlen zu speichern. Wenn sie dies tun, können sie bei der nächsten Bestellung ihre gespeicherte Karte auswählen oder eine neue eingeben. Dies erfolgt über den Customer Information Manager-Dienst von Authorize.net, um die Daten in ihrem sicheren und PCI-kompatiblen Netzwerk zu tokenisieren.</p><p><br /></p><p>Wenn Sie eine Admin-Bestellung für einen Kunden aufgeben, erhält dieser eine E-Mail, die ihn auf Ihre Website leitet, um Zahlungsinformationen einzugeben, um die Bestellung zu bezahlen.</p><p><br /></p><p>Transaktionsänderungen (einschließlich Erfassung, Stornierung, Rückerstattung, Genehmigung/Ablehnung usw.) können im Portal von Authorize.net oder über ein Authorize.net-kompatibles ERP- oder Auftragsmanager vorgenommen werden. Alle Transaktionsänderungen bei Authorize.net werden synchronisiert und aktualisieren automatisch den Zahlungsstatus der Bestellung in Shopware.</p><p><br /></p><h2>Vertrauenswürdige</h2><p>ParadoxLabs erstellt und wartet seit 2013 Authorize.net-zertifizierte Lösungen. Unsere Zahlungserweiterungen werden in Tausenden von E-Commerce-Shops verwendet und verarbeiten ein Transaktionsvolumen in Milliardenhöhe pro Jahr.</p><p><br /></p><h2>Sichern</h2><p>Die gesamte Kommunikation mit Authorize.net erfolgt mit TLS-Verschlüsselung und es werden keine vertraulichen Karteninhaberdaten auf Ihrem eigenen Server gespeichert. Ein Prozess namens Tokenisierung wird verwendet, um Transaktionen mit gespeicherten Zahlungsinformationen auszuführen. Auf diese Weise können Ihre Kunden mit einer „gespeicherten“ Karte bezahlen, die sich überhaupt nicht auf Ihrem Server befindet.</p><p><br /></p><p>Alle Zahlungsinformationen werden über die von Authorize.net gehosteten Zahlungsformulare gesammelt. Auf diese Weise können Kreditkarteninformationen direkt vom Browser Ihrer Kunden an Authorize.Net gesendet werden, ohne Ihre Website zu berühren. Da Ihr Webserver nie die unformatierte Kreditkartennummer sieht, verbessert dies die Sicherheit Ihrer Website und verringert Ihre PCI-Compliance-Anfälligkeit.</p><p><br /></p><h2>PCI-konform</h2><p>PCI-Compliance ist ein komplexes und vielschichtiges Thema, das jeden Aspekt Ihres Unternehmens abdeckt. Wir können nicht garantieren, dass Ihr Unternehmen PCI-konform ist. Das hängt von Ihrem Server, Richtlinien, Prozessen, regelmäßigen Sicherheitsscans, anderen angebotenen Zahlungsmethoden und vielem mehr ab. Was wir Ihnen sagen können ist, dass diese Erweiterung Sie nicht daran hindert, PCI-konform zu sein. Wir speichern oder protokollieren keine vertraulichen Karteninhaberdaten.</p><p><br /></p><p>Alle Zahlungsinformationen des Kunden werden über gehostete Zahlungsformulare direkt an Authorize.net gesendet. Dadurch ist diese Erweiterung konform mit dem PCI Self-Assessment Questionnaire (SAQ) A, dem einfachsten Compliance-Formular.</p><p><br /></p><h2>Bekannte Probleme und Einschränkungen</h2><p>Dies ist eine vorzeitige Veröffentlichung dieser Zahlungsmethode. Die gesamte Zahlungsabwicklung funktioniert wie beschrieben, es gibt jedoch einige Funktionseinschränkungen. Wenn Sie diese benötigen, bekunden Sie bitte Ihr Interesse. Vielen Dank!</p><p><br /></p><h4>Wir unterstützen derzeit nicht:</h4><p></p><ul><li>Shopware-Cloud. Shopware Cloud unterstützt nur Zahlungsmethoden vom Redirect-Typ.</li><li>Shopware-APIs.</li><li>PWA und kopflose Schaufenster.</li><li>Mehrere Währungen. Authorize.net unterstützt nur eine Währung pro Konto. Alle Transaktionen müssen in derselben Währung wie Ihr Authorize.net-Konto abgewickelt werden. Derzeit wird keine Währungsumrechnung unterstützt.</li><li>Shopware Admin Zahlungsaktionen. Die gesamte Transaktionsverarbeitung, einschließlich Erfassung, Rückerstattung, Stornierung und Betrugsprüfung, muss über das Authorize.net-Portal oder einen anderen mit Authorize.net verbundenen Dienst durchgeführt werden.</li><li>Teilweise Erfassung oder Rückerstattung. Bestellungen müssen zu diesem Zeitpunkt erfasst, storniert oder vollständig erstattet werden.</li></ul><p></p><p><br /></p><p>Mit Ausnahme von Shopware Cloud hoffen wir, diese im Laufe der Zeit je nach Bedarf und Gelegenheit anzugehen.</p>","installationManual":"<p>1. Wenn Sie noch kein Authorize.net-Händlerkonto haben, melden Sie sich zuerst an. Dies beinhaltet einen Genehmigungs- und Bonitätsprüfungsprozess. Mit der Nutzung von Authorize.net-Zahlungsdiensten sind Gebühren verbunden. Sie können sich hier anmelden: http://reseller.authorize.net/application/?resellerId=24716</p><p><br /></p><p>2. Kaufen Sie diese Erweiterung im Shopware Store.</p><p><br /></p><p>3. Installieren und aktivieren Sie die Erweiterung mit dem Erweiterungsmanager. Gehen Sie zu Admin &gt; Erweiterungen &gt; Meine Erweiterungen, suchen Sie nach \"Authorize.Net Payments\" und klicken Sie auf \"App installieren\".</p><p><br /></p><p>4. Klicken Sie auf der Seite \"Meine Erweiterungen\" auf das Menü (...) auf der rechten Seite der App \"Authorize.Net Payments\" und klicken Sie auf \"Konfiguration\".</p><p><br /></p><p>5. Geben Sie Ihre Authorize.net-Kontoanmeldeinformationen ein und klicken Sie dann auf die Schaltfläche \"Informationen überprüfen und Webhooks installieren (erforderlich)\". Dadurch erfahren Sie, ob die Anmeldeinformationen gültig sind oder nicht, und initialisiert die Transaktionssynchronisierung über Webhooks. Jedes Mal, wenn Sie Authorize.Net-Kontodaten oder Ihre Shopware-Shop-URL ändern, müssen Sie diese Schaltfläche erneut anklicken.</p><p><br /></p><p>Jede Einstellung enthält zusätzliche Informationen im blauen „Hilfe“-Symbol. Klicken Sie auf das Symbol, um mehr über die Einstellung zu erfahren.</p>","version":"1.0.5","changelog":[{"version":"1.0.5","text":"<p>Fixed distributed JS.</p>","creationDate":{"date":"2021-08-23 15:32:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Fixed payment form actions not working in subfolders.</p>","creationDate":{"date":"2021-07-27 15:36:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Set payment frame minimum height.</p>","creationDate":{"date":"2021-07-26 22:18:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Fixed checkout token error handling.</p>","creationDate":{"date":"2021-07-23 14:46:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Improved error messaging.</p><p>Fixed distribution JS for admin and storefront.</p><p>Fixed missing vendor session cookie declaration.</p>","creationDate":{"date":"2021-07-22 22:14:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release of Authorize.Net Payments for Shopware by ParadoxLabs</p>","creationDate":{"date":"2021-07-16 15:03:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Parad74935465154","redirectToStore":false,"lowestPriceValue":29}