{"id":13850,"name":"shpclShipcloudApp","code":"shpcl61878897417","lastChange":{"date":"2023-07-18 11:16:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz3mUaS","examplePageUrl":"","moduleKey":"shpclShipcloudApp","creationDate":{"date":"2021-08-13 14:35:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-08-20 10:29:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-08-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-08-24 22:39:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":370,"prefix":"shpcl","name":"shipcloud","website":"//www.shipcloud.io","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod370_SHIPCLOUD_LOGO_Umbruch-128px.png"},"infos":[{"id":24101,"name":"shipcloud App für Shopware 6: Die Versandlösung für DHL, Hermes, UPS, DPD, Deutsche Post...","description":"<p><b>Send</b>&nbsp;- Einfache Erstellung von Versandmarken direkt aus Shopware heraus</p><p><b>Track</b>&nbsp;- Mehr Kundenzufriedenheit durch automatisierte Sendungsverfolgung im eigenen Design</p><p><b>Return</b>&nbsp;- Flexibler Retourenprozess nach Ihren Bedürfnissen</p><h4>shipcloud App für Shopware installieren, bei shipcloud anmelden, API Key eintragen und loslegen!</h4><p>Von Standardversand, Expresslieferung, über die Sendungsverfolgung bis hin zur Retoure - shipcloud unterstützt Sie bei Ihrem kompletten Versandprozess aus Deutschland heraus. Unser Angebot, mit allen angebundenen Versanddienstleistern und Service-Leistungen, steht bislang lediglich Kunden aus Deutschland in vollem Umfang zur Verfügung.&nbsp;Die Nutzung aus anderen Ländern ist unter&nbsp;<a href=\"https://support.shipcloud.io/de/articles/3191054-aus-welchen-landern-kann-ich-shipcloud-nutzen?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">den folgenden Voraussetzungen</a>&nbsp;möglich.&nbsp;</p><p>shipcloud ist der Shipping Service Provider für Shopware und bietet Ihnen eine einfache und einheitliche Schnittstelle zu allen relevanten Versanddienstleistern (<b>DHL, DHL Express, UPS, Deutsche Post, DPD, Hermes, Post AT, Post CH, GLS, GO!, ANGEL, PARCEL.ONE, Asendia, u.v.m.</b>).   Dazu können Sie auch von den&nbsp;attraktiven&nbsp;shipcloud-Versandkonditionen für DHL, UPS und DPD profitieren. Diese Schnittstelle für paketdienstübergreifenden Versand stellt shipcloud in einer Software-as-a-Service Plattform zur Verfügung.</p><p>Dank des shipcloud App für Shopware ist die Integration des shipcloud-Services schneller und damit kostengünstiger als die Anbindung eines einzelnen Paketdienstes. Somit können Sie Ihren Versand direkt aus Ihrem System abwickeln und somit zeitsparend auf unnötige CSV-Uploads und Systemwechsel verzichten.&nbsp;</p><p>Egal, ob kleine Ware oder große Pakete, dank attraktiver Zusatzservices wie Nachnahme, Alterssichtprüfung, Sperrgut u.v.m kommt Ihre Ware mit shipcloud immer sicher bei Ihren Kunden an. Schaffen Sie von Ihrem Shop über die Sendungsverfolgung bis zur Retoure in einem einheitlichen Look-and-feel die perfekte Customer Experience. Starten Sie jetzt mit Ihrem Versand!</p><h2>Die Installation ist ganz einfach</h2><h3>1. Bei shipcloud anmelden</h3><p>Sie haben bereits sehr große Versandmengen oder stehen gerade erst am Anfang? shipcloud hat für Sie das passende Angebot. Entscheiden Sie sich einfach nach der von Ihnen zu erwartenden monatlichen Versandmenge für eines&nbsp;für eines&nbsp;<a href=\"https://www.shipcloud.io/shopware/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">unserer Abonnements</a>&nbsp;und überlegen Sie, mit welchen Versanddienstleistern und über welche Konditionen Sie Ihre Sendungen verschicken wollen.</p><h3>2. Einfach in Shopware integrieren</h3><p>Um gemeinsam mit uns ahead of the pack zu sein, verbinden Sie Ihren Shopware-Online-Shop mit der shipcloud App und versenden Ihre Pakete einfach und unkompliziert mit&nbsp;<a href=\"https://www.shipcloud.io/paketdienste/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">den wesentlichen Versanddienstleistern</a>.&nbsp;</p><h3>3. Gleich loslegen und versenden</h3><p>Nach Ihrer Anmeldung sind in allen Abonnements sofort die Versanddienstleister DHL, UPS und DPD über unsere Konditionen für Sie verfügbar. Für die Verwendung weiterer Versanddienstleister oder für das Hinterlegen Ihrer eigenen Versanddienstleisterverträge, wenden Sie sich bitte nach Ihrer Anmeldung an unser Support Team unter support@shipcloud.io.</p><h2>Shopware-Kunden berichten über shipcloud</h2><p>“shipcloud stellt eine einheitliche, technische Schnittstelle zu verschiedenen Logistikdienstleistern für die Automatisierung des Pack- und Versandprozesses zur Verfügung. Das senkt unsere Implementierungs- und Betriebskosten.“ - sagt Rico Rühmer - Leiter IT und Prozesse bei&nbsp;<a href=\"http://www.rausch.de/\">Rausch</a>. In seiner komplexen IT-Landschaft aus SAP und Shopware hat Rausch Schokolade mit shipcloud&nbsp;<a href=\"https://blog.shipcloud.io/customer-story-rausch/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">die ideale Lösung für den Versand</a>&nbsp;gefunden.&nbsp;</p><p>Weitere begeisterte Kunden finden Sie&nbsp;<a href=\"https://blog.shipcloud.io/?s=shopware&amp;?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">hier</a>.&nbsp;&nbsp;</p>","installationManual":"<h2>Installationsanleitung für shipcloud-App</h2><p></p><p>1.Log Dich als Admin in Deinem Shopware-Shop ein.</p><p></p><p>2.Gehe auf „Einstellungen“ -&gt; „Store“ und suche nach „shipcloud“<br></p><p>3.Wähle die Erweiterung „shipcloud Einfache Erstellung von Versandetiketten - Direkt aus der Shopware Administration“. Achtung, wähle nicht die Erweiterung „shipcloud Connector für Shopware 6“, diese Funktioniert nicht mit der Shopware-Cloud. Die Erweiterung „shipcloud“ funktioniert mit der Shopware-Cloud oder mit einer selbst gehosteten Shopware-Installation.</p><p></p><p>4.Aktiviere die Erweiterung „shipcloud“<br></p><p>5.Klicke rechts auf „…“und dann auf „Konfiguration“:&nbsp; &nbsp; &nbsp;</p><p>6.Trage Deinen shipcloud-API-Key ein. Falls Du die Erweiterung erstmal ausprobieren möchtest, trage dort Deinen Sandbox-API-Key ein. Du kannst später den Sandbox-API-Key durch den Production-API-Key ersetzen.</p><p></p><p>7.Sobald Du einen gültigen shipcloud-API-Key eingetragen hast, kannst Du die übrigen Konfigurationen vornehmen:</p><p></p><p>8.Gehe auf „Bestellungen“ -&gt; „Übersicht“:</p><p></p><p></p>9.Hier kannst Du nun Deine Versandmarken erstellen.&nbsp; &nbsp;&nbsp;","shortDescription":"Von Standardversand, Expresslieferung, über die Sendungsverfolgung bis hin zur Retoure - shipcloud unterstützt Sie bei Ihrem kompletten Versandprozess aus Deutschland heraus.","highlights":"Versandmarken direkt aus Shopware: Einheitliches Erstellen Ihrer Versandetiketten direkt aus Ihrem Shopware-Backend\nOptimierte Versandkosten: Den eigenen Versanddienstleister-Vertrag nutzen oder über shipcloud-Konditionen versenden\nIntegrierte Sendungsverfolgung, auch im Kundenkonto: Dank Tracking-Seite und automatisierten Benachrichtigungs-Emails in Ihrem Shop-Design\nEinfaches Retourenmanagement: Zu jeder Sendung die passende Retourenmarke, Ihr eigenes Retourenportal oder die mobile QR-Code Retoure von DHL \nExzellenter Service: shipcloud übernimmt alle Updates und Service-Erweiterungen der von Ihnen genutzten Versanddienstleister","features":"Erstellen Sie Versandmarken für alle relevanten Versanddienstleister (DHL, DHL Express, UPS, Deutsche Post, DPD, Hermes, Post AT, Post CH, GLS, GO!, Cargo International, ANGEL Last Mile, PARCEL.ONE, Asendia,  u.v.m.).\nDen passenden Retourenschein direkt mit erstellen und drucken oder dem Kunden auf Wunsch bequem per E-Mail zusenden.\nPer Stapelverarbeitung beliebig viele Etiketten gleichzeitig erstellen.\nAutomatische Berechnung des Versandgewichts (pauschales Versandgewicht ebenfalls möglich).\nBringen Sie Ihren eigenen Versanddienstleister-Vertrag mit und nutzen ihn unkompliziert weiter. Oder nutzen Sie die shipcloud Konditionen, bei Versanddienstleistern für die Sie keinen Vertrag haben.\nVerfolgen Sie Ihre Sendungen im Shopware Backend über die integrierte Sendungsverfolgung. Durch die automatische Hinterlegung der Trackingcodes in den Bestelldetails und die übersichtliche Darstellung für alle Versanddienstleister identifizieren Sie so schnell Problemfälle und behalten Sie Ihre Kosten im Blick.\nSendungsverfolgung auch im Kundenkonto - so wissen Ihre Kunden immer, wo ihre Bestellung ist und erhalten weniger Supportanfragen.\nImmer auf dem Laufenden dank Status-E-Mails: shipcloud benachrichtigt Sie bzw. Ihre Kunden per E-Mail, wenn es ein Update zu einer Sendung gibt.\nKonfigurieren Sie die Größe der Versandmarken, je nach Ihrem Bedarf.\nAbholaufträge direkt aus dem Shopware Backend erstellen und Abholzeitfenster für Expresslieferungen definieren.\nDas Retourenportal von shipcloud: Damit können Ihre Kunden ein Rücksendeetikett einfach selbst erstellen - und zwar genau dann, wenn es gebraucht wird. Schicken Sie Ihren persönlichen Link des Retourenportals in Ihrem Shop-Design einfach an Ihren Kunden. So sparen Sie Zeit und Kosten durch den reduzierten Arbeitsaufwand und wissen zudem immer genau, wann es zu einer Retoure kommt. Und das alles auch, wenn Sie Ihren Versand bislang anders organisieren."},{"id":24102,"name":"shipcloud app for Shopware 6: The shipping solution for DHL, Hermes, UPS, DPD, Deutsche Post...","description":"<p><b>Send</b>&nbsp;- Easy creation of shipping labels directly from Shopware</p><p><b>Track</b>&nbsp;- More customer satisfaction through automated tracking and tracing in your own design</p><p><b>Return&nbsp;</b>- Flexible returns process according to your needs</p><p><b>#Install shipcloud app for Shopware, sign up for shipcloud, enter your API key and get started!&nbsp;</b></p><p>From standard shipping, express delivery, tracking to returns - shipcloud supports you with your complete shipping process out of Germany. Our offer, with all connected carriers and services, is so far only available to customers from Germany in full. Shipping from other countries is possible&nbsp;<a href=\"https://support.shipcloud.io/en/articles/3191054-from-which-countries-can-i-use-shipcloud?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=shopware6-connector\">under the following conditions</a>.</p><p>With the shipcloud app for Shopware you have access to all relevant carriers (DHL, DHL Express, UPS, Deutsche Post, DPD, Hermes, Post AT, Post CH, GLS, GO!, ANGEL, PARCEL.ONE, Asendia and many more).&nbsp;You can also benefit from the attractive shipcloud shipping conditions for DHL, UPS and DPD. shipcloud provides this in a simple and uniform interface through a Software-as-a-Service platform.&nbsp;</p><p>&nbsp;Use the shipcloud app for Shopware to integrate all at once and therefore faster and more cost-effective than connecting&nbsp; single carriers. This means you can handle your shipping directly from your system and thus save time by avoiding unnecessary CSV uploads and system changes.Whether small goods or large parcels, thanks to attractive additional services such as cash on delivery or age verification, your goods will always be delivered safely to your customers with shipcloud. Start your shipping now!</p><h2>The installation is easy</h2><h3>1. Sign in for shipcloud</h3><p>Do you already have very large numbers of shipments or are you just starting now? shipcloud has the right offer for you. Simply choose one of&nbsp;<a href=\"https://www.shipcloud.io/shopware/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=shopware6-connector\">our subscriptions</a>&nbsp;based on your expected monthly shipping volume and consider which carriers and business rates you want to use.&nbsp;</p><h3>2. Easily integrate with Shopware</h3><p>To be ahead of the pack together with us, connect your Shopware online shop with the shipcloud connector and send your packages easily and uncomplicated with the&nbsp;<a href=\"https://www.shipcloud.io/en/carriers/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=shopware6-connector\">relevant carriers</a>.&nbsp;</p><h3>3. Start right away and ship!</h3><p>After registering, the carriers DHL, UPS and DPD are immediately available for you in all subscriptions via our business rates. If you would like to use other carriers or integrate your own carrier accounts, please contact our support team at&nbsp;<a href=\"https://shipcloud.io/\" target=\"_blank\" rel=\"noreferrer noopener\">support@shipcloud.io</a>&nbsp;after your registration.</p>","installationManual":"","shortDescription":"From standard shipping, express delivery, tracking to returns - shipcloud supports you with your complete shipping process out of Germany. You have access to all relevant carriers.","highlights":"Uniform label creation: Create shipping labels for all carriers uniformly and directly from Shopware.\nOptimized shipping costs: Use shipcloud conditions or your own.\nAlways know where your shipment is: Thanks to an individualized tracking page and automated notification Emails in your store design.\nSimple returns management: Create the respective return label for each shipment, build your own returns portal or use the mobile QR code returns from DHL via shipcloud.\nExcellent service: shipcloud takes care of all updates and service enhancements of the carriers you use and thus keeps all integrations up to date.","features":"Create uniform shipping labels for all relevant carriers (DHL, DHL Express, UPS, Deutsche Post, DPD, Hermes, Post AT, Post CH, GLS, GO!, Cargo International, ANGEL Last Mile, PARCEL.ONE, Asendia and many more).\nGenerate and print the matching returns label directly or send it to you customer by email on request\nCreate as many labels as you like using batch processing\nAutomatic calculation of the shipping weight /flate rate shipping weight also possible\nBring your own shipping service contract and keep using it easily or use the shipcloud conditions, with shipping service providers for which you have no contract\nTrack your shipments in the Shopware Backend. By automatically storing tracking codes in the order details and clearly displaying them for all shipping service providers, you can quickly identify problem cases and keep an eye on your costs\nTracking also in MyAccount section: So your customers always know where their order is and receive fewer support requests\nAlways up to date thanks to status emails: shipcloud will notify you or your customers via email if there is an update to a shipment\nSet your shipping label size according to your needs\nPick up time window for express deliveries\nReturn portal: Design your portal in your shop design and leave to your customer the choice with which parcel service he would like to return. You can also use the returns portal with your own returns conditions and also if the outbound delivery was not created via shipcloud."}],"addons":["isAppContestParticipant"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163949,"bookingKey":"shpcl61878897417","bookingText":"shipcloud app for Shopware: The shipping solution for DHL, Hermes, UPS, DPD, Deutsche Post...","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptGZmBE","preview":true,"priority":0,"id":70843},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJn3Dtt","preview":false,"priority":0,"id":70842},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php54K4wY","preview":false,"priority":0,"id":70997},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpohvEi3","preview":false,"priority":0,"id":70998}],"comments":[{"authorName":"Jan Hilmer","text":"Weder die Erstellung der Versandmarken noch der automatische Versand der Trackingmails funktioniert.\nVersandmarken müssen manuell über das Shipcloud Portal erstellt werden.\nDer Support schiebt die Schuld auf Shopware.","headline":"Erweiterung bietet keinen Mehrwert","creationDate":{"date":"2023-01-29 18:21:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2}],"ratingAverage":2,"label":"shipcloud App für Shopware 6: Die Versandlösung für DHL, Hermes, UPS, DPD, Deutsche Post...","description":"<p><b>Send</b> - Einfache Erstellung von Versandmarken direkt aus Shopware heraus</p><p><b>Track</b> - Mehr Kundenzufriedenheit durch automatisierte Sendungsverfolgung im eigenen Design</p><p><b>Return</b> - Flexibler Retourenprozess nach Ihren Bedürfnissen</p><h4>shipcloud App für Shopware installieren, bei shipcloud anmelden, API Key eintragen und loslegen!</h4><p>Von Standardversand, Expresslieferung, über die Sendungsverfolgung bis hin zur Retoure - shipcloud unterstützt Sie bei Ihrem kompletten Versandprozess aus Deutschland heraus. Unser Angebot, mit allen angebundenen Versanddienstleistern und Service-Leistungen, steht bislang lediglich Kunden aus Deutschland in vollem Umfang zur Verfügung. Die Nutzung aus anderen Ländern ist unter <a href=\"https://support.shipcloud.io/de/articles/3191054-aus-welchen-landern-kann-ich-shipcloud-nutzen?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">den folgenden Voraussetzungen</a> möglich. </p><p>shipcloud ist der Shipping Service Provider für Shopware und bietet Ihnen eine einfache und einheitliche Schnittstelle zu allen relevanten Versanddienstleistern (<b>DHL, DHL Express, UPS, Deutsche Post, DPD, Hermes, Post AT, Post CH, GLS, GO!, ANGEL, PARCEL.ONE, Asendia, u.v.m.</b>).   Dazu können Sie auch von den attraktiven shipcloud-Versandkonditionen für DHL, UPS und DPD profitieren. Diese Schnittstelle für paketdienstübergreifenden Versand stellt shipcloud in einer Software-as-a-Service Plattform zur Verfügung.</p><p>Dank des shipcloud App für Shopware ist die Integration des shipcloud-Services schneller und damit kostengünstiger als die Anbindung eines einzelnen Paketdienstes. Somit können Sie Ihren Versand direkt aus Ihrem System abwickeln und somit zeitsparend auf unnötige CSV-Uploads und Systemwechsel verzichten. </p><p>Egal, ob kleine Ware oder große Pakete, dank attraktiver Zusatzservices wie Nachnahme, Alterssichtprüfung, Sperrgut u.v.m kommt Ihre Ware mit shipcloud immer sicher bei Ihren Kunden an. Schaffen Sie von Ihrem Shop über die Sendungsverfolgung bis zur Retoure in einem einheitlichen Look-and-feel die perfekte Customer Experience. Starten Sie jetzt mit Ihrem Versand!</p><h2>Die Installation ist ganz einfach</h2><h3>1. Bei shipcloud anmelden</h3><p>Sie haben bereits sehr große Versandmengen oder stehen gerade erst am Anfang? shipcloud hat für Sie das passende Angebot. Entscheiden Sie sich einfach nach der von Ihnen zu erwartenden monatlichen Versandmenge für eines für eines <a href=\"https://www.shipcloud.io/shopware/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">unserer Abonnements</a> und überlegen Sie, mit welchen Versanddienstleistern und über welche Konditionen Sie Ihre Sendungen verschicken wollen.</p><h3>2. Einfach in Shopware integrieren</h3><p>Um gemeinsam mit uns ahead of the pack zu sein, verbinden Sie Ihren Shopware-Online-Shop mit der shipcloud App und versenden Ihre Pakete einfach und unkompliziert mit <a href=\"https://www.shipcloud.io/paketdienste/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">den wesentlichen Versanddienstleistern</a>. </p><h3>3. Gleich loslegen und versenden</h3><p>Nach Ihrer Anmeldung sind in allen Abonnements sofort die Versanddienstleister DHL, UPS und DPD über unsere Konditionen für Sie verfügbar. Für die Verwendung weiterer Versanddienstleister oder für das Hinterlegen Ihrer eigenen Versanddienstleisterverträge, wenden Sie sich bitte nach Ihrer Anmeldung an unser Support Team unter support@shipcloud.io.</p><h2>Shopware-Kunden berichten über shipcloud</h2><p>“shipcloud stellt eine einheitliche, technische Schnittstelle zu verschiedenen Logistikdienstleistern für die Automatisierung des Pack- und Versandprozesses zur Verfügung. Das senkt unsere Implementierungs- und Betriebskosten.“ - sagt Rico Rühmer - Leiter IT und Prozesse bei <a href=\"http://www.rausch.de/\">Rausch</a>. In seiner komplexen IT-Landschaft aus SAP und Shopware hat Rausch Schokolade mit shipcloud <a href=\"https://blog.shipcloud.io/customer-story-rausch/?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">die ideale Lösung für den Versand</a> gefunden. </p><p>Weitere begeisterte Kunden finden Sie <a href=\"https://blog.shipcloud.io/?s=shopware&amp;?utm_source=shopware&amp;utm_medium=partner&amp;utm_campaign=app\">hier</a>.  </p>","installationManual":"<h2>Installationsanleitung für shipcloud-App</h2><p></p><p>1.Log Dich als Admin in Deinem Shopware-Shop ein.</p><p></p><p>2.Gehe auf „Einstellungen“ -&gt; „Store“ und suche nach „shipcloud“<br /></p><p>3.Wähle die Erweiterung „shipcloud Einfache Erstellung von Versandetiketten - Direkt aus der Shopware Administration“. Achtung, wähle nicht die Erweiterung „shipcloud Connector für Shopware 6“, diese Funktioniert nicht mit der Shopware-Cloud. Die Erweiterung „shipcloud“ funktioniert mit der Shopware-Cloud oder mit einer selbst gehosteten Shopware-Installation.</p><p></p><p>4.Aktiviere die Erweiterung „shipcloud“<br /></p><p>5.Klicke rechts auf „…“und dann auf „Konfiguration“:     </p><p>6.Trage Deinen shipcloud-API-Key ein. Falls Du die Erweiterung erstmal ausprobieren möchtest, trage dort Deinen Sandbox-API-Key ein. Du kannst später den Sandbox-API-Key durch den Production-API-Key ersetzen.</p><p></p><p>7.Sobald Du einen gültigen shipcloud-API-Key eingetragen hast, kannst Du die übrigen Konfigurationen vornehmen:</p><p></p><p>8.Gehe auf „Bestellungen“ -&gt; „Übersicht“:</p><p></p><p></p>9.Hier kannst Du nun Deine Versandmarken erstellen.    ","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p>First version of the shipcloud App</p>","creationDate":{"date":"2021-08-13 14:41:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=shpcl61878897417","redirectToStore":false,"lowestPriceValue":0}