{"id":13887,"name":"LenzPlatformRegulations","code":"lenz982874098839","lastChange":{"date":"2023-07-18 11:16:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEYvutv","examplePageUrl":"","moduleKey":"LenzPlatformRegulations","creationDate":{"date":"2021-08-20 15:08:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-09-08 13:47:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-03-18 14:18:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":245,"prefix":"lenz","name":"LENZ eBusiness GmbH","website":"//lenz-ebusiness.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod245_scs-hersteller-logo.png"},"infos":[{"id":24171,"name":"Rechtliche Angaben (CLP, Biozid, Elektro, Batterie, Lebensmittel, Spielzeug)","description":"<p class=\"MsoNormal\">Unsere App „Rechtliche Angaben“ vereint verschiedene rechtliche Grundlagen in einer App und unterstützt Dich bei der Darstellung in Deinem Shop.</p><p class=\"MsoNormal\">Du kannst in der Konfiguration der App die rechtliche Vorgabe, die Du benötigst aktivieren. Die Felder für dieses Vorgabe werden dann in den Produktdetails eingeblendet.&nbsp;Zusätzlich kannst Du die Angaben im Warenkorb anzeigen lassen.&nbsp;</p><p class=\"MsoNormal\">Im Folgenden werden die einzelnen Konfigurationsmöglichkeiten zu den Vorgaben kurz erläutert.</p><p class=\"MsoNormal\"><b>CLP Verordnungen</b><br></p><p class=\"MsoNormal\">Du hast die Möglichkeit im Backend in den Produktdetails die jeweiligen EUH-, H- &amp; P-Sätze, Signalwörter und Gefahrenpiktogramme anzugeben. Sind die Felder beschrieben bzw wurde eine Auswahl getroffen, werden die Hinweise im Frontend in den Produktdetails angezeigt. Die EUH-, H- und P-Sätze müssen händisch eingegeben werden. Die Signalwörter und Gefahrenpiktogramme sind angelegt und können aktiviert werden.&nbsp;</p><p class=\"MsoNormal\">Folgende Felder sind enthalten:</p><p></p><ul><li>EUH-Sätze</li><li>H-Sätze</li><li>P-Sätze</li><li>Signalwörter</li><li>Gefahrenpiktogramme</li></ul><b>Elektroverordnungen</b><br><p></p><p>In der Konfiguration der App kannst Du&nbsp; Deine WEEE-Nr. angeben. Wenn Du nun die Anzeige der WEEE-Nr. in den Produktdetails im Backend aktivierst, wird Deine WEEE-Nr. im Frontend in den Produktdetails angezeigt.</p><p>Folgende Felder sind enthalten:</p><p></p><ul><li>Deine WEEE-Nr.&nbsp;</li></ul><p></p><p><b>Biozidverordnung</b></p><p>Du kannst in den Produktdetails im Backend für jeden betroffenen Artikel die Anzeige des Satzes: „Biozidprodukte vorsichtig verwenden. Vor Gebrauch stets Etikett und Produktinformationen lesen“ aktivieren. Der Satz wird anschließend im Frontend in den Produktdetails angezeigt.</p><p><b>Pflanzenschutzverordnung</b></p><p>Du kannst in den Produktdetails im Backend für jeden betroffenen Artikel die Anzeige des Satzes: \"Hinweis: vor Verwendung stets Etikett und Produktinformationen lesen. Warnhinweise und Symbole beachten.\" aktivieren. Der Satz wird anschließend im Frontend unter den Produktdetails angezeigt.</p><p class=\"MsoNormal\"><b>Batterieverordnung</b></p><p class=\"MsoNormal\">Der Hinweis zur Entsorgung von Batterien kann nun einfach im Backend pro Artikel gepflegt werden. In der Konfiguration der App musst Du die URL zu deiner Seite mit dem „Hinweis zur Batterieentsorgung“ hinterlegen. Wenn Du nun in den Produktdetails die Anzeige des Hinweis aktivierst, wird im Frontend in den Produktdetails folgender Hinweis erscheinen: „Zur Entsorgung der Batterien beachten Sie bitte die Hinweise zur Batterieentsorgung“. Über die Verlinkung des Satzes gelangt Dein Kunde direkt zu Deiner Seite mit dem Hinweis zur Batterieentsorgung</p><p class=\"MsoNormal\">Folgendes Feld ist enthalten:</p><p></p><ul><li>Link zu weiteren Informationen zur Batterie-Entsorgung</li></ul><b>Spielzeugverordnung</b><p></p><p>Entscheide welcher passende Warnhinweis zu Deinem Artikel im Shop angezeigt werden soll. Du kannst im Backend in den Produktdetails zwischen verschiedenen Hinweisen wählen. Nach der Auswahl werden sie im Frontend in den Produktdetails angezeigt. Folgende Warnhinweise sind in der App enthalten:<br></p><p></p><ul><li>Spielzeugverordnung: Achtung! Für Kinder unter 36 Monaten nicht geeignet. Erstickungsgefahr wergen verschluckbarer Kleinteile; Warnung! Plastiktüten können gefährlich sein. Bitte von Kindern fernhalten. Erstickungsgefahr!; Benutzung nur unter Aufsicht von Erwachsenen</li></ul><p></p><b>Energieverbrauch-Kennzeichnungspflicht</b><br><p>Du kannst im Backend in den Produktdetails wählen welches Energielabel für Dein Produkt verwendet wird. Das alte Energielabel oder das Neue das seit März 2021 gilt. In einer weiteren Checkbox kannst Du dann die Klasse auswählen, die für Deinen Artikel gilt. Die Energieklasse wird anschließend im Frontend in den Produktdetails angezeigt.</p><p>Folgende Felder sind enthalten:</p><p></p><ul><li>Energieeffizienskala: Neu - ab März 2021 (A-G); Alt – bis März 2021 (A+++-D)<br></li><li>Energieeffiziensklasse: A+++, A++, A+, A, B, C, D, G<br></li></ul><b>Bio-Produkte<br></b><p></p><p>Beim Verkauf von Bioprodukten musst Du den Code der Bio-Kontrollstelle in Deinem Shop anzeigen. In der Konfiguration der App kannst Du den Code der Bio-Kontrollstelle angeben und anschließend in den Produktdetails die Anzeige aktivieren. Der Code erscheint in Frontend in den Produktdetails der Artikel.</p><p>Folgendes Feld ist enthalten:</p><p></p><ul><li>Code der Bio-Kontrollstelle</li></ul><b>Lebensmittel</b><br><p></p><p>Wenn Du Lebensmittel über Deinen Shop vertreibst, bist Du verpflichtet Deine Kunden genau über Deine Produkte zu informieren. Unsere App legt Zusatzfelder in den Produktdetails an in denen Du die Angaben einfach eintragen kannst. Die Angaben werden anschließend im Frontend in den Produktdetails angezeigt. Folgende Felder sind enthalten:<br></p><p></p><ul><li>Brennwert</li><li>Fett</li><li>davon gesättigte Fettsäuren</li><li>einfach gesättigte Fettsäuren</li><li>mehrfach ungesättigte Fettsäuren</li><li>Kohlenhydrate</li><li>davon Zucker</li><li>mehrwertige Alkohole</li><li>Stärke</li><li>Ballaststoffe</li><li>Eiweiß</li><li>Salz</li><li>Vitamine und Mineralstoffe</li><li>Zutaten</li><li>Allergien und Unverträglichkeiten</li><li>Herkunftsland</li><li>Lebensmittelunternehmern und Anschriften anzeigen</li><li>Lebensmittelunternehmer und Anschrift</li><li>Alkoholgehalt</li><li>Restsüße</li><li>Säuregehalt</li></ul>Die Felder für die Lebensmittelunternehmen und die dazugehörige Adresse kannst Du zum Einen in der App-Konfiguration ausfüllen, wenn Du beispielsweise nur einen Lebensmittelunternehmer führst. Zum Anderen kannst Du aktivieren, dass diese Felder auch in den Produktdetails erscheinen sollen, wenn Du zum Beispiel mehrere Lebensmittelunternehmen führst.<p>Bitte informiere Dich vor Kauf der App, ob die App auch die Anforderungen für Deinen Shop erfüllt. Die App ersetzt keine rechtliche Beratung und stellt nur eine Hilfe bei der Umsetzung der Verordnung dar.<br></p><h2>Weitere Informationen</h2><p><b>Allgemein&nbsp;<br></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der Apps nicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können.&nbsp;</p><p><b>Kompatibilität<br></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der App-Beschreibung an. <br>Wir können die Kompatibilität unserer Apps zu Apps anderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angeboten Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support&nbsp;<br></b>Wir prüfen ob der angegebene Fehler von unserer App verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unserer App vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion&nbsp;<br></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unsere App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicherzugehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen&nbsp;<br></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unsere App, die in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion?&nbsp;<a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"nooper\">Dann teile uns Deinen Featurewunsch mit.</a></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur&nbsp;<a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"nooper\">Newsletter Anmeldung</a>.<br>Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt.&nbsp;","installationManual":"<ol><li>Installieren</li><li>Aktivieren</li><li>Die benötigten Felder aktivieren und die Werte hinterlegen.&nbsp;</li><li>Fertig.&nbsp;</li></ol>","shortDescription":"Unsere App „Rechtliche Angaben“ vereint viele verschiedene rechtliche Grundlagen in einer App und unterstützt Dich bei der Darstellung in Deinem Shop.","highlights":"Rechtliche Vorgaben in einer App vereint\nDie Angaben werden in den Artikeldetails dargestellt\nDie Verordnungen können einzeln aktiviert werden\nZusätzlich können die Angaben im Warenkorb angezeigt werden","features":"CLP Verordnung\nElektroverordnung\nBiozidverordnung\nPflanzenschutzverordnung\nSpielzeugverordnung\nEnergieverbrauch-Kennzeichnungspflicht\nBio-Produkte\nLebensmittel-Angaben"},{"id":24172,"name":"Legal Requirements","description":"<p>Our app \"Legal Requirements\" combines various legal principles in one app and supports you in the presentation in your shop.</p><p>You can activate the legal default you need in the configuration of the app. The fields for this default are then displayed in the product details.&nbsp;In addition, you can view the information in the shopping cart.&nbsp;<br></p><p>The individual configuration options for the defaults are briefly explained below.<br></p><p><b>CLP regulations</b><br></p><p>You have the option of specifying the respective EUH, H &amp; P phrases, signal words and hazard pictograms in the backend in the product details. Once the fields have been described or a selection has been made, the information is displayed in the front end in the product details.&nbsp;The EUH-, H- and P-phrases must be entered manually. The signal words and hazard pictograms are created and can be activated.</p><p>The following fields are included:<br></p><p></p><ul><li>EUH-phrases</li><li>H-phrases</li><li>P-phrases</li><li>signal words</li><li>hazard pictograms</li></ul><p><b>Electrical regulations</b></p><p>In the configuration of the plug-in, you can enter your WEEE-No. If you now activate the display of the WEEE-No. in the product details in the backend, your WEEE-No. will be displayed in the product details in the frontend.</p><p>The following fields are included:</p><p></p><ul><li>your WEEE number</li></ul><p><b>Biocide Regulation</b></p><p>You can activate the display of the sentence: \"Use biocidal products carefully. Always read the label and product information before use\". The sentence is then displayed in the front end in the product details.<br></p><p><b>Plant Protection Regulations</b></p><p>You can activate the display of the sentence: \"Note: Always read the label and product information before use. Observe warnings and symbols\". The sentence is then displayed in the frontend under the product details.</p><p><b>Battery ordinance</b></p><p>The note on the disposal of batteries can now be easily maintained per article in the backend. In the configuration of the app, you must store the URL to your page with the \"Note on battery disposal\". If you now activate the display of the note in the product details, the following note will appear in the frontend in the product details: \"For the disposal of batteries, please observe the notes on battery disposal\". The linking of the sentence takes your customer directly to your page with the note on battery disposal.</p><p>The following field is included:</p><p></p><ul><li>Link to further information on battery disposal</li></ul><p></p><p><b>Toy regulation</b></p><p>Decide which warning notice should be displayed for your article in the shop. You can choose between different warnings in the product details in the backend. After the selection, they are displayed in the frontend in the product details. The following warnings are included in the app:</p><p></p><ul><li>Toy regulation: Caution! Not suitable for children under 36 months. Choking hazard due to small parts that may be swallowed; Warning! Plastic bags can be dangerous. Please keep away from children. Danger of suffocation; Use only under adult supervision.</li></ul><p><b>Energy consumption labelling obligation</b></p><p>You can choose which energy label is used for your product in the backend in the product details. The old energy label or the new one that has been valid since March 2021. In another checkbox, you can then select the class that applies to your item. The energy class is then displayed in the front end in the product details.</p><p>The following fields are included:</p><p></p><ul><li>Energy efficiency scale: new - from march 2021 (A-G); old - till march 2021 (A+++ - D)&nbsp;</li><li>Energy efficiency class: A+++, A++, A+, A, B, C, D, G</li></ul><p><b>Organic products</b></p><p>When selling organic products, you must display the code of the organic inspection body in your shop. You can enter the code of the organic inspection body in the configuration of the plug-in and then activate the display in the product details. The code appears in Frontend in the product details of the articles.</p><p>The following field is included:</p><p></p><ul><li>Organic inspection body code<br></li></ul><b>foods</b><br>If you sell food via your shop, you are obliged to inform your customers exactly about your products. Our app creates additional fields in the product details where you can easily enter the information. The information is then displayed in the front end in the product details. The following fields are included:<p></p><ul><li>caloric value</li><li>fat</li><li>fatty acids<br></li><li>&nbsp;monounsaturated fatty acids</li><li>polyunsaturated fatty acids</li><li>carbohydrates</li><li>thereof sugar<br></li><li>alcohols</li><li>starch</li><li>roughage</li><li>protein</li><li>salt</li><li>vitamins and minerals</li><li>ingredients</li><li>allergies and cases of incompatibility</li><li>country of origin</li><li>alcohol concentration</li><li>residual sugar</li><li>acidity</li></ul>You can fill in the fields for the food businesses and the corresponding address in the plug-in configuration, for example, if you only have one food business. On the other hand, you can activate that these fields should also appear in the product details if, for example, you manage several food businesses.<p></p><p><br></p><p></p><p>Before purchasing the plug-in, please check whether it meets the requirements for your shop. The app does not replace legal advice and is only an aid in implementing the regulation.</p><p></p><p></p><p></p><p></p><p></p>","installationManual":"<ol><li>Install</li><li>Activate</li><li>Enable or set the necessary fields.&nbsp;</li><li>Finished.&nbsp;</li></ol>","shortDescription":"Our app \"Legal Requirements\" combines various legal principles in one app and supports you in the presentation in your shop. (CLP, Toys, Biocide, etc.)","highlights":"Regulations combined in one app\nThe information is displayed in the item details\nThe regulations can be activated individually","features":"CLP regulations\nElectrical regulations\nBiocide regulation\nBattery ordinance\nToy regulation\nEnergy consumption labelling obligation\nOrganic products\nFoods"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":163922,"bookingKey":"lenz982874098839","bookingText":"","price":495,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":163921,"bookingKey":"lenz982874098839_M","bookingText":"","price":39.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQaAaRy","preview":true,"priority":0,"id":91310},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdNTkRt","preview":false,"priority":0,"id":91311},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpi5F5eE","preview":false,"priority":0,"id":91312},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8vAVmU","preview":false,"priority":0,"id":91313}],"comments":[],"ratingAverage":0,"label":"Rechtliche Angaben (CLP, Biozid, Elektro, Batterie, Lebensmittel, Spielzeug)","description":"<p>Unsere App „Rechtliche Angaben“ vereint verschiedene rechtliche Grundlagen in einer App und unterstützt Dich bei der Darstellung in Deinem Shop.</p><p>Du kannst in der Konfiguration der App die rechtliche Vorgabe, die Du benötigst aktivieren. Die Felder für dieses Vorgabe werden dann in den Produktdetails eingeblendet. Zusätzlich kannst Du die Angaben im Warenkorb anzeigen lassen. </p><p>Im Folgenden werden die einzelnen Konfigurationsmöglichkeiten zu den Vorgaben kurz erläutert.</p><p><b>CLP Verordnungen</b><br /></p><p>Du hast die Möglichkeit im Backend in den Produktdetails die jeweiligen EUH-, H- &amp; P-Sätze, Signalwörter und Gefahrenpiktogramme anzugeben. Sind die Felder beschrieben bzw wurde eine Auswahl getroffen, werden die Hinweise im Frontend in den Produktdetails angezeigt. Die EUH-, H- und P-Sätze müssen händisch eingegeben werden. Die Signalwörter und Gefahrenpiktogramme sind angelegt und können aktiviert werden. </p><p>Folgende Felder sind enthalten:</p><p></p><ul><li>EUH-Sätze</li><li>H-Sätze</li><li>P-Sätze</li><li>Signalwörter</li><li>Gefahrenpiktogramme</li></ul><b>Elektroverordnungen</b><br /><p></p><p>In der Konfiguration der App kannst Du  Deine WEEE-Nr. angeben. Wenn Du nun die Anzeige der WEEE-Nr. in den Produktdetails im Backend aktivierst, wird Deine WEEE-Nr. im Frontend in den Produktdetails angezeigt.</p><p>Folgende Felder sind enthalten:</p><p></p><ul><li>Deine WEEE-Nr. </li></ul><p></p><p><b>Biozidverordnung</b></p><p>Du kannst in den Produktdetails im Backend für jeden betroffenen Artikel die Anzeige des Satzes: „Biozidprodukte vorsichtig verwenden. Vor Gebrauch stets Etikett und Produktinformationen lesen“ aktivieren. Der Satz wird anschließend im Frontend in den Produktdetails angezeigt.</p><p><b>Pflanzenschutzverordnung</b></p><p>Du kannst in den Produktdetails im Backend für jeden betroffenen Artikel die Anzeige des Satzes: \"Hinweis: vor Verwendung stets Etikett und Produktinformationen lesen. Warnhinweise und Symbole beachten.\" aktivieren. Der Satz wird anschließend im Frontend unter den Produktdetails angezeigt.</p><p><b>Batterieverordnung</b></p><p>Der Hinweis zur Entsorgung von Batterien kann nun einfach im Backend pro Artikel gepflegt werden. In der Konfiguration der App musst Du die URL zu deiner Seite mit dem „Hinweis zur Batterieentsorgung“ hinterlegen. Wenn Du nun in den Produktdetails die Anzeige des Hinweis aktivierst, wird im Frontend in den Produktdetails folgender Hinweis erscheinen: „Zur Entsorgung der Batterien beachten Sie bitte die Hinweise zur Batterieentsorgung“. Über die Verlinkung des Satzes gelangt Dein Kunde direkt zu Deiner Seite mit dem Hinweis zur Batterieentsorgung</p><p>Folgendes Feld ist enthalten:</p><p></p><ul><li>Link zu weiteren Informationen zur Batterie-Entsorgung</li></ul><b>Spielzeugverordnung</b><p></p><p>Entscheide welcher passende Warnhinweis zu Deinem Artikel im Shop angezeigt werden soll. Du kannst im Backend in den Produktdetails zwischen verschiedenen Hinweisen wählen. Nach der Auswahl werden sie im Frontend in den Produktdetails angezeigt. Folgende Warnhinweise sind in der App enthalten:<br /></p><p></p><ul><li>Spielzeugverordnung: Achtung! Für Kinder unter 36 Monaten nicht geeignet. Erstickungsgefahr wergen verschluckbarer Kleinteile; Warnung! Plastiktüten können gefährlich sein. Bitte von Kindern fernhalten. Erstickungsgefahr!; Benutzung nur unter Aufsicht von Erwachsenen</li></ul><p></p><b>Energieverbrauch-Kennzeichnungspflicht</b><br /><p>Du kannst im Backend in den Produktdetails wählen welches Energielabel für Dein Produkt verwendet wird. Das alte Energielabel oder das Neue das seit März 2021 gilt. In einer weiteren Checkbox kannst Du dann die Klasse auswählen, die für Deinen Artikel gilt. Die Energieklasse wird anschließend im Frontend in den Produktdetails angezeigt.</p><p>Folgende Felder sind enthalten:</p><p></p><ul><li>Energieeffizienskala: Neu - ab März 2021 (A-G); Alt – bis März 2021 (A+++-D)<br /></li><li>Energieeffiziensklasse: A+++, A++, A+, A, B, C, D, G<br /></li></ul><b>Bio-Produkte<br /></b><p></p><p>Beim Verkauf von Bioprodukten musst Du den Code der Bio-Kontrollstelle in Deinem Shop anzeigen. In der Konfiguration der App kannst Du den Code der Bio-Kontrollstelle angeben und anschließend in den Produktdetails die Anzeige aktivieren. Der Code erscheint in Frontend in den Produktdetails der Artikel.</p><p>Folgendes Feld ist enthalten:</p><p></p><ul><li>Code der Bio-Kontrollstelle</li></ul><b>Lebensmittel</b><br /><p></p><p>Wenn Du Lebensmittel über Deinen Shop vertreibst, bist Du verpflichtet Deine Kunden genau über Deine Produkte zu informieren. Unsere App legt Zusatzfelder in den Produktdetails an in denen Du die Angaben einfach eintragen kannst. Die Angaben werden anschließend im Frontend in den Produktdetails angezeigt. Folgende Felder sind enthalten:<br /></p><p></p><ul><li>Brennwert</li><li>Fett</li><li>davon gesättigte Fettsäuren</li><li>einfach gesättigte Fettsäuren</li><li>mehrfach ungesättigte Fettsäuren</li><li>Kohlenhydrate</li><li>davon Zucker</li><li>mehrwertige Alkohole</li><li>Stärke</li><li>Ballaststoffe</li><li>Eiweiß</li><li>Salz</li><li>Vitamine und Mineralstoffe</li><li>Zutaten</li><li>Allergien und Unverträglichkeiten</li><li>Herkunftsland</li><li>Lebensmittelunternehmern und Anschriften anzeigen</li><li>Lebensmittelunternehmer und Anschrift</li><li>Alkoholgehalt</li><li>Restsüße</li><li>Säuregehalt</li></ul>Die Felder für die Lebensmittelunternehmen und die dazugehörige Adresse kannst Du zum Einen in der App-Konfiguration ausfüllen, wenn Du beispielsweise nur einen Lebensmittelunternehmer führst. Zum Anderen kannst Du aktivieren, dass diese Felder auch in den Produktdetails erscheinen sollen, wenn Du zum Beispiel mehrere Lebensmittelunternehmen führst.<p>Bitte informiere Dich vor Kauf der App, ob die App auch die Anforderungen für Deinen Shop erfüllt. Die App ersetzt keine rechtliche Beratung und stellt nur eine Hilfe bei der Umsetzung der Verordnung dar.<br /></p><h2>Weitere Informationen</h2><p><b>Allgemein <br /></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der Apps nicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können. </p><p><b>Kompatibilität<br /></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der App-Beschreibung an. <br />Wir können die Kompatibilität unserer Apps zu Apps anderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angeboten Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support <br /></b>Wir prüfen ob der angegebene Fehler von unserer App verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unserer App vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion <br /></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unsere App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicherzugehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen <br /></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unsere App, die in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion? <a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"noreferrer noopener\">Dann teile uns Deinen Featurewunsch mit.</a></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur <a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter Anmeldung</a>.<br />Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt. ","installationManual":"<ol><li>Installieren</li><li>Aktivieren</li><li>Die benötigten Felder aktivieren und die Werte hinterlegen. </li><li>Fertig. </li></ol>","version":"5.0.0","changelog":[{"version":"5.0.0","text":"<p>TASK | Added nl_NL translation for storefront.</p><p>BUGFIX | SW 6.5 compatibility.</p>","creationDate":{"date":"2023-06-07 11:00:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>TASK | Fixed typo in translations.</p><p>TASK | Added nl_NL translation for storefront.</p>","creationDate":{"date":"2023-06-07 10:59:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- TASK | Compatibility with Shopware 6.5.</p><p><br /></p><p>Requirements:</p><p>- The plugin now requires at least Shopware version 6.5.0.0.</p><p><b>Note: BEFORE UPDATING TO SHOPWARE 6.5.0.0, deactivate the app, then update, then activate.</b></p>","creationDate":{"date":"2023-04-06 10:25:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>IMPROVEMENT | Plant protection regulation added as an option.</p>","creationDate":{"date":"2022-06-03 11:37:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>BUGFIX | Fixed typos in english translation.</p><p>IMPROVEMENT | Added support for product cms pages.</p>","creationDate":{"date":"2022-04-28 16:33:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>BUGFIX | Corrected clp symbol translations.</p>","creationDate":{"date":"2022-02-25 14:54:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>IMPROVEMENT | Added option to display notices also in cart.</p><p>TASK | Administration blocks changed for compatibility.</p>","creationDate":{"date":"2022-02-24 11:28:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>initial plugin release.</p>","creationDate":{"date":"2021-08-20 16:08:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=lenz982874098839","redirectToStore":false,"lowestPriceValue":39.9}