{"id":13944,"name":"FirebearImportExport","code":"Fireb81914862032","lastChange":{"date":"2023-07-25 16:37:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjS8OUY","examplePageUrl":"","moduleKey":"FirebearImportExport","creationDate":{"date":"2021-09-02 11:10:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-11-04 08:45:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-01-02 10:17:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3270,"prefix":"Fireb","name":"Firebear Studio","website":"//firebearstudio.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3270_Firebear_128.png"},"infos":[{"id":24276,"name":"Verbesserte Import, Export und Massenaktionen","description":"<h2>Die App ist einer <a href=\"https://twitter.com/shopware/status/1461253266914918403?s=21\" target=\"_blank\" rel=\"noreferrer\">der Gewinner des Shopware App Contest!</a>!</h2><p>Die App wird ständig weiterentwickelt, und wir sind auf Ihr Feedback und Ihre Tests angewiesen. Wir sind bereit, Sie bei Bedarf zu unterstützen.</p><p><a href=\"https://vitalyverbitsky.typeform.com/to/MlXqPSFC\" target=\"_blank\" rel=\"noreferrer\">Stimmen Sie für die neuen Funktionen ab und teilen Sie uns Ihre Anforderungen mit</a></p><p>Erfahren Sie, wie wir die Anwendung, die Sie sich gerade ansehen, geplant und gebaut haben.</p><p><a href=\"https://drive.google.com/file/d/14pEWGdCw0cjo0L9QB_nJ0DV3pIKkpQHP/view?usp=sharing\" target=\"_blank\" rel=\"noreferrer\">Laden Sie das Whitepaper herunter</a></p><h2>Was ist Shopware Improved Import</h2><p>Improved Import, Export &amp; Mass Actions ist eine Shopware 6 App, mit der Sie Daten aus Ihrem Shop importieren und exportieren können.</p><p>Sie können Ihren Shopware Produktkatalog in eine einzelne CSV-, XML- oder Excel XLSX-Datei exportieren, mit allen benutzerdefinierten Eigenschaften und lesbaren Werten anstelle von IDs.</p><p>Sie können CSV-, XML-, XLSX-Dateien direkt von FTP/FTPS, wo Ihr Lieferant Dateien hochlädt, oder durch manuelles Hochladen einer Datei in Ihren Shop importieren.</p><p>Mit dem verbesserten Import können Sie Aktualisierungen des Produktkatalogs für Shopware und Exportvorgänge mit dem Scheduler automatisieren, den Sie zu jedem gewünschten Zeitpunkt einrichten können.</p><h2>Aktualisierung im September 2022</h2><ul><li>Sie können jetzt Produktvarianten mit \"product_number\" anstelle von \"product_id\" importieren. Der Produktexport exportiert auch Produktvarianten mit der neuen Spalte \"product_sku\", in der die Nummer des übergeordneten Produkts angegeben ist.</li><li>Der \"Cheapest Price Net\" und der \"Cheapest Price Gross\" können nun zusammen mit den Produkten importiert und exportiert werden.</li><li>Sie können nun bereits gestartete Import- und Exportprofile stoppen. Die Importprofile werden gestoppt, wenn der aktuell importierte Produktstapel beendet ist. Die Exportprofile werden gestoppt, wenn die aktuell exportierte Seite beendet ist.</li></ul><h2>Wie die App funktioniert</h2><p>Die Shopware Import &amp; Export App funktioniert über Shopware 6 API. Wir stellen Ihnen den speziellen Shopware 6 Backend-Bereich zur Verfügung, in dem Sie den Produktkatalog importieren und exportieren können.</p><p>In Ihrem Shopware-Shop erstellen Sie Import- und Exportprofile, in denen Sie Automatisierungsoptionen, Dateitypen, Quellen, aus denen Sie die Dateien hochladen, und die Dateizuordnung definieren.</p><p>Mit dem Mapping-Tool können Sie Spalten aus der zu importierenden Datei mit den Produkteigenschaften von Shopware abgleichen.</p><p>Die Anwendung unterstützt benutzerdefinierte Produkteigenschaften und verwendet tatsächliche Eigenschaftswerte anstelle von IDs. Das heißt, Sie können Produktfarben mit Werten wie \"rot\" oder \"grün\" importieren und Ihre Produkte mit den lesbaren Eigenschaftswerten exportieren.</p><p>Alles in allem ist die Anwendung dazu da, Sie bei Ihrer täglichen Shopware-Datenverwaltungsroutine zu unterstützen, und wir sind immer offen für Ihre Vorschläge.</p><h2>Wie schnell ist die App</h2><p>Die Geschwindigkeit der Import- und Exportvorgänge für Shopware 6 ist stark abhängig von der CPU und dem RAM des Servers.</p><ul><li>Für den Produktimport messen wir Zahlen von 0,1 Sekunden/Produkt bis zu 4 Sekunden/Produkt.</li><li>Für den Produktexport liegen die Zahlen bei 0,01 Sekunden/Produkt.</li></ul><p>Die Verbesserung der Importgeschwindigkeit hat für uns höchste Priorität und wir optimieren die Prozesse ständig.</p><h2>Anwendungsfälle für Ihr Unternehmen</h2><h3>Import von Produktvarianten mit Produktnummer</h3><p>Jetzt können Sie Produkte mit Varianten importieren und Varianten über die Spalte \"product_sku\", die eine Produktnummer enthält, übergeordneten Produkten zuordnen. Sie brauchen den Katalog nicht mehr zu exportieren, um die IDs zu erhalten. Firebear versucht, die Verwendung von IDs an allen möglichen Stellen zu vermeiden.</p><p>Das bedeutet, dass Sie jetzt Produkte direkt aus Ihrem Lager oder von Ihrem Lieferanten importieren können, ohne dass Sie die IDs vorher kennen müssen. Das spart eine Menge Zeit und ermöglicht schnelle Aktualisierungen.</p><h3>Schneller PIM-Dienst</h3><p>Jeder PIM-Dienst ist eine schöne Schnittstelle für Ihre XLSX- oder CSV-Tabellen. Das bedeutet, dass Sie, wenn Sie Tabellen lesen können, direkt mit CSV und XLSX arbeiten können, ohne Hunderte pro Monat zu bezahlen.</p><p>Bearbeiten Sie Produktbeschreibungen, laden Sie neue Bilder hoch, aktualisieren Sie Preise, fügen Sie Mengen hinzu.</p><h3>Schnelle Aktualisierung der Preise oder Mengen</h3><p>Die Anwendung erfordert nicht jedes Mal den Import ALLER Produkteigenschaften. Stattdessen können Sie eine benutzerdefinierte CSV-Datei mit nur wenigen Spalten speichern: productID, price und QTY oder andere Eigenschaften, die Sie häufig aktualisieren.</p><p>Erstellen Sie eine einfache Tabelle, führen Sie die Aktualisierungen durch und importieren Sie sie zurück in Ihr Shopware 6. Das ist ganz einfach.</p><h3>Für Entwicklungsagenturen</h3><p>Wir unterstützen XML-Dateitypen für Produkte und später für Bestellungen und Kunden. Das bedeutet, dass alle Daten mit dem anderen Produkt und System synchronisiert werden können.</p><h3>Verwendung von Excel XLSX-Tabellen</h3><p>Wenn Sie ERP- oder CRM-Systeme verwenden, die auf XLSX-Dateien basieren, können Sie mit der Anwendung Ihren gesamten Katalog nach Excel exportieren. Dann können Sie die Tabellen so bearbeiten, wie es für Sie am bequemsten ist, und sie per CSV-Datei wieder in Ihren Shop hochladen.</p><h3>Bestellungen exportieren</h3><p>Exportieren Sie die Bestellungen, um sie in einer CSV-, XML- oder XLSX-Datei zu bearbeiten und zu verwalten. Stellen Sie sicher, dass Sie über jeden Kauf Rechenschaft ablegen und die Umsatzberichte überall hin übertragen können.</p><h3>Kundensynchronisation mit CRM</h3><p>Exportieren Sie Kunden in Ihr CRM-System. Verwalten Sie die Verkäufe oder neue Kontakte. Importieren Sie neue Kunden, die Sie über andere Kanäle gewonnen haben, in Shopware.</p><h2>Roadmap und weitere Entwicklung</h2><p>Firebear Studio ist auf Import- und Exportlösungen und Integrationen spezialisiert. Deshalb verstehen wir, was Shopbetreiber brauchen.</p><p>Die Anwendung wird zügig weiterentwickelt, um die gängigsten und nützlichsten Funktionen zu integrieren, wie z.B.:</p><ul><li>Import von Bestellungen</li><li>Unterstützung von verschiedenen Sprachen</li><li>Unterstützung von benutzerdefinierten Feldern</li><li>Unterstützung der produktspezifischen Felder</li><li>E-Mail-Benachrichtigungen für Import- und Exportprofile</li><li>Google Sheets-Import und -Export für Shopware 6</li><li>Google Drive-Import und -Export für Shopware 6</li><li>Mapping-Bereich für die Exportprofile</li><li>Import und Export von Shopware 6 Produkt-Tags</li><li>Unterstützung von Wildcards in den importierten Dateinamen</li><li>Unterstützung der Sales Channels für Produktimport und -export</li><li>Unterstützung von Google Drive, OneDrive, Dropbox Import- und Exportquellen</li><li>Unterstützung von erweiterten Preisen und Staffelpreisen, Rabattkampagnen, Bewertungen, Newsletter-Abonnenten im- und exportieren</li></ul><h2>User Guide and installation</h2><ul><li><a href=\"https://firebear.notion.site/App-Installation-d5caa2c17d404bf394fd7845ea22ea82\" target=\"_blank\" rel=\"noreferrer\">Installationsanweisungen</a><br></li><li><a href=\"https://firebear.notion.site/User-Manual-78d30c085bea4d7ea8e6ff2c75311a6b\" target=\"_blank\" rel=\"noreferrer\">Verbessertes Import-Benutzerhandbuch</a><br></li><li><a href=\"https://firebear.notion.site/Sample-Files-2919ae4a0952487faabbb610bd9cdb7c\" target=\"_blank\" rel=\"noreferrer\">Beispiel einer Produktimportdatei in Google Sheets</a><br></li></ul><p>Wir entwickeln auch die beste Import- und Exportlösung für Magento 2. Finden Sie heraus, <a href=\"https://www.trustpilot.com/review/firebearstudio.com\" target=\"_blank\" rel=\"noreferrer\"><b>wie zufrieden unsere Kunden auf Trustpilot sind.</b></a>.</p>\n\n\n","installationManual":"<h2>Laden Sie die Datei MANIFEST.XML NICHT in Ihren Store hoch, wenn Sie versuchen, die App zu installieren. Die App kann nur mit der unten stehenden Anleitung installiert werden.<br></h2><h2>Die Anwendung kann nur über das Administrationspanel Ihres Shops installiert werden</h2><p>1) Loggen Sie sich in das Administrationspanel Ihres Shopware 6 Shops ein (Backend)</p><p>2)&nbsp;Stellen Sie sicher, dass Sie in Ihrem Shopware account unter <b>Einstellungen &gt; System &gt; Shopware Account</b> eingeloggt sind und einen Shop registriert haben</p><p>2) Navigieren Sie zu <b>Erweiterungen &gt; Shop</b> und suchen Sie nach \"Improved Import, Export &amp; Mass Actions</p><p>3) Klicken Sie in den Suchergebnissen auf \"Improved Import, Export &amp; Mass Actions\" (Verbesserter Import, Export &amp; Massenaktionen)</p><p>4) Klicken Sie auf die Schaltfläche \"Erweiterung hinzufügen\" in der oberen rechten Ecke des Bildschirms</p><p>5) Aktivieren Sie alle Kontrollkästchen und klicken Sie auf die Schaltfläche \"Erweiterung abonnieren\".</p><p><br></p><p>Erledigt. Sie können die Anwendung nun verwenden, indem Sie zum Abschnitt <b>Erweiterungen &gt; Verbesserter Import, Export &amp; Massenaktionen</b> gehen.</p><p><br></p><h2>Fehlersuche</h2><p></p><ul><li>Vergewissern Sie sich, dass die URL Ihres Shops in '.env' mit der tatsächlichen URL Ihres Shops übereinstimmt, einschließlich der HTTP- und HTTPS-Protokollpräfixe.</li><li>Leeren Sie Ihren Browser-Cache, wenn Sie Fehler erhalten oder die Seite nicht geladen wird.</li></ul><p></p>","shortDescription":"Importieren und exportieren Sie Produkte und Bestellungen in dem von Ihnen gewünschten Format. Verwenden Sie Excel XLSX, XML, CSV-Dateien. Importieren und exportieren Sie von FTP.","highlights":"Massenhafte Produktaktualisierungen in einer einzigen Datei. Sie müssen nicht mehrere Dateien exportieren. Sie können jede Produkteigenschaft in einer einzigen Tabelle bearbeiten\nSchnelle Aktualisierung von Preis und Menge. Sie müssen nur Produktnummer, Menge und Preis importieren, alle anderen Spalten sind optional.\nKündigen Sie Ihr PIM-Abonnement. Sie können Ihre monatlichen Zahlungen einsparen, wenn Sie mit der Bearbeitung von Excel-Tabellen vertraut sind.\nDie Spaltenzuordnung ermöglicht es Ihnen, die Dateien, die Ihnen Ihre Lieferanten schicken, direkt hochzuladen.\nJeder Teil des Codes ist vollständig durch die Unit-Tests abgedeckt","features":"Import und Export von Produkten und Produkten mit Varianten\nVerwendung der übergeordneten product_number zum Importieren von Varianten anstelle der übergeordneten product_ID\nBestell exportieren\nImport- und Exportkunden\nImport und Export auf FTP und FTPS\nVerwendung eines beliebigen Dateiformats mit CSV, Excel XLSX oder XML\nAutomatisieren Sie den Import und Export mit dem Planer für jeden wiederkehrenden Tag\nSpeichern Sie Import- und Exportprofile für schnellen Zugriff\nImportieren Sie beliebige Dateiformate mit der Mapping-Funktion, die es ermöglicht, verschiedene Spalten mit Shopware-Eigenschaften zu verknüpfen\nImport und Export ALLER Produktdaten in einer einzigen Datei, einschließlich aller benutzerdefinierten Produkteigenschafte"},{"id":24281,"name":"Improved Import, Export & Mass Actions","description":"<h2>The app is one of the <a href=\"https://twitter.com/shopware/status/1461253266914918403?s=21\" target=\"_blank\" rel=\"noreferrer\">winners of Shopware App Contest</a>!</h2><p>The app is being developed constantly, and we are looking for your feedback and testing. We are ready to provide you with any support required.</p><p><a href=\"https://vitalyverbitsky.typeform.com/to/MlXqPSFC\" target=\"_blank\" rel=\"noreferrer\">Vote for new features to include in the development</a></p><p>Learn how we have planned and built the application you are currently looking at.</p><p><a href=\"https://drive.google.com/file/d/14pEWGdCw0cjo0L9QB_nJ0DV3pIKkpQHP/view?usp=sharing\" target=\"_blank\" rel=\"noreferrer\">Download the whitepaper</a></p><h2>What is Shopware improved import</h2><p>Improved Import, Export &amp; Mass Actions is a Shopware 6 application that allows you to import and export data from your store.</p><p>You can export your Shopware products catalog into a single CSV, XML, or Excel XLSX file, with all custom properties and readable values instead of IDs.</p><p>You can import CSV, XML, XLSX files to your store directly from FTP/FTPS where your supplier uploads files, or by manually uploading a file.</p><p>Improved Import allows you to automate product catalog updates for Shopware and export procedures with the scheduler, which you can set up to any convenient time you want.</p><h2>What’s new in September 2022</h2><ul><li>You can now import product variants \"product number\" instead of \"product ID\". Product export will also export product variants with new column \"product_sku\", where the number of the parent product is specified.</li><li>Cheapest price net and cheapest price gross can now be imported and exported along with products.</li><li>You can now stop already started import and exported profiles. The import profiles will be stopped when the currently importing product batch finishes. The export profiles will be stopped when the currently exported page finishes.</li></ul><h2>How the app works</h2><p>The application works via Shopware 6 API. We provide you with the dedicated Shopware 6 backend section where you can import and export product catalog.</p><p>Inside your Shopware store, you create import and export profiles, where you define automation options, file types, sources you upload the files from, and file mapping.</p><p>With the mapping tool, you can match columns from the file you are importing with your Shopware’s product properties.</p><p>The application supports custom product properties and uses actual property values instead of IDs. Meaning you can import product color with values like ‘red’ or ‘green’, and export your products with the readable property values.</p><p>All in all, the application is here to help you manage your daily Shopware data management routine, and we are always open to your suggestions.</p><h2>How fast is the import/export</h2><p>The speed of import and export procedures for Shopware 6 is highly dependent on server CPU &amp; RAM.</p><ul><li>For product import we measure figures starting with 0.1 sec/product up to 4 sec/product.</li><li>For product export the figures are around 0.01 sec/product.</li></ul><p>Improving import speed is one of the top priorities for us and we are constantly optimizing the processes.</p><h2>Use cases for your business</h2><h3>Importing product variants with product number</h3><p>Now you can import products with variants and assign variants to parent products with \"product_sku\" column, which contains a product number. You don't need to export the catalog to get the IDs anymore. Firebear is trying to remove the use of ID from every place possible.</p><p>It means that now, you can import products directly from your warehouse or supplier without the need to know the IDs first. Saving great deal of time, and allowing for quick updates.</p><h3>Сheap and quick PIM service</h3><p>Every PIM service is a nice interface for your XLSX or CSV tables. It means that if you can read tables, you can work with CSV and XLSX directly, without paying hundreds a month.</p><p>Edit product description, upload new images, update prices, add quantity.</p><h3>Quick update of the prices or quantity</h3><p>The application does not require to import ALL product properties every time. Instead you can save a custom CSV with only a few columns: productID, price, and QTY, or any other properties you update often.</p><p>Create a simple table, proceed with the updates, and import it back to your Shopware 6. It is easy.</p><h3>For development agencies</h3><p>We support XML file types for products and later for orders and customers. It means that every piece of data can be synced with the other product and system.</p><h3>Use of Excel XLSX tables</h3><p>If you are using ERP or CRM systems that rely on XLSX files, the application will let you export your whole catalog to Excel. Then you can edit the spreadsheets in the most convenient way for you, and upload it back to your store via CSV file.</p><h3>Export orders</h3><p>Export the orders to edit and manage them inside a CSV, XML, or XLSX file. Make sure you account for every purchase and can transfer the sales reports anywhere you want.</p><h3>Customer sync with CRM</h3><p>Export customers to your CRM system. Manage the sales or new contacts. Import new customers you have acquired via other channels to Shopware.</p><h2>Roadmap and further development</h2><p>Firebear Studio specializes in import and export solutions, and integrations. That's why we understand what store owners need.</p><p>The application will be developed rapidly to include the most common and useful features such as:</p><ul><li>Shopware 6 order import</li><li>Support of different languages</li><li>Support of custom fields</li><li>Email notifications for import and export profiles</li><li>Google Sheets import and export for Shopware 6</li><li>Google Drive import and export for Shopware 6</li><li>Mapping section for the export profiles</li><li>Import and export of Shopware 6 product tags</li><li>Support of wildcards in the imported file names</li><li>Support of the sales channels for product import and export</li><li>Support of Google Drive, OneDrive, Dropbox import and export sources</li><li>Support of advanced prices and tier prices, discount campaigns, reviews, newsletter subscribers import and export</li></ul><h2>User Guide and manuals</h2><ul><li><a href=\"https://firebear.notion.site/App-Installation-d5caa2c17d404bf394fd7845ea22ea82\" target=\"_blank\" rel=\"noreferrer\">Installation</a><br></li><li><a href=\"https://firebear.notion.site/User-Manual-78d30c085bea4d7ea8e6ff2c75311a6b\" target=\"_blank\" rel=\"noreferrer\">Improved Import user Guide</a><br></li><li><a href=\"https://firebear.notion.site/Sample-Files-2919ae4a0952487faabbb610bd9cdb7c\" target=\"_blank\" rel=\"noreferrer\">Sample product import file in Google Sheets</a><br></li></ul><p>We also develop the best Import &amp; Export solution for Magento 2, <a href=\"https://www.trustpilot.com/review/firebearstudio.com\" target=\"_blank\" rel=\"noreferrer\"><b>find out how our customers are happy at Trustpilot</b></a>.</p>\n\n\n","installationManual":"<h2>DO NOT UPLOAD MANIFEST.XML to your store trying to install the app. The app can only be installed by the instruction below.<br></h2><h2>The application can only be installed from your store's administrator panel</h2><p>1) Log into your Shopware 6 store's administrator panel (backend)</p><p>2) Make sure you are logged into your Shopware Account at&nbsp;<b>Settings &gt; System &gt; Shopware Account</b> and registered a store</p><p>3) Navigate to <b>Extensions &gt; Store </b>and search for 'Improved Import, Export &amp; Mass Actions</p><p>4) Click Improved Import, Export &amp; Mass Actions application in the search results</p><p>5) Click 'Add extension' button in the upper-right corner of the screen</p><p>6) Tick in all the checkboxes and click 'Subscribe to extension' button</p><p><br></p><p>Done. You can now use the application by proceeding to <b>Extensions &gt; Improved Import, Export &amp; Mass Actions </b>section.</p><p><br></p><h2>Troubleshooting</h2><p></p><ul><li>Make sure that the URL of your store inside '.env' is the same as the actual URL of your store, including HTTP and HTTPS protocol prefixes.</li><li>Clear your browser cache if you are getting any errors or the page doesn't load.</li></ul><p></p>","shortDescription":"Import and export products and orders in the format you want. Use Excel XLSX, XML, CSV files. Import and export from FTP. Automate import and export tasks, save time and money.","highlights":"Mass product updates in a single file. No need to export multiple files. You can edit every product property in a single table\nQuick price and product quantity updates. You only need to import product number, quantity, and price, all other columns are optional\nCancel your PIM subscription. You can save your monthly payments if you are good with editing Excel tables\nColumn mapping allows you to upload the files your suppliers send to you directly\nEvery piece of code is fully covered with the unit tests","features":"Import and export products and products with variants\nUse parent product_number to import variants instead of parent_ID\nExport orders\nImport and export customers\nImport and export to FTP and FTPS\nUse any file format with CSV, Excel XLSX, or XML\nAutomate import and export using the scheduler for any recurring day\nSave import and export profiles for quick access\nImport any file formats with mapping feature, allowing to map different columns with Shopware properties\nImport and export ALL product data in a single file, including all custom product properties"}],"addons":["enterpriseCertified","highlightInListing","isAppContestParticipant"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":164213,"bookingKey":"Fireb81914862032_M","bookingText":"Improved Import, Export & Mass Actions","price":75,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTICyJV","preview":true,"priority":1,"id":71733},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOwHFpk","preview":false,"priority":50,"id":86227},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpB8ANf6","preview":false,"priority":40,"id":90856},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFyQOyY","preview":false,"priority":35,"id":90857},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCYu8Wq","preview":false,"priority":30,"id":86229},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIA06q0","preview":false,"priority":20,"id":86230},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpC261dC","preview":false,"priority":10,"id":86231},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFJXSez","preview":false,"priority":5,"id":88784},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1pv0ec","preview":false,"priority":0,"id":90859}],"comments":[{"authorName":"BigDataguy","text":"Das Shopware bei seiner kostenfreien Integration des Import/Export Tools auf eine Filterungsoption beim Export verzichtet ist nachvollziehbar, denn Sie wollen ja die anderen Editionen verkaufen.\nEin kostenpflichtiges Plugin, dass im Endeffekt eigentlich nur das gleiche kann wie SW bloß bisschen hübscher für knapp 80€ im Monat: eigentlich schon frech.\nTheoretisch kann man auch mehrere Profile für den Import anlegen um zeitgleich mehrere Uploads durchzuführen. Falsch: denn sobald man bei einem Profil die Datei ändert wird Sie für alle geändert.\n\nFazit:\nSpart euch das Geld und lernt mit dem Standard umzugehen, dieses Plugin ist sinnlos in dieser Form.\n\n(Support nicht gesprochen daher 3 Sterne)","headline":"Ein Exporttool bei dem man nicht filtern kann = richtig SMART","creationDate":{"date":"2023-07-25 16:37:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Rene Frantzen","text":"Es ist ein sehr nützliches Tool und perfekt für die Massenverarbeitung","headline":"Top Plugin und schneller Support","creationDate":{"date":"2023-04-01 21:12:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"P.","text":"Nach anfänglichen Problemen funktioniert das Plugin nun sehr gut. Danke an das Support-Team für die Unterstützung","headline":"Der Export funktioniert sehr gut","creationDate":{"date":"2022-08-16 14:27:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Niek Vlam","text":"The plugin doesn't show the greatest of error messages when things go wrong, but I've received the best support I could with for! They reacted within hours of me sending them problems and we've been able to fix all of them.","headline":"There are issues and the documentation could be better, but the support is superb!","creationDate":{"date":"2022-06-30 08:45:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Site Owner","text":"I get a 405 error. This would seem to be a programming issue.\n\nhttps://stackoverflow.com/questions/61908567/custom-shopware6-route-gives-405-method-not-allowed\n\nIf I'm wrong I'm happy to delete the review but it looks to me like someone's programmed get and push is required. \n\nSeems the other reviewers have a different version maybe...?","headline":"405 error","creationDate":{"date":"2022-04-17 14:01:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Jörg Zimmermann","text":"Update! 9.Mai - TOP!\nWir haben getestet und sind sehr zufrieden. Installation wurde zuvor von Shopware erledigt, der Fehler auf Shopware Seite und wir haben auch von SW eine Gutschrift erhalten. Das Plugin hält was es verspricht. Das einzige was besser sein könnte... es steht wie bei vielen der Support reagiert sehr schnell. Es ist nicht klar, was sehr schnell, schnell oder normal bedeutet, \n\nupdate 27.April\nPlugin wurde Hilfe von Support Shopware installiert, Fehler lag an Shopware und wurde auch mit dem Update 6.4.10 &gt;&gt; Ticket: NEXT-20097 | Could not sign payload with store secret &lt;&lt; muss man sagen leider nicht gelöst. Wir prüfen und testen jetzt das Plugin.  \n\nNäheres in Kürze\n\nupdate 19.april\nmit dem Aktualisierung auf Shopware 6.4.10 sollte eigentlich der Fehler von Shopware beseitigt sein. Ich kann leider noch nicht eine erfolgreiche Installation bestätigen.\n\n\nSeit 2 Monaten versuchen wir dieses Plugin / App im Shop zu installieren. Es dauert lange, bis reagiert wird. Meine Empfehlung: dieser Pluginanbieter sollte sich mal mit Shopware zusammensetzen und schauen, woran es genau liegt. Alle Login Daten und Zugriffsrechte liegen vor. Die Fehlermeldung ist dokumentiert.\nDabei wurde bisher die Lizenzierung vom Shop überprüft, die Shopware Versionen aktualisiert.\n\nWir sind mit unserem Latein am Ende","headline":"Update! Jetzt installiert und getestet - TOP!","creationDate":{"date":"2022-04-14 13:37:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Peter Tresston","text":"Been waiting for the last update with Excel support. Fully covered one of our product scenarios with importing supplier updates from FTP.\nNice one, saved us a bunch on development, which I'm absolutely happy for!\n\nLooking forward to the promised support for googlesheets which we want for other suppliers. Thanks","headline":"Already good, hoping for more updates","creationDate":{"date":"2022-04-08 15:29:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Jaroslav Koksovich","text":"Das Firebear-Team hat uns geholfen, das Problem mit der Installation zu lösen, das wir aufgrund einer falschen Einrichtung des Shops hatten. Ich war vielleicht am Anfang ein bisschen unfreundlich, aber sie haben sehr gelassen und freundlich reagiert und waren sehr hilfreich. Vielen Dank für Ihre Arbeit.","headline":"Großartiger Support!","creationDate":{"date":"2022-02-07 13:24:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Halley Atwell","text":"4 stars, because the app lacks FTP and Excel support yet. Hope it arrives soon.\n\nWe needed a tool to upate product properties, and general product information. WE've tried using native export and import for the product updates, with no success however, considering everything had to be split into several files.\nWith this app, and assistance of Alexey Malynov (thanks again), we've managed to set up the perfect mapping template for the weekly updates.\nNice job!","headline":"Import and export work and this is great","creationDate":{"date":"2022-01-18 10:57:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Andreas Wistuba","text":"All my other apps worked great after migrating to our final domain. This one did not. It simply failed working...\nIn addition, it simply seems not ready yet. Too many features are announced for months but are still not available. \nIn addition, not being able to work with Excel on the CSVs generated really is a pain. Working with Google Sheets (ass suggested by the developers) is not an option IMHO...\nI will certainly give it another try when at least some of the features that have been announced are ready. For the moment, I am a bit frustrated after all....","headline":"Not really ready yet?","creationDate":{"date":"2022-01-11 18:40:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Heinrich Kemmler","text":"Genau das haben wir für unseren Produktimport gebraucht! Das Mapping funktioniert hervorragend, alle unsere Lieferantendaten werden ohne Probleme importiert.\nDer Support ist auch großartig und schnell. Es gab zwar Probleme mit der Installation, aber es schien ein Problem mit dem Shopware Store Login zu sein. Dank Firebear Team konnten wir die App in unserem Shop installieren. Vielen Dank!","headline":"Vielen Dank!","creationDate":{"date":"2021-12-27 14:40:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Robert Vostrykin","text":"Been running this tool at my test store trying to import products from the Excel converted to CSV. Support did good job explaining what I had wrong in the file and helped me import the produts. Also nice having all product settings in a single file.\nI've had prior experience with Firebear at Magento 2 store, the guys know their job. Can recommend","headline":"Nice tool, great support","creationDate":{"date":"2021-12-23 09:56:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":8,"label":"Verbesserte Import, Export und Massenaktionen","description":"<h2>Die App ist einer <a href=\"https://twitter.com/shopware/status/1461253266914918403?s=21\" target=\"_blank\" rel=\"noreferrer noopener\">der Gewinner des Shopware App Contest!</a>!</h2><p>Die App wird ständig weiterentwickelt, und wir sind auf Ihr Feedback und Ihre Tests angewiesen. Wir sind bereit, Sie bei Bedarf zu unterstützen.</p><p><a href=\"https://vitalyverbitsky.typeform.com/to/MlXqPSFC\" target=\"_blank\" rel=\"noreferrer noopener\">Stimmen Sie für die neuen Funktionen ab und teilen Sie uns Ihre Anforderungen mit</a></p><p>Erfahren Sie, wie wir die Anwendung, die Sie sich gerade ansehen, geplant und gebaut haben.</p><p><a href=\"https://drive.google.com/file/d/14pEWGdCw0cjo0L9QB_nJ0DV3pIKkpQHP/view?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Laden Sie das Whitepaper herunter</a></p><h2>Was ist Shopware Improved Import</h2><p>Improved Import, Export &amp; Mass Actions ist eine Shopware 6 App, mit der Sie Daten aus Ihrem Shop importieren und exportieren können.</p><p>Sie können Ihren Shopware Produktkatalog in eine einzelne CSV-, XML- oder Excel XLSX-Datei exportieren, mit allen benutzerdefinierten Eigenschaften und lesbaren Werten anstelle von IDs.</p><p>Sie können CSV-, XML-, XLSX-Dateien direkt von FTP/FTPS, wo Ihr Lieferant Dateien hochlädt, oder durch manuelles Hochladen einer Datei in Ihren Shop importieren.</p><p>Mit dem verbesserten Import können Sie Aktualisierungen des Produktkatalogs für Shopware und Exportvorgänge mit dem Scheduler automatisieren, den Sie zu jedem gewünschten Zeitpunkt einrichten können.</p><h2>Aktualisierung im September 2022</h2><ul><li>Sie können jetzt Produktvarianten mit \"product_number\" anstelle von \"product_id\" importieren. Der Produktexport exportiert auch Produktvarianten mit der neuen Spalte \"product_sku\", in der die Nummer des übergeordneten Produkts angegeben ist.</li><li>Der \"Cheapest Price Net\" und der \"Cheapest Price Gross\" können nun zusammen mit den Produkten importiert und exportiert werden.</li><li>Sie können nun bereits gestartete Import- und Exportprofile stoppen. Die Importprofile werden gestoppt, wenn der aktuell importierte Produktstapel beendet ist. Die Exportprofile werden gestoppt, wenn die aktuell exportierte Seite beendet ist.</li></ul><h2>Wie die App funktioniert</h2><p>Die Shopware Import &amp; Export App funktioniert über Shopware 6 API. Wir stellen Ihnen den speziellen Shopware 6 Backend-Bereich zur Verfügung, in dem Sie den Produktkatalog importieren und exportieren können.</p><p>In Ihrem Shopware-Shop erstellen Sie Import- und Exportprofile, in denen Sie Automatisierungsoptionen, Dateitypen, Quellen, aus denen Sie die Dateien hochladen, und die Dateizuordnung definieren.</p><p>Mit dem Mapping-Tool können Sie Spalten aus der zu importierenden Datei mit den Produkteigenschaften von Shopware abgleichen.</p><p>Die Anwendung unterstützt benutzerdefinierte Produkteigenschaften und verwendet tatsächliche Eigenschaftswerte anstelle von IDs. Das heißt, Sie können Produktfarben mit Werten wie \"rot\" oder \"grün\" importieren und Ihre Produkte mit den lesbaren Eigenschaftswerten exportieren.</p><p>Alles in allem ist die Anwendung dazu da, Sie bei Ihrer täglichen Shopware-Datenverwaltungsroutine zu unterstützen, und wir sind immer offen für Ihre Vorschläge.</p><h2>Wie schnell ist die App</h2><p>Die Geschwindigkeit der Import- und Exportvorgänge für Shopware 6 ist stark abhängig von der CPU und dem RAM des Servers.</p><ul><li>Für den Produktimport messen wir Zahlen von 0,1 Sekunden/Produkt bis zu 4 Sekunden/Produkt.</li><li>Für den Produktexport liegen die Zahlen bei 0,01 Sekunden/Produkt.</li></ul><p>Die Verbesserung der Importgeschwindigkeit hat für uns höchste Priorität und wir optimieren die Prozesse ständig.</p><h2>Anwendungsfälle für Ihr Unternehmen</h2><h3>Import von Produktvarianten mit Produktnummer</h3><p>Jetzt können Sie Produkte mit Varianten importieren und Varianten über die Spalte \"product_sku\", die eine Produktnummer enthält, übergeordneten Produkten zuordnen. Sie brauchen den Katalog nicht mehr zu exportieren, um die IDs zu erhalten. Firebear versucht, die Verwendung von IDs an allen möglichen Stellen zu vermeiden.</p><p>Das bedeutet, dass Sie jetzt Produkte direkt aus Ihrem Lager oder von Ihrem Lieferanten importieren können, ohne dass Sie die IDs vorher kennen müssen. Das spart eine Menge Zeit und ermöglicht schnelle Aktualisierungen.</p><h3>Schneller PIM-Dienst</h3><p>Jeder PIM-Dienst ist eine schöne Schnittstelle für Ihre XLSX- oder CSV-Tabellen. Das bedeutet, dass Sie, wenn Sie Tabellen lesen können, direkt mit CSV und XLSX arbeiten können, ohne Hunderte pro Monat zu bezahlen.</p><p>Bearbeiten Sie Produktbeschreibungen, laden Sie neue Bilder hoch, aktualisieren Sie Preise, fügen Sie Mengen hinzu.</p><h3>Schnelle Aktualisierung der Preise oder Mengen</h3><p>Die Anwendung erfordert nicht jedes Mal den Import ALLER Produkteigenschaften. Stattdessen können Sie eine benutzerdefinierte CSV-Datei mit nur wenigen Spalten speichern: productID, price und QTY oder andere Eigenschaften, die Sie häufig aktualisieren.</p><p>Erstellen Sie eine einfache Tabelle, führen Sie die Aktualisierungen durch und importieren Sie sie zurück in Ihr Shopware 6. Das ist ganz einfach.</p><h3>Für Entwicklungsagenturen</h3><p>Wir unterstützen XML-Dateitypen für Produkte und später für Bestellungen und Kunden. Das bedeutet, dass alle Daten mit dem anderen Produkt und System synchronisiert werden können.</p><h3>Verwendung von Excel XLSX-Tabellen</h3><p>Wenn Sie ERP- oder CRM-Systeme verwenden, die auf XLSX-Dateien basieren, können Sie mit der Anwendung Ihren gesamten Katalog nach Excel exportieren. Dann können Sie die Tabellen so bearbeiten, wie es für Sie am bequemsten ist, und sie per CSV-Datei wieder in Ihren Shop hochladen.</p><h3>Bestellungen exportieren</h3><p>Exportieren Sie die Bestellungen, um sie in einer CSV-, XML- oder XLSX-Datei zu bearbeiten und zu verwalten. Stellen Sie sicher, dass Sie über jeden Kauf Rechenschaft ablegen und die Umsatzberichte überall hin übertragen können.</p><h3>Kundensynchronisation mit CRM</h3><p>Exportieren Sie Kunden in Ihr CRM-System. Verwalten Sie die Verkäufe oder neue Kontakte. Importieren Sie neue Kunden, die Sie über andere Kanäle gewonnen haben, in Shopware.</p><h2>Roadmap und weitere Entwicklung</h2><p>Firebear Studio ist auf Import- und Exportlösungen und Integrationen spezialisiert. Deshalb verstehen wir, was Shopbetreiber brauchen.</p><p>Die Anwendung wird zügig weiterentwickelt, um die gängigsten und nützlichsten Funktionen zu integrieren, wie z.B.:</p><ul><li>Import von Bestellungen</li><li>Unterstützung von verschiedenen Sprachen</li><li>Unterstützung von benutzerdefinierten Feldern</li><li>Unterstützung der produktspezifischen Felder</li><li>E-Mail-Benachrichtigungen für Import- und Exportprofile</li><li>Google Sheets-Import und -Export für Shopware 6</li><li>Google Drive-Import und -Export für Shopware 6</li><li>Mapping-Bereich für die Exportprofile</li><li>Import und Export von Shopware 6 Produkt-Tags</li><li>Unterstützung von Wildcards in den importierten Dateinamen</li><li>Unterstützung der Sales Channels für Produktimport und -export</li><li>Unterstützung von Google Drive, OneDrive, Dropbox Import- und Exportquellen</li><li>Unterstützung von erweiterten Preisen und Staffelpreisen, Rabattkampagnen, Bewertungen, Newsletter-Abonnenten im- und exportieren</li></ul><h2>User Guide and installation</h2><ul><li><a href=\"https://firebear.notion.site/App-Installation-d5caa2c17d404bf394fd7845ea22ea82\" target=\"_blank\" rel=\"noreferrer noopener\">Installationsanweisungen</a><br /></li><li><a href=\"https://firebear.notion.site/User-Manual-78d30c085bea4d7ea8e6ff2c75311a6b\" target=\"_blank\" rel=\"noreferrer noopener\">Verbessertes Import-Benutzerhandbuch</a><br /></li><li><a href=\"https://firebear.notion.site/Sample-Files-2919ae4a0952487faabbb610bd9cdb7c\" target=\"_blank\" rel=\"noreferrer noopener\">Beispiel einer Produktimportdatei in Google Sheets</a><br /></li></ul><p>Wir entwickeln auch die beste Import- und Exportlösung für Magento 2. Finden Sie heraus, <a href=\"https://www.trustpilot.com/review/firebearstudio.com\" target=\"_blank\" rel=\"noreferrer noopener\"><b>wie zufrieden unsere Kunden auf Trustpilot sind.</b></a>.</p>","installationManual":"<h2>Laden Sie die Datei MANIFEST.XML NICHT in Ihren Store hoch, wenn Sie versuchen, die App zu installieren. Die App kann nur mit der unten stehenden Anleitung installiert werden.<br /></h2><h2>Die Anwendung kann nur über das Administrationspanel Ihres Shops installiert werden</h2><p>1) Loggen Sie sich in das Administrationspanel Ihres Shopware 6 Shops ein (Backend)</p><p>2) Stellen Sie sicher, dass Sie in Ihrem Shopware account unter <b>Einstellungen &gt; System &gt; Shopware Account</b> eingeloggt sind und einen Shop registriert haben</p><p>2) Navigieren Sie zu <b>Erweiterungen &gt; Shop</b> und suchen Sie nach \"Improved Import, Export &amp; Mass Actions</p><p>3) Klicken Sie in den Suchergebnissen auf \"Improved Import, Export &amp; Mass Actions\" (Verbesserter Import, Export &amp; Massenaktionen)</p><p>4) Klicken Sie auf die Schaltfläche \"Erweiterung hinzufügen\" in der oberen rechten Ecke des Bildschirms</p><p>5) Aktivieren Sie alle Kontrollkästchen und klicken Sie auf die Schaltfläche \"Erweiterung abonnieren\".</p><p><br /></p><p>Erledigt. Sie können die Anwendung nun verwenden, indem Sie zum Abschnitt <b>Erweiterungen &gt; Verbesserter Import, Export &amp; Massenaktionen</b> gehen.</p><p><br /></p><h2>Fehlersuche</h2><p></p><ul><li>Vergewissern Sie sich, dass die URL Ihres Shops in '.env' mit der tatsächlichen URL Ihres Shops übereinstimmt, einschließlich der HTTP- und HTTPS-Protokollpräfixe.</li><li>Leeren Sie Ihren Browser-Cache, wenn Sie Fehler erhalten oder die Seite nicht geladen wird.</li></ul><p></p>","version":"1.0.20","changelog":[{"version":"1.0.20","text":"<ul><li>Implemented alphabetically sort for shopware product's options on export</li><li>Added email notification for import/export jobs</li></ul>","creationDate":{"date":"2023-07-19 13:57:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.19","text":"<p></p><ul><li>Fixed import custom fields with boolean type</li><li>Added affiliateCode, campaignCode to order export</li><li>Fixed file name in import job log grid</li><li>Added shippingAddressCountry, billingAddressCountry, shippingAddressCountryIso, billingAddressCountryIso fields to order export</li><li>Improved error reporting for xlsx, xml, csv data provider for empty files and files with only header</li><li>Implement case-insensitive customFields import</li><li>Fixed tags deserialization when only child without parent present within input file</li></ul>","creationDate":{"date":"2023-06-22 14:49:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.18","text":"<p></p><ul><li>Implemented possibility to limit and rename export columns for products, customers, orders</li></ul>","creationDate":{"date":"2023-06-08 12:06:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.17","text":"<p></p><ul><li>Added possibility to import/export product translations</li><li>Added possibility to import/export product properties translations</li><li>Implement cache for properties and property options.</li><li>Fixed import of some types of custom fields</li><li>Auth mechanism changed from cookies to token based</li><li>Fixed xml export</li></ul>","creationDate":{"date":"2023-05-15 17:43:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.16","text":"<p></p><ul><li>Implemented import/export of \"restockTime\", \"minPurchase\", \"maxPurchase\",\"purchaseSteps\" fields.</li><li>Implemented import/export scale units and other \"Measures &amp; packaging\" fields</li></ul><p><br /></p>","creationDate":{"date":"2023-04-04 16:25:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.15","text":"<p></p><ul><li>Added productNumber and options to shopware order export</li><li>Increase max_execution_time limit</li><li>Fixed memory leak</li><li>Implemented shopware custom fields export to separated columns</li><li>Added support of custom fields with complex type</li><li>Added support of custom fields import from separated columns</li><li>Fixed incorrect variant replace processing</li><li>Fixed import of custom field where type is price</li><li>Implemented order of image's within product import</li></ul>","creationDate":{"date":"2023-03-27 15:10:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.14","text":"<p></p><ul><li>Implemented memory optimization for ExistingProductsCollectionRegistry</li><li>Added export variant's manufacturer</li></ul>","creationDate":{"date":"2023-01-24 23:14:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.13","text":"<p></p><ul><li>Default location flow for inventory</li><li>Implemented calculating for price_net and price_gross based on TaxId/Without</li><li>Implemented import tags with the chunk serializer and after importer</li><li>Fixed taxRate displaying for preview step</li></ul>","creationDate":{"date":"2023-01-09 17:14:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p>Released on 2 December 2022</p><p><b>Features</b></p><p></p><ul><li>Adjusted auto-mapping to consider camelcase column names</li><li>Added support for HTTP 420 error</li><li>Removed taxId validation from the import step. Now, if the tax is not specified the default tax ID will be assigned to the products</li></ul><p>Bugfixes</p><p></p><ul><li>Now duplicates of the media are properly search through the whole media folder</li><li>Child products are now skipped with a warning if no parent product is found inside the file</li></ul>","creationDate":{"date":"2022-12-02 08:50:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<p>Released on 25 November 2022</p><p>Features</p><p></p><ul><li>Added ‘URL rewrite behavior’ settings for product import. Now you can decide how the duplicate product URLs should be handled during the import: incremented, overwritten, stay untouched</li><li>Now you can import products with the URL paths which have been reserved by the Shopware store</li><li>Added bunch size control for export profiles. Now you can specify the size of the bunches exported: 5-15 for low spec servers, 50 for regular servers, 100 for high-end server set ups</li><li>Updated Shopware SDK to 1.7.1, and overall import and export speed improvements</li></ul><p>Bugfixes</p><p></p><ul><li>Fixed issue with the time counter for the export jobs when the estimated execution time was not displaying relevant numbers.</li></ul>","creationDate":{"date":"2022-11-24 10:40:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>Released on 6 October 2022</p><p>Bugfixes</p><ul><li><p>Adjusted XML mapping for the variant_inventory_fulfillment field</p></li><li><p>Adjusted the Download button for the import and export logs</p></li></ul>","creationDate":{"date":"2022-10-06 13:23:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>PRICE INCREASE STARTING OCTOBER 1ST 2022</p><p>Subscribe now to have the current price of €49 for lifetime!</p><p>Released on 28 September 2022</p><p>Features</p><ul><li><p>Added possibility to assign product variants to the parent product using parent product number, instead of parent product ID. You can now choose by how to compose products with variations, by ID or product_number - the selector has been added to the Mapping step.</p></li><li><p>Added cheapest price gross and cheapest price net product properties for both import and export</p></li><li><p>Added possibility to stop import and export profiles during the execution. When stopped, import will finish with the current batch, meaning that products before the stop will be imported. And export will finish with the current page export. </p></li></ul><p>Bugfixes</p><p></p><ul><li><p>New unit testing has been added to cover new features and code</p></li><li><p>Fixed existing and added new integration tests</p></li><li><p>Fixed issue with automatic profile naming not representing import or export</p></li><li><p>Fixed issue where the product number couldn’t be updated by the product ID when importing only two columns</p></li><li><p>Fixed issue with the order export sometimes giving an error message</p></li><li><p>Fixed issues with the camelCases in XML files</p></li><li><p>Fixed static analysis errors. Added phpcs-fixer to dev packages in composer.</p></li><li><p>Added AUTO_AUTH .env variable</p></li><li><p>Adjust the code for import and export processes for speeding up import and export</p></li><li><p>Stability and speed improvements.</p></li></ul>","creationDate":{"date":"2022-09-23 10:00:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p></p><p>Released on 26 May 2022</p><p><b>Features</b></p><ul><li>Added possibility to import and export customers from Shopware 6</li><li>Added possibility to import and export product SEO URLs for all sales channels</li><li>Import and export logging functionality adjustments, now the logs are more readable</li><li>Bugfixes</li><li>Improved loading times for the profile interface</li><li>Fixed issues with the import and export profile navigation buttons</li><li>Fixed issue with the autodetect delimiter option</li><li>Fixed issue with the null price exception, added default price = 0</li><li>Fixed issue with the  stock increment strategy</li></ul>","creationDate":{"date":"2022-05-26 15:06:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>Released on 18 April 2022</p><p>Features</p><ul><li><p>Added possibility to export Shopware orders into CSV, XML, XLSX</p></li><li><p>Added possibility to add imported product stock to Shopware stock. E.g. add 100 imported products to 100 in the store to have 200</p></li><li><p>Adjusted menus and the profiles</p></li><li><p>Stability and speed improvements</p></li></ul>","creationDate":{"date":"2022-04-18 15:27:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>Released on 7 April 2022</p><p><b>Features</b></p><p></p><ul><li>Added support of product custom fields import and export</li><li>Added ‘Replace media’ switch, which allows you to overwrite existing images with the same name and size as imported image. By default images with the same name and size are not overwritten.</li><li>Improved import speed when importing images. Now the images are not uploaded if their name and size match the name and size of the existing images.</li><li>Stability and speed improvements</li></ul>","creationDate":{"date":"2022-04-07 18:08:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p></p><p>Released on 22 March 2022<b><br /></b></p><p></p><p><b>Features</b><br /></p><ul><li>Added FTP/FTPS as import and export sources. You can now import and export files from the external FTP/FTPS location</li></ul><p></p><ul><li>Added support for Excel XLSX files for both import and export procedures</li></ul><p></p><ul><li>Added support for XML files for both import and export procedures</li></ul><p></p><ul><li>Added support for multi-value separators for import and export procedures. Covers: multiple values separator, category levels, and category multiple values</li></ul><p></p><ul><li>Added support for period \".\" and comma \",\" as decimal value separators. Decimal separators are detected automatically for properties with 'float' type, including prices, and other numeric values. So you can import prices like 9.99 and 9,99 without any issues</li></ul><p></p><ul><li>Added profile grid and profiling support for export procedure</li></ul><p><b>Bugfixes</b></p><p></p><ul><li>Fixed issue with the error display in the log files and overall logging performance</li></ul><p></p><ul><li>Fixed issue where importing a file with the empty ID column resulted in merging products</li></ul><p></p><ul><li>Stability and speed improvements when importing product images. We have addressed image replace and add behaviors to increase the request processing speeds.</li></ul><p></p><ul><li>Fixed issue where the breadcrumb links were clickable inside the import profile when they should not.</li></ul>","creationDate":{"date":"2022-03-22 17:50:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Released on 14 February 2022<b><br /></b></p><p></p><b>Features</b><p></p><ul><li>Added import profiles - you can now create, save, and edit import profiles using the profile configuration grid</li><li>Added profile configuration grid - you can now see, manage, delete, and quickly run all created import profiles via the configuration grid</li><li>Adde import profile scheduling - you can now schedule the import profiles to run automatically on a specified date and time recurrently</li><li>Added product variant synchronization for import</li><li>Added possibility to export product catalog to XLSX, support for XLSX for import process coming soon</li><li>Added possibility to export and import metaDescription, metaKeywords product properties</li><li>Added possibility to export and import deliveryTime product property</li><li>Fixed issue with creating a product tree and data collection for product configurator</li><li>Unit tests adjusted for the new functionality</li><li>Stability and speed improvements</li></ul><p></p>","creationDate":{"date":"2022-02-14 16:41:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><p>Released on 2 December 2021</p><ul><li><p>Unit test adjustments, refactoring, and setup to include new features</p></li><li><p>Fixed issue with remaining time not calculating properly with large file import. The time is now calculated after product preparation.</p></li><li><p>German translation fixes</p></li><li><p>Catalog list is no longer loaded for the Preview step to speed up preview generation</p></li><li><p>Fixed issue with tax not being displayed at the Preview step</p></li><li><p>Fixed issue with importing categories where the category couldn't be created</p></li><li><p>Fixed issue with unmapping a product property at the Mapping step displaying empty value instead of ‘Not selected yet’</p></li><li><p>Optimized memory usage while preparing products for import</p></li></ul>","creationDate":{"date":"2021-12-02 14:25:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Released on 17 November 2021</p><p><b>Features</b></p><ul><li><p>‘isCloseout’ and ‘shippingFree’ properties have been added to product export</p></li><li><p>Automatic error checks at the preparation step of the import process</p></li><li><p>‘Product_number’ property is now required during the import and ‘id’ property is set as optional</p></li><li><p>Adaptations for the async product loading</p></li><li><p>Minor UI updates and adjustments for buttons, translation, and layout</p></li><li><p>Import error log adjustments for better readability</p></li><li><p>Import and export logic improvements</p></li><li><p>Stability and speed improvements</p></li></ul><p><b>Bugfixes</b></p><p></p><ul><li><p>Fixed issue with product media and media cover properties. Product media attribute now properly supports multiple values separated by pipe symbol</p></li><li><p>Fixed issue with product media images being imported even if the same image is already attached to the product</p></li><li><p>Fixed issue with the Mapping step not being updated when moving a step back and uploading a new file</p></li><li><p>Fixed issue with the Mapping step ‘Clear’ button not properly clearing current mappings</p></li><li><p>Fixed issue with the properties missing from the imported file being imported with empty or 0 values</p></li><li><p>Fixed issue with the default properties being imported even if not mapped</p></li><li><p>Fixed issue where boolean values have not been property imported to Shopware</p></li><li><p>Fixed issue with List Price not being imported</p></li></ul><p></p>","creationDate":{"date":"2021-11-17 13:06:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Released on 11 October 2021</p><ul><li>Export products to csv file.</li><li>Export products to google drive.</li><li>Import products: create and update.</li></ul>","creationDate":{"date":"2021-10-11 21:35:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Fireb81914862032","redirectToStore":false,"lowestPriceValue":75}