{"id":13962,"name":"PixupTranslatorSW6","code":"Pixup67953015752","lastChange":{"date":"2023-07-24 19:03:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbiGi3m","examplePageUrl":"","moduleKey":"PixupTranslatorSW6","creationDate":{"date":"2021-09-07 15:09:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-11-17 16:14:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-26 12:22:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":105,"prefix":"Pixup","name":"Pixup Media GmbH","website":"//www.pixupmedia.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod105_Pixup_Logo_128.jpg"},"infos":[{"id":24305,"name":"Pixup AI Translator","description":"<p>Mit&nbsp;dem Pixup Ai Translator können Sie&nbsp;alle Inhalte Ihres Shopware 6 Shops, einschließlich der Produktbeschreibungen, Kategoriebeschreibungen und viele weitere Inhalte in wenigen Minuten übersetzen. Dabei heben sich die Übersetzungen vom Pixup AI Translator dank der Anbindung zu DeepL von herkömmlichen Übersetzern in der Qualität deutlich ab, da die Quellen themenbezogen analysiert und sinngemäß übersetzt werden.&nbsp;</p><p><br></p><p>Voraussetzung für die Nutzung des Plugins ist die Registrierung auf https://translator.pixupmedia.com und der Erwerb von Zeichenpaketen. Sie können durch das Plugin die vorhandenen Zeichen zählen lassen, um für Sie das richtige Paket zu wählen.</p><p><br></p><p>Ab Version 1.2.3 ist das Plugin kompatibel mit dem Plugin \"CmsElementBuilder\"&nbsp; von Net Inventors (https://store.shopware.com/neti984871281616/erstelle-inhaltselemente-fuer-erlebniswelten-cmselementbuilder.html)</p><p><br></p><p>Ab Version 1.3.0 ist das Plugin kompatibel mit dem Plugin \"Blog Premium für SW6\"&nbsp; von Netzperfet (https://store.shopware.com/netzp55675230632/blog-premium-fuer-sw-6.html?c=3)<br></p><p><br></p><p><b>Die wichtigsten Vorteile vom Pixup AI Translator:</b><br>- KEINE Google Übersetzungen, sondern professionelle und Kontext basierte Übersetzungen von <b>DeepL</b><br>- vollständig übersetzter Shop in wenigen Minuten<br>- Intuitives&nbsp;Dashboard zur Bearbeitung der Übersetzungen<br>- Einfache und schnelle Installation<br>- Inhalte werden automatisch erkannt und übersetzt<br>- Bereits übersetzte Texte werden nicht erneut übersetzt<br>- Vollständig kompatibel mit Ihrem Shop und Ihrem Theme<br>- Über 16 Sprachen verfügbar<br>- Einfaches Übersetzungsmanagement<br>- Direktübersetzung mit unserem manuellen Editor möglich<br>- Einfache Wartung<br>- Server-seitige Übersetzungen<br>- Aktiver und reaktionsschneller Support-Service, der Sie bei weiteren Anpassungen unterstützt<br></p><p><br></p><p></p><p style=\"box-sizing: border-box; padding: 0px; margin: 0px; line-height: 24px; font-size: 14px; color: rgb(96, 113, 130); font-family: &quot;Brandon Text&quot;, -apple-system, &quot;system-ui&quot;, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"></p><p style=\"box-sizing: border-box; padding: 0px; margin: 0px; line-height: 24px; font-size: 14px; color: rgb(96, 113, 130); font-family: &quot;Brandon Text&quot;, -apple-system, &quot;system-ui&quot;, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"></p><p></p><h2 style=\"box-sizing: border-box; padding: 0px; margin: 0px 0px 4px; color: rgb(61, 66, 92); font-weight: 500; font-size: 18px; line-height: 28px; font-family: &quot;Brandon Text&quot;, -apple-system, &quot;system-ui&quot;, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">Hinweis</h2><p>Sie benötigen einen Account auf&nbsp;<a href=\"https://translator.pixupmedia.com/\" target=\"_blank\" rel=\"noreferrer\">https://translator.pixupmedia.com</a>&nbsp;um diesen mit dem Plugin in Ihrem Shop zu verknüpfen. Weitere Infos lesen Sie in der&nbsp;<br>Installationsanleitung.</p><p><br></p><h2>Kontaktieren Sie uns</h2><p></p><p></p><p>Sie wünschen sich ein ansprechendes, modernes und zielgruppengerechtes Design für Ihren Shop oder haben noch Fragen? Kein Problem!&nbsp;<b>Gerne stehen wir Ihnen auch bei anderen Anliegen rund um Shopware zur Verfügung.&nbsp;</b>Rufen Sie uns doch direkt an:</p><p>Pixup Media GmbH<br>Invalidenstr. 34<br>10115 Berlin</p><p>Telefon: 030 - 4000 61 01<br>E-Mail: service@pixupmedia.com<br>Web:&nbsp;<a href=\"https://store.shopware.com/pixup23072286129/google-sitemap-generator.html?c=1004#\">www.pixupmedia.com</a></p><p></p>","installationManual":"<p>Installieren Sie zunächst das Plugin über den Store (Backend).</p><p><br><b>1. Account Erstellen</b><br></p><p>Danach erstellen Sie bitte einen Account auf <a href=\"https://translator.pixupmedia.com\" target=\"_blank\" rel=\"noreferrer\">https://translator.pixupmedia.com</a>.<br>Dies können Sie machen indem Sie oben rechts bei der Webseite auf Login klicken und anschließend auf Registrieren.<br></p><p><br><b>2. API Key erstellen</b><br></p><p>Anschließend können sie im Kundenportal auf der Account Seite einen Key erstellen. <br><b><br>3. Shopware Account verknüpfen und 5.000 Zeichen sichern</b><br>Sollten Sie die Vollversion des Plugins gekauft haben, geben Sie bitte die URL ein, welche auch in Ihrem Shopware Account (mit dem Sie das Plugin gekauft haben) hinterlegt ist.<br>Bitte beachten Sie, dass Sie Ihre URL eins zu eins von Ihrem Shopware-Account kopieren sollten, da sonst die Verknüpfung nicht erstellt werden kann.<br>Sollte Ihr Shopware Account erfolgreich mit unserem Kundenaccount verknüpft sein, erhalten Sie 500.000 Zeichen als Guthaben. <br><br><b>4. API Key kopieren</b><br>Anschließend wird Ihnen ein API-Key angezeigt, welchen Sie brauchen, um den Pixup Ai Translator benutzen zu können.<br>Diesen API-Key fügen Sie anschließend in Ihrem Shopware-Backend ein. <br><br><b>5. API Key in Shopware hinterlegen</b><br>Um den API-Key nun hinterlegen zu können, klicken Sie bitte nun auf Einstellungen -&gt; Erweiterungen -&gt; Pixup Translator. <br>Hier können Sie Ihren API-Key eintragen. <br><br><b>6. Plugin konfigurieren</b><br>Unter Einstellungen -&gt; Erweiterungen -&gt; Pixup Translator können Sie alle Einstellungen für das Plugin setzen. <br>Hier werden im ersten Abschnitt die Grundeinstellungen festgelegt. <br>Der Translator erfasst die Texte Ihres Shops anhand der angegebenen \"Quell-Sprache\" und übersetzt diese Texte in alle \"Ziel-Sprachen\", die vorher ausgewählt wurden. <br>Hier ist es wichtig zu beachten, dass die Sprachen im Dropdown nur dann auftauchen, wenn Sie diese auch in Ihren Shop hinterlegt haben (siehe Punkt 7). <br><br>In den Einstellungen werden nun alle Entitys angezeigt. Ein Entity entspricht einem Teilbereich des Shops z.B Produkt, Kategorie, CMS-Seite etc.<br>Sobald Sie ein Entity ausklappen wird dieses als aktiv gesetzt. Anschließend können Sie je nach Entity noch bestimmen, welche Einstellungen für die Übersetzungen übernommen werden sollen. Hier kann z.B. entschieden werden ob Titel oder ob nur Beschreibungen übersetzt werden sollen. <br><br>Wenn Sie alle Einstellungen gesetzt haben, so speichern sie diese, indem ganz unten auf der Seite auf \"Speichern\" klicken.</p><p><br><b>7. Sprachen in Ihrem Shop hinterlegen</b><br>Um Sprachen in Ihrem Shop zu hinterlegen, müssen Sie auf folgende Seite wechseln: <br>Einstellungen -&gt; Shop -&gt; Sprachen <br>Dort können Sie die Sprachen anlegen, welche anschließend vom Translator benutzt werden können.</p><p>&nbsp; <br>Der Translator erkennt die Sprachen anhand des ISO-CODES.&nbsp;Fängt die Sprache beispielsweise mit dem ISO-CODE \"DE\" an, wird dies vom Translator als Deutsch erkannt.</p><p><br>Jeder ISO-CODE, der mit folgenden Buchstaben beginnt (<b>Case-Insensitive</b>) wird als valide vom Translator erkannt und der entsprechenden Sprache zugewiesen:<br><br></p>\n\nEN-US = English - America <br>\nEN-GB = English - Great Britain <br>\nDE = Deutsch <br>\nBG = Bulgarian <br>\nCS = Czech <br>\nDA = Danish <br>\nEL = Greek <br>\nES = Spanish <br>\nET = Estonian <br>\nFI = Finnish <br>\nFR = French <br>\nHU = Hungarian <br>\nIT = Italian <br>\nJA = Japanese <br>\nLT = Lithuanian <br>\nLV = Latvian <br>\nNL = Dutch <br>\nPL = Polish <br>\nPT-BR = Portuguese - Brazilian <br>\nPT-PT = Portuguese - European <br>\nRO = Romanian <br>\nRU = Russian <br>\nSK = Slovak <br>\nSL = Slovenian <br>\nSV = Swedish <br><p>\nZH = Chinese <br></p><p>TR = Türkisch<br>ID = Indonesisch<br></p><br><b>8. Übersetzungen ausführen </b><br>Wenn Sie die Entities aktiviert haben, können Sie nun (oben rechts) auf \"Ausführen\" klicken. <br>Im Folge dessen öffnet sich eine neue Seite. Auf dieser Seite können Sie entweder einzelne Entities oder diese alle auf einmal ausführen.<br>Es öffnet sich eine Modal-Box, in welcher Sie nochmals darauf hingewiesen werden, über wie viele Zeichen Sie (innerhalb Ihres Kundenkontos) verfügen.<br>Dort haben Sie auch die Möglichkeit die noch nicht übersetzten Zeichen Ihres Shops zu zählen. <br>Anschließend können Sie die Übersetzung ausführen. Sollten Sie nicht genügend Zeichen haben, stoppt der Translator den Übersetzungsprozess. <br><br><b>9. Zusätzliche Zeichen kaufen </b><br>Im Kundenportal haben Sie die Möglichkeit zusätzliche Pakete zu kaufen. Diese Pakete werden nach Kaufabschluss Ihrem Kundenaccount zugewiesen.<br><br><b>10. Nutzung des FileTranslators</b><br>Sie haben JSON-, CSV- oder TXT- Dateien, welche Sie ebenfalls gerne übersetzen würden?<br>Mit unserem FileTranslator können Sie dies ohne Probleme machen. <br>Loggen Sie sich auf unserer Website&nbsp;<a href=\"https://translator.pixupmedia.com/\" target=\"_blank\" rel=\"noreferrer\">translator.pixupmedia.com</a>&nbsp;ein&nbsp;und gehen Sie anschließend auf den Tab \"Manuel\". <br>Dort können Sie eine Datei Ihrer Wahl hochladen und auswählen, in welche Sprachen Sie diese übersetzt haben wollen. <br>Die Übersetzung der Dateien kann etwas Zeit in Anspruch nehmen. Sie können die übersetzten Dateien anschließend im FileCenter downloaden. <br><br><b>11. Fragen?</b><br>Sollten Sie Fragen oder Probleme mit dem Translator haben, stehen wir Ihnen innerhalb unserer Öffnungszeiten jederzeit zur Verfügung. <br>Sie können entweder über Shopware ein Support Ticket erstellen oder sich direkt unter support@pixupmedia.com melden. <br><p><br></p><h2>Achtung</h2><p>Aus reiner Vorsichtsmaßnahme sollten Sie vorher einen Backup der Datenbank anlegen.</p>","shortDescription":"Der Pixup Ai Translator ist eine komplette und an DeepL angebundene eCommerce Übersetzungslösung für Shopware 6. \nÜbersetzen Sie den gesamten Shop per Knopfdruck.","highlights":"Sofort Übersetzung des gesamten Shops in mehr als 16 Sprachen\nVollständige Übersetzung in wenigen Minuten\nÜbersetzungen für Artikel, Kategorien, Textsnippets, Erlebniswelten / CMS, uvm.\nÜbersetzungen erfolgt auf unserem Server, so dass keine Belastung ihres Servers entsteht","features":"Automatisierte Übersetzung von einzelnen Entities (z.B. einzelne Produkte, Kategorien etc)\nAutomatisierte Übersetzung für Artikelnamen, -beschreibung, -meta Titel, -meta Beschreibung, uvm\nAutomatisierte Übersetzung für Kategorienamen, -beschreibung, -meta Titel, -meta Beschreibung, uvm\nAutomatisierte Übersetzung aller CustomFields\nAutomatische Übesetzungen für Snippets innerhalb der DB\nAutomatische Übesetzungen für MailTemplates, Emailvorlagen, Mail Header/Footer, Landingpages, Kundengruppen, Währungen, Länder, Städte, uvm\nErfassung/Berechnung der zu übersetzenden Zeichen\nKeine monatlichen Kosten, zahlen Sie nur das was Sie auch brauchen \nKEINE Google Übersetzungen, sondern professionelle und Kontext basierte Übersetzungen \nSofortguthaben für die ersten 5.000 Zeichen\nEditor für Direktübersetzungen"},{"id":24306,"name":"Pixup Ai Translator","description":"<p>With the Pixup Ai Translator, you can translate all the content of your Shopware 6 shop, including product descriptions, category descriptions and much more content in just a few minutes. The translations of the Pixup AI Translator clearly stand out from conventional translators in terms of quality, as the sources are analysed in relation to the topic and translated according to the meaning.&nbsp;</p><p><br></p><p>The prerequisite for using the plugin is registration at https://translator.pixupmedia.com.</p><p><br></p><p>As of version 1.2.3, the plugin is compatible with the plugin&nbsp;\"CmsElementBuilder\"&nbsp; from Net Inventors (https://store.shopware.com/en/neti984871281616/create-content-elements-for-shopping-experience-cmselementbuilder.html)</p><p><br></p><p>As of version 1.3.0, the plugin is compatible with the plugin \"Blog Premium for SW6\" from Netzperfet (https://store.shopware.com/netzp55675230632/blog-premium-fuer-sw-6.html?c=3).<br></p><p><br></p><b>The most important advantages of Pixup AI Translator:</b><br>- NO Google translations, but professional and context-based translations<br>- Fully translated shop in a few minutes<br>- Intuitive dashboard for editing translations<br>- Easy and quick installation<br>- Content is automatically recognised and translated<br>- Already translated texts are not translated again<br>- Fully compatible with your shop and theme<br>- Over 16 languages available<br>- Simple translation management<br>- Direct translation possible with our manual editor<br>- Easy maintenance<br>- Server-side translations<br>- Active and responsive support service to help you with further customisations<br><p></p><p><br></p><p>Note</p><p>You need an account on <a href=\"https://translator.pixupmedia.com\" target=\"_blank\" rel=\"noreferrer\">https://translator.pixupmedia.com</a>&nbsp;to connect it with the plugin in your store. For more information read the&nbsp;</p><p>installation guide.</p><p><br></p><p>Contact us</p><p>Would you like an appealing, modern and target group-oriented design for your shop or do you still have questions? No problem! We are also happy to help you with other Shopware-related concerns. Please call us directly:</p><p><br></p><p>Pixup Media GmbH</p><p>Invalidenstr. 34</p><p>10115 Berlin</p><p><br></p><p>phone: 030 - 4000 61 01</p><p>E-mail: service@pixupmedia.com</p><p>Web: www.pixupmedia.com</p><p></p>","installationManual":"First install the plugin via the store (backend).<br><br><br><p><b>1. create an account</b></p>Then please create an account at https://translator.pixupmedia.com.<br>You can do this by clicking on Login at the top right of the website and then on Register.<br><br><br><p><b>2. create API Key</b></p>Afterwards you can create a key on the account page in the customer portal.<br><br><p><b>3. link your Shopware account and save 5.000 characters</b></p>If you have purchased the full version of the plugin, please enter the URL that is also stored in your Shopware account (with which you purchased the plugin).<br>Please note that you should copy your URL one-to-one from your Shopware account, otherwise the link cannot be created.<br>If your Shopware account is successfully linked to our customer account, you will receive 500,000 characters as credit.<br><br><b>4. copy API Key</b><br>You will then be shown an API key which you need to be able to use the Pixup Ai Translator.<br>Then insert this API key into your Shopware backend.<br><br><b>5. store the API key in Shopware</b><br>In order to store the API key, please click on Settings -&gt; Extensions -&gt; Pixup Translator.<br>Here you can enter your API key.<br><br><b>6. configure plugin</b><br>Under Settings -&gt; Extensions -&gt; Pixup Translator you can set all the settings for the plugin.<br>Here, the basic settings are defined in the first section.<br>The Translator captures the texts of your shop based on the specified \"source language\" and translates these texts into all \"target languages\" that were previously selected.<br>It is important to note here that the languages only appear in the dropdown if you have also stored them in your shop (see point 7).<br><br>All entities are now displayed in the settings. An entity corresponds to a sub-area of the shop, e.g. product, category, CMS page etc.<br>As soon as you expand an entity, it is set as active. Then, depending on the entity, you can determine which settings are to be used for the translations. For example, you can decide whether titles or only descriptions should be translated.<br><br>Once you have set all the settings, save them by clicking on \"Save\" at the bottom of the page.<br><br><br><b>7. save languages in your shop</b><br>To add languages to your shop, you must go to the following page:<br>Settings -&gt; Shop -&gt; Languages<br>There you can create the languages that can then be used by the Translator.<br><p><br></p>The Translator recognises the languages by means of the ISO-CODES. For example, if the language starts with the ISO-CODE \"DE\", the Translator will recognise this as German.<br><p><br></p>Every ISO-CODE that begins with the following letters (case-insensitive) is recognised as valid by the translator and assigned to the corresponding language:<br><br>EN-US = English - America<br>EN-GB = English - Great Britain<br>DE = German<br>BG = Bulgarian<br>CS = Czech<br>DA = Danish<br>EL = Greek<br>ES = Spanish<br>ET = Estonian<br>FI = Finnish<br>FR = French<br>HU = Hungarian<br>IT = Italian<br>JA = Japanese<br>LT = Lithuanian<br>LV = Latvian<br>NL = Dutch<br>PL = Polish<br>PT-BR = Portuguese - Brazilian<br>PT-PT = Portuguese - European<br>RO = Romanian<br>RU = Russian<br>SK = Slovak<br>SL = Slovenian<br>SV = Swedish<br><p>ZH = Chinese</p><p>TR = Turkish<br></p><p>ID = Indonesien</p><br><b>8. execute translations</b><br>If you have activated the entities, you can now click (top right) on \"Execute\".<br>This will open a new page. On this page you can either execute individual entities or all of them at once.<br>A modal box opens in which you are again informed about how many characters you have (within your customer account).<br>There you also have the option of counting the characters of your shop that have not yet been translated.<br>You can then carry out the translation. If you do not have enough characters, the translator will stop the translation process. 9.<br><br><b>9. buy additional characters</b><br>In the customer portal, you have the option to buy additional packages. These packages will be assigned to your customer account after you have completed the purchase.<br><br><b>10. use of the FileTranslator</b><br>Do you have JSON, CSV or TXT files that you would also like to translate?<br>With our FileTranslator you can do this without any problems.<br>Log in to our website translator.pixupmedia.com and then go to the tab \"Manuel\".<br>There you can upload a file of your choice and select into which languages you want it translated.<br>The translation of the files may take some time. You can then download the translated files from the FileCenter.<br><br><b>11. questions?</b><br>If you have any questions or problems with the Translator, we are always available within our opening hours.<br><p>You can either create a support ticket via Shopware or contact us directly at support@pixupmedia.com. </p><p><br></p><p>Attention</p><p>As a precautionary measure, you should create a backup of the database beforehand.</p>","shortDescription":"The Pixup Ai Translator is a complete and AI-based e-commerce translation solution for Shopware 6. \nTranslate the entire shop with one click. \nYou decides what you want to translate.","highlights":"Instant translation of the entire shop in 16 languages\nComplete translation in a few minutes\nIndividually configurable translations for articles, categories, text snippets, worlds of experience / CMS, etc.\nTranslations are done on our server, so there is no load on your server","features":"Automated translation for single entities (for example: single Products, Categories etc)\nAutomated translation for item names, description, meta title, meta description, etc.\nAutomated translation for category names, description, meta title, meta description, etc.\nAutomated translation for all Custom Fields\nAutomatic translations for snippets within the DB\nAutomatic translations for mail templates, email templates, mail headers/footers, landing pages, customer groups, currencies, countries, cities, etc.\nRecording/calculation of the characters to be translated\nNo monthly costs, you only pay for what you need \nNO Google translations, but professional and context-based translations \nInstant credit for the first 5.000 characters\nEditor for direct translations"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167984,"bookingKey":"Pixup67953015752","bookingText":"Pixup Ai Translator","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvShKZP","preview":true,"priority":1,"id":72184},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php17VKs1","preview":false,"priority":11,"id":75028},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIzhJ1J","preview":false,"priority":10,"id":75030},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMWVtP3","preview":false,"priority":8,"id":75031},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXtYu0v","preview":false,"priority":7,"id":74460},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpl8DGXX","preview":false,"priority":6,"id":74464},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCqTLJO","preview":false,"priority":5,"id":75024},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZn7Que","preview":false,"priority":4,"id":74463},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPBFKk0","preview":false,"priority":4,"id":75025},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCSXgjq","preview":false,"priority":3,"id":74461},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4tDvd6","preview":false,"priority":1,"id":75017},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnnnyMX","preview":false,"priority":0,"id":90349},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcMGdlq","preview":false,"priority":0,"id":91895}],"comments":[{"authorName":"Paul Ahlers","text":"Wir hatten eine kurze technische Rückfrage mit dem Support, welcher sich umgehend um unser Problem kümmerte und auch noch am gleichen Tag behoben hatte. Dazu ist die Qualität der Übersetzung durch die DeepL Anbindung sehr hochwertig und bindet das ganze super direkt wieder in Shopware an allen erdenklichen Stellen wie Erlebniswelten, Kategorien, Produkte, etc. ein. Absolute Empfehlung für jeden Shop der international agieren möchte!","headline":"Ideales Tool um in wenigen Minuten mehrsprachig zu gehen!","creationDate":{"date":"2023-05-31 12:28:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Tobias Faulian","text":"Wir haben das Tool genutzt, um unseren Shop neben Englisch auch auf Französisch, Spanisch und Italienisch anbieten zu können. \n\nDa wir einige Anpassungen/Eigenentwicklungen für unseren Shop haben, waren auch Anpassungen durch Pixup notwendig. die mit dem Support schnell gelöst wurden. \n\nDas Plugin stellt eine große Erleichterung vor allem bei der Pflege der Webseiten und neuen Produkten/Landingpages usw. dar, die jetzt quasi auf Knopfdruck auch in die anderen Sprachen übersetzt werden können.","headline":"das perfekte Tool für mehrsprachige Shops","creationDate":{"date":"2022-07-07 13:38:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Michael Dolp","text":"Wer die Reichweite seiner eigenen Produkte auf einfache Art und Weise erhöhen möchte, kann mit diesem Plugin automatisch \"funktionelle\" Übersetzungen erstellen. Auch wenn DeepL nicht 100% korrekt im Vergleich zu einem Dolmetscher übersetzt, so sind die Kosten und der Aufwand nur ein Bruchteil deren einer manuellen Übersetzung.\nMein System machte immer wieder neue Probleme, doch der Support hat stets alles in kürzester Zeit gelöst - TOP!","headline":"Super Lösung - Super Service","creationDate":{"date":"2022-06-21 14:37:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Michael Friedrich","text":"Wir sind sehr begeistert von dem Pixup AI Translator. Die Produktbeschreibungen, Kategoriebeschreibungen und viele weitere Inhalte können in wenigen Minuten mit einem Klick in mehr als 16 Sprachen übersetzt werden, was unsere Arbeit sehr erleichtert. Es sind KEINE Google Übersetzungen, sondern professionelle und Kontext basierte Übersetzungen. \nDer Support-Service reagiert schnell und hilft mit Rat und Tat.","headline":"Sehr gutes Übersetzungs-Plugin!","creationDate":{"date":"2022-05-20 14:35:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Pixup AI Translator","description":"<p>Mit dem Pixup Ai Translator können Sie alle Inhalte Ihres Shopware 6 Shops, einschließlich der Produktbeschreibungen, Kategoriebeschreibungen und viele weitere Inhalte in wenigen Minuten übersetzen. Dabei heben sich die Übersetzungen vom Pixup AI Translator dank der Anbindung zu DeepL von herkömmlichen Übersetzern in der Qualität deutlich ab, da die Quellen themenbezogen analysiert und sinngemäß übersetzt werden. </p><p><br /></p><p>Voraussetzung für die Nutzung des Plugins ist die Registrierung auf https://translator.pixupmedia.com und der Erwerb von Zeichenpaketen. Sie können durch das Plugin die vorhandenen Zeichen zählen lassen, um für Sie das richtige Paket zu wählen.</p><p><br /></p><p>Ab Version 1.2.3 ist das Plugin kompatibel mit dem Plugin \"CmsElementBuilder\"  von Net Inventors (https://store.shopware.com/neti984871281616/erstelle-inhaltselemente-fuer-erlebniswelten-cmselementbuilder.html)</p><p><br /></p><p>Ab Version 1.3.0 ist das Plugin kompatibel mit dem Plugin \"Blog Premium für SW6\"  von Netzperfet (https://store.shopware.com/netzp55675230632/blog-premium-fuer-sw-6.html?c=3)<br /></p><p><br /></p><p><b>Die wichtigsten Vorteile vom Pixup AI Translator:</b><br />- KEINE Google Übersetzungen, sondern professionelle und Kontext basierte Übersetzungen von <b>DeepL</b><br />- vollständig übersetzter Shop in wenigen Minuten<br />- Intuitives Dashboard zur Bearbeitung der Übersetzungen<br />- Einfache und schnelle Installation<br />- Inhalte werden automatisch erkannt und übersetzt<br />- Bereits übersetzte Texte werden nicht erneut übersetzt<br />- Vollständig kompatibel mit Ihrem Shop und Ihrem Theme<br />- Über 16 Sprachen verfügbar<br />- Einfaches Übersetzungsmanagement<br />- Direktübersetzung mit unserem manuellen Editor möglich<br />- Einfache Wartung<br />- Server-seitige Übersetzungen<br />- Aktiver und reaktionsschneller Support-Service, der Sie bei weiteren Anpassungen unterstützt<br /></p><p><br /></p><p></p><p></p><p></p><p></p><h2>Hinweis</h2><p>Sie benötigen einen Account auf <a href=\"https://translator.pixupmedia.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://translator.pixupmedia.com</a> um diesen mit dem Plugin in Ihrem Shop zu verknüpfen. Weitere Infos lesen Sie in der <br />Installationsanleitung.</p><p><br /></p><h2>Kontaktieren Sie uns</h2><p></p><p></p><p>Sie wünschen sich ein ansprechendes, modernes und zielgruppengerechtes Design für Ihren Shop oder haben noch Fragen? Kein Problem! <b>Gerne stehen wir Ihnen auch bei anderen Anliegen rund um Shopware zur Verfügung. </b>Rufen Sie uns doch direkt an:</p><p>Pixup Media GmbH<br />Invalidenstr. 34<br />10115 Berlin</p><p>Telefon: 030 - 4000 61 01<br />E-Mail: service@pixupmedia.com<br />Web: <a href=\"https://store.shopware.com/pixup23072286129/google-sitemap-generator.html?c=1004#\">www.pixupmedia.com</a></p><p></p>","installationManual":"<p>Installieren Sie zunächst das Plugin über den Store (Backend).</p><p><br /><b>1. Account Erstellen</b><br /></p><p>Danach erstellen Sie bitte einen Account auf <a href=\"https://translator.pixupmedia.com\" target=\"_blank\" rel=\"noreferrer noopener\">https://translator.pixupmedia.com</a>.<br />Dies können Sie machen indem Sie oben rechts bei der Webseite auf Login klicken und anschließend auf Registrieren.<br /></p><p><br /><b>2. API Key erstellen</b><br /></p><p>Anschließend können sie im Kundenportal auf der Account Seite einen Key erstellen. <br /><b><br />3. Shopware Account verknüpfen und 5.000 Zeichen sichern</b><br />Sollten Sie die Vollversion des Plugins gekauft haben, geben Sie bitte die URL ein, welche auch in Ihrem Shopware Account (mit dem Sie das Plugin gekauft haben) hinterlegt ist.<br />Bitte beachten Sie, dass Sie Ihre URL eins zu eins von Ihrem Shopware-Account kopieren sollten, da sonst die Verknüpfung nicht erstellt werden kann.<br />Sollte Ihr Shopware Account erfolgreich mit unserem Kundenaccount verknüpft sein, erhalten Sie 500.000 Zeichen als Guthaben. <br /><br /><b>4. API Key kopieren</b><br />Anschließend wird Ihnen ein API-Key angezeigt, welchen Sie brauchen, um den Pixup Ai Translator benutzen zu können.<br />Diesen API-Key fügen Sie anschließend in Ihrem Shopware-Backend ein. <br /><br /><b>5. API Key in Shopware hinterlegen</b><br />Um den API-Key nun hinterlegen zu können, klicken Sie bitte nun auf Einstellungen -&gt; Erweiterungen -&gt; Pixup Translator. <br />Hier können Sie Ihren API-Key eintragen. <br /><br /><b>6. Plugin konfigurieren</b><br />Unter Einstellungen -&gt; Erweiterungen -&gt; Pixup Translator können Sie alle Einstellungen für das Plugin setzen. <br />Hier werden im ersten Abschnitt die Grundeinstellungen festgelegt. <br />Der Translator erfasst die Texte Ihres Shops anhand der angegebenen \"Quell-Sprache\" und übersetzt diese Texte in alle \"Ziel-Sprachen\", die vorher ausgewählt wurden. <br />Hier ist es wichtig zu beachten, dass die Sprachen im Dropdown nur dann auftauchen, wenn Sie diese auch in Ihren Shop hinterlegt haben (siehe Punkt 7). <br /><br />In den Einstellungen werden nun alle Entitys angezeigt. Ein Entity entspricht einem Teilbereich des Shops z.B Produkt, Kategorie, CMS-Seite etc.<br />Sobald Sie ein Entity ausklappen wird dieses als aktiv gesetzt. Anschließend können Sie je nach Entity noch bestimmen, welche Einstellungen für die Übersetzungen übernommen werden sollen. Hier kann z.B. entschieden werden ob Titel oder ob nur Beschreibungen übersetzt werden sollen. <br /><br />Wenn Sie alle Einstellungen gesetzt haben, so speichern sie diese, indem ganz unten auf der Seite auf \"Speichern\" klicken.</p><p><br /><b>7. Sprachen in Ihrem Shop hinterlegen</b><br />Um Sprachen in Ihrem Shop zu hinterlegen, müssen Sie auf folgende Seite wechseln: <br />Einstellungen -&gt; Shop -&gt; Sprachen <br />Dort können Sie die Sprachen anlegen, welche anschließend vom Translator benutzt werden können.</p><p>  <br />Der Translator erkennt die Sprachen anhand des ISO-CODES. Fängt die Sprache beispielsweise mit dem ISO-CODE \"DE\" an, wird dies vom Translator als Deutsch erkannt.</p><p><br />Jeder ISO-CODE, der mit folgenden Buchstaben beginnt (<b>Case-Insensitive</b>) wird als valide vom Translator erkannt und der entsprechenden Sprache zugewiesen:<br /><br /></p>\n\nEN-US = English - America <br />\nEN-GB = English - Great Britain <br />\nDE = Deutsch <br />\nBG = Bulgarian <br />\nCS = Czech <br />\nDA = Danish <br />\nEL = Greek <br />\nES = Spanish <br />\nET = Estonian <br />\nFI = Finnish <br />\nFR = French <br />\nHU = Hungarian <br />\nIT = Italian <br />\nJA = Japanese <br />\nLT = Lithuanian <br />\nLV = Latvian <br />\nNL = Dutch <br />\nPL = Polish <br />\nPT-BR = Portuguese - Brazilian <br />\nPT-PT = Portuguese - European <br />\nRO = Romanian <br />\nRU = Russian <br />\nSK = Slovak <br />\nSL = Slovenian <br />\nSV = Swedish <br /><p>\nZH = Chinese <br /></p><p>TR = Türkisch<br />ID = Indonesisch<br /></p><br /><b>8. Übersetzungen ausführen </b><br />Wenn Sie die Entities aktiviert haben, können Sie nun (oben rechts) auf \"Ausführen\" klicken. <br />Im Folge dessen öffnet sich eine neue Seite. Auf dieser Seite können Sie entweder einzelne Entities oder diese alle auf einmal ausführen.<br />Es öffnet sich eine Modal-Box, in welcher Sie nochmals darauf hingewiesen werden, über wie viele Zeichen Sie (innerhalb Ihres Kundenkontos) verfügen.<br />Dort haben Sie auch die Möglichkeit die noch nicht übersetzten Zeichen Ihres Shops zu zählen. <br />Anschließend können Sie die Übersetzung ausführen. Sollten Sie nicht genügend Zeichen haben, stoppt der Translator den Übersetzungsprozess. <br /><br /><b>9. Zusätzliche Zeichen kaufen </b><br />Im Kundenportal haben Sie die Möglichkeit zusätzliche Pakete zu kaufen. Diese Pakete werden nach Kaufabschluss Ihrem Kundenaccount zugewiesen.<br /><br /><b>10. Nutzung des FileTranslators</b><br />Sie haben JSON-, CSV- oder TXT- Dateien, welche Sie ebenfalls gerne übersetzen würden?<br />Mit unserem FileTranslator können Sie dies ohne Probleme machen. <br />Loggen Sie sich auf unserer Website <a href=\"https://translator.pixupmedia.com/\" target=\"_blank\" rel=\"noreferrer noopener\">translator.pixupmedia.com</a> ein und gehen Sie anschließend auf den Tab \"Manuel\". <br />Dort können Sie eine Datei Ihrer Wahl hochladen und auswählen, in welche Sprachen Sie diese übersetzt haben wollen. <br />Die Übersetzung der Dateien kann etwas Zeit in Anspruch nehmen. Sie können die übersetzten Dateien anschließend im FileCenter downloaden. <br /><br /><b>11. Fragen?</b><br />Sollten Sie Fragen oder Probleme mit dem Translator haben, stehen wir Ihnen innerhalb unserer Öffnungszeiten jederzeit zur Verfügung. <br />Sie können entweder über Shopware ein Support Ticket erstellen oder sich direkt unter support@pixupmedia.com melden. <br /><p><br /></p><h2>Achtung</h2><p>Aus reiner Vorsichtsmaßnahme sollten Sie vorher einen Backup der Datenbank anlegen.</p>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"<p></p><ul><li>FIX: Sometimes config variables were not completely transferred for category/landing page single translations</li><li>FIX: Edited final private methods</li></ul>","creationDate":{"date":"2023-06-16 15:14:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p></p><ul><li>Compatibility Update: Updates for Shopware version 6.5 are recognizable by the plugin major version number 2.X.X</li></ul>","creationDate":{"date":"2023-05-26 14:56:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p></p><ul><li>HOLD: Deactivated Snippet Translation, will be fixed in future</li></ul><p><br /></p>","creationDate":{"date":"2023-07-10 16:48:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<ul><li></li><li>FIX: Edited final private method</li></ul>","creationDate":{"date":"2023-06-16 15:17:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<ul><li>FIX: Sometimes config variables were not completely transferred for category/landing page single translations</li></ul>","creationDate":{"date":"2023-06-12 12:56:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p></p><ul><li>FIX: Special characters are now correctly decoded in the translation</li><li>ADD: It is now possible to exclude the names of manufacturers from translation in all fields (customer request)</li></ul><p><br /></p>","creationDate":{"date":"2023-05-23 14:43:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<p>HOTFIX: Now checking the right Composer Bundle for Version (Shopware/Core)</p><p><br /></p>","creationDate":{"date":"2023-05-03 14:03:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>ADD: CMS Slots in Shopping Experiences can be set via inputField</li><li>ADD: CMS Slots in Landingpages can be set via inputField</li><li>ADD: CMS Slots in Categories can be set via inputField</li><li>ADD: Added Netzperfekt Blog Support</li></ul>","creationDate":{"date":"2023-04-20 13:50:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.10","text":"<p></p><ul><li>FIX: Updating CountryTranslation: added addressFormat (added in Shopware v6.4.18.0)</li></ul>","creationDate":{"date":"2023-03-27 11:01:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.9","text":"FIX: Fixing Middleware because some PHP Enviroments have connection problems.","creationDate":{"date":"2022-10-20 13:29:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.8","text":"- ADD: Adding possibility to translate LandingPage specific Slot Configs","creationDate":{"date":"2022-08-24 13:56:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.7","text":"CHANGE: Changing Snippet","creationDate":{"date":"2022-06-24 15:13:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"- ADD: add possibility to translate Category based CMS-SLOT-Configs","creationDate":{"date":"2022-06-23 15:00:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"FIX: adjust Z-Index for CMS-Slot Single translation","creationDate":{"date":"2022-06-22 11:12:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"FIX: Bug where in some Enviroments Javascript Int are interpreted as Strings (only effects Backend not Translations)","creationDate":{"date":"2022-06-21 12:09:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"FIX: single Translation warning on specific MYSQL settings","creationDate":{"date":"2022-06-13 10:02:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"ADD: Adding new Translation possibility (Turkish, indonesian)","creationDate":{"date":"2022-06-13 08:31:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>Hotfix: Fixing Routes<br /></p>","creationDate":{"date":"2022-06-07 09:17:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"ADD: Adding Single Entity Translation","creationDate":{"date":"2022-05-18 17:02:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"FIX: Fixing Twig Template translation bugs","creationDate":{"date":"2022-05-10 15:18:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"HOTFIX: Product and Category Title Config settable","creationDate":{"date":"2022-04-26 17:59:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"HOTFIX: Default Values for Database and CustomFields field for mailHeaderFooter table","creationDate":{"date":"2022-04-26 15:22:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"HOTFIX: expecting NULL value of CustomFields","creationDate":{"date":"2022-04-25 16:10:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"ADD: add possibility to translate CustomFields","creationDate":{"date":"2022-04-22 16:25:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Fix Translation Error<br /></p>","creationDate":{"date":"2022-04-12 15:40:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"ADD: adding possibility to prevent translation of inactive Produts and Categories","creationDate":{"date":"2022-04-06 13:34:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p>FIX: Fetching more than 25 Languages</p>","creationDate":{"date":"2022-04-05 09:31:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"ADD: Adding Events so other Plugins can extend the CMS-Slot Translation","creationDate":{"date":"2022-04-04 15:43:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"HOTFIX: Fixing missing index on Cross-Selling Products","creationDate":{"date":"2022-03-17 15:39:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"FIX: Fixing Translation of empty ProductCrossSellings Titles","creationDate":{"date":"2022-03-07 11:39:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"HOTFIX: Fixing Code Structure und Übersetzungsfehler","creationDate":{"date":"2022-02-17 16:40:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"HOTFIX: Fixing Code Structure und Übersetzungsfehler","creationDate":{"date":"2022-02-17 16:39:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>ADD: Add CMS Slots to translation</p>","creationDate":{"date":"2022-02-08 13:18:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"ADD: add Slot-Translation","creationDate":{"date":"2022-02-08 13:16:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- ADD: add possibility to translate product_cross_sellings_titles as well</p><p>- FIX: FIX BUG where\ntags will dissapear after translation if there are not self closing</p>","creationDate":{"date":"2022-01-28 15:32:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- ADD: add possibility to translate product_cross_sellings_titles as well</p><p>- FIX: FIX BUG where\ntags will dissapear after translation if there are not self closing</p>","creationDate":{"date":"2022-01-28 15:30:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Version for Shopware 6.1.x - 6.3.x<br /></p>","creationDate":{"date":"2021-12-06 16:20:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Release of the Plugin<br /></p>","creationDate":{"date":"2021-10-15 17:06:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Pixup67953015752","redirectToStore":false,"lowestPriceValue":0}