{"id":14109,"name":"relevanzApp","code":"relev10022925761","lastChange":{"date":"2023-07-18 11:16:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpn3Iwfa","examplePageUrl":"","moduleKey":"relevanzApp","creationDate":{"date":"2021-10-06 15:16:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-11-22 16:02:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-11-04 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-10-14 22:27:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":888,"prefix":"relev","name":"releva.nz - Dynamisches Retargeting für Webshops","website":"//releva.nz","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod888_128x128px.png"},"infos":[{"id":24555,"name":"releva.nz | Dynamisches Retargeting","description":"<h2>Dynamisches Retargeting, einfach für jeden Shopware Betreiber - jetzt auch für Shopware Cloud</h2><p>Mit der releva.nz App sprichst Du Shop-Besucher gezielt mit personalisierten, produktbezogenen Online-Bannern an, auch wenn sie deinen Shopware Shop bereits verlassen haben. Dabei wird ein Teil der Kaufabbrecher aktiviert, kehrt auf deinen Webshop zurück und schließt den Kauf ab. Deine Conversion-Rate steigt signifikant und Du profitierst von Umsatzsteigerungen von bis zu 15 Prozent!</p><p>Durch die einfache Bedienung der App (keine Programmierkenntnisse erforderlich) und eine Kampagnenoptimierung auf Basis künstlicher Intelligenz ist releva.nz für Online-Händler jeder Größe geeignet.</p><p>Teste die releva.nz App für Shopware 30 Tage kostenfrei in vollem Funktionsumfang und sichere dir ein Werbebudget von 30 Euro zum Start:&nbsp;<a href=\"https://releva.nz/kostenlos-testen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://releva.nz/shopware-anmeldung-30-tage/</a></p><p><br></p><h2>Kernfunktionen der releva.nz Retargeting App</h2><p></p><p><b>Automatische Erstellung dynamischer Werbebanner&nbsp;</b></p><p>Du musst deine Display-Anzeigen nicht selbst gestalten - releva.nz generiert automatisch auf Basis deiner Shop-Produkte ansprechende Ads.</p><p><b>Optimaler Einsatz des Tagesbudgets&nbsp;</b></p><p>Du legst dein tägliches Werbebudget im Shopware-Backend fest - releva.nz sorgt dafür, dass es kosteneffizient eingesetzt wird.</p><p><b>Kampagnenoptimierung auf Basis künstlicher Intelligenz&nbsp;</b></p><p>Selbstlernende Algorithmen optimieren die Auslieferung deiner Ads. Zum Beispiel werden Besucher, die gerade deinen Shop verlassen haben, vorrangig angesprochen.</p><p><b>Integration der Retargeting-Pixel ohne Programmierkenntnisse&nbsp;</b></p><p>Die releva.nz App übernimmt den technischen Part für dich und platziert die Retargeting-Pixel selbstständig auf allen relevanten Seiten deines Webshops.</p><p><b>Dosierter Einsatz von Werbeanzeigen&nbsp;</b></p><p>Die releva.nz App lernt selbst, welche Anzeigen-Frequenz auf welchem Endgerät bei deiner Zielgruppe am besten ankommt. Außerdem wird nach Kaufabschluss keine Werbung mehr zum gekauften Produkt angezeigt.</p><p><b>Anzeigen-Distribution an über 30 Werbenetzwerke&nbsp;</b></p><p>Abgesehen von der Google Marketing Platform arbeitet releva.nz z.B. mit dem Rubicon Project, OpenX, AppNexus und vielen mehr. So können wir eine Abdeckung von bis zu 85 % aller Werbeplätze im deutschsprachigen Raum gewährleisten.</p><p><b>Echtzeit-Statistiken im Shopware-Backend&nbsp;</b></p><p>Mit den Live-Statistiken im Shopware Backend hast Du dein Werbebudget sowie das Verhalten deiner Shop-Besucher immer im Blick und siehst genau, wie effizient der selbstlernende releva.nz&nbsp; Algorithmus Anzeigen aussteuert.</p><p></p><p><br></p><h2>Diese Vorteile bietet dynamisches Retargeting mit der releva.nz Shopware App</h2><p>Für große Shopbetreiber ist dynamisches Retargeting mittlerweile zum Standard-Tool geworden, um Umsätze nachhaltig und signifikant zu steigern. Die releva.nz App macht den Zugang zu dieser Werbetechnologie nun für Händler jeglicher Größe möglich. Dabei profitieren sie von folgenden Vorteilen:</p><p><b>Identifikation von Kaufabbrechern&nbsp;</b></p><p>Besucher werden per Retargeting-Pixel markiert und klassifiziert, während sie sich Produkte in deinem Shop ansehen oder in den Warenkorb legen. Verlassen sie den Shop, sind sie für dich über personalisierte Anzeigenplatzierung immer noch greifbar.</p><p><b>Neukunden gewinnen&nbsp;</b></p><p>Statt ungezielt immer mehr Traffic auf deinen Webshop zu lenken, analysiert die releva.nz App deine Besucher und begleitet sie bis zum Kaufabschluss. Streuverluste werden minimiert und dein Budget wird optimal eingesetzt. So rechnet sich Neukundengewinnung.</p><p><b>Zeit- und Kostenersparnis durch vollautomatisierte Anzeigen-Prozesse&nbsp;</b></p><p>Die erste Retargeting-Kampagne ist mit releva.nz innerhalb weniger Minuten eingerichtet - ganz ohne Hilfe externer Dienstleister.</p><p><b>DSGVO-konforme Einbindung&nbsp;</b></p><p>Die releva.nz App ist kompatibel mit der Cookie-Lösung von Shopware 6 sowie mit den bekanntesten Cookie-Hinweis-Anbietern wie Consentmanager, Usercentrics oder Cookiebot.&nbsp;Darüber ist releva.nz mit den gängigsten Drittanbieter-Lösungen für Shopware 6 wie Acris, plehn media und Mediameets kompatibel.</p><p><br></p><h2>Fortschrittlichste Retargeting-Technologie auf Basis künstlicher Intelligenz</h2><p></p><p>Technologieführerschaft, made in Germany: Die releva.nz App gehört zu den fortschrittlichsten Tools für dynamisches Retargeting im E-Commerce. Als Herzstück dient das releva.nz Datencenter. Dort werden Benutzer- und Anzeigeninformationen mithilfe von Deep Learning Algorithmen analysiert und deine laufenden Retargeting-Kampagnen in Echtzeit optimiert. So merkst Du schon nach kurzer Zeit eine signifikante Zunahme der Umsätze in deinem Webshop.</p><p>Und so funktioniert die Technologie hinter der releva.nz App Schritt für Schritt:</p><p><b>Schritt 1: Webshop-Besucher werden markiert</b></p><p>Mithilfe von Retargeting-Pixeln, welche die releva.nz App selbstständig in deinem Webshop platziert, werden Besucher markiert. Im Browser des Users wird darüber hinaus ein Cookie gesetzt. Ab diesem Zeitpunkt wird das für Retargeting relevante Nutzerverhalten im releva.nz Datencenter gespeichert.</p><p><b>Schritt 2: Besucher werden klassifiziert</b></p><p>Durch das Retargeting-Pixel wird das Verhalten des Users im Detail analysiert. Dann findet eine Klassifizierung statt, z.B. woher der User kam, welche Produkte er sich angeschaut und in den Warenkorb gelegt hat, wie lange er Zeit auf dem Shop verbracht hat uvm.</p><p><b>Schritt 3: Automatische Erstellung personalisierter Ads</b></p><p>Die gewonnenen und klassifizierten Informationen werden im releva.nz Datencenter ausgewertet und zu personalisierten, produktbezogenen Online-Ads umgewandelt. Dabei findet eine Priorisierung nach Kaufwahrscheinlichkeit statt.</p><p><b>Schritt 4: Budget-Optimierung durch automatisierte Gebotsstrategien</b></p><p>Mithilfe Künstlicher Intelligenz wird im releva.nz Datencenter die zum Userverhalten passende Gebotsstrategie festgelegt - damit übernimmt die App die Arbeit eines Anzeigen-Spezialisten und das in einem Bruchteil der Zeit.</p><p><b>Schritt 5: Werbemittel-Ausspielung auf externen Seiten</b></p><p>Unser Datencenter ist mit den weltweit größten Ad-Netzwerken verbunden und wir distribuieren Anzeigen über unsere eigenen Ad-Server. So ist eine reibungslose Platzierung von Ads in themen- und produktrelevanten Umfeldern auf externen Seiten sichergestellt.</p><p><b>Schritt 6: Kontinuierliche Optimierung des Anzeigen-Kreislaufes</b></p><p>Der releva.nz Algorithmus übernimmt für dich das A/B Testing und lernt schnell, zu welcher Uhrzeit deine Shop-Besucher am empfänglichsten für Online-Werbung sind, welche Browser am häufigsten verwendet werden, welche geografischen Standorte am besten funktionieren, über welches Endgerät bevorzugt geklickt und gekauft wird uvm.</p><p><b>Schritt 7: Conversion-Rate und Shop-Umsatz steigen signifikant</b></p><p>Durch diesen sich selbst optimierenden Kreislauf wird sichergestellt, dass Kaufabbrecher effizient auf deinen Shop zurückgeführt und in Käufer umgewandelt werden. Damit steigerst Du deinen Umsatz um bis zu 15 %.</p>","installationManual":"<ul><li>Öffne unter \"Erweiterungen\" in deinem SW-Backend und installiere die relevanz App</li><li>Melde dich für unseren unverbindlichen &amp; kostenlosen Test an:&nbsp;<a href=\"https://releva.nz/kostenlos-testen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://releva.nz/shopware-anmeldung-30-tage/</a></li><li>Dein API-Key wird automatisch in deinem Account unter releva.nz hinterlegt:&nbsp;<a href=\"https://frontend.releva.nz/\">https://frontend.releva.nz/</a></li><li>Via copy and paste hinterlege den API-Key - aus deinem Account - in der relvanz App in deinem SW-Backend</li></ul><p><br></p><p>Und los geht's : )</p>","shortDescription":"Hol deine Besucher zurück und mach sie zu Käufern - mit dynamischem Retargeting. Funktionen: Automatische Erstellung & Platzierung von Online-Bannern, Kampagnenoptimierung durch KI uvm.","highlights":"Mit dynamischem Retargeting Shop-Umsatz um bis zu 15 % steigern\nMit wenigen Klicks zur ersten Retargeting-Kampagne\n30 Tage kostenfrei testen und 30 Euro Werbebudget geschenkt\nDSVGO-konformer Einsatz der Retargeting-Technologie\nApp-Hersteller aus Deutschland mit persönlichem Support","features":"Automatische Erstellung dynamischer Werbebanner\nOptimaler Einsatz des Tagesbudgets\nKampagnenoptimierung auf Basis Künstlicher Intelligenz\nEinfache Integration des Retargeting-Pixels\nDosierter Einsatz von Werbeanzeigen\nAnzeigen werden an über 30 Werbenetzwerke ausgeliefert\nEchtzeit-Statistiken im Webshop-Backend"},{"id":24556,"name":"releva.nz | Dynamic Retargeting","description":"<h2>Dynamic Retargeting made simple for every Shopware Owner - now available for Shopware 6</h2><p>The releva.nz plugin lets you target shop visitors with personalized, product-based online banners, even after they have already left your store. Thanks to this, part of the visitors who had abandoned their cart are being reactivated: they return to your shop and finish their purchase. Your conversion rate rises significantly and your sales increase up to 15 percent.</p><p>You do not need any programming knowledge for our plugin and thus, it’s super easy to handle. Thanks to campaign optimization based on Artificial Intelligence (AI), releva.nz is suitable for online merchants of any size.</p><p>You can now get a free trial of our releva.nz plugin for Shopware for 30 days including all its features. We even give you an ad budget of 30 EUR to get started:&nbsp;<a href=\"https://releva.nz/kostenlos-testen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://releva.nz/kostenlos-testen/</a></p><p>Are you planning on updating your Shopware shop to version 6 or have you already done so? Of course, you can use the releva.nz plugin for Shopware 6 as well.</p><h2><br></h2><h2>Core features of the releva.nz retargeting plugin</h2><p><b>Automatic creation of dynamic ad banners&nbsp;</b></p><p>You don’t have to design your own display ads - releva.nz automatically generates appealing ads based on your shop products</p><p><b>Efficient use of daily ad budget&nbsp;</b></p><p>You determine your daily ad budget in the Shopware backend - releva.nz makes sure it’s used cost-efficiently&nbsp;</p><p><b>Campaign optimization based on AI&nbsp;</b></p><p>Self-learning algorithms optimize the distribution of your ads. I.e., these ads primarily target visitors who just left your shop&nbsp;</p><p><b>Integration of retargeting pixel without programming knowledge&nbsp;</b></p><p>The releva.nz plugin takes care of the technical details for you and places retargeting pixels independently on all relevant pages of your online store.</p><p><b>Controlled use of ads&nbsp;</b></p><p>The releva.nz plugin learns on its own how many times an ad should be shown to which terminal device of your target group. Once a customer buys, s/he will no longer receive any ads about the bought product.</p><p><b>Ads distribution via more than 30 ad networks&nbsp;</b></p><p>releva.nz does not only work with the Google Marketing Platform, but also with Rubicon Project, OpenX, AppNexus and many more. That’s how we can guarantee a coverage of 85% of all ad spaces in the European area.</p><p><b>Realtime statistics in the Shopware backend&nbsp;</b></p><p>With the live statistics in the Shopware backend you always have an eye on your ad budget as well as the behavior of your shop visitors and you are able to view how efficiently the self-learning releva.nz algorithm distributes ads</p><p></p><h2><br></h2><h2>Dynamic retargeting with the releva.nz Shopware plugin: These are the advantages</h2><p>Large shop operators have been using dynamic retargeting as a standard tool to consistently and significantly increase their sales.The relevan.nz plugin now allows shop operators of any size to use this ad technology. Hereby, you can profit from the following advantages:</p><p><b>Identification of visitors who have abandoned their cart&nbsp;</b></p><p>Visitors are marked and classified while they’re looking at products in your shop or placing them into the shopping cart. If they abandon their cart, you can still target them via personalized ad placement.</p><p><b>Win new customers</b></p><p>Instead of leading more random traffic to your online store, the releva.nz plugin analyzes your customers and monitors them until they buy. Scatter losses are minimized and your budget is used efficiently. That’s how you actually get new paying customers.</p><p><b>Save time and money through fully-automated ad processes&nbsp;</b></p><p>releva.nz lets you create your first retargeting campaign within a few minutes - without the help of external service providers.&nbsp;</p><p><b>GDPR-compliant integration&nbsp;</b></p><p>The releva.nz plugin is compatible with the cookie solution of Shopware 6 as well as with the most popular cookie consent providers such as Consentmanager, Usercentrics, or Cookiebot.&nbsp;In addition, releva.nz is compatible with the most common third-party solutions for Shopware 5 such as Acris, plehn media and Mediameets.</p><p></p><h2><br></h2><h2>The most progressive retargeting technology based on AI</h2><p>Technology leadership made in Germany: The releva.nz plugin is one of the most advanced tools for dynamic retargeting in E-commerce. At the core we have the releva.nz data center. That’s where user and ad information are analyzed with the help of deep learning algorithms and your running retargeting campaign is optimized in real time. This is what leads to a significant increase of sales in your online store.</p><p>Here’s how the technology behind the releva.nz plugin works:</p><p><b>Step 1: Tagging webshop visitors</b></p><p>Releva.nz automatically places retargeting pixels in your webshop, which tag visitors. A cookie is set in the user’s browser. From this point on, relevant user behavior is stored in the releva.nz data center.</p><p><b>Step 2: Classifying visitors</b></p><p>The retargeting pixels analyze the behavior of the user in detail. Then it classifies where the user came from, which products s/he viewed and placed into the cart, how much time s/he spent in the shop, and more.</p><p><b>Step 3: Automatically creating personalized ads</b></p><p>The releva.nz data center evaluates obtained and classified information and turns the information into personalized, product-related online ads. This process also prioritizes customers who are more likely to buy.&nbsp;</p><p><b>Step 4: Budget optimization via automated bid strategies</b></p><p>AI supports the releva.nz data center in finding the right bid strategy that suits the user’s behavior - this is how the plugin takes over an ad specialist’s work in a fraction of the time.</p><p><b>Step 5: Ad distribution via external sites</b></p><p>Our data center is connected to the world’s biggest ad networks and we distribute ads via our own ad server; thus, we can ensure a seamless placement of ads on external sites in subject- and product-relevant environments.&nbsp;</p><p><b>Step 6: Continuous optimization of the ad cycle</b></p><p>The releva.nz algorithm does the A/B testing for you and quickly learns at what time your shop visitors are most receptive to online ads, which browsers are used the most, which geographic locations work best and from which terminal device they click and buy, etc.</p><p><b>Step 7: Conversion rate and shop sales increase significantly</b></p><p>This automatically self-optimizing cycle ensures that visitors who abandon their cart will return to your shop and turn into customers. That’s how you increase your sales up to 15%.</p>","installationManual":"<ul><li>Open the Plugin Manager in your SW backend</li><li>Sign up for our non-binding &amp; free test: https://releva.nz/kostenlos-testen/</li><li>Then you will receive your API key via email ...</li></ul><p></p><p><br></p><p>And let's go :)</p><p><br></p><p>You can find a technical description directly in the plugin folder under README.</p><p>You can also download the plugin from our website or via Github.</p>","shortDescription":"Bring your visitors back and turn them into buyers - with dynamic retargeting. \nFeatures: automatic creation and placement of online banners, campaign optimization via AI and many more.","highlights":"Increase your sales by up to 15 % with dynamic retargeting\nYour first retargeting campaign with just a few clicks\nTry our plugin for free for 30 days and get 30 EUR ad budget\nGDPR-compliant integration of retargeting technology\nPersonal support and onboarding","features":"Automatic creation of dynamic web banners\nEfficient use of daily ad budget\nCampaign optimization based on AI\nSimple integration of the retargeting pixels\nRegulated use of ads\nAds distribution to more than 30 ad networks\nReal time statistics in the webshop backend"}],"addons":["isAppContestParticipant"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164263,"bookingKey":"relev10022925761","bookingText":"releva.nz | Dynamic Retargeting","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppljBK3","preview":true,"priority":0,"id":73880},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdcRSmS","preview":false,"priority":20,"id":73882},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpG5zCMc","preview":false,"priority":20,"id":73884},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwqL4I7","preview":false,"priority":10,"id":75182},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM9qpae","preview":false,"priority":0,"id":73885},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfkk8fP","preview":false,"priority":0,"id":73886},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwVwuQs","preview":false,"priority":0,"id":73887},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAeMFub","preview":false,"priority":0,"id":73888},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgZL5tm","preview":false,"priority":0,"id":73889},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpd51Rrc","preview":false,"priority":0,"id":73890}],"comments":[{"authorName":"Tobias Püls","text":"Eine tolle App, die einfach und schnell eingerichtet ist. Kleine anfängliche Startschwierigkeiten unserer SW-Version hat der Support freundlich und kompetent behoben. \nMan muss eigentlich nur das Budget festlegen und schon läuft es. In den Statistiken werden alle wesentlichen KPIs direkt angezeigt.","headline":"Einfach, effektiv und toller Support","creationDate":{"date":"2023-03-20 14:31:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"releva.nz | Dynamisches Retargeting","description":"<h2>Dynamisches Retargeting, einfach für jeden Shopware Betreiber - jetzt auch für Shopware Cloud</h2><p>Mit der releva.nz App sprichst Du Shop-Besucher gezielt mit personalisierten, produktbezogenen Online-Bannern an, auch wenn sie deinen Shopware Shop bereits verlassen haben. Dabei wird ein Teil der Kaufabbrecher aktiviert, kehrt auf deinen Webshop zurück und schließt den Kauf ab. Deine Conversion-Rate steigt signifikant und Du profitierst von Umsatzsteigerungen von bis zu 15 Prozent!</p><p>Durch die einfache Bedienung der App (keine Programmierkenntnisse erforderlich) und eine Kampagnenoptimierung auf Basis künstlicher Intelligenz ist releva.nz für Online-Händler jeder Größe geeignet.</p><p>Teste die releva.nz App für Shopware 30 Tage kostenfrei in vollem Funktionsumfang und sichere dir ein Werbebudget von 30 Euro zum Start: <a href=\"https://releva.nz/kostenlos-testen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://releva.nz/shopware-anmeldung-30-tage/</a></p><p><br /></p><h2>Kernfunktionen der releva.nz Retargeting App</h2><p></p><p><b>Automatische Erstellung dynamischer Werbebanner </b></p><p>Du musst deine Display-Anzeigen nicht selbst gestalten - releva.nz generiert automatisch auf Basis deiner Shop-Produkte ansprechende Ads.</p><p><b>Optimaler Einsatz des Tagesbudgets </b></p><p>Du legst dein tägliches Werbebudget im Shopware-Backend fest - releva.nz sorgt dafür, dass es kosteneffizient eingesetzt wird.</p><p><b>Kampagnenoptimierung auf Basis künstlicher Intelligenz </b></p><p>Selbstlernende Algorithmen optimieren die Auslieferung deiner Ads. Zum Beispiel werden Besucher, die gerade deinen Shop verlassen haben, vorrangig angesprochen.</p><p><b>Integration der Retargeting-Pixel ohne Programmierkenntnisse </b></p><p>Die releva.nz App übernimmt den technischen Part für dich und platziert die Retargeting-Pixel selbstständig auf allen relevanten Seiten deines Webshops.</p><p><b>Dosierter Einsatz von Werbeanzeigen </b></p><p>Die releva.nz App lernt selbst, welche Anzeigen-Frequenz auf welchem Endgerät bei deiner Zielgruppe am besten ankommt. Außerdem wird nach Kaufabschluss keine Werbung mehr zum gekauften Produkt angezeigt.</p><p><b>Anzeigen-Distribution an über 30 Werbenetzwerke </b></p><p>Abgesehen von der Google Marketing Platform arbeitet releva.nz z.B. mit dem Rubicon Project, OpenX, AppNexus und vielen mehr. So können wir eine Abdeckung von bis zu 85 % aller Werbeplätze im deutschsprachigen Raum gewährleisten.</p><p><b>Echtzeit-Statistiken im Shopware-Backend </b></p><p>Mit den Live-Statistiken im Shopware Backend hast Du dein Werbebudget sowie das Verhalten deiner Shop-Besucher immer im Blick und siehst genau, wie effizient der selbstlernende releva.nz  Algorithmus Anzeigen aussteuert.</p><p></p><p><br /></p><h2>Diese Vorteile bietet dynamisches Retargeting mit der releva.nz Shopware App</h2><p>Für große Shopbetreiber ist dynamisches Retargeting mittlerweile zum Standard-Tool geworden, um Umsätze nachhaltig und signifikant zu steigern. Die releva.nz App macht den Zugang zu dieser Werbetechnologie nun für Händler jeglicher Größe möglich. Dabei profitieren sie von folgenden Vorteilen:</p><p><b>Identifikation von Kaufabbrechern </b></p><p>Besucher werden per Retargeting-Pixel markiert und klassifiziert, während sie sich Produkte in deinem Shop ansehen oder in den Warenkorb legen. Verlassen sie den Shop, sind sie für dich über personalisierte Anzeigenplatzierung immer noch greifbar.</p><p><b>Neukunden gewinnen </b></p><p>Statt ungezielt immer mehr Traffic auf deinen Webshop zu lenken, analysiert die releva.nz App deine Besucher und begleitet sie bis zum Kaufabschluss. Streuverluste werden minimiert und dein Budget wird optimal eingesetzt. So rechnet sich Neukundengewinnung.</p><p><b>Zeit- und Kostenersparnis durch vollautomatisierte Anzeigen-Prozesse </b></p><p>Die erste Retargeting-Kampagne ist mit releva.nz innerhalb weniger Minuten eingerichtet - ganz ohne Hilfe externer Dienstleister.</p><p><b>DSGVO-konforme Einbindung </b></p><p>Die releva.nz App ist kompatibel mit der Cookie-Lösung von Shopware 6 sowie mit den bekanntesten Cookie-Hinweis-Anbietern wie Consentmanager, Usercentrics oder Cookiebot. Darüber ist releva.nz mit den gängigsten Drittanbieter-Lösungen für Shopware 6 wie Acris, plehn media und Mediameets kompatibel.</p><p><br /></p><h2>Fortschrittlichste Retargeting-Technologie auf Basis künstlicher Intelligenz</h2><p></p><p>Technologieführerschaft, made in Germany: Die releva.nz App gehört zu den fortschrittlichsten Tools für dynamisches Retargeting im E-Commerce. Als Herzstück dient das releva.nz Datencenter. Dort werden Benutzer- und Anzeigeninformationen mithilfe von Deep Learning Algorithmen analysiert und deine laufenden Retargeting-Kampagnen in Echtzeit optimiert. So merkst Du schon nach kurzer Zeit eine signifikante Zunahme der Umsätze in deinem Webshop.</p><p>Und so funktioniert die Technologie hinter der releva.nz App Schritt für Schritt:</p><p><b>Schritt 1: Webshop-Besucher werden markiert</b></p><p>Mithilfe von Retargeting-Pixeln, welche die releva.nz App selbstständig in deinem Webshop platziert, werden Besucher markiert. Im Browser des Users wird darüber hinaus ein Cookie gesetzt. Ab diesem Zeitpunkt wird das für Retargeting relevante Nutzerverhalten im releva.nz Datencenter gespeichert.</p><p><b>Schritt 2: Besucher werden klassifiziert</b></p><p>Durch das Retargeting-Pixel wird das Verhalten des Users im Detail analysiert. Dann findet eine Klassifizierung statt, z.B. woher der User kam, welche Produkte er sich angeschaut und in den Warenkorb gelegt hat, wie lange er Zeit auf dem Shop verbracht hat uvm.</p><p><b>Schritt 3: Automatische Erstellung personalisierter Ads</b></p><p>Die gewonnenen und klassifizierten Informationen werden im releva.nz Datencenter ausgewertet und zu personalisierten, produktbezogenen Online-Ads umgewandelt. Dabei findet eine Priorisierung nach Kaufwahrscheinlichkeit statt.</p><p><b>Schritt 4: Budget-Optimierung durch automatisierte Gebotsstrategien</b></p><p>Mithilfe Künstlicher Intelligenz wird im releva.nz Datencenter die zum Userverhalten passende Gebotsstrategie festgelegt - damit übernimmt die App die Arbeit eines Anzeigen-Spezialisten und das in einem Bruchteil der Zeit.</p><p><b>Schritt 5: Werbemittel-Ausspielung auf externen Seiten</b></p><p>Unser Datencenter ist mit den weltweit größten Ad-Netzwerken verbunden und wir distribuieren Anzeigen über unsere eigenen Ad-Server. So ist eine reibungslose Platzierung von Ads in themen- und produktrelevanten Umfeldern auf externen Seiten sichergestellt.</p><p><b>Schritt 6: Kontinuierliche Optimierung des Anzeigen-Kreislaufes</b></p><p>Der releva.nz Algorithmus übernimmt für dich das A/B Testing und lernt schnell, zu welcher Uhrzeit deine Shop-Besucher am empfänglichsten für Online-Werbung sind, welche Browser am häufigsten verwendet werden, welche geografischen Standorte am besten funktionieren, über welches Endgerät bevorzugt geklickt und gekauft wird uvm.</p><p><b>Schritt 7: Conversion-Rate und Shop-Umsatz steigen signifikant</b></p><p>Durch diesen sich selbst optimierenden Kreislauf wird sichergestellt, dass Kaufabbrecher effizient auf deinen Shop zurückgeführt und in Käufer umgewandelt werden. Damit steigerst Du deinen Umsatz um bis zu 15 %.</p>","installationManual":"<ul><li>Öffne unter \"Erweiterungen\" in deinem SW-Backend und installiere die relevanz App</li><li>Melde dich für unseren unverbindlichen &amp; kostenlosen Test an: <a href=\"https://releva.nz/kostenlos-testen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://releva.nz/shopware-anmeldung-30-tage/</a></li><li>Dein API-Key wird automatisch in deinem Account unter releva.nz hinterlegt: <a href=\"https://frontend.releva.nz/\">https://frontend.releva.nz/</a></li><li>Via copy and paste hinterlege den API-Key - aus deinem Account - in der relvanz App in deinem SW-Backend</li></ul><p><br /></p><p>Und los geht's : )</p>","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<p>- improved support for Shopware 6.5</p>","creationDate":{"date":"2023-06-21 15:34:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- fixes problems with Shoopware 6.4.3</p><p>- App is now listed in the marketing menu</p>","creationDate":{"date":"2023-01-26 14:26:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.5","text":"<p>- improve the UI</p><p>- improve product export</p><p>- performance improvements</p>","creationDate":{"date":"2023-01-10 06:19:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.2","text":"<p>Fixed url encoding issues.</p>","creationDate":{"date":"2021-12-17 15:28:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.1","text":"<p>Implementation of our popular plugin as an app</p>","creationDate":{"date":"2021-10-15 17:43:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=relev10022925761","redirectToStore":false,"lowestPriceValue":0}