{"id":14139,"name":"AcrisDiscountGroupCS","code":"acris86132570962","lastChange":{"date":"2023-07-21 11:03:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoffFrJ","examplePageUrl":"","moduleKey":"AcrisDiscountGroupCS","creationDate":{"date":"2021-10-11 09:48:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-02-08 15:59:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-01-09 12:49:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":24612,"name":"Rabattgruppen: Kunden-Rabatt auf Warengruppen vom Listenpreis + Staffelrabatte Produkt übergreifend","description":"<h3>Zweck / Funktion des Plugins<br></h3><p>Mit diesem Plugin ist es möglich, Rabatte (oder auch Zuschläge) für frei definierbare Kunden auf frei definierte Produkte auf den aktuellen Verkaufspreis festzulegen.</p><p>Zusätzlich ist es möglich, den bisherigen Verkaufspreis als Streichpreis zu setzen, sodass die Kunden sofort die Einsparung sehen können.<br></p><p>Dieses Plugin ist speziell für B2B Projekte sinnvoll, wo der aktuelle Verkaufspreis der \"Listenpreis\" ist und die Kunden des Händlers verschiedene Rabatt auf Produkte (mit Warengruppen) bekommen sollen. Durch die vielfältigen Konfigurationsmöglichkeiten lassen sich fast alle B2B relevanten Rabatte abbilden.<br></p><p><br></p><p><b>Neues Features ab Version 2.1.0<br></b></p><ul><li>Rabattgruppen im Kundenkonto anzuzeigen (Ein frei definierbarter Text kann bei einer Rabattgruppen Regel hinterlegt werden.<br>(Dieser wird im Mein Konto Bereich angezeigt / Account Übersicht dies Kunden)</li></ul><b>Neues Features ab Version 3.2.0</b><ul><li>Ab\nsofort ist es bei absoluten Zuschlägen oder Rabatten möglich, diese multipliziert mit der Anzahl der Positionen oder mit der Anzahl der Positionen und deren Menge zu berechnen. (Ermöglicht eine mengenbasierte Berechnung von Aufpreisen / Abschlägen.)</li></ul><b>Neue Funktionen von Version 4.2.0</b><ul><li>Fügt eine neue Plugin-Konfiguration für die Verwendung von <b>Staffelrabatten im Warenkorb über Produkte hinweg hinzu.</b></li><li>Fügt eine neue Plugin-Konfiguration für die Anzeige der aktuellen Anzahl von Artikeln in der gleichen Rabattgruppe aus dem Einkaufswagen als Hinweis auf der Produktseite hinzu.</li><li>Fügt ein neues Feld für den Anzeigenamen auf der Detailseite der Rabattgruppe in der Verwaltung hinzu.<br></li></ul><p></p><p><b><br></b></p><p><b>Neue Funktionen von Version 4.4.0</b><br></p><ul><li>&nbsp;&nbsp;&nbsp; Ermöglicht die Berechnung des Verkaufspreises ausgehend vom Einkaufpreis mit einem Zuschlag von x%.<br></li></ul><h3><br></h3><h3>Mögliche Definition / Selektion von Kunden:</h3><ul><li>Einzelner Kunde (Auswahl aus den in Shopware angelegten Kunden)</li><li>Kunden-Rabattgruppe (Im Admin Bereich bei den Kunden kann eine Kunden-Rabattgruppe definiert werden)<br></li><li>Regel (Nutzung einer zuvor in Shopware angelegten Regel mittels des Rule Builders) <br></li></ul><h3><br></h3><h3>Mögliche Definition / Selektion von Produkten:<br></h3><ul><li>Einzelne Produkte (Auswahl aus den in Shopware angelegten Produkten)</li><li>Warengruppe (Rabattgruppe) (Im Admin Bereich bei den Produkten kann eine Warengruppe (Rabattgruppe) definiert werden)<br></li><li>Dynamische Produktgruppe:&nbsp; Nutzung einer zuvor in Shopware angelegten Dynamischen Produktgruppe <br></li></ul><p><br></p><h3>Mögliche Rabatte / Zuschläge:<br></h3><ul><li>Rabatttyp: Absolut oder Prozentual auswählbar und Eingabe eines Wertes<br></li><li>Abschlag / Zuschlag: Abschlag oder Zuschlag auswählbar<br></li></ul><p><br></p><h3>Mögliche Optionen zur Anzeige der Preis-/ Streichpreis Anzeige im Frontend:<br></h3><ul><li>Wenn kein Streichpreis vorhanden, <b>keinen neuen Streispreis setzen</b>. Wenn ein Streichpreis vorhanden, diesen behalten.</li><li>Wenn kein Streichpreis vorhanden, <b>ursprünglichen Preis als Streispreis setzen</b>. Wenn ein Streichpreis vorhanden, diesen behalten.</li><li><b>Immer den ursprünglichen Verkaufspreis des Produktes als Streichpreis verwenden</b>, auch wenn das Produkt einen eigenen Streichpreis besitzt.</li><li>Ursprünglichen Streichpreis immer ignorieren.<br></li></ul><p><br></p><h3>Bekannte Einschränkungen / Hinweise zur Nutzung:<br></h3><ul><li><b>Kunden-Rabattgruppen:&nbsp;</b><br>Es ist nur<b> eine </b>Kennzeichnung je Kunde möglich. Das bedeutet, dass ein Kunden nur in einer Kunden-Rabattgruppe sein kann, nicht in mehreren Kunden-Rabattgruppen. z.B. HEK1<br></li><li><b>Warengruppe (Rabattgruppe) - je SPRACHE festzulegen<br></b>Jedes Produkt kann nur <b>eine</b> Warengruppe (Rabattgruppe) besitzen - dies ist<b> je genutzter SPRACHE </b>zu einzugeben&nbsp; z.B. WG-DE-100 <br>Dies ermöglicht es, für jede Sprachen eine andere Warengruppe festzulegen und somit andere Rabattregeln festzulegen z.B. WG-EN-101<br>Wird in einer Sprachen keine Warengruppe (Rabattgruppe) festgelegt, dann werden in dieser Sprache kein Rabatte abgezogen.<br>Soll in allen Sprache dieselbe Warengruppe zur Anwendung kommen, dann müssen diese je Sprache hinterlegt werden.<br></li></ul><p><br></p><h3>Anwendungsfall #1&nbsp; <br>Ein einzelner B2B Kunde erhält einen Rabatt auf eine (oder mehrere) Warengruppen vom aktuellen Verkaufspreis<br></h3><p><br><b></b></p><p><b>Anforderung</b></p><ul><li>Produkte sind im ERP in Warengruppen eingeteilt und haben einen aktuellen Verkaufspreis (z.B. Listenpreis).<br></li><li>B2B-Kunden sollen auf den Listenpreis einen Rabatt erhalten - und zwar unterschiedlich je Warengruppe&nbsp; <br></li></ul><p><br></p><p><b>Lösungsweg</b></p><ul><li>Voraussetzung: Produkte müssen die Warengruppen Info besitzen. <br>Dies ist direkt beim Produkt im neuen Tab \"Rabattgruppen\" -&gt; \"\"Warengruppe (Rabattgruppe) einzutragen. (z.B. WG888)<br>(Alternativer Weg: Kataloge &gt; Produkte &gt; Produkt auswählen &gt; Reiter Spezifikationen, im Bereich Zusatzfelder &gt; Rabattgruppe eintragen (z.B. WG888))</li><li>B2B-Kunden die Rabatte für die einzelnen Warengruppen zuweisen<br>Kunden &gt; Übersicht &gt; Kunde auswählen &gt; Reiter Rabattgruppen &gt; bearbeiten &gt; neue Rabattgruppe hinzufügen<br><b>Bereich Allgemein<br></b>Interner Name: Warengruppenrabatt WG888<br>Aktiv: aktivieren<br>Rest nach Bedarf einstellen<br><b>Bereich Produktzuordnung</b><br>Produktzuordnung: Rabattgruppe <br>Rabattgruppe: WG888<br><b>Bereich Rabatt</b><br>Rabatt: gewünschten Rabatt eintrage z.B. 25<br>Rest nach Bedarf einstellen<br><i><b>&nbsp; SPEICHERN<br></b></i><br>Weitere Warengruppen-Rabatt nach denselben Schema anlegen.</li></ul><p><br></p><h3>Anwendungsfall #2&nbsp; <br>Mehrere Kunden erhalten einen Rabatt auf eine (oder mehrere) Warengruppen vom aktuellen Verkaufspreis</h3><p><b><br></b></p><p><b>Anforderung</b></p><ul><li>Produkte sind im ERP in Warengruppen eingeteilt und haben einen Listenpreis.<br></li><li>Mehrere B2B-Kunden sollen auf den Listenpreis denselben Rabatt erhalten&nbsp; <br></li></ul><p><br></p><p><b>Lösungsweg</b></p><ul><li>Voraussetzung: Produkte müssen die Warengruppen Info besitzen. <br>Dies ist direkt beim Produkt im neuen Tab \"Rabattgruppen\" -&gt; \"\"Warengruppe (Rabattgruppe) einzutragen. (z.B. WG888)<br>(Alternativer Weg: Kataloge &gt; Produkte &gt; Produkt auswählen &gt; Reiter\nSpezifikationen, im Bereich Zusatzfelder &gt; Rabattgruppe eintragen\n(z.B. WG888))</li><li>Kunden mit einer RuleBuilder Regel zusammenfassen<br>Einstellungen &gt; Shop &gt; Rulebuilder &gt; Regel erstellen&nbsp; z.B. \"Alle Kunden der Kundengruppe Händler\" oder \"Alle Kunden mit Tag HEK1\"</li><li>Einstellungen &gt; Erweiterungen &gt; Rabattgruppen &gt; eine neue Rabattgruppe anlegen und dann<br>im Bereich der Kundenzuordung &gt; Regel auswählen und darunter die zuvor angelegte Rulebuilder Regel auswählen.<br>im Bereich der Produktzuordnung &gt; Warengruppe (Rabattgruppe) die zu rabattierende Warengruppe eintragen - in diesem Beispiel WG888.<br>im Bereich Rabatt &gt; den Rabatt und die gewünschte Anzeige im Frontend auswählen und danach speichern.<br><br></li></ul>","installationManual":"<p><b>Die Installation des Plugins geht sehr schnell und ist unkompliziert.</b></p><ul><li>Plugin Manager über Erweiterungen &gt; Meine Erweiterungen &gt;<br></li><li>Das Plugin hochladen, installieren und aktivieren.</li><li>Das Plugin hat keine speziellen Konfigurationen.</li></ul><p><br></p><p>Es steht nach erfolgreicher Aktivierung unter Einstellungen &gt; Erweiterungen ein neuer Menüpunkt \"Rabattgruppen\" zur Verfügung.<br></p>","shortDescription":"B2B Funktion: Definierte Kunden erhalten ausgehend vom Listenpreis (aktueller Verkaufspreis) einen (Warengruppen) Rabatt.  Kunden und Produkte Gruppierungen sind frei festzulegen.","highlights":"Rabatte oder Zuschläge ausgehend vom aktuellen Verkaufspreis festlegen - ideal für B2B (Rabatt für Kunden ausgehend vom Listenpreis)\nFrei definierbare Kunden (Gruppierung über Kunden-Rabattgruppe oder Regel des Rule Builders oder ein einzelner Kunde)\nFrei definierbare Produkte (Gruppierung über Warengruppe (Rabattgruppe) oder Dynamische Produktgruppe oder einzelnes Produkt)\nEine Rabattgruppen Übersicht ermöglicht es, viele verschiedene Regeln zu verwalten.\nAuch direkt bei den Kunden ist es möglich, Rabattgruppen festzulegen.","features":"Produkte können eine Warengruppe (Rabattgruppe) besitzen (z.B. WG100)\nKunden können eine Kunden-Rabattgruppe besitzen (z.B. HEK1)\nEs können Rabatte / Zuschläge in (fast) freier Kunden / Produktkombinaktion angelegt werden\nEine Anzeige des aktuellen Verkaufspreises sowie des \"bisherigen\" Verkaufspreises vor dem Rabatt kann als Streichpreis definiert werden\nErmöglicht die Berechnung des Verkaufspreises ausgehend vom Einkaufpreis mit einem Zuschlag von x%."},{"id":24613,"name":"Discount groups - customer discount on product groups from list price","description":"<h3>Purpose / Function of the Plugin</h3>With this plugin it is possible to set discounts (or also surcharges) for freely definable customers on freely definable products on the current sales price.<br>In addition, it is possible to set the previous sales price as a strike price, so that customers can see the saving immediately.<br><p>This plugin is especially useful for B2B projects where the current sales price is the \"list price\" and the retailer's customers are to receive various discounts on products (with product groups). Due to the various configuration options, almost all B2B relevant discounts can be mapped.</p><p><br></p><p><br><b>New features from version 2.1.0</b><br></p><ul><li>Display discount groups in the customer account (A freely definable text can be deposited with a discount group rule.</li></ul><p>&nbsp;&nbsp;&nbsp; (This is displayed in the My account area / Account overview of this customer)<br><b>New features from version 3.2.0</b></p><ul><li>From now on it is possible to calculate absolute surcharges or discounts multiplied by the number of items or by the number of items and their quantity. (Allows a quantity based calculation of surcharges / discounts).</li></ul><b>New features from version 4.2.0</b>- <br><ul><li>Adds a new plugin configuration for using scale discounts in the cart across products.</li><li>Adds a new plugin configuration for displaying the current number of items in the same discount group from the shopping cart as a note on the product page.</li><li>Adds a new display name field on the discount group detail page in the Administration.</li></ul><h4>New features from version 4.4.0</h4><ul><li>Allows the calculation of the sales price starting from the purchase price with a surcharge of x%.</li></ul><h3><br></h3><h3>Possible definition / selection of customers:</h3><ul><li>Individual customer (selection from the customers created in Shopware)</li><li>Customer discount group (a customer discount group can be defined in the admin area under customers)</li><li>Rule (use of a rule previously created in Shopware by means of the Rule Builder) <br></li></ul><p><br></p><h3>Possible definition / selection of products:</h3><ul><li>&nbsp;Individual products (selection from the products created in Shopware)</li></ul><ul><li>&nbsp;Product group (discount group) (a product group (discount group) can be defined in the admin area for the products)</li></ul><ul><li>&nbsp;Dynamic product group: Use of a previously created dynamic product group in Shopware. </li></ul><p><br></p><h3>Possible discounts / surcharges:</h3><ul><li>&nbsp;Discount type: Absolute or percentage selectable and input of a value</li></ul><ul><li>&nbsp;Discount / Surcharge: Discount or surcharge selectable</li></ul><p><br></p><h3>Possible options for displaying the price / strike price display in the frontend:</h3><ul><li>If no strike price exists, do not set a new strike price. If a strike price exists, keep it.</li><li>If no strike price exists, set original price as strike price. If a strike price exists, keep it.</li><li>Always use the original sales price of the product as the strike price, even if the product has its own strike price.</li><li>Always ignore original strike price.<br></li></ul><p><br></p><h3>Known restrictions / notes on use:</h3><p></p><ul><li><b>Customer discount groups:<br></b>Only one marking per customer is possible. This means that a customer can only be in one customer discount group, not in several customer discount groups. e.g. HEK1</li><li><b>Product group (discount group) - to be defined per LANGUAGE<br></b>Each product can only have one merchandise group (discount group) - this is to be entered per LANGUAGE used e.g. WG-DE-100<br>This makes it possible to define a different merchandise group for each language and thus define different discount rules e.g. WG-EN-101<br>If no merchandise category (discount group) is defined in a language, no discount will be deducted in this language.<br></li></ul><p>&nbsp;&nbsp;&nbsp; If the same merchandise group is to be applied in all languages, then these must be stored for each language.<br><br></p>","installationManual":"<h3>The installation of the plugin is very quick and uncomplicated.</h3><ul><li>&nbsp;Plugin Manager via Extensions &gt; My extensions &gt;</li></ul><ul><li>&nbsp;Upload, install and activate the plugin.</li></ul><ul><li>&nbsp;The plugin has no special configurations.</li></ul><br><p>After successful activation, a new menu item \"Discount groups\" is available under Settings &gt; Extensions.</p>","shortDescription":"B2B function: Defined customers receive a (product group) discount based on the list price (current sales price).  Customers and product groups can be freely defined.","highlights":"Define discounts or surcharges based on the current sales price - ideal for B2B (discount for customers based on list price)\nFreely definable customers (grouping via customer discount group or rule builder rule or a single customer)\nFreely definable products (grouping via product group (discount group) or dynamic product group or individual product)\nA discount group overview makes it possible to manage many different rules.\nIt is also possible to define discount groups directly for customers.","features":"Products can have a product group (discount group) (e.g. WG100)\nCustomers can have a customer discount group (e.g. HEK1)\nDiscounts / surcharges can be created in (almost) free customer / product combination action\nA display of the current sales price as well as the \"previous\" sales price before the discount can be defined as a strike price\nAllows the calculation of the sales price starting from the purchase price with a surcharge of x%."}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":171967,"bookingKey":"acris86132570962","bookingText":"Discount groups - customer discount on product groups from list price","price":499,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":171966,"bookingKey":"acris86132570962_M","bookingText":"Discount groups - customer discount on product groups from list price","price":69.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpH4jc5s","preview":true,"priority":0,"id":73542},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAAibYJ","preview":false,"priority":0,"id":82077},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpepG3G4","preview":false,"priority":0,"id":82080},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM9GAA8","preview":false,"priority":0,"id":82161},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpscf4ms","preview":false,"priority":0,"id":82162},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZg9fEz","preview":false,"priority":0,"id":82163},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCDTkFS","preview":false,"priority":0,"id":82164},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5V3mmB","preview":false,"priority":0,"id":82165},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpP6cg0r","preview":false,"priority":0,"id":82166},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLPo2jS","preview":false,"priority":0,"id":82167},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXejvPj","preview":false,"priority":0,"id":115132},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4UOVLZ","preview":false,"priority":0,"id":115133}],"comments":[{"authorName":"TGU","text":"Super Plugin. Support antwortet extrem schnell bei Rückfragen.","headline":"Super Plugin","creationDate":{"date":"2023-04-21 08:28:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Ingmar de Vos","text":"The plugin is perfect for our use case where customer groups need to get a discount in an easily manageable way using rules and conditions. The support from Acris is really great, Wolfgang went out of his way to help us by making it compatible with a different plugin.","headline":"Very useful plugin, excellent support","creationDate":{"date":"2022-10-06 12:43:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Richard Trinkl","text":"Wer mit Kunden arbeitet welche feste Rabatt haben, ist das eine super Erweiterung. Auch Artikel welche nicht rabattfähig sind können von einem Grundrabatt ausgenommen werden.\nÄnderungswünsche wurden von Acris auch schnell umgesetzt.\nAlles in Allem ein gutes Tool","headline":"Ein Muss im B2B","creationDate":{"date":"2022-02-22 10:50:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Rabattgruppen: Kunden-Rabatt auf Warengruppen vom Listenpreis + Staffelrabatte Produkt übergreifend","description":"<h3>Zweck / Funktion des Plugins<br /></h3><p>Mit diesem Plugin ist es möglich, Rabatte (oder auch Zuschläge) für frei definierbare Kunden auf frei definierte Produkte auf den aktuellen Verkaufspreis festzulegen.</p><p>Zusätzlich ist es möglich, den bisherigen Verkaufspreis als Streichpreis zu setzen, sodass die Kunden sofort die Einsparung sehen können.<br /></p><p>Dieses Plugin ist speziell für B2B Projekte sinnvoll, wo der aktuelle Verkaufspreis der \"Listenpreis\" ist und die Kunden des Händlers verschiedene Rabatt auf Produkte (mit Warengruppen) bekommen sollen. Durch die vielfältigen Konfigurationsmöglichkeiten lassen sich fast alle B2B relevanten Rabatte abbilden.<br /></p><p><br /></p><p><b>Neues Features ab Version 2.1.0<br /></b></p><ul><li>Rabattgruppen im Kundenkonto anzuzeigen (Ein frei definierbarter Text kann bei einer Rabattgruppen Regel hinterlegt werden.<br />(Dieser wird im Mein Konto Bereich angezeigt / Account Übersicht dies Kunden)</li></ul><b>Neues Features ab Version 3.2.0</b><ul><li>Ab\nsofort ist es bei absoluten Zuschlägen oder Rabatten möglich, diese multipliziert mit der Anzahl der Positionen oder mit der Anzahl der Positionen und deren Menge zu berechnen. (Ermöglicht eine mengenbasierte Berechnung von Aufpreisen / Abschlägen.)</li></ul><b>Neue Funktionen von Version 4.2.0</b><ul><li>Fügt eine neue Plugin-Konfiguration für die Verwendung von <b>Staffelrabatten im Warenkorb über Produkte hinweg hinzu.</b></li><li>Fügt eine neue Plugin-Konfiguration für die Anzeige der aktuellen Anzahl von Artikeln in der gleichen Rabattgruppe aus dem Einkaufswagen als Hinweis auf der Produktseite hinzu.</li><li>Fügt ein neues Feld für den Anzeigenamen auf der Detailseite der Rabattgruppe in der Verwaltung hinzu.<br /></li></ul><p></p><p><b><br /></b></p><p><b>Neue Funktionen von Version 4.4.0</b><br /></p><ul><li>    Ermöglicht die Berechnung des Verkaufspreises ausgehend vom Einkaufpreis mit einem Zuschlag von x%.<br /></li></ul><h3><br /></h3><h3>Mögliche Definition / Selektion von Kunden:</h3><ul><li>Einzelner Kunde (Auswahl aus den in Shopware angelegten Kunden)</li><li>Kunden-Rabattgruppe (Im Admin Bereich bei den Kunden kann eine Kunden-Rabattgruppe definiert werden)<br /></li><li>Regel (Nutzung einer zuvor in Shopware angelegten Regel mittels des Rule Builders) <br /></li></ul><h3><br /></h3><h3>Mögliche Definition / Selektion von Produkten:<br /></h3><ul><li>Einzelne Produkte (Auswahl aus den in Shopware angelegten Produkten)</li><li>Warengruppe (Rabattgruppe) (Im Admin Bereich bei den Produkten kann eine Warengruppe (Rabattgruppe) definiert werden)<br /></li><li>Dynamische Produktgruppe:  Nutzung einer zuvor in Shopware angelegten Dynamischen Produktgruppe <br /></li></ul><p><br /></p><h3>Mögliche Rabatte / Zuschläge:<br /></h3><ul><li>Rabatttyp: Absolut oder Prozentual auswählbar und Eingabe eines Wertes<br /></li><li>Abschlag / Zuschlag: Abschlag oder Zuschlag auswählbar<br /></li></ul><p><br /></p><h3>Mögliche Optionen zur Anzeige der Preis-/ Streichpreis Anzeige im Frontend:<br /></h3><ul><li>Wenn kein Streichpreis vorhanden, <b>keinen neuen Streispreis setzen</b>. Wenn ein Streichpreis vorhanden, diesen behalten.</li><li>Wenn kein Streichpreis vorhanden, <b>ursprünglichen Preis als Streispreis setzen</b>. Wenn ein Streichpreis vorhanden, diesen behalten.</li><li><b>Immer den ursprünglichen Verkaufspreis des Produktes als Streichpreis verwenden</b>, auch wenn das Produkt einen eigenen Streichpreis besitzt.</li><li>Ursprünglichen Streichpreis immer ignorieren.<br /></li></ul><p><br /></p><h3>Bekannte Einschränkungen / Hinweise zur Nutzung:<br /></h3><ul><li><b>Kunden-Rabattgruppen: </b><br />Es ist nur<b> eine </b>Kennzeichnung je Kunde möglich. Das bedeutet, dass ein Kunden nur in einer Kunden-Rabattgruppe sein kann, nicht in mehreren Kunden-Rabattgruppen. z.B. HEK1<br /></li><li><b>Warengruppe (Rabattgruppe) - je SPRACHE festzulegen<br /></b>Jedes Produkt kann nur <b>eine</b> Warengruppe (Rabattgruppe) besitzen - dies ist<b> je genutzter SPRACHE </b>zu einzugeben  z.B. WG-DE-100 <br />Dies ermöglicht es, für jede Sprachen eine andere Warengruppe festzulegen und somit andere Rabattregeln festzulegen z.B. WG-EN-101<br />Wird in einer Sprachen keine Warengruppe (Rabattgruppe) festgelegt, dann werden in dieser Sprache kein Rabatte abgezogen.<br />Soll in allen Sprache dieselbe Warengruppe zur Anwendung kommen, dann müssen diese je Sprache hinterlegt werden.<br /></li></ul><p><br /></p><h3>Anwendungsfall #1  <br />Ein einzelner B2B Kunde erhält einen Rabatt auf eine (oder mehrere) Warengruppen vom aktuellen Verkaufspreis<br /></h3><p><br /><b></b></p><p><b>Anforderung</b></p><ul><li>Produkte sind im ERP in Warengruppen eingeteilt und haben einen aktuellen Verkaufspreis (z.B. Listenpreis).<br /></li><li>B2B-Kunden sollen auf den Listenpreis einen Rabatt erhalten - und zwar unterschiedlich je Warengruppe  <br /></li></ul><p><br /></p><p><b>Lösungsweg</b></p><ul><li>Voraussetzung: Produkte müssen die Warengruppen Info besitzen. <br />Dies ist direkt beim Produkt im neuen Tab \"Rabattgruppen\" -&gt; \"\"Warengruppe (Rabattgruppe) einzutragen. (z.B. WG888)<br />(Alternativer Weg: Kataloge &gt; Produkte &gt; Produkt auswählen &gt; Reiter Spezifikationen, im Bereich Zusatzfelder &gt; Rabattgruppe eintragen (z.B. WG888))</li><li>B2B-Kunden die Rabatte für die einzelnen Warengruppen zuweisen<br />Kunden &gt; Übersicht &gt; Kunde auswählen &gt; Reiter Rabattgruppen &gt; bearbeiten &gt; neue Rabattgruppe hinzufügen<br /><b>Bereich Allgemein<br /></b>Interner Name: Warengruppenrabatt WG888<br />Aktiv: aktivieren<br />Rest nach Bedarf einstellen<br /><b>Bereich Produktzuordnung</b><br />Produktzuordnung: Rabattgruppe <br />Rabattgruppe: WG888<br /><b>Bereich Rabatt</b><br />Rabatt: gewünschten Rabatt eintrage z.B. 25<br />Rest nach Bedarf einstellen<br /><i><b>  SPEICHERN<br /></b></i><br />Weitere Warengruppen-Rabatt nach denselben Schema anlegen.</li></ul><p><br /></p><h3>Anwendungsfall #2  <br />Mehrere Kunden erhalten einen Rabatt auf eine (oder mehrere) Warengruppen vom aktuellen Verkaufspreis</h3><p><b><br /></b></p><p><b>Anforderung</b></p><ul><li>Produkte sind im ERP in Warengruppen eingeteilt und haben einen Listenpreis.<br /></li><li>Mehrere B2B-Kunden sollen auf den Listenpreis denselben Rabatt erhalten  <br /></li></ul><p><br /></p><p><b>Lösungsweg</b></p><ul><li>Voraussetzung: Produkte müssen die Warengruppen Info besitzen. <br />Dies ist direkt beim Produkt im neuen Tab \"Rabattgruppen\" -&gt; \"\"Warengruppe (Rabattgruppe) einzutragen. (z.B. WG888)<br />(Alternativer Weg: Kataloge &gt; Produkte &gt; Produkt auswählen &gt; Reiter\nSpezifikationen, im Bereich Zusatzfelder &gt; Rabattgruppe eintragen\n(z.B. WG888))</li><li>Kunden mit einer RuleBuilder Regel zusammenfassen<br />Einstellungen &gt; Shop &gt; Rulebuilder &gt; Regel erstellen  z.B. \"Alle Kunden der Kundengruppe Händler\" oder \"Alle Kunden mit Tag HEK1\"</li><li>Einstellungen &gt; Erweiterungen &gt; Rabattgruppen &gt; eine neue Rabattgruppe anlegen und dann<br />im Bereich der Kundenzuordung &gt; Regel auswählen und darunter die zuvor angelegte Rulebuilder Regel auswählen.<br />im Bereich der Produktzuordnung &gt; Warengruppe (Rabattgruppe) die zu rabattierende Warengruppe eintragen - in diesem Beispiel WG888.<br />im Bereich Rabatt &gt; den Rabatt und die gewünschte Anzeige im Frontend auswählen und danach speichern.<br /><br /></li></ul>","installationManual":"<p><b>Die Installation des Plugins geht sehr schnell und ist unkompliziert.</b></p><ul><li>Plugin Manager über Erweiterungen &gt; Meine Erweiterungen &gt;<br /></li><li>Das Plugin hochladen, installieren und aktivieren.</li><li>Das Plugin hat keine speziellen Konfigurationen.</li></ul><p><br /></p><p>Es steht nach erfolgreicher Aktivierung unter Einstellungen &gt; Erweiterungen ein neuer Menüpunkt \"Rabattgruppen\" zur Verfügung.<br /></p>","version":"5.3.2","changelog":[{"version":"5.3.2","text":"<ul><li>Improved storefront compatibility with other plugins.</li></ul>","creationDate":{"date":"2023-06-19 07:33:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.3.1","text":"<p>Optimisation of cache invalidation for changes to discount groups.</p>","creationDate":{"date":"2023-06-09 08:41:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.3.0","text":"<p>Allows the discount to be calculated from the purchase price.</p>","creationDate":{"date":"2023-06-06 09:53:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.2.0","text":"<p>Adds a new default order confirmation with discounts from discount group mail template.</p>","creationDate":{"date":"2023-06-02 10:00:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.1","text":"<p>Optimizes calculating of the list price across products for scale discounts in the cart.</p>","creationDate":{"date":"2023-06-01 09:21:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.0","text":"- Adds a new plugin configuration for using scale discounts in the cart across products.<br />- Adds a new plugin configuration for displaying the current number of items in the same discount group from the shopping cart as a note on the product page.<br />- Adds a new display name field on the discount group detail page in the Administration.<br /><p>- Optimizes loading of the scale discounts in the cart across products.</p>","creationDate":{"date":"2023-04-28 09:40:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.0","text":"<p>Compatibility established with Shopware 6.5.0.0</p>","creationDate":{"date":"2023-03-08 15:14:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.4.1","text":"<p>Optimisation of cache invalidation for changes to discount groups.</p>","creationDate":{"date":"2023-06-09 08:41:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.4.0","text":"<p>Allows the discount to be calculated from the purchase price.</p>","creationDate":{"date":"2023-06-06 09:52:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.0","text":"<p>Adds a new default order confirmation with discounts from discount group mail template.</p>","creationDate":{"date":"2023-06-02 10:00:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.2","text":"<p>Optimizes calculating of the list price across products for scale discounts in the cart.</p>","creationDate":{"date":"2023-06-01 09:21:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.1","text":"<p>Optimizes loading of the scale discounts in the cart across products.</p>","creationDate":{"date":"2023-04-28 09:13:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.0","text":"<p>- Adds a new plugin configuration for using scale discounts in the cart across products.</p>\n                                                                                                    <p>-\n Adds a new plugin configuration for displaying the current number of \nitems in the same discount group from the shopping cart as a note on the\n product page.</p>\n                                                                                                    <p>- Adds a new display name field on the discount group detail page in the Administration.</p>","creationDate":{"date":"2023-04-12 07:57:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.0","text":"- From now on it is possible to use the list price or the RRP (from ACRIS RRP plugin) as a basis for the discount calculation.<br /><p>- From now on, the RRP price (from ACRIS RRP plugin) can also be displayed as a list price.</p>","creationDate":{"date":"2023-02-23 09:02:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<p>- RRP based discount calculation corrected for Shopware versions at 6.4.18.0 and above.</p>","creationDate":{"date":"2023-01-16 09:29:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>- Optimized the plugin for Shopware versions at 6.4.18.0 and above.</p>","creationDate":{"date":"2022-12-16 09:41:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.1","text":"<p>- Calculates discount correctly when RRP based discount is higher than product price.</p>","creationDate":{"date":"2023-01-13 12:23:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"<p>Adds option \"Prevents combination with ACRIS discount groups\" at the \npromotion detail page inside of the conditions tab in the \nAdministration.</p>","creationDate":{"date":"2022-11-22 15:07:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"<p>- Now the plugin supports ACRIS RRP.</p>","creationDate":{"date":"2022-11-22 15:06:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.2","text":"<p>Optimizes loading of the discount groups with dynamic product groups type of the Product assignment.</p>","creationDate":{"date":"2022-11-17 14:04:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.1","text":"<p>Fixes a problem where discount groups are not loaded correctly to the products or dynamic product groups.</p>","creationDate":{"date":"2022-09-20 15:33:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"<p>Performance optimisation.</p>","creationDate":{"date":"2022-08-22 16:21:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<p>Adds internal id field for discount groups.</p>","creationDate":{"date":"2022-06-24 11:06:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p>Optimizes product price calculation by discount groups.</p>","creationDate":{"date":"2022-06-22 07:35:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.1","text":"<p>Optimized ACRIS CMS integration with BundleHierarchyBuilder.</p>","creationDate":{"date":"2022-08-12 17:40:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"- Enables better compatibility with the ACRIS B2B plugin.<br /><p>- Performance optimisations.</p>","creationDate":{"date":"2022-06-02 11:45:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"<p>Fixes a possible problem in the ordering process</p>","creationDate":{"date":"2022-05-19 10:16:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p>- Fixes a problem where discounts were not displayed in the shopping cart for graduated prices.<br /></p><p>- Adds display option for discount groups in the account area.</p>","creationDate":{"date":"2022-05-19 07:37:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Optimisation of the rounding of discounts for graduated prices.</p>","creationDate":{"date":"2022-05-04 09:53:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<ul><li>Optimizes plugin image.</li><li>Improves compatibility with Shopware &gt;= 6.4.10.0.</li><li>Optimizes plugin color in administration.\n                                                                        \n                                                                        </li></ul>","creationDate":{"date":"2022-04-25 11:22:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"- Fixes a problem with the configuration of which price should be used to determine the discount.<br />- The option \"List price available on the product: use this. - If there is no list price on the product: use the original product price as the list price.\" is now used as the default configuration for configuring which price to use to determine the discount. <br /><p>- Optimisation of the configuration which price should be used to determine the discount.</p><p>- Fixes a problem where discounts with a value of 0 were not taken into account.</p>","creationDate":{"date":"2022-02-22 10:39:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"- Fixes a problem where products were read from the cache with the wrong prices.<br /><p>- Snippet optimisations in the admin.</p>","creationDate":{"date":"2022-02-07 14:31:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>Optimizes snippets for product and customer discount group fields.</p>","creationDate":{"date":"2022-02-04 10:12:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Veröffentlichnung / Store Release</li></ul>","creationDate":{"date":"2021-10-11 10:14:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris86132570962","redirectToStore":false,"lowestPriceValue":69.9}