{"id":14162,"name":"SwpCategoryLayoutToChildsSix","code":"Swp6079136022719","lastChange":{"date":"2023-07-19 13:45:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMDiv65","examplePageUrl":"","moduleKey":"SwpCategoryLayoutToChildsSix","creationDate":{"date":"2021-10-12 13:40:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2021-10-21 11:38:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-10-13 09:51:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":39,"prefix":"Swp","name":"BuI Hinsche GmbH","website":"//www.bui-hinsche.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod39_bui-fb-logo_128.png"},"infos":[{"id":24660,"name":"Rekursives Kategorielayout","description":"<p>Mit diesem Plugin kannst du ganz bequem das Kategorielayout der übergeordneten Kategorie auf die untergeordnenten Kategorien übertragen. Damit entfällt die zeit- und nervenaufwendige Zuweisung für jede einzelne Kategorie.&nbsp;</p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen.&nbsp;</p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität&nbsp;kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden.&nbsp;</p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung.&nbsp;</p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können.&nbsp;</p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden.&nbsp;</p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br>E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>\n\n\n","installationManual":"<h2><a href=\"https://docs.google.com/document/d/134sMymZl6h_TmonOdsewr7lHDs7gw5unzMjNzNv1oSA/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a></h2><p><br></p><h3>Pluginkonfiguration (generelle Zuweisung)</h3><p>Eine Pluginkonfiguration ist nicht notwendig. Das Plugin muss nur aktiviert werden.<br><br></p><h3>Kategorie Layout für alle Unterkategorien anpassen</h3><p>Du wählst die gewünschte Kategorie aus und gehst auf den Reiter “Layout”. Dort klickst du auf “Layout ändern” und wählst das gewünschte Layout aus. Zunächst muss du diese Auswahl speichern. Jetzt kannst du den Button “Layout für Unterordner ändern” klicken. Es erfolgt eine Abfrage, ob du dir auch sicher bist in dem was du tust. Wenn du dies bestätigst, wird das soeben zugeordnete Layout auf alle Unterkategorien übertragen.</p><p><br></p><p>\n\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.\n\n\n</p>","shortDescription":"Mit dem Plugin ist es möglich das Kategorielayout der übergeordneten Kategorie auf alle untergeordneten Kategorien (rekursiv) mit einem Klick zu übertragen.","highlights":"einfach zu bedienen","features":""},{"id":24661,"name":"recursive category layout","description":"<p>With this plugin you can easily transfer the category layout of the superordinate category to the subordinate categories. This eliminates the time-consuming and nerve-racking assignment for each individual category.</p><h3>** FAQ **</h3><h4>**** Basic ****</h4><p>Our plugin are all designed to the standard functionalities of the basic system Shopware 6 (Community Edition). This concerns both the functionalities and the design. So if it does not fit once, may have to make adjustments to your own theme. Please understand that it is impossible for us to consider every single theme.&nbsp;</p><p>All plugin have been newly developed for Shopware 6. Therefore, it may be possible that functionalities that existed in Shopware 5 are no longer there. We have deliberately used this change to streamline and optimize the plugins.</p><h4>**** compatibility ****</h4><p>Basically, our plugins are compatible with each other. If there should be restrictions or malfunctions, we will gladly check them in a timely manner. In individual cases, it may happen that functionalities of individual plugins from our house are excluded. In this case, we will point this out to you. However, this compatibility&nbsp;can only be guaranteed for our plugin. The market of third party providers and their plugins makes it impossible to take into account all functionalities and modes of operation. This also applies to plugins from Shopware that are not included in the Community Edition.</p><p>In a few cases, multiple manipulation of the same template blocks in the theme can lead to display deficits.&nbsp;Unfortunately, we have no influence on this due to the original shop software. Due to this circumstance, only an individual solution can be provided in such cases.&nbsp;</p><h4>**** Support ****</h4><p>Basically, we first look to see if it is an error from the plugin or the cause is otherwise. Depending on the result, we will inform you whether there will be any costs or not. However, if you have made changes to the plugin yourself, any claim to free support is forfeited. In this case, we charge the full cost.&nbsp;</p><h4>**** Are there trial versions for our plugin ****</h4><p>All our plugin you can test with the free trial month to look at the functionalities in peace and try. In this trial month all functions are available to you, there are no limitations. We ask you to make use of this trial month to decide for sure if it is exactly the plugin you need or if it offers the functionalities you expected before buying or renting.</p><h4>**** Can I have the plugin customized? ****</h4><p>YES, if you are missing a functionality or you need a customization for your specific needs, we will be happy to find a solution together with you. The easiest way to do this is to send us an email with your ideas. Don't forget to give us your contact details, so we can get in touch with you.&nbsp;</p><h3>** What we do **</h3><h4>**** consulting ****</h4><p>The digital world is changing hourly and getting more and more complex. Therefore, we have made it our mission to stay on the ball for you and to constantly expand and develop our knowledge and relieve you of this tedious work. We can advise you, for example, on questions such as:</p><ul><li>How do I optimize my store system?</li><li>Which merchandise management fits me?</li><li>Can I optimize processes in relation to the store?</li><li>Can I optimize processes in the company with the store?</li></ul><h4>**** development ****</h4><p>Our developers are always and constantly to develop new products, expand, develop or optimize. But we also look beyond the horizon and develop together with you suitable websites or interfaces to software connections. Completely individual solutions are also no problem. We just have to talk about it.</p><h4>**** Design ****</h4><p>You want a new design? We help you with the implementation.</p><h4>**** support ****</h4><p>Like a car or bike, your store also needs regular maintenance. We also have suitable solutions for this. Many of our customers already use this and let store and plugin updates through us. Just ask for our maintenance contract.</p><h3>** Who are we? **</h3><p>BuI-Hinsche GmbH has been in the e-commerce sector since 2006 and therefore has 15 years of experience to fall back on. Our employees are 100% behind the company and give their best every day. Creative, solution-oriented and customer-oriented - these are always statements that are made about us.&nbsp;</p><p></p><h3>** Contact **</h3><p>phone: +49 3441 9799060<br>email: info@bui-hinsche.com or support@bui-hinsche.com</p><p></p>\n\n\n","installationManual":"<h2><a href=\"https://docs.google.com/document/d/1qhFmN_YoFccgKp9fSkSbe_B4iVItV2zQne5MIIoYntI/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Documentation / Installation / Configuration</a></h2><p><br></p><h3>Plugin configuration (general assignment)</h3><p>A plugin configuration is not necessary. The plugin just needs to be activated.</p><p><br></p><h3>category layout adjust for all sub-categories</h3><p>You select the desired category and go to the “Layout” tab. There you click on “Change layout” and select the layout you want. First you have to save this selection. Now you can click the button “Change layout for subfolders”. You will be asked whether you are also sure of what you are doing. If you confirm this, the layout just assigned will be transferred to all subcategories.</p><p><br></p><p><p>If you have any questions or are unsure about something, please contact us at support@bui-hinsche.com We will help you quickly and easily. Alternatively you can contact us directly via your shopware account.</p>\n\n\n</p>","shortDescription":"With the plugin it is possible to transfer the category layout of the superordinate category to all subordinate categories (recursively) with one click.","highlights":"easy to use","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164229,"bookingKey":"Swp6079136022719","bookingText":"recursive category layout","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpD6xVCf","preview":true,"priority":0,"id":73631},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLZIozM","preview":false,"priority":0,"id":73693}],"comments":[{"authorName":"A. Raiber","text":"Sehr hilfreiches Tool, das einem bei vielen Unterkategorien sehr viel Zeit erspart. Vielen Dank :)","headline":"Hilfreiches Tool","creationDate":{"date":"2023-03-01 08:33:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dominik","text":"Ein klasse Plugin, welches eine (so sollte man für eine 40k€ teure Enterprise-Version meinen) Standardfunktionalität mitbringt.\nDie Erweiterung funktioniert problemlos und ist einfach in der Anwendung.\nDas ganze jetzt noch für die Produktlayouts und Shopware 6 entwickelt sich Richtung \"brauchbar\" :D\nDanke für die kostenlose Bereitstellung!","headline":"Klasse Plugin","creationDate":{"date":"2022-05-18 22:39:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sven Rösner","text":"Es hat nicht sofort funktioniert. Nach 5 Minuten gings dann… \nJetzt läuft es gut! KOSTENLOS! \n\nFrüher war es üblich, sich für kostenlose Plugins mit einem Kaffee zu bedanken. \nDiese Funktion sollte man hier einbauen.  Solche kleinen Tools machen einem das Leben so viel einfacher.","headline":"Wir haben es installiert. Es funktioniert!","creationDate":{"date":"2022-03-24 14:40:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Lucas Brodkorb","text":"Generell ein tolles Plugin, welches uns viel Zeit sparen würde.\nAllerdings funktioniert es wohl unter 6.4.7.0 noch nicht wirklich.\nBei uns wird der Button zum Kopieren des Layouts auf die Unterkategorien überhaupt nicht angezeigt.\nWir warten hier auf ein Update, dass wir das Plugin dann verwenden können.","headline":"Gute Idee !","creationDate":{"date":"2021-12-30 09:45:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8}],"ratingAverage":10,"label":"Rekursives Kategorielayout","description":"<p>Mit diesem Plugin kannst du ganz bequem das Kategorielayout der übergeordneten Kategorie auf die untergeordnenten Kategorien übertragen. Damit entfällt die zeit- und nervenaufwendige Zuweisung für jede einzelne Kategorie. </p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen. </p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br /></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden. </p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung. </p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können. </p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden. </p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br />E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<h2><a href=\"https://docs.google.com/document/d/134sMymZl6h_TmonOdsewr7lHDs7gw5unzMjNzNv1oSA/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a></h2><p><br /></p><h3>Pluginkonfiguration (generelle Zuweisung)</h3><p>Eine Pluginkonfiguration ist nicht notwendig. Das Plugin muss nur aktiviert werden.<br /><br /></p><h3>Kategorie Layout für alle Unterkategorien anpassen</h3><p>Du wählst die gewünschte Kategorie aus und gehst auf den Reiter “Layout”. Dort klickst du auf “Layout ändern” und wählst das gewünschte Layout aus. Zunächst muss du diese Auswahl speichern. Jetzt kannst du den Button “Layout für Unterordner ändern” klicken. Es erfolgt eine Abfrage, ob du dir auch sicher bist in dem was du tust. Wenn du dies bestätigst, wird das soeben zugeordnete Layout auf alle Unterkategorien übertragen.</p><p><br /></p><p>\n\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.\n\n\n</p>","version":"6.05.00","changelog":[{"version":"6.05.00","text":"<p>adjustment to Shopware-version 6.5.0.0</p>","creationDate":{"date":"2023-05-03 14:25:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.00","text":"<p>first release for Shopware 6</p>","creationDate":{"date":"2021-10-13 09:35:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Swp6079136022719","redirectToStore":false,"lowestPriceValue":0}