{"id":14185,"name":"CogiRecommendations","code":"cogi495607424229","lastChange":{"date":"2023-07-18 11:16:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplBFgMk","examplePageUrl":"","moduleKey":"CogiRecommendations","creationDate":{"date":"2021-10-14 13:57:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-11-25 15:01:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-11-25 15:00:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2698,"prefix":"cogi","name":"codegiganten GmbH","website":"//www.codegiganten.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2698_logo-cg.png"},"infos":[{"id":24701,"name":"Produktempfehlungen (dynamisch und personalisiert)","description":"<p>Unsere Erweiterung zeigt Ihrer Kundschaft auf Basis von <b>Verhaltensanalysen </b>Produkte an, die entsprechend auf diese abgestimmt sind. Konfigurieren Sie mithilfe von Regeln in sog. <b>Rankinggruppen</b>, welche Produkte auf Basis verschiedener Attribute vorgeschlagen werden sollen.</p><p>In den Erlebniswelten können Sie dann die Bausteine für Ihre Produktansichten oder Kategorie-Listings anpassen, welche die zugeschnittenen Empfehlungen an Ihre Kundschaft in verschiedenen Designs ausspielen.</p><p>Möchten Sie z.B. kurz vor Saisonende Ihren Lagerbestand von einem bestimmten Produkt verringern, können Sie die Regeln Ihrer Rankinggruppe so anpassen, dass diese vermehrt Ihr <b>Wunschprodukt </b>ausspielt, wenn es zum <b>Einkaufsverhalten </b>passt. So können Sie z.B. auch Bestseller-Produkte, welche sich ohnehin schon gut verkaufen, von der Rankinggruppe ausschließen und lassen keine zusätzlichen Empfehlungen für die ausgewählten Produkte oder Produktgruppen mehr ausspielen.</p><p>Mit den <b>Regeln </b>können Sie die Empfehlungen detailliert bestimmen, denn die Erweiterung optimiert die ausgespielten Produkte im Hintergrund. Sie optimiert intelligent, ob die Empfehlungen geklickt werden oder ob sie automatisch mit anderen Produkten ausgetauscht werden sollen, um Ihre Verkäufe zu optimieren.</p><p>Die Erweiterung kann nicht nur registrierte Kundschaft, sondern auch Besucher:innen Ihrer Website identifizieren sowie diese als männlich, weiblich oder Kind einstufen, um angepasst an die Regeln Ihrer Rankinggruppe noch<b> spezifischere Empfehlungen</b> zu erstellen. Zudem <b>trackt </b>die App sämtliche Bewegungen, um die Kundschaft in eine potenzielle <b>Zielgruppe </b>einzustufen und die Empfehlungen zu verfeinern.</p><p>Wir bieten zu dieser App aufgrund der umfangreichen Einstellungsmöglichkeiten vorgefertigte Pakete, welche für viele Use-Cases optimierte Rankingregeln beinhalten. Kontaktieren Sie uns gerne.</p><h3>Funktionsweise bzw. Einrichtung der App:</h3><p>Sie finden das Menü zur Verwaltung der Produktempfehlungen unter <i><b>Inhalte -&gt; Dynamische Produktempfehlungen.</b></i></p><p>Hier finden Sie eine <b>erweiterte Dokumentation</b> für unsere App:&nbsp;<a href=\"https://docs.codegiganten.de/plugin-documentation/apps/dynamische-produktempfehlungen\" target=\"_blank\" rel=\"noreferrer\">https://docs.codegiganten.de/plugin-documentation/apps/dynamische-produktempfehlungen</a></p><p>Folglich finden Sie eine kurze Einrichtungserklärung, welche Sie auch in unserer Dokumentation finden können.</p><h4>Rankinggruppe</h4><p>Erstellen Sie zunächst eine oder mehrere Rankinggruppen. Diese sagen aus, welche Produkte anhand der definierten Filterregeln geladen werden sollen, geben also eine wilde Mischung an Produkten wieder.&nbsp;</p><p>Vergeben Sie zunächst einen Namen und aktivieren Sie die Rankinggruppe. Mit der Einstellung \"Auf Geschlecht einschränken\", werden die Produkte aller definierten Filterregeln auf das potenzielle Geschlecht der Besucher:innen eingeschränkt. Alle Produkte werden im Hintergrund anhand der Kategoriebezeichnung mit gewissen Keywords in die Kategorien \"Weiblich, Männlich und Kind\" eingestuft. Sie können in den Einstellungen der App optional bestimmte Kategorien für die Geschlechter definieren, um die Erkennung des Geschlechts zu optimieren.</p><p>Sie können nun Regeln erstellen, welche Produkte geladen werden sollen. Jede Regel hat primär einen Typ und eine Gewichtung. Je nach Typ kann teilweise eine Konfiguration erforderlich sein, welche über die drei Punkte auf der rechten Seite mit dem Menüpunkt \"Konfiguration\" geöffnet werden kann. Der Menüpunkt existiert <b>nicht</b>, wenn keine Konfiguration erforderlich ist.</p><p>Die Gewichtung ist wie folgt zu verstehen: Jede Regel (bzw. jeder Typ) liefert eine Liste an Produkten zurück. Jedes Produkt in dieser Liste erhält die Gewichtung der Regel. Sollten mehrere Regeln innerhalb der Rankinggruppe die selben Produkte zurückgeben, addieren sich die Gewichtungen. Produkte, die bei vielen Regeln zutreffen, werden also in dem Empfehlungsalgorithmus berücksichtigt. Demnach sind die Empfehlungen erfahrungsgemäß besser, wenn viele Regeln mit kleineren Gewichtungen erstellt werden.</p><p>Sie können auf der Bearbeitungsseite einer Rankinggruppe eine grobe Vorschau der Produkte einsehen, welche die Rankinggruppe zurückgibt. Wählen Sie dazu ein Produkt aus, aus dessen Perspektive die Empfehlungen geladen werden sollen (Sie können Produktempfehlungen nachher jedoch auch in dem Kategorie-Listing ausspielen).</p><h4>Kampagne</h4><p>Eine Kampagne sagt aus, welche Rankinggruppe wann geladen werden soll. Definieren Sie verschiedene Regeln, in welcher Kategorie welche Rankinggruppe geladen werden soll. Verkaufen Sie bspw. T-Shirts und Technikprodukte, ist es empfehlenswert, verschiedene Rankinggruppen zu definieren und diese mit einer Kampagne separat je nach Kategorie auszuspielen. Es ist ebenso empfehlenswert, eine allgemeine Rankinggruppe zu erstellen, welche kaum Produktspezifisch ist. Diese kann in der Kampagne als Standard-Rankinggruppe hinterlegt werden. Die Standard-Rankinggruppe wird ausgespielt, wenn keine der Regeln zutreffend ist oder die zutreffende Regel keine Produkte zurück liefert.</p><p>Es ist geplant, die Kampagnenregeln zu erweitern, um so auch zeitabhängige Ausspielungen von Rankinggruppen zu ermöglichen, z.B. von dem 01.11. bis zu dem 25.12. eine Rankinggruppe auszuspielen, welche speziell auf Ihr Weihnachtsgeschäft zugeschnitten ist.</p><h4>Erlebniswelten</h4><p>Wenn Sie mindestens eine Kampagne mit dazugehöriger Rankinggruppe konfiguriert haben, können Sie in den Erlebniswelten unsere Blöcke überall in Ihrem Shop verwenden. Ziehen Sie die Blöcke aus der Kategorie \"Dynamische Produktempfehlungen\" in Ihren Seiteninhalt hinein und öffnen Sie die Einstellungen. Wählen Sie hier die Kampagne aus, welche ausgespielt werden soll. Sie können nun die Sortierung der zurückgegebenen Produkte auswählen und das Design der Produkte im Listing anpassen.</p><p>Wenn Sie das Erlebniswelten-Layout nun zu einem Produkt oder einer Kategorie hinzugefügt, gespeichert und den Cache geleert (ALT + C) haben, müssten Sie die Empfehlungen in der Storefront einsehen können. Beachten Sie unser FAQ für typische Fehler.</p><p><b>Individueller Support und regelmäßige Updates</b></p><p>Sollten Sie für den Einsatz der Erweiterung in Ihrem Shop besondere Anpassungen wünschen, nehmen Sie gerne Kontakt auf. Wir entwickeln die App fortlaufend weiter. Die Zufriedenheit unserer Kundschaft und erstklassiger Support stehen für uns an erster Stelle. Kontaktieren Sie uns direkt über den Shopware App-Support, wir setzen alles daran, Ihnen kompetent und schnell zu helfen (zu finden in Ihrem Account im Shopbetreiberbereich &gt; Support &gt; Support anfragen &gt; Support für Erweiterungen).</p><p>________________________________________________________________________________________________________________________________________________________________</p><p><b>Über uns</b></p><p>Wir sind die code<b>giganten</b>&nbsp;aus Paderborn, Ihr erfahrener Partner für Shopware 6 Projekte. Jahrelange Erfahrung in individuellen PHP-Projekten mit aktuellen Frameworks bilden das Fundament für einen effizienten und professionellen Umgang mit sämtlichen Technologien im Shopware Universum. Unsere Apps und Themes entwickeln wir fortlaufend weiter und bieten kompetenten, individuellen Support sowie maßgeschneiderte Lösungen, um Ihren Shop noch besser zu machen.</p><p>Mit der code<b>giganten</b>&nbsp;GmbH haben Sie nicht nur einen absolut technisch versierten Partner an Ihrer Seite, sondern profitieren zudem von einem immensen Erfahrungsschatz aus zahlreichen eCommerce-Projekten im B2C- und B2B-Bereich.</p><p></p><p>code<b>giganten</b>&nbsp;GmbH - Ihr Partner für Shopware 6</p><p>Friedrichstraße 15 | 33102 Paderborn</p><p>Geschäftsführer: Oliver Krimmer</p><p><a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">codegiganten.de</a><br></p><p>Benötigen Sie eigene Apps oder Themes, welche es noch nicht im Store gibt? Kein Problem! Melden Sie sich jederzeit bei uns unter&nbsp;<a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">info@codegiganten.de</a></p><p></p><p>*******&nbsp;<a href=\"https://codegiganten.de/newsletter/\" target=\"_blank\" rel=\"noreferrer noopener\">Jetzt kostenfrei unseren informativen&nbsp;<b>Newsletter</b>&nbsp;zu Shopware 6 und Apps abonnieren!</a>&nbsp;*******</p><p></p><p>________________________________________________________________________________________________________________________________________________________________</p>","installationManual":"<p>Sie haben sich für unsere App entschieden? Vielen Dank! Jetzt folgt nur noch die einfache Installation.</p><p>Tipp: Haben Sie eine App oder ein Theme erworben und Ihr Shop ist mit Ihrem Account verbunden, taucht die jeweilige Erweiterung automatisch in Ihrem Shop in der App-/Themes-Liste auf und muss nur noch installiert werden. So überspringen Sie den unten aufgeführten Schritt zum Hochladen der Erweiterung.<br></p><p><br></p><p></p><ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Loggen Sie sich in Ihren Shopware 6 Administrationsbereich ein und navigieren zu&nbsp;<b><i>Erweiterungen &gt; Meine Erweiterungen &gt; Apps</i></b></li><li>Klicken Sie auf den \"<b><i>Erweiterung hochladen</i></b>\"-Button und wählen die heruntergeladene Erweiterung aus</li><li>Nutzen Sie das Menü neben der Erweiterung, um sie zu installieren und den Schalter, um sie zu aktivieren&nbsp;</li><li>Die App ist jetzt aktiv. Lesen Sie unsere App-Beschreibung, um Informationen zur Einrichtung der Produktempfehlungen zu erhalten.&nbsp;</li></ol><p></p><p><br></p><p><b>Sollten Sie Hilfe benötigen, stehen wir Ihnen jederzeit unter info@codegiganten.de und https://codegiganten.de/kontakt/ zur Verfügung.</b></p>","shortDescription":"Diese Erweiterung erstellt dynamische Produktempfehlungen, zugeschnitten auf das Einkaufsverhalten Ihrer Kundschaft. So steigern Sie nachhaltig die Umsätze Ihres Shops.","highlights":"Identifzierung und Analysierung des Einkaufsverhaltens\nOptimierung der ausgespielten Produkte","features":"Verwaltung von Regeln zur Ausspielung der Produkte\nAnalyse der Wirksamkeit von Bestellungen durch Empfehlungen\nVerschiedene CMS-Bausteine"},{"id":24703,"name":"product recommendations (dynamic and personalised)","description":"<p>This extension shows your customers products that are tailored to your visitors based on behavioral analysis in order to sustainably increase the sales of your online store. Configure which products should be suggested based on various attributes using rules in so-called ranking groups.</p><p>In the experience worlds, you can then configure modules between your product views or category listings that play out the customized recommendations to your visitors in different designs.</p><p>For example, if you want to reduce your stock of a certain product shortly before the end of the season, you can adjust the rules of your ranking group so that they play out more of their desired product if it matches the visitor. For example, you can also exclude best-selling products, which are already selling well, from the ranking group so that no recommendations are played out for the selected products or product groups.</p><p>With the rules you can determine the recommendations in detail, the extension optimizes the played out products in the background. Thus, the extension intelligently optimizes whether the recommendations should be clicked or automatically swapped with other products to optimize your sales.</p><p>The extension can identify not only registered customers, but also visitors to your website and also classify them as male, female or child to create even more specific recommendations adapted to the rules of your ranking group. Moreover, the plugin tracks all the visitor's movements to classify the visitor into a potential target group and refine the recommendations.</p><p>To optimize your sales, depending on the selected campaign, you can configure the recommendations as cross-selling from, for example, another product group or category, or by default as up-selling with more expensive products.</p><p>We offer pre-built packages to the plugin due to the powerful settings options, which include optimized ranking rules for many use cases.</p><h3>How the app works or is set up:</h3><p>You can find the menu for managing product recommendations under Content -&gt; Dynamic Product Recommendations.</p><h4>Ranking group</h4><p>First, create one or more ranking group(s). These tell which products are to be loaded based on the defined filter rules, so give a wild mix of products.</p><p>First assign a name and activate the ranking group. With the setting \"Restrict to gender\", the products of all defined filter rules are restricted to the potential gender of the visitor. All products are ranked in the background based on the category name with certain keywords into the categories Female, Male and Child. You can optionally define certain gender categories in the app settings to optimize gender detection.</p><p>You can now create rules for which products should be loaded. Each rule has primarily a type and a weighting. Depending on the type, a configuration may be necessary in some cases, which can be opened via the three dots on the right side with the menu item \"Configuration\". The menu item does not exist if no configuration is required.</p><p>The weighting is to be understood as follows: Each rule (or type) returns a list of products. Each product in this list receives the weighting of the rule. If multiple rules within the ranking group return the same products, the weights add up. Products that match many rules are thus considered in the recommendation algorithm. According to the experience, the recommendations are better if many rules with smaller weights are created.</p><p>You can see a rough preview of the products that the ranking group returns on the edit page of a ranking group. To do this, select a product from whose perspective you want the recommendations to be loaded. (However, you can also play out product recommendations in the category listing afterwards).</p><h4>Campaign</h4><p>A campaign tells which ranking group should be loaded and when. Define different rules, in which category which ranking group should be loaded. For example, if you sell T-shirts and technical products, it is recommended to define different ranking groups and to play them out with a campaign separately for each category. It is also advisable to create a general ranking group, which is hardly product-specific. This can be stored in the campaign as a standard ranking group. The default ranking group is played out if none of the rules apply or the applicable rule does not return any products.</p><p>It is planned to extend the campaign rules to allow time-dependent playout of ranking groups, e.g. to play out a ranking group from 01.11. to 25.12. that is specially tailored to your Christmas business.</p><h4>Shopping experiences</h4><p>If you have configured at least one campaign with associated ranking group, you can use our blocks anywhere in your store in the Experience Worlds. Drag the blocks from the Dynamic Product Recommendations category into your page content and open the settings. Select the campaign here, which should be played out. You can now select the sort order of the returned products and customize the design of the products in the listing.</p><p>If you have now added the shopping experiences layout to a product or category, saved it and cleared the cache (ALT + C), you should be able to see the recommendations in the storefront. See our FAQ for typical errors.</p><p><b>Individual support and regular updates</b></p><p><b></b></p><p>If you require special adaptations for the use of our extension in your store, please feel free to contact us. We are continuously improving the app. The satisfaction of our customers and top-quality support are our number one priority. Contact us directly through the Shopware Plugin Support, we will do everything we can to help you competently and quickly.</p><p>________________________________________________________________________________________________________________________________________________________________<br></p><p></p><p><b>About us</b></p><p><b></b></p><p>We are the code<b>giganten</b>&nbsp;(code giants) from Paderborn, your experienced partner for any Shopware 6 project. Years of experience in individual PHP projects with current frameworks form the foundation for an efficient and professional handling of all technologies in the Shopware universe. We continuously update and improve our apps and themes and offer competent, individual support as well as customised solutions to make your store even better.</p><p></p><p>With code<b>giganten</b>&nbsp;GmbH, you not only have an absolutely technically skilled partner at your side, but also benefit from an immense wealth of experience from numerous eCommerce projects in the B2C and B2B markets.</p><p></p><p>codeg<b>iganten</b>&nbsp;GmbH – Your Shopware 6 Partner</p><p></p><p>Friedrichstraße 15 | 33102 Paderborn | Germany</p><p></p><p>Managing Director: Oliver Krimmer</p><p></p><p><a href=\"https://codegiganten.de/\">codegiganten.de</a></p><p></p><p>Do you need a special app or theme, which is not yet available in the store? No problem! Please contact us at any time via E-Mail to&nbsp;<a href=\"https://codegiganten.de/kontakt/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">info@codegiganten.de</a></p><p></p><p><b></b><b></b></p><p>________________________________________________________________________________________________________________________________________________________________</p>","installationManual":"<p>You have decided to use our app? Thank you very much! Now all that's left is the simple installation.</p><p><br></p><p>Tip: If you have purchased an app or theme and your store is connected to your account, the respective extension will automatically appear in your store in the app/theme list and only needs to be installed. Here's how to skip the extension upload step below.</p><p><br></p><p><ol><li>Download the app from the store</li><li>Log into your Shopware 6 administration area and navigate to Extensions &gt; My Extensions &gt; Apps.</li><li>Click on the \"Upload extension\" button and select the downloaded extension</li><li>Use the menu next to the extension to install it and the switch to activate it&nbsp;</li><li>The app is now active. Read our app description for information on how to set up product recommendations.&nbsp;</li></ol></p><p><br></p><p><b>If you need help, we are always available at info@codegiganten.de and https://codegiganten.de/kontakt/</b></p>","shortDescription":"With this extension, you can sustainably increase your store's sales thanks to dynamic product recommendations that are tailored to the visitor's behavior.","highlights":"Identification and analysis of shopping behavior\nOptimization of the products played","features":"Management of rules for the playout of the products\nAnalysis of the effectiveness of orders through recommendations\nVarious CMS modules"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164255,"bookingKey":"cogi495607424229_M","bookingText":"Dynamic product recommendations","price":59.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsiXQ3w","preview":true,"priority":0,"id":75566},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiGUh4r","preview":false,"priority":0,"id":75561},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJ2DAyy","preview":false,"priority":0,"id":75565},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpW4Ocsv","preview":false,"priority":0,"id":75567},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpf1ytGO","preview":false,"priority":0,"id":78392},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphv2fE2","preview":false,"priority":0,"id":78393},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVE4RiK","preview":false,"priority":0,"id":78394},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWGnbf9","preview":false,"priority":0,"id":78395},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeiIH3H","preview":false,"priority":0,"id":78396},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpipyBAg","preview":false,"priority":0,"id":78397}],"comments":[],"ratingAverage":0,"label":"Produktempfehlungen (dynamisch und personalisiert)","description":"<p>Unsere Erweiterung zeigt Ihrer Kundschaft auf Basis von <b>Verhaltensanalysen </b>Produkte an, die entsprechend auf diese abgestimmt sind. Konfigurieren Sie mithilfe von Regeln in sog. <b>Rankinggruppen</b>, welche Produkte auf Basis verschiedener Attribute vorgeschlagen werden sollen.</p><p>In den Erlebniswelten können Sie dann die Bausteine für Ihre Produktansichten oder Kategorie-Listings anpassen, welche die zugeschnittenen Empfehlungen an Ihre Kundschaft in verschiedenen Designs ausspielen.</p><p>Möchten Sie z.B. kurz vor Saisonende Ihren Lagerbestand von einem bestimmten Produkt verringern, können Sie die Regeln Ihrer Rankinggruppe so anpassen, dass diese vermehrt Ihr <b>Wunschprodukt </b>ausspielt, wenn es zum <b>Einkaufsverhalten </b>passt. So können Sie z.B. auch Bestseller-Produkte, welche sich ohnehin schon gut verkaufen, von der Rankinggruppe ausschließen und lassen keine zusätzlichen Empfehlungen für die ausgewählten Produkte oder Produktgruppen mehr ausspielen.</p><p>Mit den <b>Regeln </b>können Sie die Empfehlungen detailliert bestimmen, denn die Erweiterung optimiert die ausgespielten Produkte im Hintergrund. Sie optimiert intelligent, ob die Empfehlungen geklickt werden oder ob sie automatisch mit anderen Produkten ausgetauscht werden sollen, um Ihre Verkäufe zu optimieren.</p><p>Die Erweiterung kann nicht nur registrierte Kundschaft, sondern auch Besucher:innen Ihrer Website identifizieren sowie diese als männlich, weiblich oder Kind einstufen, um angepasst an die Regeln Ihrer Rankinggruppe noch<b> spezifischere Empfehlungen</b> zu erstellen. Zudem <b>trackt </b>die App sämtliche Bewegungen, um die Kundschaft in eine potenzielle <b>Zielgruppe </b>einzustufen und die Empfehlungen zu verfeinern.</p><p>Wir bieten zu dieser App aufgrund der umfangreichen Einstellungsmöglichkeiten vorgefertigte Pakete, welche für viele Use-Cases optimierte Rankingregeln beinhalten. Kontaktieren Sie uns gerne.</p><h3>Funktionsweise bzw. Einrichtung der App:</h3><p>Sie finden das Menü zur Verwaltung der Produktempfehlungen unter <i><b>Inhalte -&gt; Dynamische Produktempfehlungen.</b></i></p><p>Hier finden Sie eine <b>erweiterte Dokumentation</b> für unsere App: <a href=\"https://docs.codegiganten.de/plugin-documentation/apps/dynamische-produktempfehlungen\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.codegiganten.de/plugin-documentation/apps/dynamische-produktempfehlungen</a></p><p>Folglich finden Sie eine kurze Einrichtungserklärung, welche Sie auch in unserer Dokumentation finden können.</p><h4>Rankinggruppe</h4><p>Erstellen Sie zunächst eine oder mehrere Rankinggruppen. Diese sagen aus, welche Produkte anhand der definierten Filterregeln geladen werden sollen, geben also eine wilde Mischung an Produkten wieder. </p><p>Vergeben Sie zunächst einen Namen und aktivieren Sie die Rankinggruppe. Mit der Einstellung \"Auf Geschlecht einschränken\", werden die Produkte aller definierten Filterregeln auf das potenzielle Geschlecht der Besucher:innen eingeschränkt. Alle Produkte werden im Hintergrund anhand der Kategoriebezeichnung mit gewissen Keywords in die Kategorien \"Weiblich, Männlich und Kind\" eingestuft. Sie können in den Einstellungen der App optional bestimmte Kategorien für die Geschlechter definieren, um die Erkennung des Geschlechts zu optimieren.</p><p>Sie können nun Regeln erstellen, welche Produkte geladen werden sollen. Jede Regel hat primär einen Typ und eine Gewichtung. Je nach Typ kann teilweise eine Konfiguration erforderlich sein, welche über die drei Punkte auf der rechten Seite mit dem Menüpunkt \"Konfiguration\" geöffnet werden kann. Der Menüpunkt existiert <b>nicht</b>, wenn keine Konfiguration erforderlich ist.</p><p>Die Gewichtung ist wie folgt zu verstehen: Jede Regel (bzw. jeder Typ) liefert eine Liste an Produkten zurück. Jedes Produkt in dieser Liste erhält die Gewichtung der Regel. Sollten mehrere Regeln innerhalb der Rankinggruppe die selben Produkte zurückgeben, addieren sich die Gewichtungen. Produkte, die bei vielen Regeln zutreffen, werden also in dem Empfehlungsalgorithmus berücksichtigt. Demnach sind die Empfehlungen erfahrungsgemäß besser, wenn viele Regeln mit kleineren Gewichtungen erstellt werden.</p><p>Sie können auf der Bearbeitungsseite einer Rankinggruppe eine grobe Vorschau der Produkte einsehen, welche die Rankinggruppe zurückgibt. Wählen Sie dazu ein Produkt aus, aus dessen Perspektive die Empfehlungen geladen werden sollen (Sie können Produktempfehlungen nachher jedoch auch in dem Kategorie-Listing ausspielen).</p><h4>Kampagne</h4><p>Eine Kampagne sagt aus, welche Rankinggruppe wann geladen werden soll. Definieren Sie verschiedene Regeln, in welcher Kategorie welche Rankinggruppe geladen werden soll. Verkaufen Sie bspw. T-Shirts und Technikprodukte, ist es empfehlenswert, verschiedene Rankinggruppen zu definieren und diese mit einer Kampagne separat je nach Kategorie auszuspielen. Es ist ebenso empfehlenswert, eine allgemeine Rankinggruppe zu erstellen, welche kaum Produktspezifisch ist. Diese kann in der Kampagne als Standard-Rankinggruppe hinterlegt werden. Die Standard-Rankinggruppe wird ausgespielt, wenn keine der Regeln zutreffend ist oder die zutreffende Regel keine Produkte zurück liefert.</p><p>Es ist geplant, die Kampagnenregeln zu erweitern, um so auch zeitabhängige Ausspielungen von Rankinggruppen zu ermöglichen, z.B. von dem 01.11. bis zu dem 25.12. eine Rankinggruppe auszuspielen, welche speziell auf Ihr Weihnachtsgeschäft zugeschnitten ist.</p><h4>Erlebniswelten</h4><p>Wenn Sie mindestens eine Kampagne mit dazugehöriger Rankinggruppe konfiguriert haben, können Sie in den Erlebniswelten unsere Blöcke überall in Ihrem Shop verwenden. Ziehen Sie die Blöcke aus der Kategorie \"Dynamische Produktempfehlungen\" in Ihren Seiteninhalt hinein und öffnen Sie die Einstellungen. Wählen Sie hier die Kampagne aus, welche ausgespielt werden soll. Sie können nun die Sortierung der zurückgegebenen Produkte auswählen und das Design der Produkte im Listing anpassen.</p><p>Wenn Sie das Erlebniswelten-Layout nun zu einem Produkt oder einer Kategorie hinzugefügt, gespeichert und den Cache geleert (ALT + C) haben, müssten Sie die Empfehlungen in der Storefront einsehen können. Beachten Sie unser FAQ für typische Fehler.</p><p><b>Individueller Support und regelmäßige Updates</b></p><p>Sollten Sie für den Einsatz der Erweiterung in Ihrem Shop besondere Anpassungen wünschen, nehmen Sie gerne Kontakt auf. Wir entwickeln die App fortlaufend weiter. Die Zufriedenheit unserer Kundschaft und erstklassiger Support stehen für uns an erster Stelle. Kontaktieren Sie uns direkt über den Shopware App-Support, wir setzen alles daran, Ihnen kompetent und schnell zu helfen (zu finden in Ihrem Account im Shopbetreiberbereich &gt; Support &gt; Support anfragen &gt; Support für Erweiterungen).</p><p>________________________________________________________________________________________________________________________________________________________________</p><p><b>Über uns</b></p><p>Wir sind die code<b>giganten</b> aus Paderborn, Ihr erfahrener Partner für Shopware 6 Projekte. Jahrelange Erfahrung in individuellen PHP-Projekten mit aktuellen Frameworks bilden das Fundament für einen effizienten und professionellen Umgang mit sämtlichen Technologien im Shopware Universum. Unsere Apps und Themes entwickeln wir fortlaufend weiter und bieten kompetenten, individuellen Support sowie maßgeschneiderte Lösungen, um Ihren Shop noch besser zu machen.</p><p>Mit der code<b>giganten</b> GmbH haben Sie nicht nur einen absolut technisch versierten Partner an Ihrer Seite, sondern profitieren zudem von einem immensen Erfahrungsschatz aus zahlreichen eCommerce-Projekten im B2C- und B2B-Bereich.</p><p></p><p>code<b>giganten</b> GmbH - Ihr Partner für Shopware 6</p><p>Friedrichstraße 15 | 33102 Paderborn</p><p>Geschäftsführer: Oliver Krimmer</p><p><a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">codegiganten.de</a><br /></p><p>Benötigen Sie eigene Apps oder Themes, welche es noch nicht im Store gibt? Kein Problem! Melden Sie sich jederzeit bei uns unter <a href=\"https://codegiganten.de/\" target=\"_blank\" rel=\"noreferrer noopener\">info@codegiganten.de</a></p><p></p><p>******* <a href=\"https://codegiganten.de/newsletter/\" target=\"_blank\" rel=\"noreferrer noopener\">Jetzt kostenfrei unseren informativen <b>Newsletter</b> zu Shopware 6 und Apps abonnieren!</a> *******</p><p></p><p>________________________________________________________________________________________________________________________________________________________________</p>","installationManual":"<p>Sie haben sich für unsere App entschieden? Vielen Dank! Jetzt folgt nur noch die einfache Installation.</p><p>Tipp: Haben Sie eine App oder ein Theme erworben und Ihr Shop ist mit Ihrem Account verbunden, taucht die jeweilige Erweiterung automatisch in Ihrem Shop in der App-/Themes-Liste auf und muss nur noch installiert werden. So überspringen Sie den unten aufgeführten Schritt zum Hochladen der Erweiterung.<br /></p><p><br /></p><p></p><ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Loggen Sie sich in Ihren Shopware 6 Administrationsbereich ein und navigieren zu <b><i>Erweiterungen &gt; Meine Erweiterungen &gt; Apps</i></b></li><li>Klicken Sie auf den \"<b><i>Erweiterung hochladen</i></b>\"-Button und wählen die heruntergeladene Erweiterung aus</li><li>Nutzen Sie das Menü neben der Erweiterung, um sie zu installieren und den Schalter, um sie zu aktivieren </li><li>Die App ist jetzt aktiv. Lesen Sie unsere App-Beschreibung, um Informationen zur Einrichtung der Produktempfehlungen zu erhalten. </li></ol><p></p><p><br /></p><p><b>Sollten Sie Hilfe benötigen, stehen wir Ihnen jederzeit unter info@codegiganten.de und https://codegiganten.de/kontakt/ zur Verfügung.</b></p>","version":"1.1.2","changelog":[{"version":"1.1.2","text":"<ul><li>Usertracking longer than one session bugfix</li></ul>","creationDate":{"date":"2022-08-01 11:36:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Deletion of products bugfix</li></ul>","creationDate":{"date":"2022-07-22 23:01:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p></p><ul><li>Fixed an error in the database for the time recording of product calls</li></ul>","creationDate":{"date":"2022-07-18 14:28:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<ul><li>Campaign timecontroll bug fixed</li></ul>","creationDate":{"date":"2022-06-29 16:57:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<ul><li>Replacement of the Cookie</li></ul>","creationDate":{"date":"2022-06-23 16:15:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Fixed Bug with Pickware Plugin</li></ul>","creationDate":{"date":"2022-06-13 09:19:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p></p><ul><li>Error with GuestAgents of the visitors fixed</li></ul>","creationDate":{"date":"2022-06-07 08:20:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<ul><li>Bug fixes when deleting products<br /></li></ul>","creationDate":{"date":"2022-04-05 08:17:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Fixed error when collecting sales statistics</p>","creationDate":{"date":"2022-03-29 08:37:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>Added the possibility to import and export the rank groups<br /></li><li>Bug fixes</li></ul>","creationDate":{"date":"2022-01-28 12:53:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><ul><li>Added integration for email marketing addon</li></ul>","creationDate":{"date":"2021-12-09 11:29:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<ul><li>Some bugs were fixed</li></ul>","creationDate":{"date":"2021-12-06 15:28:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>First version of the app</li></ul>","creationDate":{"date":"2021-11-08 14:52:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=cogi495607424229","redirectToStore":false,"lowestPriceValue":59.9}