{"id":14238,"name":"AtlSeoUrlManager","code":"Atl7563489453634","lastChange":{"date":"2023-07-18 11:16:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8KgI5T","examplePageUrl":"","moduleKey":"AtlSeoUrlManager","creationDate":{"date":"2021-10-25 14:05:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-10-28 16:39:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-12-14 20:30:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3488,"prefix":"Atl","name":"Atloss GmbH","website":"//www.atloss.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3488_atloss-logo.png"},"infos":[{"id":24796,"name":"SEO URL Manager","description":"<p>Du suchst nach einer Erweiterung, die deine URLs <b>SEO konform</b> generiert? Der&nbsp;<b style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Atloss SEO URL Manager&nbsp;</b>bietet dir die perfekte Ausgangsbasis für deinen Shopware 6 Shop.</p><p>⚙️&nbsp; Varianten URLs können mit sprechendem Varianten-Suffix generiert werden<br>⚙️&nbsp;&nbsp;Canonical URLs verweisen bei Varianten automatisch auf den Parent&nbsp;<br>⚙️&nbsp; Sitemap URLs enthalten lediglich die Parent URL deiner Produkte<br>⚙️&nbsp;&nbsp;Listing-Links verweisen auf die Parent URL eines Variantenartikels</p><h2>Welches Problem löst der Atloss SEO URL Manager?</h2><p>Die Erweiterung bietet dir die perfekte Shop URL Grundlage durch folgende Funktionen:</p><ol><li>Shopware 6 bietet dir keine Möglichkeit sprechende URLs für Varianten zu generieren. Was bedeutet das? URLs wie www.deinshop.com/t-shirt-rot-xl werden vom Shopware Core nicht unterstützt. Mit einem kinderleichten Template bist du nun in der Lage sprechende URLs für deine Varianten zu generieren.<br><br></li><li>Canonical URLs lassen sich in Shopware 6 nur auf eine andere Variante setzen. Hast du bspw. einen Artikel mit den Varianten M, L und XL, erlaubt Shopware lediglich eine dieser drei Varianten als Canonical URL zu verwenden. Gerade bei Kleidungsgrößen, Farben oder verschiedenen Ausführungen ist es jedoch vorteilhaft die Parent URL (www.deinshop.com/t-shirt) zu verwenden. Dies verhilft der Suchmaschine keine konkrete Variante, sondern den Parent zu indexieren. Dies ist gängige Praxis in der Shop-SEO.<br><br></li><li>Die Shopware 6 Sitemap enthält standardmäßig alle URLs die in deinem Shop existieren. Somit auch alle Varianten URLs. Bei einem Artikel mit acht Varianten bedeutet das insgesamt acht URLs in der Sitemap. Gerade bei Varianten wie Größen, Farben oder Maßen ist es jedoch wichtig, dass lediglich die Parent URL in der Sitemap angezeigt wird. Somit wird deine Sitemap deutlich konkreter für die Suchmaschine, was zu besseren Rankings führt.</li></ol><h2>Mit richtigen Canonicals Duplicate Content verhindern und bessere Google Ergebnisse erzielen</h2><p>Online-Shops, deren Produkte Varianten wie Größen, Farben und Maßen enthalten erzeugen sehr schnell <b>Duplicate Content</b>. Solltest du beispielsweise Kleidung in verschiedenen Größen verkaufen, wird für jede Kleidergröße eine eigene URL erzeugt. Das Problem ist hierbei, dass alle diese URLs von Google indexiert werden und die Seiten 1:1 gleich aufgebaut sind.</p><p>Setzt du den Canonical mithilfe der App jedoch auf den Parent des Produktes, so wird nur der Parent von Google indexiert. Weiterhin werden nur die Canonical URLs in die Sitemap mit aufgenommen. Dies verhindert, dass der Google Crawler unnötig lange Zeit verschwendet deine Produkte in der Sitemap zu finden und richtig zu indexieren. Je effizienter du den Google Crawler arbeiten lässt, je besser werden deine Rankings.</p><p>Hilf deinem Onlineshop jetzt dabei die perfekten Gegebenheiten für <b>Spitzenpositionen auf Google</b> zu schaffen.</p><h2>Support:</h2><p>Falls du Fragen hast oder Hilfe benötigst erreichst du uns per Mail oder Telefon:</p><p>Unsere <a href=\"https://atloss.de/\">Shopware Agentur</a>:<br>✉️&nbsp; E-Mail: hello@atloss.de<br>✉️&nbsp; Telefon: +49 6045 9542182</p>","installationManual":"<h2>Basiskonfiguration</h2><p>1. Erweiterung installieren und aktivieren<br>2. Die Konfiguration öffnen und die gewünschten Funktionen aktivieren<br>3. Cache leeren</p><h2>Varianten URLs generieren</h2><p>1. Zu <b>Einstellungen &gt; Shop &gt; SEO</b> begeben<br>2. Folgendes Template verwenden und speichern:</p><p>--------------------------------------------------------<br>{{ product.translated.name|lower }}{% if product.variation is not empty and product.parentId is not empty %}{% for var in product.variation %}-{{ var.option|lower }}{% endfor %}{% endif %}/<br>--------------------------------------------------------</p><p>Dieses Template erstellt die URLs nach folgendem Schema:<br><i style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://www.deinshop.com/[produkt-name-in-kleinbuchstaben]-[variante(n)-in-kleinbuchstaben]/</i></p><p>Du kannst die Vorlage natürlich an deine Bedürfnisse anpassen.</p><p>3. <b>Einstellungen &gt; System &gt; Caches &amp; Indizes &gt; Indizes aktualisieren</b><br>(Den aktuellen Stand der Indexierung kannst du in den Mitteilungen rechts oben verfolgen. Je mehr Produkte du in deinem Shop hast, desto länger kann dieser Prozess dauern.)</p><h2>Canonical URLs</h2><p>Hierfür ist keine weitere Konfiguration nötig.</p><h2>Sitemap URLs</h2><p>1. <b>Einstellungen &gt; System &gt; Caches &amp; Indizes &gt; Indizes aktualisieren</b><br>(Den aktuellen Stand der Indexierung kannst du in den Mitteilungen rechts oben verfolgen. Je mehr Produkte du in deinem Shop hast, desto länger kann dieser Prozess dauern.)</p><h2>Weitere Optionen</h2><p>Globale Einstellungen aus der App Konfiguration wie die Verlinkung aus Produkt Boxen, sowie die Canonical-URL Setzung kannst du unter <br><br><b>[Produkt] &gt; Spezifikationen &gt; Zusatzfelder &gt; Produkt (SEO URL Manager)</b><br><br>&nbsp;auf Produktebene überschreiben.</p>","shortDescription":"Du suchst nach einer Erweiterung die deine URLs SEO konform generiert? Der Atloss SEO URL Manager bietet dir die perfekte Ausgangsbasis für deinen Shopware 6 Shop.","highlights":"Varianten URLs mit sprechendem Variantensuffix \nCanonical URLs zeigen bei Varianten automatisch auf den Parent\nSitemap URLs enthalten lediglich Produkt Parent URLs\nListing-Links zeigen automatisch auf die Parent URL eines Variantenartikels\nSchnelle Einrichtung","features":"Inklusive Produktdetail Seiten Markup wie Produkt \"name\", \"review\", \"reviewRating\" und \"reviewCount\" Tag"},{"id":24797,"name":"SEO URL Manager","description":"<p>Looking for an extension that generates your URLs <b>SEO compliant</b>? The&nbsp;<b style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Atloss SEO URL Manager&nbsp;</b>offers you the perfect starting point for your Shopware 6 shop.</p><p>⚙️&nbsp; Variant URLs can be generated with a speaking variant suffix<br>⚙️&nbsp; Canonical URLs automatically refer to the parent for variants<br>⚙️&nbsp; Sitemap URLs only contain the parent URL of your products<br>⚙️&nbsp; Listing links point to the parent URL of a variant product<br></p><h2>What problem does the Atloss SEO URL Manager solve?</h2><p>The extension offers you the perfect store URL foundation through the following features:</p><p></p><ol><li>Shopware 6 does not offer you the possibility to generate speaking URLs for variants. What does this mean? URLs like www.yourshop.com/t-shirt-rot-xl are not supported by the Shopware Core. With a very easy template you are now able to generate talking URLs for your variants.<br><br></li><li>Canonical URLs can only be set to another variant in Shopware 6. For example, if you have a product with the variants M, L and XL, Shopware only allows one of these three variants to be used as a Canonical URL. Especially with clothing sizes, colors or different versions it is advantageous to use the Parent URL (www.yourshop.com/t-shirt). This helps the search engine to index not a specific variant, but the parent. This is common practice in shop SEO.<br><br></li><li>The Shopware 6 sitemap contains by default all URLs that exist in your shop. Thus also all variant URLs. For a product with eight variants, this means a total of eight URLs in the sitemap. Especially for variants like sizes, colors or measurements it is important that only the parent URL is shown in the sitemap. This makes your sitemap much more concrete for the search engine, which leads to better rankings.</li></ol><h2>Prevent duplicate content with correct canonicals and achieve better Google results</h2><p>Online shops whose products contain variants such as sizes, colors and measurements generate <b>duplicate content</b> very quickly. For example, if you sell clothing in different sizes, a separate URL will be generated for each clothing size. The problem is that all these URLs are indexed by Google and the pages are literally built the same way.</p><p>However, if you set the canonical to the parent of the product using the app, only the parent will be indexed by Google. Furthermore, only the canonical URLs are included in the sitemap. This prevents the Google crawler from wasting unnecessary time finding your products in the sitemap and indexing them correctly. The more efficiently you let the Google crawler work, the better your rankings will be.</p><p>Help your online shop now to create the perfect conditions for <b>top positions on Google</b>.</p><h2>Support:</h2><p>If you have any questions or need help, you can reach us by mail or phone:</p><p>Our&nbsp;<a href=\"https://atloss.de/\">Shopware agency</a>:<br>✉️&nbsp; Email: hello@atloss.de<br>✉️&nbsp; Phone: +49 6045 9542182</p>","installationManual":"<h2>Basic configuration</h2><p>1. Install and activate the extension.&nbsp;<br>2. Open the configuration and activate the desired functions.&nbsp;<br>3. Clear cache</p><h2>Generate variant URLs</h2><p>1. Go to <b>Settings &gt; Shop &gt; SEO<br></b>2. Use and save the following template:</p><p>--------------------------------------------------------<br>{{ product.translated.name|lower }}{% if product.variation is not empty and product.parentId is not empty %}{% for var in product.variation %}-{ var.option|lower }}{% endfor %}{% endif %}/<br>--------------------------------------------------------</p><p>This template creates the URLs according to the following scheme:<br><i style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://www.yourshop.com/[product-name-in-lowercase]-[variation(s)-in-lowercase]/</i></p><p>You can, of course, adjust the template to your needs.</p><p>3. <b>Settings &gt; System &gt; Caches &amp; Indexes &gt; Update indexes<br></b>(You can see the current state of the indexing in the notifications in the upper right corner. The more products you have in your store, the longer this process can take).</p><h2>Canonical URLs</h2><p>No further configuration is necessary.</p><h2>Sitemap URLs</h2><p>1.&nbsp;<b style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Settings &gt; System &gt; Caches &amp; Indexes &gt; Update indexes<br></b>(You can see the current state of the indexing in the notifications in the upper right corner. The more products you have in your store, the longer this process can take).</p><h2>Further options</h2><p>Global settings from the app configuration like the linking from product boxes, as well as the canonical URL setting can be adjusted under<br><br><b>[Product] &gt; Specifications &gt; Custom Fields &gt; Product (SEO URL Manager)</b><br><br>&nbsp;on product level.</p>","shortDescription":"Looking for an extension that generates your URLs SEO compliant? The Atloss SEO URL Manager offers you the perfect starting point for your Shopware 6 online shop.","highlights":"Variant URLs with speaking variant suffix \nCanonical URLs automatically point to the parent for variants\nSitemap URLs only contain product parent URLs\nListing links automatically point to the parent URL of a variant product\nQuick setup","features":"Includes product detail pages markup like product \"name\", \"review\", \"reviewRating\" and \"reviewCount\" tag"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164324,"bookingKey":"Atl7563489453634","bookingText":"","price":99.99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":164323,"bookingKey":"Atl7563489453634_M","bookingText":"","price":9.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHQyOyA","preview":true,"priority":99,"id":75039},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2uq5yY","preview":false,"priority":97,"id":75043},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNhvCIx","preview":false,"priority":95,"id":75042},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprLXxbY","preview":false,"priority":93,"id":75041},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpm3J2Ey","preview":false,"priority":91,"id":75044}],"comments":[{"authorName":"Robin Deimel","text":"Das Plugin macht was es soll und funktioniert tadellos. Ich arbeite ausschließlich mit Variantenartikeln und kann nun endlich einen vernünftigen Canonical setzen.\n\nAnfänglich hatte ich einige Probleme mit meinen SEO Einstellungen, was allerdings an einem Fremdplugin lag. Der Kundenservice war äußerst freundlich und hat mir binnen weniger Stunden sehr kompetent weitergeholfen! Absolut vorbildlich &amp; vielen Dank noch einmal!","headline":"Plugin &amp; Kundenservice absolut top!","creationDate":{"date":"2023-04-13 19:10:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dirk","text":"Ich habe wegen der 0%-Besteuerung auf Solaranlagen viele Varianten im Shop erzeugt und wunderte mich, dass mein Ranking abk*ckte. Als ich mir die Canonical-Struktur von Shopware näher anschaute, fiel ich vom Glauben ab... Danke für die einfache und gute Lösung!","headline":"Gut dokumentiert, einfach anzuwenden, perfekt!","creationDate":{"date":"2023-04-05 19:11:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Timo Trautner","text":"Dieses Plugin gibt Dir die Möglichkeit schnell und einfach deine Link-Struktur umzusetzen, wenn man mit den Standard-Einstellungen von Shopware 6 nicht ganz glücklich ist. Es spart Zeit und ist zudem sehr flexibel in der Template-Anpassung. Eine absolute Empfehlung beim Umstieg auf Shopware 6. \nUnd falls man eine Frage hat, gibt es immer eine schnelle Antwort!","headline":"Schöne SEO-Links für Ästheten","creationDate":{"date":"2023-02-02 10:49:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"BAB - Marcel Böttcher","text":"Das Plugin hält das, was es verspricht und ist absolut durchdacht.\nFragen werden wirklich geklärt und es wird auch erklärt.\n\nHinterher ist man immer ein Stück schlauer - Danke dafür.\n\nWissen so zu teilen, ist leider nicht so verbreitet...\n\nMacht weiter so....\nIch wünsche euch mit dieser Einstellung wieterhin viel Erfolg - die 5 Sterne sind absolut verdient.","headline":"lässt nichts ungeklärt - absolut sachlich, freundlich und kompetent","creationDate":{"date":"2022-11-22 12:49:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"MS","text":"The extension solved our issue with variant urls. Support was very helpful and fast.","headline":"Helpful extension","creationDate":{"date":"2022-09-14 11:22:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Mario Wormuth","text":"Macht exakt was es soll. Hat uns bei der Sitemap Problematik hervorragend geholfen. Der Support ist sehr freundlich und beantwortet einem jede Frage sehr ruhig und verständlich. Hier erhält man auch noch kostenlos Tipps und Informationen - wir sind sehr zufrieden mit dem Anbieter und können jedem der Varianten nutzt dieses Plug-in empfehlen.","headline":"Top Support - Top Plugin","creationDate":{"date":"2022-08-08 11:53:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sven Meister","text":"Bei der Migration von Shopware 5 auf 6 mussten wir mit Schrecken feststellen, dass wenn man Produkte mit Varianten (in unserem Fall bei Jeans die entsprechenden Größen) SEOtechnisch völlig gegen die Wand fährt, wenn man Shopware 6 einsetzen möchte. Dieses Plugin hat das Problem aber gelöst, indem es jeder Variante einen Canonical gibt. Installation und Betrieb sehr einfach. Der Support ist absolut klasse, meiner Meinung nach der beste Support für ein Plugin was ich hier im Store jemals erlebt habe. Vielen Dank dafür!","headline":"Eine Lösung für Shops mit Varianten","creationDate":{"date":"2022-06-27 13:24:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Max Scheuerer","text":"Durch das Plugin konnten wir endlich saubere Varianten URLs generieren und korrekte Canonicals setzen. Jeder der mit Shop SEO vertraut ist kommt an diesem Plugin nicht vorbei!","headline":"Must Have","creationDate":{"date":"2022-06-11 13:33:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marisa Schulz","text":"Das Plugin macht genau das was benötigt wird bei den Varianten und der Support ist nicht nur hilfsbereit, sondern auch supernett! 100 Punkte! :)","headline":"Super Support","creationDate":{"date":"2022-03-10 15:12:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Nicolas","text":"Das Plugin tut, was es soll. Luca hat sich viel Zeit genommen, mir die Funktionalität zu erklären. Ich kann dieses Plugin und die Agentur empfehlen.","headline":"Top Plugin - top Service","creationDate":{"date":"2022-02-09 16:55:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marco","text":"Plugin tut was es verspricht. Der Support ist sehr schnell, technisch versiert und hilfreich. Ich habe Freitag Abend innerhalb von 2h eine Antwort auf meine Frage erhalten!","headline":"Super Support","creationDate":{"date":"2022-01-27 13:39:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Matthias Clemens","text":"Dieses Plugin habe ich gesucht. Endlich ist es möglich URLs Variantenkonform zu generieren!","headline":"Endlich keine URL Probleme mehr","creationDate":{"date":"2021-12-09 17:57:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Uwe Schmidt","text":"Macht auf \"Knopfdruck\" genau das was es soll. Dazu super schneller Support.","headline":"Top Erweiterung","creationDate":{"date":"2021-12-03 17:04:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marcus Dauth","text":"Alles bestens","headline":"Das Plugin macht was es soll","creationDate":{"date":"2021-11-04 13:15:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Maximilian Faust","text":"Das Plugin hält was es verspricht. Support war auch super. Um unser Anliegen wurde sich direkt gekümmert.","headline":"Perfekt, wenn man seine SEO URLs in den Griff bekommen möchte","creationDate":{"date":"2021-11-02 13:16:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"SEO URL Manager","description":"<p>Du suchst nach einer Erweiterung, die deine URLs <b>SEO konform</b> generiert? Der <b>Atloss SEO URL Manager </b>bietet dir die perfekte Ausgangsbasis für deinen Shopware 6 Shop.</p><p>⚙️  Varianten URLs können mit sprechendem Varianten-Suffix generiert werden<br />⚙️  Canonical URLs verweisen bei Varianten automatisch auf den Parent <br />⚙️  Sitemap URLs enthalten lediglich die Parent URL deiner Produkte<br />⚙️  Listing-Links verweisen auf die Parent URL eines Variantenartikels</p><h2>Welches Problem löst der Atloss SEO URL Manager?</h2><p>Die Erweiterung bietet dir die perfekte Shop URL Grundlage durch folgende Funktionen:</p><ol><li>Shopware 6 bietet dir keine Möglichkeit sprechende URLs für Varianten zu generieren. Was bedeutet das? URLs wie www.deinshop.com/t-shirt-rot-xl werden vom Shopware Core nicht unterstützt. Mit einem kinderleichten Template bist du nun in der Lage sprechende URLs für deine Varianten zu generieren.<br /><br /></li><li>Canonical URLs lassen sich in Shopware 6 nur auf eine andere Variante setzen. Hast du bspw. einen Artikel mit den Varianten M, L und XL, erlaubt Shopware lediglich eine dieser drei Varianten als Canonical URL zu verwenden. Gerade bei Kleidungsgrößen, Farben oder verschiedenen Ausführungen ist es jedoch vorteilhaft die Parent URL (www.deinshop.com/t-shirt) zu verwenden. Dies verhilft der Suchmaschine keine konkrete Variante, sondern den Parent zu indexieren. Dies ist gängige Praxis in der Shop-SEO.<br /><br /></li><li>Die Shopware 6 Sitemap enthält standardmäßig alle URLs die in deinem Shop existieren. Somit auch alle Varianten URLs. Bei einem Artikel mit acht Varianten bedeutet das insgesamt acht URLs in der Sitemap. Gerade bei Varianten wie Größen, Farben oder Maßen ist es jedoch wichtig, dass lediglich die Parent URL in der Sitemap angezeigt wird. Somit wird deine Sitemap deutlich konkreter für die Suchmaschine, was zu besseren Rankings führt.</li></ol><h2>Mit richtigen Canonicals Duplicate Content verhindern und bessere Google Ergebnisse erzielen</h2><p>Online-Shops, deren Produkte Varianten wie Größen, Farben und Maßen enthalten erzeugen sehr schnell <b>Duplicate Content</b>. Solltest du beispielsweise Kleidung in verschiedenen Größen verkaufen, wird für jede Kleidergröße eine eigene URL erzeugt. Das Problem ist hierbei, dass alle diese URLs von Google indexiert werden und die Seiten 1:1 gleich aufgebaut sind.</p><p>Setzt du den Canonical mithilfe der App jedoch auf den Parent des Produktes, so wird nur der Parent von Google indexiert. Weiterhin werden nur die Canonical URLs in die Sitemap mit aufgenommen. Dies verhindert, dass der Google Crawler unnötig lange Zeit verschwendet deine Produkte in der Sitemap zu finden und richtig zu indexieren. Je effizienter du den Google Crawler arbeiten lässt, je besser werden deine Rankings.</p><p>Hilf deinem Onlineshop jetzt dabei die perfekten Gegebenheiten für <b>Spitzenpositionen auf Google</b> zu schaffen.</p><h2>Support:</h2><p>Falls du Fragen hast oder Hilfe benötigst erreichst du uns per Mail oder Telefon:</p><p>Unsere <a href=\"https://atloss.de/\">Shopware Agentur</a>:<br />✉️  E-Mail: hello@atloss.de<br />✉️  Telefon: +49 6045 9542182</p>","installationManual":"<h2>Basiskonfiguration</h2><p>1. Erweiterung installieren und aktivieren<br />2. Die Konfiguration öffnen und die gewünschten Funktionen aktivieren<br />3. Cache leeren</p><h2>Varianten URLs generieren</h2><p>1. Zu <b>Einstellungen &gt; Shop &gt; SEO</b> begeben<br />2. Folgendes Template verwenden und speichern:</p><p>--------------------------------------------------------<br />{{ product.translated.name|lower }}{% if product.variation is not empty and product.parentId is not empty %}{% for var in product.variation %}-{{ var.option|lower }}{% endfor %}{% endif %}/<br />--------------------------------------------------------</p><p>Dieses Template erstellt die URLs nach folgendem Schema:<br /><i>https://www.deinshop.com/[produkt-name-in-kleinbuchstaben]-[variante(n)-in-kleinbuchstaben]/</i></p><p>Du kannst die Vorlage natürlich an deine Bedürfnisse anpassen.</p><p>3. <b>Einstellungen &gt; System &gt; Caches &amp; Indizes &gt; Indizes aktualisieren</b><br />(Den aktuellen Stand der Indexierung kannst du in den Mitteilungen rechts oben verfolgen. Je mehr Produkte du in deinem Shop hast, desto länger kann dieser Prozess dauern.)</p><h2>Canonical URLs</h2><p>Hierfür ist keine weitere Konfiguration nötig.</p><h2>Sitemap URLs</h2><p>1. <b>Einstellungen &gt; System &gt; Caches &amp; Indizes &gt; Indizes aktualisieren</b><br />(Den aktuellen Stand der Indexierung kannst du in den Mitteilungen rechts oben verfolgen. Je mehr Produkte du in deinem Shop hast, desto länger kann dieser Prozess dauern.)</p><h2>Weitere Optionen</h2><p>Globale Einstellungen aus der App Konfiguration wie die Verlinkung aus Produkt Boxen, sowie die Canonical-URL Setzung kannst du unter <br /><br /><b>[Produkt] &gt; Spezifikationen &gt; Zusatzfelder &gt; Produkt (SEO URL Manager)</b><br /><br /> auf Produktebene überschreiben.</p>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"<p></p><ul><li>Customization of the Shopware Core version in composer.json</li></ul>","creationDate":{"date":"2023-06-05 10:35:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p></p><ul><li>Compatibility with Shopware v6.5.0.0</li></ul>","creationDate":{"date":"2023-03-29 17:37:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>It is now possible to override the global parent-canonical-URL-for-variants option at the product level<br /></li></ul>","creationDate":{"date":"2023-02-23 14:50:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>It is now possible to customize the global linking to the parent from product boxes on product level.<br /></li></ul>","creationDate":{"date":"2022-11-05 14:36:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.10","text":"<ul><li>Improved compatibility with third-party plugins<br /></li></ul>","creationDate":{"date":"2022-10-29 17:33:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<ul><li>Fixed a bug where the meta tag \"name\" was not included correctly.<br /></li></ul>","creationDate":{"date":"2022-07-06 12:16:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<ul><li>Bug fix where an error was thrown on product detail pages due to an assigned layout</li></ul>","creationDate":{"date":"2022-06-26 13:58:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<ul><li>Meta Tags \"name\", \"review\", \"reviewRating\" and \"reviewCount\" added to plugin configuration</li></ul>","creationDate":{"date":"2022-06-25 18:00:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<ul><li>Link to parent was missing on the \"details button\" when a product is no longer for sale<br /></li></ul>","creationDate":{"date":"2022-04-03 11:11:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<ul><li>Plugin configuration was refined<br /></li></ul>","creationDate":{"date":"2022-03-11 09:13:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>The template for parent canonical URLs was improved<br /></li></ul>","creationDate":{"date":"2021-12-09 16:54:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<ul><li>Bug fixed where variant products couldn't be removed from wishlist<br /></li></ul>","creationDate":{"date":"2021-12-03 21:02:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>Bug fixed where products couldn't be added to wishlist correctly</li></ul>","creationDate":{"date":"2021-12-03 19:50:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Ignore product availability for sitemap generation<br /></li></ul>","creationDate":{"date":"2021-11-02 12:39:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Listing links now point to the parent of a variant product if \"Parent canonical URL for variants\" config is enabled.<br /></li></ul>","creationDate":{"date":"2021-10-29 19:27:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p></p><ul><li>Initial plugin version</li></ul>","creationDate":{"date":"2021-10-25 14:15:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Atl7563489453634","redirectToStore":false,"lowestPriceValue":9.99}