{"id":14370,"name":"OvrFacebookProductExport","code":"Ovr9495644955819","lastChange":{"date":"2023-07-18 11:16:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbuVhAw","examplePageUrl":"","moduleKey":"OvrFacebookProductExport","creationDate":{"date":"2021-11-15 04:40:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2021-12-06 19:53:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2021-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-03-17 12:43:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3226,"prefix":"Ovr","name":"OVR Engineering","website":"//ovrengineering.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3226_logo_black_bg.png"},"infos":[{"id":25020,"name":"Facebook / Instagram Katalog Template","description":"<h2>Was bringt mir der Facebook Produktkatalog Export? </h2>Für zielgerichtete Anzeigen auf Instagram und Facebook ist es möglich, Produktdaten im Facebook Commerce Manager einzureichen. Damit die Produkte korrekt importiert werden können, müssen die Produktdaten in einem bestimmten Format bereitgestellt werden. Unser Plugin übernimmt diese Aufgabe komplett und fügt ein neues Template für Produktvergleich-Verkaufskanäle hinzu, das deine Produkte entsprechend der Anforderungen von Facebook formatiert.\nNeben dem reinen Template fügt unser Plugin den Produkteinstellungen in deiner Shop-Administration einen neuen Reiter hinzu, über den du die Produktdaten wie Name und Beschreibung für den Facebook Feed anpassen kannst - ohne, dass sich die Daten in deinem Shop ändern.\nEine Besonderheit stellt dabei die Pflege der Varianten Eigenschaften dar. Facebook&nbsp; bietet die Möglichkeit, im Feed für Varianten die Eigenschaften “Material”, “Muster”, “Größe” und “Farbe” anzugeben. In unserem Plugin ist dies so gelöst, dass du in der Plugin-Konfiguration jeweils eine Eigenschaftgruppe aus deinem Shop auswählen kannst. Die jeweilige Eigenschaft wird für die passenden Produkte dann ganz automatisch übergeben. <br><h2>Wie kann ich das Plugin einrichten &amp; sind Code-Kenntnisse notwendig? </h2>Für die Integration des Plugins benötigst Du keine Code-Kenntnisse. Die Anleitung zum Einrichten findest Du im Tab „Installationsanleitung”.<br><h2>Feedback &amp; Bewertung </h2>Du hast einen Verbesserungsvorschlag, einen Fehler gefunden oder es fehlt dir ein Feature? Schreib uns gerne eine Mail an: info@ovrengineering.de","installationManual":"<p>Eine ausführliche Beschreibung findest du in unserer <a href=\"https://docs.ovrengineering.de/facebook-katalog-template/\" target=\"_blank\" rel=\"noopener\">Dokumentation.</a><br></p><p><br></p><p>Nach dem Installieren des Plugins kannst du eine neue Storefront vom Typ \"Produktvergleich\" anlegen. In dieser findest du nun das vom Plugin hinzugefügte Template \"Facebook Katalog (CSV)\". Wähle das Template aus, stimme dem Überschreiben der Werte zu und speichere den neuen Verkaufskanal. Den Link zum Feed kannst du nun im Facebook Commerce Manager einreichen.</p><p>In der Plugin Konfiguration kannst du Standard-Werte hinterlegen, die für alle Produkte gelten. In der Detailansicht eines Produkts kannst du diese Werte zusätzlich überschreiben, um individuelle Einstellungen für das Produkt vorzunehmen. <br></p>","shortDescription":"Unser Facebook Katalog Export Plugin fügt ein neues Template für Produktvergleich-Verkaufskanäle hinzu, das als Datenfeed bei Facebook und Instagram verwendet werden kann.","highlights":"Einfache Einrichtung – Nur wenige Klicks, keine Code-Kenntnisse notwendig\nVerkaufskanal Template - Beliebig viele Datenfeeds anlegbar\nProduktdaten überschreibbar - Daten speziell für den Facebook Katalog einpflegbar\nVoll kompatibel mit Varianten - statt Texteingabe über Auswahl der Gruppe definierbar\nVersandkosten Validierung - automatische Überprüfung der Versandkosten-Definition","features":"Fertige Vorlage für einen Verkaufskanal, der als Datenquelle bei Facebook und Instagram verwendet werden kann\nExport der Produkte im CSV-Format\nDie Produktdaten können speziell für den Facebook Feed überschrieben werden\nÜber einen Schalter kann ausgewählt werden, dass die Varianten-Eigenschaften an den Name angehängt werden\nIn der Plugin-Config sowie für jedes Produkt individuell kann für die Felder “Material”, “Muster”, “Größe” und “Farbe” jeweils eine Eigenschaften-Gruppe gewählt werden. \nFacebook erwartet die Versandkosten in einem ganz bestimmten Format. Im Plugin wurde ein Validator implementiert, der deine Eingabe auf ihre Gültigkeit überprüft"},{"id":25021,"name":"Facebook / Instagram Catalog Template","description":"<h2>What does the Facebook / Instagram Product Catalog Template do for me? </h2>For targeted ads on Instagram and Facebook, it is possible to submit product data in Facebook Commerce Manager. In order for the products to be imported correctly, the product data must be provided in a certain format. Our plugin takes care of this task completely and adds a new template for product comparison sales channels, which formats your products according to Facebook's requirements.\nBesides the pure template, our plugin adds a new tab to the product settings in your store administration, which allows you to customize the product data like name and description for the Facebook feed - without changing the data in your store.\nA special feature is the maintenance of the variant properties. Facebook offers the possibility to specify the properties \"material\", \"pattern\", \"size\" and \"color\" in the feed for variants. In our plugin, this is solved in such a way that you can select a property group from your store in the plugin configuration. The respective property is then automatically transferred for the matching products. <br><h2>How can I set up the plugin &amp; are code knowledge necessary? </h2>For the integration of the plugin you do not need any code knowledge. You can find the setup instructions in the \"Installation Guide\" tab.<br><h2>Feedback &amp; Rating </h2>You have a suggestion for improvement, found a bug or you are missing a feature? Feel free to write us an email to: info@ovrengineering.de","installationManual":"<p>You can find a more in-depth manual in our <a href=\"https://docs.ovrengineering.de/facebook-katalog-template/\" target=\"_blank\" rel=\"noopener\">documentation</a>.<br></p><p><br></p><p>After installing the plugin, you can create a new storefront of the type \"Product comparison\". In this storefront you will find the template \"Facebook Catalog (CSV)\" added by the plugin. Select the template, agree to overwrite the values and save the new sales channel. You can now submit the link to the feed in Facebook Commerce Manager.</p><br><p>In the plugin configuration you can set default values that apply to all products. In the detail view of a product you can additionally overwrite these values to make individual settings for the product. </p>","shortDescription":"Our Facebook Catalog Template plugin adds a new template for product comparison sales channels that can be used as a data feed on Facebook and Instagram.","highlights":"Easy setup - Only a few clicks, no code knowledge required\nSales channel template - Any number of data feeds can be created\nProduct data overwritable - Data can be entered specifically for the Facebook catalog\nFully compatible with variants - can be defined by selecting the group instead of entering text\nShipping costs validation - automatic check of shipping costs definition","features":"Pre-made template for a sales channel that can be used as a data source on Facebook and Instagram.\nExport of the products in CSV format\nThe product data can be overwritten specifically for the Facebook feed\nA switch can be used to select that the variant properties are appended to the name\nIn the plugin config and for each product individually, a property group can be selected for the fields \"Material\", \"Pattern\", \"Size\" and \"Color\" respectively. \nFacebook expects the shipping costs in a very specific format. A validator has been implemented in the plugin, which checks your input for its validity"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164503,"bookingKey":"Ovr9495644955819","bookingText":"Facebook Product Catalog Template","price":80,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":164502,"bookingKey":"Ovr9495644955819_M","bookingText":"Facebook Product Catalog Template","price":9.95,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpw9TEnS","preview":true,"priority":0,"id":101630},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXujsq1","preview":false,"priority":10,"id":75818},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8sRacF","preview":false,"priority":5,"id":75814},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpv03Dns","preview":false,"priority":2,"id":75816}],"comments":[{"authorName":"Markus von besonders.eu","text":"Wir waren auf der Suche nach einem Tool, welches uns all unsere Produkte unkompliziert in den Facebook-Kakalog überträgt. Wir sind abolute Anfänger ohne IT-Erfahrung. Mit dem sehr übersichtlichen und leicht verständlichen Handbuch haben wir es aber tatsächlich ohne Hilfe geschafft :-).\nIm Nachhinein sind von Facebook Fehler/Hinweise zu den Google Kategiorien gemeldet worden.\nIch fragte bei OVR Engeneering nach und bekam am nächsten Tag eine verständliche Antwort, mit der ich das Problem beheben konnte.\nBins sehr zufrieden mit dem Produkt und dem Service!\nBitte weiter so.","headline":"Einfaches Tool und toller Service","creationDate":{"date":"2023-01-14 17:53:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"A. Raiber","text":"Ich habe mich für dieses Plugin entschieden, da ich damit die Feeds für Facebook/Instagram und auch Google Shopping einfach erstellen kann. Das Plugin ist leicht verständlich und sehr flexibel. Die Templates für die einzelnen Feeds können individuell angepasst werden (Programmierkenntnisse erforderlich). \nBin total zufrieden mit diesem Plugin. Danke für die tolle Arbeit!","headline":"Tolles &amp; flexibles Plugin für Facebook/Instagram und Google Shopping","creationDate":{"date":"2022-03-16 10:19:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Facebook / Instagram Katalog Template","description":"<h2>Was bringt mir der Facebook Produktkatalog Export? </h2>Für zielgerichtete Anzeigen auf Instagram und Facebook ist es möglich, Produktdaten im Facebook Commerce Manager einzureichen. Damit die Produkte korrekt importiert werden können, müssen die Produktdaten in einem bestimmten Format bereitgestellt werden. Unser Plugin übernimmt diese Aufgabe komplett und fügt ein neues Template für Produktvergleich-Verkaufskanäle hinzu, das deine Produkte entsprechend der Anforderungen von Facebook formatiert.\nNeben dem reinen Template fügt unser Plugin den Produkteinstellungen in deiner Shop-Administration einen neuen Reiter hinzu, über den du die Produktdaten wie Name und Beschreibung für den Facebook Feed anpassen kannst - ohne, dass sich die Daten in deinem Shop ändern.\nEine Besonderheit stellt dabei die Pflege der Varianten Eigenschaften dar. Facebook  bietet die Möglichkeit, im Feed für Varianten die Eigenschaften “Material”, “Muster”, “Größe” und “Farbe” anzugeben. In unserem Plugin ist dies so gelöst, dass du in der Plugin-Konfiguration jeweils eine Eigenschaftgruppe aus deinem Shop auswählen kannst. Die jeweilige Eigenschaft wird für die passenden Produkte dann ganz automatisch übergeben. <br /><h2>Wie kann ich das Plugin einrichten &amp; sind Code-Kenntnisse notwendig? </h2>Für die Integration des Plugins benötigst Du keine Code-Kenntnisse. Die Anleitung zum Einrichten findest Du im Tab „Installationsanleitung”.<br /><h2>Feedback &amp; Bewertung </h2>Du hast einen Verbesserungsvorschlag, einen Fehler gefunden oder es fehlt dir ein Feature? Schreib uns gerne eine Mail an: info@ovrengineering.de","installationManual":"<p>Eine ausführliche Beschreibung findest du in unserer <a href=\"https://docs.ovrengineering.de/facebook-katalog-template/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation.</a><br /></p><p><br /></p><p>Nach dem Installieren des Plugins kannst du eine neue Storefront vom Typ \"Produktvergleich\" anlegen. In dieser findest du nun das vom Plugin hinzugefügte Template \"Facebook Katalog (CSV)\". Wähle das Template aus, stimme dem Überschreiben der Werte zu und speichere den neuen Verkaufskanal. Den Link zum Feed kannst du nun im Facebook Commerce Manager einreichen.</p><p>In der Plugin Konfiguration kannst du Standard-Werte hinterlegen, die für alle Produkte gelten. In der Detailansicht eines Produkts kannst du diese Werte zusätzlich überschreiben, um individuelle Einstellungen für das Produkt vorzunehmen. <br /></p>","version":"1.1.0","changelog":[{"version":"1.1.0","text":"<p>Compatibility with Shopware 6.5<br /></p>","creationDate":{"date":"2023-04-02 22:09:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Improved naming of the plugin config fields<br /></p>","creationDate":{"date":"2021-12-06 20:10:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Improve product variant suffix functionality<br /></p>","creationDate":{"date":"2021-11-18 06:04:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release. Compatible with Shopware 6.4.6<br /></p>","creationDate":{"date":"2021-11-16 07:08:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Ovr9495644955819","redirectToStore":false,"lowestPriceValue":9.95}