{"id":14405,"name":"pqtPAQATO","code":"pqt5297682089401","lastChange":{"date":"2023-07-24 11:30:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBlWJ9x","examplePageUrl":"","moduleKey":"pqtPAQATO","creationDate":{"date":"2021-11-19 08:44:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-02-13 08:48:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-02-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-11-19 09:38:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1538,"prefix":"pqt","name":"PAQATO","website":"//paqato.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1538_paqatp-logo-shopware.jpg"},"infos":[{"id":25080,"name":"PAQATO","description":"<p>Die <b>PAQATO</b> After-Sales Experience Plattform ist der Wachstumstreiber, der Onlineshops heute für morgen erfolgreich macht. Mit PAQATO bieten Onlinehändler ihren KundInnen nach dem Kauf ein überragendes Einkaufserlebnis und sorgen für maximale Zufriedenheit. Personalisierte Versand-Benachrichtigungen und eine Tracking-Seite im eigenen Shop verwandeln KundInnen in treue Fans. Durch proaktive Multi-Channel-Kommunikation nutzen Onlineshops auf dem Versandweg Cross-Selling-Potentiale und sammeln starke Kundenbewertungen. Gleichzeitig behalten Onlinehändler mit smartem Versandcontrolling den vollen Überblick über ihre Versandprozesse und reduzieren mit transparenten Daten ihre Service-Kosten.&nbsp;Schon heute begeistern über 1.000 E-Commerce Unternehmen wie OTTO, Peek &amp; Cloppenburg, ROSE Bikes und KoRo ihre KundInnen mit herausragenden After-Sales-Erlebnissen.</p><br><h2>Entdecke die Funktionswelt von PAQATO für deinen Onlineshop</h2><p><br></p><p></p><h4>QONTROL</h4>Mit QONTROL hast du endlich den vollen Überblick über die Performance deiner Versanddienstleister. Ein zentrales Dashboard liefert dir detaillierte Analysen zu Laufzeiten, Zustellraten, Verzögerungen und Problemen für all deine Sendungen. Prüfe, vergleiche und optimiere datenbasiert deine Versandprozesse. QONTROL hilft dir, bei Problemen schnell und zielgerichtet zu handeln, um deine Kundenzufriedenheit zu sichern. Behalte mit der umfassenden Datenauswertung von QONTROL die Kontrolle über die letzte Meile und sei für Verhandlungen mit deinen Logistik-Partnern bestens aufgestellt.<p><br><h4>TRAQ</h4><p>TRAQ ist deine Möglichkeit, eine eigene Tracking-Seite in deinen Onlineshop zu integrieren. Mit TRAQ sind du und deine KundInnen nicht mehr länger auf die Sendungsverfolgungsseiten deiner Versanddienstleister angewiesen. Stattdessen leitest du KundInnen auf dem Versandweg direkt zurück in deinen Shop, wo sie alle Informationen zum Lieferstatus finden. Zusätzlich wird deine Track &amp; Trace Seite durch platzierte Produktempfehlungen und Sonderangebote im Handumdrehen zum Umsatz- und Wachstumstreiber deines Shops.</p><p><br></p><h4>SPEAQ</h4><p>SPEAQ ist deine Lösung für personalisierte und automatisierte Versand-Benachrichtigungen nach dem Kauf. Ob per E-Mail, SMS oder Push-Notification - mit SPEAQ erhalten deine KundInnen proaktiv detaillierte Informationen zu verschiedenen Versandereignissen, die ein reibungsloses Einkaufserlebnis gewährleisten und Rückfragen überflüßig machen. Verschicke Status-Updates im Design und Wording deiner Marke und nutze die zusätzlichen Kontaktpunkte zu deinen KundInnen für ergänzende Produktempfehlungen und Bewertungsanfragen. Schaffe mit SPEAQ starke Kundenzufriedenheit, steigere dein Cross-Selling und reduziere messbar den Aufwand deines Support-Teams.</p><p><br></p><h4>RETURN</h4><p></p><p>RETURN ist dein digitales Retourenportal, das eine vollautomatisierte und reibungslose Retourenabwicklung für dich und deine KundInnen gewährleistet. Schreibe deine eigenen Regeln und Bedingungen zu Retourenfristen, Retourengründen, Warenkorbwerten und länderspezifischen Merkmalen und hinterlege diese im Retourenportal. Deine KundInnen erstellen Rücksendungen direkt digital über dein Retourenportal. RETURN schafft ein unkompliziertes Retourenerlebnis für deine KundInnen und reduziert gleichzeitig den Service-Aufwand deines Teams. Detaillierte Auswertungen zu Retourengründen und zurückgesendeten Artikeln helfen dir, deine Retourenquote nachhaltig zu reduzieren.</p><h3><br></h3><h3>Vorteile für dich als Händler</h3><ul><li>Entscheide <b>du</b>, welche Informationen zum Sendungsstatus deine KundInnen erhalten (z.B. Versandbestätigung, in Zustellung, Verzögerungen,..) und auf welchen Kanälen sie Informationen erhalten sollen (SMS, Email, Push Notification und Co.).</li><li><b>Sichere dir Shop-Traffic</b>, in dem deine KundInnen während der Lieferzeit auf deine Track &amp; Trace Seite zurückkommen.</li><li><b>Generiere mehr Umsatz</b> durch ergänzende Produkte oder Aktionen auf der eigenen Track &amp; Trace Seite und in den Status-Nachrichten.</li><li><b>Je Bestellung</b> erhalten Shopware Händler mit PAQATO bis zu zehn Mal mehr relevante Touchpoints.</li><li><b>Erhöhe die Kundenzufriedenheit</b> und senke die Service-Anfragen deiner KundInnen. <br></li></ul><br><h3>Vorteile für deine KundInnen</h3><ul><li>Deine KundInnen sind immer gut informiert und wissen, dass sich um sie gekümmert wird.</li><li>Deine KundInnen erhalten alle notwendigen Informationen aus einer Hand und nicht von fremden Dienstleistern.</li><li>Deine KundInnen werden auf dem Versandweg von dir begleitet und über jeden neuen Schritt, der das Paket geht, informiert. <br></li></ul><br>Shopware bietet Systeme für den E-Commerce der Zukunft, bei denen die Customer Experience im Fokus steht und die sich dem Wachstum deines Onlineshops anpassen.<br>Um die Lösungen des All-in-One Tools von PAQATO nutzen und anwenden zu können, benötigen wir die Auftragskopfdaten deiner Bestellungen. Diese Daten können auf unterschiedlichen Wegen an uns übermittelt werden.<br><br><h3>Für Shopware Shops gibt es dafür eine App</h3>Mit der Installation der App ist die Nutzung von PAQATO spielend einfach möglich.<br><br>Die PAQATO App für Shopware Shops kann schnell und einfach mit wenigen Mausklicks und ohne IT Know-How installiert werden. Dann ist PAQATO mit den Tools verbunden, die du täglich im Einsatz hast. Alternativ können Shopware Shops auch über die PAQATO API angebunden werden. Durch diese Schnittstelle zu deinem Shopsystem werden die relevanten Daten automatisiert an uns übertragen. Oder du exportierst die CSV-Dateien der Tagesabschlussdaten aus deiner Versandsoftware bzw. weitere CSV- oder XML-Dateien. Abgelegt auf einem FTP-Server kann PAQATO diese dann automatisiert abfragen.<br><br>Du erhältst automatisch einen Vertrag zur Auftragsverarbeitung nach Art. 28 Abs. 3 DSGVO von PAQATO gestellt, so dass sämtliche datenschutzrechtliche Erfordernisse erfüllt sind.<br><br><h3>Haben wir dein Interesse geweckt?</h3><p>Dann buche dir jetzt deinen persönlichen und kostenfreien Beratungstermin und teste die PAQATO App.</p><br><h4>PAQATO Sales Team</h4>Tel. <a href=\"//tel\" target=\"_blank\" rel=\"noreferrer noopener\">tel:+4925114981970</a><br><p>E-Mail:<a href=\"//paqato.com\" target=\"_blank\" rel=\"noreferrer noopener\"> sales@paqato.com</a></p><p><a href=\"https://www.paqato.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.paqato.com</a></p><p></p></p>","installationManual":"<h2>Wie wird die App konfiguriert?</h2><h4>Die App kann kostenlos im Marketplace heruntergeladen werden. Der dazugehörige Account bei PAQATO kann über PAQATO/Preise erstellt oder über den PAQATO Support (service@paqato.com) angefragt werden.</h4><h2><br></h2><h2>1. Grundeinstellungen</h2><h4>Im ersten Schritt zur Einrichtung des Plugins ist die Festlegung des PAQATO API-Keys erforderlich. Der API-Key kann unter https://myadmin.paqato.com/api/key generiert werden oder im Kundenservices (service@paqato.com) angefordert werden.&nbsp;</h4><h2><br></h2><h2>2. Verkaufskanäle</h2><h4>Im zweiten Schritt der Konfiguration kannst du die Datenübertragung der Verkaufskanäle steuern. Du kannst für jeden Verkaufskanal einen \"Shop\" bei PAQATO ansteuern oder auch mehrere Kanäle in einen Shop leiten. Für die Datenzuordnung musst du in diesem Schritt das jeweilige Shoptoken hinterlegen, das auch in PAQATO unter https://myadmin.paqato.com/shop vergeben wurde. Wenn du einzelne Kanäle nicht aktivierst, werden zu diesem Kanal auch keine Daten an PAQATO übermittelt.</h4><h2><br></h2><h2>3. Versandartzuordnung</h2><h4>Im dritten Schritt ordnest du die in Shopware hinterlegten Versandarten den Paketdienstleistern zu. Dadurch wird das Tracking der Pakete durch PAQATO ermöglicht. Die in Shopware hinterlegten Versandarten sind vorausgefüllt, der Paketdienstleister kann über das Dropdown-Feld ausgewählt werden.</h4>","shortDescription":"PAQATO - Die After-Sales Experience Plattform für wachsende Onlineshops. Kommunikation, Track & Trace und Controlling auf dem Versandweg - personalisiert und automatisiert.","highlights":"Zentrales Dashboard mit allen Sendungsdaten\nUmfangreiche Kontrolle von Versanddienstleister-Performances\nVolle Transparenz und 360° Kommunikation auf dem Versandweg - im Look & Feel deines Shops\nWeniger Service Anfragen und Aufwände\nUmsatzsteigerung durch Cross-Selling Potentiale","features":"Einfach integriert - innerhalb weniger Minuten\n\nMit unserer \"quick &amp; easy\" – Integration bindest du die App spielend einfach in deinen Onlineshop ein.\nDirekt nach Installation und Aktivierung der App führen wir dich Schritt für Schritt durch alle relevanten Punkte im Setup. Für die Integration sind dadurch keinerlei Programmierkenntnisse erforderlich."},{"id":25081,"name":"PAQATO","description":"<p>The <b>PAQATO</b> After-Sales Experience Platform is the growth driver that makes online stores successful for tomorrow. With PAQATO, online retailers offer their customers an outstanding shopping experience after the checkout and ensure maximum satisfaction. Personalized shipping notifications and a tracking page in their own store turn customers into loyal fans. Through proactive multi-channel communication, online stores exploit cross-selling potential during the shipping process and collect strong customer reviews. At the same time, smart shipment controlling allows online retailers to maintain a full overview of their shipping processes and reduce their service costs with transparent data. Today, over 1,000 e-commerce companies such as OTTO, Peek &amp; Cloppenburg, ROSE Bikes and KoRo are already delighting their customers with outstanding after-sales experiences.</p><p><br></p><h2>Discover the functional world of PAQATO for your online shop</h2><p><br></p><h4>QONTROL:</h4><p>With QONTROL, you finally have a full overview of the performance of your shipping service providers. A central dashboard provides you with detailed analyses of transit times, delivery rates, delays and problems for all your shipments. Check, compare and optimize your shipping processes based on data. QONTROL helps you to act quickly and purposefully in case of problems in order to ensure customer satisfaction. Keep control over the last mile with QONTROL's comprehensive data analysis and be well positioned for negotiations with your logistics partners.<br></p><p><br></p><h4>TRAQ</h4><p>TRAQ is your opportunity to integrate your own tracking page into your online store. With TRAQ, you and your customers no longer have to rely on the tracking pages of your shipping providers. Instead, you redirect customers on the shipping route directly back to your store, where they can find all information about the delivery status. In addition, your track &amp; trace page will quickly become a sales and growth driver for your store through placed product recommendations and special offers.<br></p><p><br></p><h4>SPEAQ</h4><p>SPEAQ is your solution for personalized and automated post-purchase shipping notifications. Whether via email, SMS or push notification, SPEAQ proactively provides your customers with detailed information on various shipping events, ensuring a smooth shopping experience and eliminating the need for queries. Send status updates in your brand's design and wording and use the additional contact points with your customers for additional product recommendations and rating requests. Create strong customer satisfaction, increase your cross-selling and measurably reduce the effort of your support team with SPEAQ.<br></p><p><br></p><h4>RETURN</h4><p>RETURN is your digital returns portal that ensures fully automated and smooth returns processing for you and your customers. Write your own rules and conditions for return periods, return reasons, shopping cart values and country-specific characteristics and store them in the returns portal. Your customers create returns directly digitally via your returns portal. RETURN creates an uncomplicated returns experience for your customers and at the same time reduces the service effort of your team. Detailed evaluations of the reasons for returns and returned items help you to sustainably reduce your returns rate.<br></p><p><br></p><h2>Advantages for you as a retailer</h2><ul><li>Decide which information about the shipment status your customers receive (e.g. shipment confirmation, in delivery, delays, etc.) and on which channels they should receive information (SMS, email, push notification, etc.).</li><li>Secure store traffic by having your customers come back to your track &amp; trace page during the delivery time.</li><li>Generate more sales by adding products or promotions to your own Track &amp; Trace page and status messages.</li><li>With PAQATO, Shopware merchants receive up to ten times more relevant touchpoints per order.</li><li>Increase customer satisfaction and reduce service requests from your customers.</li></ul><p><br></p><h2>Advantages for you as a retailer</h2><ul><li>Your customers are always well informed and know that they are being taken care of. <br></li><li>Your customers receive all necessary information from one source and not from external service providers. <br></li><li>You accompany your customers along the package journey and inform them about every relevant status update.</li></ul><p><br></p><p>Shopware\n offers systems for the e-commerce of the future that focus on the \ncustomer experience and adapt to the growth of your online store.&nbsp; <br></p><p><br></p><p>In\n order to use and apply the PAQATO solutions, we need the order header \ndata of your orders. This data can be transmitted to us in different \nways. <br></p><p><br></p><h2>For Shopware Shops there is a plugin! <br></h2><p>Installing\n the plugin makes it easy to use PAQATO. You can install the plugin with\n a few mouse clicks and without needing any IT know-how, and then the \ntools you use daily will be connected to PAQATO. Alternatively, the data\n can also be sent to us via CSV export. Stored on an FTP server, PAQATO \ncan query and use your daily closing data. Shopware stores can also be \nconnected via the <b>PAQATO API</b>. Through this interface to your store system, the relevant data is automatically transferred to us.&nbsp; <br></p><p><br></p><p>Once\n connected to PAQATO, our standardized processes start running on their \nown, helping you become an e-commerce champion in the process. PAQATO \nwill automatically send you an order processing contract in accordance \nwith the General Data Protection Regulation (GDPR), so that all data \nprotection requirements are met. <br></p><p><br></p><p><br></p><h2>Have we caught your interest?&nbsp; <br></h2><p>Then book your personal and free consultation appointment now and test the PAQATO plugin. <br></p><p><br></p><p>PAQATO Sales Team</p><p>Phone: <a target=\"_blank\" rel=\"noreferrer\">+49 251 149 819 70</a></p><p>Email: <a href=\"https://mailto:sales@paqato.com\" target=\"_blank\" rel=\"noreferrer\">sales@paqato.com</a></p><p><a href=\"https://www.paqato.com\" target=\"_blank\" rel=\"noreferrer\">www.paqato.com</a></p>","installationManual":"<h2>How is the app configured?</h2><h4>The app can be downloaded free of charge from the Marketplace. The corresponding account with PAQATO can be created via PAQATO/Prices or requested via PAQATO Support (service@paqato.com).</h4><h2><br></h2><h2>1. basic settings</h2><h4>The first step in setting up the plug-in is to define the PAQATO API key. The API key can be generated at https://myadmin.paqato.com/api/key or requested from Customer Services (service@paqato.com).&nbsp;</h4><h2><br></h2><h2>2. sales channels</h2><h4>In the second step of the configuration you can control the data transfer of the sales channels. You can control a \"shop\" at PAQATO for each sales channel or direct several channels to one shop. For the data assignment, you must store the respective shop token in this step, which was also assigned in PAQATO at https://myadmin.paqato.com/shop. If you do not activate individual channels, no data will be transmitted to PAQATO for this channel.</h4><h2><br></h2><h2>3. shipping type assignment</h2><h4>In the third step, you assign the shipping types stored in Shopware to the parcel service providers. This enables PAQATO to track the parcels. The shipping types stored in Shopware are pre-filled, the parcel service provider can be selected via the drop-down field.</h4>","shortDescription":"PAQATO - The After-Sales Experience Platform for Growing Online Shops. Communication, track & trace and controlling on the shipping route - personalized and automated.","highlights":"Central dashboard with all shipment data\nExtensive control of shipping service provider performance\nFull transparency and 360° communication on the shipping route - in the look & feel of your store\nFewer service requests and expenses\nIncrease in sales through cross-selling potentials","features":"Simple integration - within a few minutes\n\nWith our \"quick & easy\" integration, you can easily integrate the app into your online shop.\nImmediately after installation and activation of the app, we guide you step by step through all relevant points in the setup. No programming knowledge is required for the integration."}],"addons":["SW6_integrated"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164536,"bookingKey":"pqt5297682089401","bookingText":"PAQATO","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeMxh56","preview":true,"priority":0,"id":75977},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxRTaR0","preview":false,"priority":0,"id":75947},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvU5NR6","preview":false,"priority":0,"id":75981},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpls5EqL","preview":false,"priority":0,"id":107956}],"comments":[{"authorName":"ALTHAUS","text":"Vor einigen Wochen haben wir das Shopware-Plugin installiert und sind seitdem durchweg beeindruckt. Die Installation verlief reibungslos und war schnell erledigt, was uns von Anfang an ein positives Bild vermittelte.\n\nFunktionalität, Statistik, alles ist vollkommen in Ordnung. Es ist deutlich erkennbar, dass die Entwickler eine Menge Zeit und Mühe in die Konzeption und Entwicklung dieses Plugins investiert haben, und ihre Arbeit zahlt sich aus.\n\nBesonders beeindruckend finden wir jedoch den Kundensupport. Das Supportteam stand jederzeit bereit, um unsere Fragen zu beantworten und uns bei eventuellen Problemen zu helfen. Der Support ist schnell, professionell und äußerst hilfsbereit.\n\nEine Investition, die sich definitiv lohnt.","headline":"Hervorragende Funktionalität, einfache Bedienung und erstklassiger Support!","creationDate":{"date":"2023-07-24 11:30:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"PAQATO","description":"<p>Die <b>PAQATO</b> After-Sales Experience Plattform ist der Wachstumstreiber, der Onlineshops heute für morgen erfolgreich macht. Mit PAQATO bieten Onlinehändler ihren KundInnen nach dem Kauf ein überragendes Einkaufserlebnis und sorgen für maximale Zufriedenheit. Personalisierte Versand-Benachrichtigungen und eine Tracking-Seite im eigenen Shop verwandeln KundInnen in treue Fans. Durch proaktive Multi-Channel-Kommunikation nutzen Onlineshops auf dem Versandweg Cross-Selling-Potentiale und sammeln starke Kundenbewertungen. Gleichzeitig behalten Onlinehändler mit smartem Versandcontrolling den vollen Überblick über ihre Versandprozesse und reduzieren mit transparenten Daten ihre Service-Kosten. Schon heute begeistern über 1.000 E-Commerce Unternehmen wie OTTO, Peek &amp; Cloppenburg, ROSE Bikes und KoRo ihre KundInnen mit herausragenden After-Sales-Erlebnissen.</p><br /><h2>Entdecke die Funktionswelt von PAQATO für deinen Onlineshop</h2><p><br /></p><p></p><h4>QONTROL</h4>Mit QONTROL hast du endlich den vollen Überblick über die Performance deiner Versanddienstleister. Ein zentrales Dashboard liefert dir detaillierte Analysen zu Laufzeiten, Zustellraten, Verzögerungen und Problemen für all deine Sendungen. Prüfe, vergleiche und optimiere datenbasiert deine Versandprozesse. QONTROL hilft dir, bei Problemen schnell und zielgerichtet zu handeln, um deine Kundenzufriedenheit zu sichern. Behalte mit der umfassenden Datenauswertung von QONTROL die Kontrolle über die letzte Meile und sei für Verhandlungen mit deinen Logistik-Partnern bestens aufgestellt.<p><br /></p><h4>TRAQ</h4><p>TRAQ ist deine Möglichkeit, eine eigene Tracking-Seite in deinen Onlineshop zu integrieren. Mit TRAQ sind du und deine KundInnen nicht mehr länger auf die Sendungsverfolgungsseiten deiner Versanddienstleister angewiesen. Stattdessen leitest du KundInnen auf dem Versandweg direkt zurück in deinen Shop, wo sie alle Informationen zum Lieferstatus finden. Zusätzlich wird deine Track &amp; Trace Seite durch platzierte Produktempfehlungen und Sonderangebote im Handumdrehen zum Umsatz- und Wachstumstreiber deines Shops.</p><p><br /></p><h4>SPEAQ</h4><p>SPEAQ ist deine Lösung für personalisierte und automatisierte Versand-Benachrichtigungen nach dem Kauf. Ob per E-Mail, SMS oder Push-Notification - mit SPEAQ erhalten deine KundInnen proaktiv detaillierte Informationen zu verschiedenen Versandereignissen, die ein reibungsloses Einkaufserlebnis gewährleisten und Rückfragen überflüßig machen. Verschicke Status-Updates im Design und Wording deiner Marke und nutze die zusätzlichen Kontaktpunkte zu deinen KundInnen für ergänzende Produktempfehlungen und Bewertungsanfragen. Schaffe mit SPEAQ starke Kundenzufriedenheit, steigere dein Cross-Selling und reduziere messbar den Aufwand deines Support-Teams.</p><p><br /></p><h4>RETURN</h4><p></p><p>RETURN ist dein digitales Retourenportal, das eine vollautomatisierte und reibungslose Retourenabwicklung für dich und deine KundInnen gewährleistet. Schreibe deine eigenen Regeln und Bedingungen zu Retourenfristen, Retourengründen, Warenkorbwerten und länderspezifischen Merkmalen und hinterlege diese im Retourenportal. Deine KundInnen erstellen Rücksendungen direkt digital über dein Retourenportal. RETURN schafft ein unkompliziertes Retourenerlebnis für deine KundInnen und reduziert gleichzeitig den Service-Aufwand deines Teams. Detaillierte Auswertungen zu Retourengründen und zurückgesendeten Artikeln helfen dir, deine Retourenquote nachhaltig zu reduzieren.</p><h3><br /></h3><h3>Vorteile für dich als Händler</h3><ul><li>Entscheide <b>du</b>, welche Informationen zum Sendungsstatus deine KundInnen erhalten (z.B. Versandbestätigung, in Zustellung, Verzögerungen,..) und auf welchen Kanälen sie Informationen erhalten sollen (SMS, Email, Push Notification und Co.).</li><li><b>Sichere dir Shop-Traffic</b>, in dem deine KundInnen während der Lieferzeit auf deine Track &amp; Trace Seite zurückkommen.</li><li><b>Generiere mehr Umsatz</b> durch ergänzende Produkte oder Aktionen auf der eigenen Track &amp; Trace Seite und in den Status-Nachrichten.</li><li><b>Je Bestellung</b> erhalten Shopware Händler mit PAQATO bis zu zehn Mal mehr relevante Touchpoints.</li><li><b>Erhöhe die Kundenzufriedenheit</b> und senke die Service-Anfragen deiner KundInnen. <br /></li></ul><br /><h3>Vorteile für deine KundInnen</h3><ul><li>Deine KundInnen sind immer gut informiert und wissen, dass sich um sie gekümmert wird.</li><li>Deine KundInnen erhalten alle notwendigen Informationen aus einer Hand und nicht von fremden Dienstleistern.</li><li>Deine KundInnen werden auf dem Versandweg von dir begleitet und über jeden neuen Schritt, der das Paket geht, informiert. <br /></li></ul><br />Shopware bietet Systeme für den E-Commerce der Zukunft, bei denen die Customer Experience im Fokus steht und die sich dem Wachstum deines Onlineshops anpassen.<br />Um die Lösungen des All-in-One Tools von PAQATO nutzen und anwenden zu können, benötigen wir die Auftragskopfdaten deiner Bestellungen. Diese Daten können auf unterschiedlichen Wegen an uns übermittelt werden.<br /><br /><h3>Für Shopware Shops gibt es dafür eine App</h3>Mit der Installation der App ist die Nutzung von PAQATO spielend einfach möglich.<br /><br />Die PAQATO App für Shopware Shops kann schnell und einfach mit wenigen Mausklicks und ohne IT Know-How installiert werden. Dann ist PAQATO mit den Tools verbunden, die du täglich im Einsatz hast. Alternativ können Shopware Shops auch über die PAQATO API angebunden werden. Durch diese Schnittstelle zu deinem Shopsystem werden die relevanten Daten automatisiert an uns übertragen. Oder du exportierst die CSV-Dateien der Tagesabschlussdaten aus deiner Versandsoftware bzw. weitere CSV- oder XML-Dateien. Abgelegt auf einem FTP-Server kann PAQATO diese dann automatisiert abfragen.<br /><br />Du erhältst automatisch einen Vertrag zur Auftragsverarbeitung nach Art. 28 Abs. 3 DSGVO von PAQATO gestellt, so dass sämtliche datenschutzrechtliche Erfordernisse erfüllt sind.<br /><br /><h3>Haben wir dein Interesse geweckt?</h3><p>Dann buche dir jetzt deinen persönlichen und kostenfreien Beratungstermin und teste die PAQATO App.</p><br /><h4>PAQATO Sales Team</h4>Tel. <a href=\"//tel\" target=\"_blank\" rel=\"noreferrer noopener\">tel:+4925114981970</a><br /><p>E-Mail:<a href=\"//paqato.com\" target=\"_blank\" rel=\"noreferrer noopener\"> sales@paqato.com</a></p><p><a href=\"https://www.paqato.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.paqato.com</a></p><p></p>","installationManual":"<h2>Wie wird die App konfiguriert?</h2><h4>Die App kann kostenlos im Marketplace heruntergeladen werden. Der dazugehörige Account bei PAQATO kann über PAQATO/Preise erstellt oder über den PAQATO Support (service@paqato.com) angefragt werden.</h4><h2><br /></h2><h2>1. Grundeinstellungen</h2><h4>Im ersten Schritt zur Einrichtung des Plugins ist die Festlegung des PAQATO API-Keys erforderlich. Der API-Key kann unter https://myadmin.paqato.com/api/key generiert werden oder im Kundenservices (service@paqato.com) angefordert werden. </h4><h2><br /></h2><h2>2. Verkaufskanäle</h2><h4>Im zweiten Schritt der Konfiguration kannst du die Datenübertragung der Verkaufskanäle steuern. Du kannst für jeden Verkaufskanal einen \"Shop\" bei PAQATO ansteuern oder auch mehrere Kanäle in einen Shop leiten. Für die Datenzuordnung musst du in diesem Schritt das jeweilige Shoptoken hinterlegen, das auch in PAQATO unter https://myadmin.paqato.com/shop vergeben wurde. Wenn du einzelne Kanäle nicht aktivierst, werden zu diesem Kanal auch keine Daten an PAQATO übermittelt.</h4><h2><br /></h2><h2>3. Versandartzuordnung</h2><h4>Im dritten Schritt ordnest du die in Shopware hinterlegten Versandarten den Paketdienstleistern zu. Dadurch wird das Tracking der Pakete durch PAQATO ermöglicht. Die in Shopware hinterlegten Versandarten sind vorausgefüllt, der Paketdienstleister kann über das Dropdown-Feld ausgewählt werden.</h4>","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<ul><li>Version Bump (accidental release)</li></ul>","creationDate":{"date":"2023-02-07 12:09:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release of the app</p>","creationDate":{"date":"2021-11-19 09:09:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=pqt5297682089401","redirectToStore":false,"lowestPriceValue":0}