{"id":14447,"name":"Cust1_Custobar","code":"Cust130288917889","lastChange":{"date":"2023-07-18 11:16:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJZ9Z3r","examplePageUrl":"","moduleKey":"Cust1_Custobar","creationDate":{"date":"2021-11-25 14:42:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-06-02 11:54:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-05-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-11-26 08:23:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3509,"prefix":"Cust1","name":"Custobar Oy","website":"//www.custobar.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3509_Custobar-Logo-VerticalWeb-128.jpg"},"infos":[{"id":25152,"name":"Custobar Customer Data Platform für Shopware 6","description":"<h2>„Bridge over troubled waters“ – das bedeuten Daten für uns</h2><p>Kundendaten können schwierig und komplex sein. Sie sind aber auch Ihr wertvollstes Kapital, und wenn Sie sie nicht nutzen, vergeuden Sie dieses Kapital.</p><p><br></p><p>Ihr Shopware 6-Webstore enthält Kundendaten, die Gold wert sind. Mit dieser kostenlosen Erweiterung können Sie den Custobar-Tracking-Code im Handumdrehen zu Ihrem Shopware 6-Store hinzufügen. Eine Kundendaten- und Marketing-Automatisierungs-Plattform wie Custobar weiß im Gegensatz zu vielen anderen Systemen genau, wer Ihr Kunde ist.</p><p><br></p><ul><li>Wir haben eine einfache Integration zwischen Shopware 6 und Custobar entwickelt, die Sie von Custobar aus aktivieren können. Diese Erweiterung rundet Ihre Integration ab!<br></li><li>Synchronisieren Sie Kunden, Produkte, Produktvarianten sowie Verkaufs- und Browserdaten von Shopware 6 mit Custobar in Echtzeit.</li><li>Erstellen Sie optimierte Segmente basierend auf beliebigen Kundendaten, zum Beispiel gekaufte Produkte, Geburtstag oder Datum der letzten Aktivität.</li><li>Erstellen Sie Marketing-Automatisierungen und verbessern Sie die Customer Experience, um Ihre Kundenbeziehung zu pflegen und den Umsatz zu steigern.</li><li>Erreichen Sie Kunden über mehrere Kanäle: ansprechende E-Mails, ein- oder zweiseitige SMS, mit Push-Nachrichten für Apps und Werbeplattformen wie Google Ads und Facebook Ads.</li><li>Lernen Sie den Kunden hinter den Daten mit der vollständigen 360-Grad Ansicht von Custobar kennen.</li><li>Machen Sie Kundendaten für Verkäufer und Callcenter mit unserem In-store Loyalty-CRM verfügbar.</li><li>Identifizieren Sie die besten Kunden, &nbsp;Neukunden und&nbsp; Risikokunden mit der RFM-Matrix.</li><li>Lösen Sie Transaktions-Nachrichten per E-Mail, SMS oder Push-Nachricht basierend auf beliebigen Kundenereignissen aus.</li><li>Nutzen Sie Gutschein-Codes, um Rabatt- oder Treuekampagnen zu erstellen.</li><li>Identifizieren Sie Ihre Kunden in Offline-Stores mit unserer mobilen Kundenkarte oder integrieren Sie Ihre eigene Identifikationsmethode in Custobar.</li><li>Flexibles Datenmodell für Custobar-Plus-Kunden. Stellen Sie das Modell so ein, dass es Ihren geschäftlichen Anforderungen entspricht, nicht umgekehrt.</li><li>Verfolgen Sie die Kundenzufriedenheit mit Kundenzufriedenheits-Umfragen per E-Mail oder SMS.</li><li>Geben Sie dem Kunden spezifische, automatische Produktempfehlungen für mehr Umsatz.</li><li>Alle Vertriebskanäle – Synchronisieren Sie Kunden-, Produkt- und Verkaufsdaten auch aus anderen Quellen wie einem anderen Shopware Store, ERP oder POS.</li></ul><p></p><p><br></p><h2>Preisgestaltung</h2><p>Diese Erweiterung, die den Custobar-Tracking-Code zu Ihrem Shopware 6-Store-Custobar hinzufügt, ist kostenlos.</p><p><br></p><p>Abonnement der Custobar-Kundendaten- und Marketing-Automatisierungsplattform ab 195 € pro Monat. Starten Sie jetzt eine kostenlose 30-tägige Testversion, Details siehe Preisangabe.</p><p><br></p><h2>Support</h2><p>Das Customer Success Team von Custobar ist dazu da, Ihnen bei der optimalen Nutzung von Custobar zu helfen. Custobar-Nutzerhandbücher und Dokumentationen sind online verfügbar.</p><p><br></p><p>Alle Kundenanfragen werden über support@custobar.com bearbeitet. Schicken Sie uns eine Nachricht und wir werden uns so schnell wie möglich bei Ihnen melden.</p>","installationManual":"<p>Sie müssen bereits ein Custobar-Konto haben, um diese Schritte durchzuführen und Ihren Shopware 6-Store mit Custobar zu verbinden. Sie können Custobar 30 Tage lang kostenlos testen:&nbsp;https://www.custobar.com/signup/</p><p><br></p><h2>Aktivieren Sie die Integration zwischen Shopware 6 und Custobar</h2><p><br></p><h3>Einstellungen in Ihrem Shopware 6-Store</h3><p><br></p><p>Zunächst müssen Sie ein paar Einstellungen in der Systemsteuerung Ihres Shopware 6-Stores vornehmen.</p><p><br></p><p>Bitte überprüfen Sie zunächst die System-Standardwährung Ihres Shopware 6-Stores. Sie können die System-Standardwährung in Shopware 6 überprüfen, indem Sie die folgenden Schritte ausführen:</p><p><br></p><p></p><ul><li>Gehen Sie zu Shopware 6, Settings -&gt; Shop -&gt; Currencies.<br></li><li>Suchen Sie in der Liste der Währungscodes die Währung, die einen „Factor“ von genau 1 hat.&nbsp;<br></li><li>Dies ist die System-Standardwährung Ihres Shopware 6-Stores.<br></li></ul><p></p><p><br></p><p><b>Die System-Standardwährung Ihres Shopware 6-Stores muss mit der Währung von Custobar übereinstimmen. </b>Finden Sie heraus, wie Sie die Währungseinheit in Custobar &nbsp;einstellen können:&nbsp;https://www.custobar.com/docs/guides/what-is-the-monetary-unit-in-custobar-and-how-to-change-it/</p><p></p><p><br></p><p>Wenn Sie die System-Standardwährung überprüft haben, gehen Sie in die Systemsteuerung Ihres Shopware-Stores und führen Sie folgende Schritte aus:</p><p><br></p><p>1.\tGehen Sie zu Settings -&gt; System -&gt; Integrations.</p><p>2.\tKlicken Sie auf „Add integration“.</p><p>3.\tGeben Sie als Namen der Integration „Custobar“ oder einen anderen aussagekräftigen Namen Ihrer Wahl ein.</p><p>4.\tAktivieren Sie die Einstellung „Administrator“.</p><p>5.\tNotieren Sie sich die „Access key ID“ und den „Secret access key“. Sie benötigen beide später in Custobar.</p><p>6.\tKlicken Sie auf „Save integration“.</p><p>7.\tNotieren Sie sich auch die Domain&nbsp;(ohne https://) Ihres Shopware 6-Stores.</p><p><br></p><p>&nbsp;Die Domäne könnte zum Beispiel lauten:</p><p></p><ul><li>accountname.shopware.store<br></li><li>accountname.shopware.store/shop/public</li><li>accountname.de<br></li><li>accountname.de/shop/public</li></ul><p></p><p><br></p><h3>Einstellungen in Custobar</h3><p><br></p><p>Nun können Sie mit der Integration in Custobar beginnen. Melden Sie sich in Ihrer Custobar-Umgebung an und führen Sie die folgenden Schritte aus:</p><p>1.\tGehen Sie zu Settings -&gt; Integrations.</p><p>2.\tSuchen Sie in der Liste „Available integrations“ nach „Shopware 6“. Klicken Sie auf „Add“.</p><p>3.\tGeben Sie in die drei Textfelder die Informationen ein, die Sie in Shopware 6 gesucht haben:</p><p></p><ul><li>Die Domain Ihres Stores.<br></li><li>Die Zugangsschlüssel-ID.<br></li><li>Den geheimen Zugangsschlüssel.<br></li></ul><p></p><p>4.\tKlicken Sie auf „Authenticate“. Sie gelangen dann auf die Detailseite der Integration.</p><p>5.\tAktivieren Sie alle Datenquellen, die Sie verwenden möchten, d. h. Kunden, Newsletter-Empfänger, Produkte und Verkäufe. Anfangs sind alle deaktiviert. Wenn Sie die Daten ausgewählt haben, die Sie in Custobar importieren möchten, klicken Sie auf „Save“.</p><p>6.\tJetzt sind Sie fertig. Die Daten sollten jetzt mit Ihrer Custobar-Umgebung synchronisiert werden.</p><p><br></p><h2>Installieren Sie das Custobar-Tracking-Skript</h2><p><br></p><h3>Einstellungen in Custobar</h3><p><br></p><p>Die Erweiterung Custobar für Shopware 6 installiert das Custobar-Tracking-Skript in Ihrem Shopware-Store. Sie erhalten dann Produkt-Browsing-Daten von identifizierten Kunden von Shopware in Custobar, und Sie können benutzerdefiniertes Tracking für Ereignisse wie das Hinzufügen von Produkten in einen Warenkorb einstellen.</p><p><br></p><p>Dazu benötigen Sie das Tracking-Skript-API-Token von Custobar.</p><p><br></p><p>1. Gehen Sie in Custobar zu Settings -&gt; Custobar.js tracking script.</p><p>2. Scrollen Sie zum Ende der Seite, um das Skript zu finden.</p><p>3. Innerhalb des Skripts finden Sie eine lange Zahlen- und Buchstabenfolge mit dem Namen „companyToken“. Der Token beginnt mit den Buchstaben „API…“.</p><p>4. Notieren Sie sich das „API…“-Token. Sie benötigen es später in Shopware.</p><p><br></p><h3>Einstellungen in Shopware</h3><p><br></p><p>1. Gehen Sie zu Shopware 6, Extensions -&gt; Store &gt; Suchen Sie nach „Custobar“, klicken Sie auf „Custobar for Shopware 6“ und klicken Sie auf „Add extension“.</p><p>2. Akzeptieren Sie die Nutzungsbedingungen und Berechtigungen und klicken Sie auf „Add extension for free“.</p><p>3. Gehen Sie zu „Meine Erweiterungen“, suchen Sie „Custobar für Shopware 6“ und klicken Sie auf „App installieren“.</p><p>4. Klicken Sie auf die drei Punkte und klicken Sie auf „Konfiguration“.</p><p>5. Wählen Sie die Vertriebskanäle aus, die Sie verfolgen möchten.</p><p>6. Aktivieren Sie „Enable tracking“.</p><p>7. Fügen Sie das API-Token, das Sie von Custobar kopiert haben, in das API-Token-Feld ein.</p><p>8. Klicken Sie auf „Save“.</p><p>9. Gehen Sie zu „Extensions“ -&gt; „My extensions“ und aktivieren Sie die Erweiterung „Custobar for Shopware 6“.</p><p><br></p><h3>Einstellungen in Custobar fortsetzen</h3><p><br></p><p>Wenn Sie das Tracking-Skript in Ihrem Shopware-Store installiert haben, müssen Sie es noch in Custobar einrichten.</p><p><br></p><p>1. Gehen Sie zu Settings -&gt; Custobar.js tracking script.</p><p>2. Fügen Sie die Adresse(n) der Shopware-Stores, die Sie verfolgen möchten, in das Feld „Allowed sources for traffic“ ein.</p><p>6. Klicken Sie unten auf der Seite auf „Save“.</p><p>7. Jetzt können Sie überprüfen, ob der Tracking-Code in Ihrem Shopware-Store funktioniert. Klicken Sie oben auf der Seite auf die Schaltfläche „Validate“.</p><p>8. Geben Sie die URL-Adresse Ihres Shopware-Stores ein und klicken Sie auf „Validate“. Folgen Sie den Anweisungen.</p><p><br></p><h2>Integration entfernen und Tracking deinstallieren</h2><p>Befolgen Sie diese Anweisungen nur, wenn Sie die Integration zwischen Custobar und Shopware 6 entfernen und den Tracking-Code von Custobar deinstallieren möchten.&nbsp;https://www.custobar.com/docs/guides/shopware-6-integration-entfernen-und-tracking-deinstallieren/</p><p><br></p><p>Bitte beachten Sie, dass durch das Entfernen der Integration und das Deinstallieren des Trackings keine Daten aus Custobar entfernt werden. Wenn Sie Custobar überhaupt nicht mehr verwenden oder alle Daten aus Custobar löschen wollen, wenden Sie sich bitte an support@custobar.com, und wir werden dies für Sie erledigen.</p>","shortDescription":"Nutzen Sie das Potenzial Ihrer Kundendaten mit Custobar, einer Customer Data Platform mit Marketing Automation. Synchronisieren Sie Kunden, Produkte und Browserdaten von Shopware 6.","highlights":"Schaffen Sie ein einzigartiges Kundenerlebnis und steigern Sie Ihren Umsatz mit Custobar, einer Marketing-Automatisierungs- und Kundendatenplattform (CDP). Sehen Sie, wie viel Geld Ihre Kampagnen sowohl über Offline- als auch über Online-Kanäle einbringen.\nSteigern Sie die Konversionsrate und nutzen Sie Kundendaten, um Zielgruppen und Inhalte für Newsletter, SMS, Google Ads, Facebook Ads und mehr zu erstellen.\nErstellen Sie personalisierte Kundenerlebnisse, die Ihre Marke in den Vordergrund stellen, Ihre Kunden begeistern und sie an Ihr Unternehmen binden.\nEntwickelt für den B2C-Omnichannel-Einzelhandel mit Fokus auf das Kundenerlebnis.\nIntegrierte DSGVO-Funktionen und DSGVO-konform. Bauen Sie Ihr Marketing auf Daten von Erstanbietern und nicht auf Cookies von Drittanbietern auf.","features":"Synchronisieren Sie einmal stündlich Kunden, Produkte (einschließlich Varianten) und Verkaufsdaten von Shopware 6 mit Custobar. Halten Sie alle Ihre Daten ständig auf dem neuesten Stand.\nZielgruppen – Erstellen Sie Zielgruppensegmente basierend auf Ihren Kundendaten, zum Beispiel Kaufdaten oder Kundeninteressen.\nAktualisieren Sie Marketing-Einwilligungen – automatische Synchronisation von abonnierten und abgemeldeten Newsletter-Empfängern von Shopware 6 mit Custobar.\nBestellstatus-Updates – Bestellungen werden ohne zeitliche Beschränkung von Shopware 6 auf Custobar aktualisiert. Erstellen Sie Transaktionsnachrichten, um Kunden über ihren Bestellstatus zu informieren und vieles mehr.\nRFM-Matrix (Aktualität/Häufigkeit/Geldwert) – Lassen Sie sich von Ihren historischen Kaufdaten aus Shopware 6 sagen, wer Ihre wertvollsten Kunden sind und wen Sie verlieren werden. Richten Sie Kampagnen oder Automatisierungen auf diese Kunden aus.\nMulti-Channel-Kampagnen und Automatisierungen – Erstellen Sie Kampagnen oder lösen Sie E-Mails, SMS, Google-Anzeigen, Facebook-Anzeigen basierend auf Kundenaktivität, Kaufhistorie, Ereignis oder Datum aus.\nFlow – Erstellen Sie Marketing-Automatisierungen und visuelle Kundenerlebnisse, um Ihre Kundenbeziehung zu pflegen, mehr über Ihre Kunden zu erfahren und die Qualität Ihrer Kundendaten zu verbessern.\nProdukte – Ziehen Sie Ihre aus Shopware 6 synchronisierten Produkte per Drag & Drop in E-Mails, um Angebote und neue Artikel zu bewerben.\nProduktempfehlungen – Steigern Sie Ihren Umsatz mit KI. Fügen Sie automatische Produktempfehlungen basierend auf der Kaufhistorie Ihrer Kunden in E-Mails ein.\nVerbinden Sie mehrere Shopware-Stores – Nutzen Sie diese Integration, um Kunden-, Produkt- und Verkaufsdaten aus mehreren Shopware-Stores an einem Ort zusammenzuführen."},{"id":25156,"name":"Custobar Customer Data Platform for Shopware 6","description":"<h2>Bridge over troubled waters - that’s what data is for us</h2><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\">Customer data can be difficult and complex. It’s also your most valuable asset, and if you’re not using it, you’re wasting your most valuable asset.</p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\">Your Shopware 6 webstore is full of customer data gold. With this free extension you can add the Custobar tracking code to your Shopware 6 store in no time. A customer data and marketing automation platform like Custobar knows exactly who your customer is, unlike many other systems.</p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><ul><li>We have created an easy integration between Shopware 6 and Custobar, that you can activate from within Custobar. This extension gives your integration the finishing touch!<br></li><li>Synchronize customers, products, product variants, sales and browsing data from Shopware 6 to Custobar.<br></li><li>Create better segments based on any point of customer data, for example, products purchased, birthday or last date of activity.<br></li><li>Build marketing automations and customer journeys to nurture your customer relationship and boost sales.<br></li><li>Reach customers in multiple channels: beautiful emails, one- or two-way SMS, with push messages to apps, and advertising platforms like Google Ads and Facebook Ads.<br></li><li>Know the customer behind the data with Custobar’s full 360-degree view.<br></li><li>Make customer data available for salespeople and call centers with our in-store loyalty CRM.<br></li><li>Identify best customers, newcomers and those at risk with the RFM matrix.<br></li><li>Trigger transactional messages by email, SMS or push message based on any customer events.<br></li><li>Use coupon codes to create discount or loyalty campaigns.<br></li><li>Identify your customers in offline stores with our mobile loyalty card or integrate your own way of identification with Custobar.<br></li><li>Flexible data schema for Custobar Plus clients. Set the schema to meet your business needs, not the other way.<br></li><li>Keep track of customer satisfaction with customer satisfaction survey by email or SMS.<br></li><li>Give customer specific, automatic product recommendations for increased sales.<br></li><li>All sales channels - Synchronize customer, product and sales data also from other sources like another Shopware store, ERP or POS.<br></li></ul><p></p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><h2>Pricing</h2><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\">This extension that adds the Custobar tracking code to your Shopware 6 store Custobar is free of charge.</p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\">Custobar customer data and marketing automation platform subscription starting from 195€ per month. Start a free 30-day trial now and see pricing for details.</p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><h2>Support</h2><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\">Custobar’s Customer Success team’s goal is to help you use Custobar to the fullest. Custobar user guides and documentation are available online.</p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><br></p><p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\">All customer requests are managed through support@custobar.com. Chuck us a message and we will get back to you as soon as possible.</p>","installationManual":"<p>You need to have a Custobar account in order to follow these steps and connect your Shopware 6 store to Custobar. You can try Custobar free for 30 days:&nbsp;https://www.custobar.com/signup/</p><p><br></p><h2>Activate the integration between Shopware 6 and Custobar</h2><h2><br></h2><h3>Settings within your Shopware 6 store</h3><p><br></p><p>First, you need to do a few things in the admin panel of your Shopware 6 store.</p><p>&nbsp;</p><p>To begin, please check&nbsp;the system standard currency of your Shopware 6 store. You can check the system standard currency in Shopware 6 by following these steps:</p><p>&nbsp;</p><p>1. Go to Shopware 6, Settings -&gt; Shop -&gt; Currencies.</p><p>2. In the list of currency codes, find the currency that has a “Factor” of exactly 1.&nbsp;</p><p>3. This is the system standard currency of your Shopware 6 store.</p><p>&nbsp;</p><p><b>The system standard currency of your Shopware 6 store needs to match the Custobar monetary unit.</b> Find out how to set the monetary unit in Custobar:&nbsp;https://www.custobar.com/docs/guides/what-is-the-monetary-unit-in-custobar-and-how-to-change-it/</p><p>&nbsp;</p><p>After you have checked the system standard currency, go to the admin panel of your Shopware store and do the following:</p><p>&nbsp;</p><p>1. Go to Settings -&gt; System -&gt; Integrations.</p><p>2. Click “Add integration”.</p><p>3. Enter “Custobar” as the name of the integration or with a descriptive name of your choice.</p><p>4. Toggle the “Administrator” setting on.</p><p>5. Note down the “Access key ID” and “Secret access key”. You will need them later in Custobar.</p><p>6. Click “Save integration”.7. Also, note down the shop address</p><p>7. Also, note down the shop address <b>without the https:// </b>(see examples below) of your Shopware 6 shop.</p><p>&nbsp;</p><p>For example, the domain could be:</p><p>accountname.shopware.store</p><p>accountname.shopware.store/shop/public<br></p><p>accountname.de</p><p>accountname.de/shop/public<br></p><p>&nbsp;</p><h2>Settings within Custobar</h2><p>&nbsp;</p><p>Now, you can activate the integration between your Shopware 6 store and Custobar. Log in to your Custobar environment and follow these steps:</p><p><br></p><p>1. Go to Settings -&gt; Integrations.</p><p>2. Find “Shopware 6” under the “Available integrations” list. Click “Add”.</p><p>3. In the three text boxes, enter the information you looked up in Shopware 6:</p><p></p><ul><li>The domain of your store.<br></li><li>The Access key ID.<br></li><li>The Secret access key.<br></li></ul><p></p><p>4. Click “Authenticate”. It will take you to the integration's detail page.</p><p>5. Toggle on all of the data sources you want to use, out of Customers, Newsletter recipients, Products, &nbsp;Sales. Initially, they all are disabled. After choosing the data that you want to import to Custobar, click “Save”.</p><p>&nbsp;Sales. Initially, they all are disabled. After choosing the data that you want to import to Custobar, click “Save”.</p><p>6. Now you are done. The data should start to get synced into your Custobar environment now.</p><p><br></p><h2>Install the Custobar tracking script</h2><p>&nbsp;</p><h3>Settings within Custobar</h3><p>&nbsp;</p><p>The Custobar for Shopware 6 extension installs the Custobar tracking script into your Shopware Store. You will start receiving product browsing data of identified customers from Shopware into Custobar, and you can add custom tracking for events like adding products into a basket.</p><p>&nbsp;</p><p>You will need the tracking script API token from Custobar.</p><p>&nbsp;</p><p>1. In Custobar, go to Settings -&gt; Custobar.js tracking script.</p><p>2. Scroll to the bottom of the page to find the script.</p><p>3. Within the script you will find a long number and letter sequence by the name of “companyToken”. The token starts with the letters “API…”.</p><p>4. Note down the “API…” token. You will need it later in Shopware.</p><p>&nbsp;</p><h3>Settings within Shopware</h3><p>&nbsp;</p><p>1. Go to Shopware 6, Extensions -&gt; Store &gt; Search for “Custobar”, click “Custobar for Shopware 6” and click “Add extension”.</p><p>2. Accept terms, conditions and permissions and click “Add extension for free”.</p><p>3. Go to My extensions, find “Custobar for Shopware 6” and click “Install app”.</p><p>4. Click on the three dots and click “Configuration”.</p><p>5. Select the sales channels you want to track.</p><p>6. Toggle on “Enable tracking”.</p><p>7. Paste the API token you copied from Custobar into the API token field.</p><p>8. Click “Save”.</p><p>9. Go to “Extensions” -&gt; “My extensions”, and toggle the “Custobar for Shopware 6” extension on.</p><p><br></p><h3>Continue settings within Custobar</h3><p>&nbsp;</p><p>Now that the tracking script has been installed in your Shopware store, you still need to set it up within Custobar.</p><p>&nbsp;</p><p>1. Go to Settings -&gt; Custobar.js tracking script.</p><p>2. Add the address(es) of the Shopware store(s) you want to track into the “Allowed sources for traffic” field. For example, https://example.com, or https://www.example.com.</p><p>3. Click “Save” at the bottom of the page.</p><p>4. Now you can validate that the tracking code in your Shopware store is working. Click on the “Validate” button at the top of the page.</p><p>5. Enter the URL address of your Shopware store and click “Validate”. Follow the instructions.</p><p><br></p><h2>Removing the integration and uninstall tracking</h2><p>Follow these instructions only if you would like to remove the integration between Custobar and Shopware 6.&nbsp;https://www.custobar.com/docs/guides/how-to-remove-the-shopware-6-integration-and-uninstall-tracking/</p><p><br></p><p>Please note that removing the integration and uninstalling tracking does not remove data from Custobar. If your intention is to stop using Custobar or deleting all data from Custobar, please be in touch with support@custobar.com.</p>","shortDescription":"Unlock the power of your customer data with Custobar, a Customer Data and Marketing Automation Platform. Synch customers, products, sales & browsing data from Shopware 6 to Custobar.","highlights":"Create a unique customer experience and increase your sales with Custobar marketing automation and customer data platform (CDP). See how much money your campaigns are bringing in both from offline and online channels.\nDrive conversions up and use customer data to create targeted audiences and content for newsletters, SMS, Google Ads, Facebook Ads and more.\nCreate personalised customer journeys that accentuate your brand, wow your customers and make them stick with you.\nDesigned for B2C omnichannel retail with the customer experience at heart.\nIn-built GDPR features and GDPR compliant. Base your marketing on 1st party data and not 3rd party cookies.","features":"Track your customers browsing activity such as what products they look at or add to the basket.\nSynchronize customers, products (including variants) and sales data from Shopware 6 to Custobar once an hour. Keep all of your data constantly updated.\nAudiences - Create audience segments based on any of your customer data like purchase data or customers’ interests.\nUpdate marketing permissions - automatic synchronization of subscribed and unsubscribed newsletter recipients from Shopware 6 to Custobar.\nOrder status updates - Orders are updated from Shopware 6 to Custobar without a time limit. Create transactional messages to update customers about their order status, and more.\nRecency, frequency, monetary (RFM) matrix - Let your historical purchase data from Shopware 6 tell you who are your most valuable customers, and who you’re about to lose. Target campaigns or automations to these customers.\nMulti-channel campaigns and automations - Create campaigns or trigger email, SMS, Google Ads, Facebook Ads based on customer’s activity, purchase history, event or date.\nFlow - Create marketing automations and visual customer journeys to nurture your customer relationship, learn more about your customers, and improve the quality of your customer data.\nProducts - Drag and drop your products synced from Shopware 6 into emails to promote deals and new items.\nProduct recommendations - Drive sales up with AI. Drop automatic product recommendations based on your customers’ purchase history into emails.\nConnect multiple Shopware stores - Use this integration to combine customer, product and sales data in one place from several Shopware stores."}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":164585,"bookingKey":"Cust130288917889","bookingText":"","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpn4gLhk","preview":true,"priority":0,"id":76250},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcwb1ir","preview":false,"priority":0,"id":76251},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgUNUWH","preview":false,"priority":0,"id":76252},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMg82FJ","preview":false,"priority":0,"id":76253}],"comments":[],"ratingAverage":0,"label":"Custobar Customer Data Platform für Shopware 6","description":"<h2>„Bridge over troubled waters“ – das bedeuten Daten für uns</h2><p>Kundendaten können schwierig und komplex sein. Sie sind aber auch Ihr wertvollstes Kapital, und wenn Sie sie nicht nutzen, vergeuden Sie dieses Kapital.</p><p><br /></p><p>Ihr Shopware 6-Webstore enthält Kundendaten, die Gold wert sind. Mit dieser kostenlosen Erweiterung können Sie den Custobar-Tracking-Code im Handumdrehen zu Ihrem Shopware 6-Store hinzufügen. Eine Kundendaten- und Marketing-Automatisierungs-Plattform wie Custobar weiß im Gegensatz zu vielen anderen Systemen genau, wer Ihr Kunde ist.</p><p><br /></p><ul><li>Wir haben eine einfache Integration zwischen Shopware 6 und Custobar entwickelt, die Sie von Custobar aus aktivieren können. Diese Erweiterung rundet Ihre Integration ab!<br /></li><li>Synchronisieren Sie Kunden, Produkte, Produktvarianten sowie Verkaufs- und Browserdaten von Shopware 6 mit Custobar in Echtzeit.</li><li>Erstellen Sie optimierte Segmente basierend auf beliebigen Kundendaten, zum Beispiel gekaufte Produkte, Geburtstag oder Datum der letzten Aktivität.</li><li>Erstellen Sie Marketing-Automatisierungen und verbessern Sie die Customer Experience, um Ihre Kundenbeziehung zu pflegen und den Umsatz zu steigern.</li><li>Erreichen Sie Kunden über mehrere Kanäle: ansprechende E-Mails, ein- oder zweiseitige SMS, mit Push-Nachrichten für Apps und Werbeplattformen wie Google Ads und Facebook Ads.</li><li>Lernen Sie den Kunden hinter den Daten mit der vollständigen 360-Grad Ansicht von Custobar kennen.</li><li>Machen Sie Kundendaten für Verkäufer und Callcenter mit unserem In-store Loyalty-CRM verfügbar.</li><li>Identifizieren Sie die besten Kunden,  Neukunden und  Risikokunden mit der RFM-Matrix.</li><li>Lösen Sie Transaktions-Nachrichten per E-Mail, SMS oder Push-Nachricht basierend auf beliebigen Kundenereignissen aus.</li><li>Nutzen Sie Gutschein-Codes, um Rabatt- oder Treuekampagnen zu erstellen.</li><li>Identifizieren Sie Ihre Kunden in Offline-Stores mit unserer mobilen Kundenkarte oder integrieren Sie Ihre eigene Identifikationsmethode in Custobar.</li><li>Flexibles Datenmodell für Custobar-Plus-Kunden. Stellen Sie das Modell so ein, dass es Ihren geschäftlichen Anforderungen entspricht, nicht umgekehrt.</li><li>Verfolgen Sie die Kundenzufriedenheit mit Kundenzufriedenheits-Umfragen per E-Mail oder SMS.</li><li>Geben Sie dem Kunden spezifische, automatische Produktempfehlungen für mehr Umsatz.</li><li>Alle Vertriebskanäle – Synchronisieren Sie Kunden-, Produkt- und Verkaufsdaten auch aus anderen Quellen wie einem anderen Shopware Store, ERP oder POS.</li></ul><p></p><p><br /></p><h2>Preisgestaltung</h2><p>Diese Erweiterung, die den Custobar-Tracking-Code zu Ihrem Shopware 6-Store-Custobar hinzufügt, ist kostenlos.</p><p><br /></p><p>Abonnement der Custobar-Kundendaten- und Marketing-Automatisierungsplattform ab 195 € pro Monat. Starten Sie jetzt eine kostenlose 30-tägige Testversion, Details siehe Preisangabe.</p><p><br /></p><h2>Support</h2><p>Das Customer Success Team von Custobar ist dazu da, Ihnen bei der optimalen Nutzung von Custobar zu helfen. Custobar-Nutzerhandbücher und Dokumentationen sind online verfügbar.</p><p><br /></p><p>Alle Kundenanfragen werden über support@custobar.com bearbeitet. Schicken Sie uns eine Nachricht und wir werden uns so schnell wie möglich bei Ihnen melden.</p>","installationManual":"<p>Sie müssen bereits ein Custobar-Konto haben, um diese Schritte durchzuführen und Ihren Shopware 6-Store mit Custobar zu verbinden. Sie können Custobar 30 Tage lang kostenlos testen: https://www.custobar.com/signup/</p><p><br /></p><h2>Aktivieren Sie die Integration zwischen Shopware 6 und Custobar</h2><p><br /></p><h3>Einstellungen in Ihrem Shopware 6-Store</h3><p><br /></p><p>Zunächst müssen Sie ein paar Einstellungen in der Systemsteuerung Ihres Shopware 6-Stores vornehmen.</p><p><br /></p><p>Bitte überprüfen Sie zunächst die System-Standardwährung Ihres Shopware 6-Stores. Sie können die System-Standardwährung in Shopware 6 überprüfen, indem Sie die folgenden Schritte ausführen:</p><p><br /></p><p></p><ul><li>Gehen Sie zu Shopware 6, Settings -&gt; Shop -&gt; Currencies.<br /></li><li>Suchen Sie in der Liste der Währungscodes die Währung, die einen „Factor“ von genau 1 hat. <br /></li><li>Dies ist die System-Standardwährung Ihres Shopware 6-Stores.<br /></li></ul><p></p><p><br /></p><p><b>Die System-Standardwährung Ihres Shopware 6-Stores muss mit der Währung von Custobar übereinstimmen. </b>Finden Sie heraus, wie Sie die Währungseinheit in Custobar  einstellen können: https://www.custobar.com/docs/guides/what-is-the-monetary-unit-in-custobar-and-how-to-change-it/</p><p></p><p><br /></p><p>Wenn Sie die System-Standardwährung überprüft haben, gehen Sie in die Systemsteuerung Ihres Shopware-Stores und führen Sie folgende Schritte aus:</p><p><br /></p><p>1.\tGehen Sie zu Settings -&gt; System -&gt; Integrations.</p><p>2.\tKlicken Sie auf „Add integration“.</p><p>3.\tGeben Sie als Namen der Integration „Custobar“ oder einen anderen aussagekräftigen Namen Ihrer Wahl ein.</p><p>4.\tAktivieren Sie die Einstellung „Administrator“.</p><p>5.\tNotieren Sie sich die „Access key ID“ und den „Secret access key“. Sie benötigen beide später in Custobar.</p><p>6.\tKlicken Sie auf „Save integration“.</p><p>7.\tNotieren Sie sich auch die Domain (ohne https://) Ihres Shopware 6-Stores.</p><p><br /></p><p> Die Domäne könnte zum Beispiel lauten:</p><p></p><ul><li>accountname.shopware.store<br /></li><li>accountname.shopware.store/shop/public</li><li>accountname.de<br /></li><li>accountname.de/shop/public</li></ul><p></p><p><br /></p><h3>Einstellungen in Custobar</h3><p><br /></p><p>Nun können Sie mit der Integration in Custobar beginnen. Melden Sie sich in Ihrer Custobar-Umgebung an und führen Sie die folgenden Schritte aus:</p><p>1.\tGehen Sie zu Settings -&gt; Integrations.</p><p>2.\tSuchen Sie in der Liste „Available integrations“ nach „Shopware 6“. Klicken Sie auf „Add“.</p><p>3.\tGeben Sie in die drei Textfelder die Informationen ein, die Sie in Shopware 6 gesucht haben:</p><p></p><ul><li>Die Domain Ihres Stores.<br /></li><li>Die Zugangsschlüssel-ID.<br /></li><li>Den geheimen Zugangsschlüssel.<br /></li></ul><p></p><p>4.\tKlicken Sie auf „Authenticate“. Sie gelangen dann auf die Detailseite der Integration.</p><p>5.\tAktivieren Sie alle Datenquellen, die Sie verwenden möchten, d. h. Kunden, Newsletter-Empfänger, Produkte und Verkäufe. Anfangs sind alle deaktiviert. Wenn Sie die Daten ausgewählt haben, die Sie in Custobar importieren möchten, klicken Sie auf „Save“.</p><p>6.\tJetzt sind Sie fertig. Die Daten sollten jetzt mit Ihrer Custobar-Umgebung synchronisiert werden.</p><p><br /></p><h2>Installieren Sie das Custobar-Tracking-Skript</h2><p><br /></p><h3>Einstellungen in Custobar</h3><p><br /></p><p>Die Erweiterung Custobar für Shopware 6 installiert das Custobar-Tracking-Skript in Ihrem Shopware-Store. Sie erhalten dann Produkt-Browsing-Daten von identifizierten Kunden von Shopware in Custobar, und Sie können benutzerdefiniertes Tracking für Ereignisse wie das Hinzufügen von Produkten in einen Warenkorb einstellen.</p><p><br /></p><p>Dazu benötigen Sie das Tracking-Skript-API-Token von Custobar.</p><p><br /></p><p>1. Gehen Sie in Custobar zu Settings -&gt; Custobar.js tracking script.</p><p>2. Scrollen Sie zum Ende der Seite, um das Skript zu finden.</p><p>3. Innerhalb des Skripts finden Sie eine lange Zahlen- und Buchstabenfolge mit dem Namen „companyToken“. Der Token beginnt mit den Buchstaben „API…“.</p><p>4. Notieren Sie sich das „API…“-Token. Sie benötigen es später in Shopware.</p><p><br /></p><h3>Einstellungen in Shopware</h3><p><br /></p><p>1. Gehen Sie zu Shopware 6, Extensions -&gt; Store &gt; Suchen Sie nach „Custobar“, klicken Sie auf „Custobar for Shopware 6“ und klicken Sie auf „Add extension“.</p><p>2. Akzeptieren Sie die Nutzungsbedingungen und Berechtigungen und klicken Sie auf „Add extension for free“.</p><p>3. Gehen Sie zu „Meine Erweiterungen“, suchen Sie „Custobar für Shopware 6“ und klicken Sie auf „App installieren“.</p><p>4. Klicken Sie auf die drei Punkte und klicken Sie auf „Konfiguration“.</p><p>5. Wählen Sie die Vertriebskanäle aus, die Sie verfolgen möchten.</p><p>6. Aktivieren Sie „Enable tracking“.</p><p>7. Fügen Sie das API-Token, das Sie von Custobar kopiert haben, in das API-Token-Feld ein.</p><p>8. Klicken Sie auf „Save“.</p><p>9. Gehen Sie zu „Extensions“ -&gt; „My extensions“ und aktivieren Sie die Erweiterung „Custobar for Shopware 6“.</p><p><br /></p><h3>Einstellungen in Custobar fortsetzen</h3><p><br /></p><p>Wenn Sie das Tracking-Skript in Ihrem Shopware-Store installiert haben, müssen Sie es noch in Custobar einrichten.</p><p><br /></p><p>1. Gehen Sie zu Settings -&gt; Custobar.js tracking script.</p><p>2. Fügen Sie die Adresse(n) der Shopware-Stores, die Sie verfolgen möchten, in das Feld „Allowed sources for traffic“ ein.</p><p>6. Klicken Sie unten auf der Seite auf „Save“.</p><p>7. Jetzt können Sie überprüfen, ob der Tracking-Code in Ihrem Shopware-Store funktioniert. Klicken Sie oben auf der Seite auf die Schaltfläche „Validate“.</p><p>8. Geben Sie die URL-Adresse Ihres Shopware-Stores ein und klicken Sie auf „Validate“. Folgen Sie den Anweisungen.</p><p><br /></p><h2>Integration entfernen und Tracking deinstallieren</h2><p>Befolgen Sie diese Anweisungen nur, wenn Sie die Integration zwischen Custobar und Shopware 6 entfernen und den Tracking-Code von Custobar deinstallieren möchten. https://www.custobar.com/docs/guides/shopware-6-integration-entfernen-und-tracking-deinstallieren/</p><p><br /></p><p>Bitte beachten Sie, dass durch das Entfernen der Integration und das Deinstallieren des Trackings keine Daten aus Custobar entfernt werden. Wenn Sie Custobar überhaupt nicht mehr verwenden oder alle Daten aus Custobar löschen wollen, wenden Sie sich bitte an support@custobar.com, und wir werden dies für Sie erledigen.</p>","version":"1.0.3","changelog":[{"version":"1.0.3","text":"<ul><li>Remove API prefix check</li><li>Use customer.customerNumber instead of customer.id</li><li>Use product.productNumber instead of product.id</li></ul>","creationDate":{"date":"2022-05-23 10:37:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><ul><li>Injects the Custobar.js tracking code to Shopware 6 online store.<br /></li><li>Admin has been translated into German.</li></ul>","creationDate":{"date":"2022-05-18 15:11:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.1.0","text":"<p>Initial version of the app</p>","creationDate":{"date":"2022-01-18 16:45:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Cust130288917889","redirectToStore":false,"lowestPriceValue":0}