{"id":14561,"name":"EmcgnStandardCmsPages","code":"emcgn65626566532","lastChange":{"date":"2023-07-18 11:16:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgCILuM","examplePageUrl":"","moduleKey":"EmcgnStandardCmsPages","creationDate":{"date":"2021-12-22 16:25:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-04-05 15:56:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-03-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-24 07:45:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":406,"prefix":"emcgn","name":"e-nitio mediasign GmbH & Co. KG","website":"//www.e-nitio.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpZyqleg"},"infos":[{"id":25348,"name":"Globales Kategorie- und Produktseiten-Layout","description":"<p>Seit Shopware 6.4 können auch die Layouts der&nbsp;<b>Produkt-Detailseiten über die Shopware Erlebniswelten</b>&nbsp;individuell gestaltet werden. Der Haken: Die angepasste Produkt-Erlebniswelt muss für jeden Artikel separat zugewiesen werden. Gleiches gilt für eine individuelle Kategorie-Erlebniswelt, die als Standard genutzt werden soll.</p><p><br></p><p>Unsere Erweiterung&nbsp;<b>Globales&nbsp;Kategorie- und Produktseiten-Layout</b>&nbsp;nimmt Ihnen diese zeitaufwendige Arbeit ab. Sie müssen die Erlebniswelten nur einmal in der Konfiguration der Erweiterung hinterlegen. Diese werden dann automatisch bei allen Kategorien und Produkten übernommen,&nbsp;bei denen kein Erlebniswelten-Layout hinterlegt worden ist. Das gewählte Layout wird auch für Kategorien übernommen, die eins der Shopware Standard-Layouts verwenden. Eine händische Zuweisung einer anderen Erlebniswelt ist weiterhin möglich. So bleibt die flexible Gestaltung von unterschiedlichen Kategorie- und Produktseiten bestehen.</p>","installationManual":"<ul><li>Installieren Sie die Erweiterung über den Erweiterungs-Manager.</li><li>Wenn noch nicht geschehen, erstellen Sie Ihre angepasste Produkt-Erlebniswelt und/oder Kategorie-Erlebniswelt.</li><li>Rufen Sie nach der Installation im Erweiterungs-Manager die Konfiguration auf (Klick auf die drei Punkte).</li><li>Wählen Sie Ihre angepasste Produkt-Erlebniswelt und/oder Kategorie-Erlebniswelt und speichern Sie die Konfiguration.<br><b>Achtung! </b>Bitte achten Sie darauf, dass die ausgewählte Erlebniswelt für die entsprechende Seitenart (Kategorie oder Produkt) geeignet ist.</li><li>Die Einstellungen sind für jeden Verkaufskanal individuell möglich.</li></ul><p></p><p><br></p><p><b>Bitte beachten Sie:</b></p><p>Die neue Funktion der individuellen Produkt-Erlebniswelt wird noch nicht von allen Erweiterungen unterstützt, die ebenfalls Änderungen auf der Produkt-Detailseite vornehmen. Sollten Sie einen Fehler im Frontend feststellen, deaktivieren Sie bitte unsere Erweiterung und hinterlegen die angepasste Produkt-Erlebniswelt bei einem Artikel händisch. Prüfen Sie bitte anschließend, ob der Fehler im Frontend weiterhin auftritt. Wenn das der Fall ist, wenden Sie sich bitte an die Entwickler der entsprechenden Erweiterungen, da wir Sie im Support hier leider nur bedingt unterstützen können.</p>","shortDescription":"Die Erweiterung ermöglicht es, eine individuell gestaltete Kategorie- oder Produkt-Erlebniswelt als Standard-Layout zu hinterlegen. Eine manuelle Zuweisung bleibt weiterhin möglich.","highlights":"Einfache Zuweisung einer individuell angepassten Kategorie-Erlebniswelt für alle Kategorien\nEinfache Zuweisung einer individuell angepassten Produkt-Erlebniswelt für alle Artikel\nGroße Zeitersparnis, da das manuelle Zuweisen pro Artikel bzw. pro Kategorie entfällt\nIndividuelle Anpassungen durch händische Zuweisung sind weiterhin möglich","features":"Einfache und schnelle Konfiguration \nIndividuelle Auswahl aus allen verfügbaren Erlebniswelten-Layouts\nZentrale Zuweisung der gewünschten Erlebniswelt"},{"id":25349,"name":"Global category and product page layout","description":"<p>Since Shopware 6.4, the layouts of the <b>product pages</b> can also be&nbsp;<b>customised via the&nbsp;Shopping Experiences</b>. The catch: The customized product page must be assigned separately for each product. The same applies to an individual category customised via the Shopping Experiences&nbsp;that is to be used as the default.</p><p><br></p><p>Our&nbsp;extension&nbsp;<b>Global Category and Product Page Layout</b>&nbsp;takes this time-consuming work off your hands.&nbsp;You only have to enter the experience worlds once in the configuration of the extension. These are then automatically adopted for all categories and products for which no experience world layout has been stored. The selected layout is also adopted for categories that use one of the Shopware standard layouts. Manual assignment of a different experience world is still possible. In this way, the flexible design of different category and product pages is maintained.</p>","installationManual":"<p><ul><li>Install the extension via the Extension Manager.</li><li>If not already done, create your customized product experience and/or category experience.</li><li>After the installation, call up the configuration in the Extension Manager (click on the three dots).</li><li>Select your customized product experience world and/or category experience world and save the configuration.<br><b>Attention! </b>Please make sure that the selected experience world is suitable for the corresponding page type (category or product).</li><li>The settings are possible for each sales channel individually.</li></ul></p><p><br></p><p><b>Please note:</b></p><p>The new feature of individual product experience is not yet supported by all extensions that also make changes to the product detail page. If you encounter an error in the frontend, please deactivate our extension and manually store the customized product experience for an article. Afterwards, please check if the error still occurs in the frontend. If this is the case, please contact the developers of the corresponding extensions, as we can unfortunately only provide you with limited support here.</p>","shortDescription":"The extension makes it possible to store an individually designed category or product experience as a standard layout. A manual assignment remains possible.","highlights":"Easy assignment of an individually adapted category page for all categories\nEasy assignment of an individually adapted product page for all articles\nGreat time savings, as manual assignment per article or per category is no longer necessary\nIndividual adjustments through manual assignment are still possible","features":"Simple and quick configuration \nIndividual selection from all available Shopping Experiences layouts\nCentral assignment of the desired Shopping Experiences layouts"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164713,"bookingKey":"emcgn65626566532","bookingText":"Global category and product page layout","price":49,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":164712,"bookingKey":"emcgn65626566532_M","bookingText":"Global category and product page layout","price":4.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":167883,"bookingKey":"emcgn65626566532_M12","bookingText":"Global category and product page layout","price":49,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsJeZlJ","preview":true,"priority":0,"id":86888},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRWFc1U","preview":false,"priority":0,"id":86890},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpv0LGaZ","preview":false,"priority":0,"id":86891}],"comments":[],"ratingAverage":0,"label":"Globales Kategorie- und Produktseiten-Layout","description":"<p>Seit Shopware 6.4 können auch die Layouts der <b>Produkt-Detailseiten über die Shopware Erlebniswelten</b> individuell gestaltet werden. Der Haken: Die angepasste Produkt-Erlebniswelt muss für jeden Artikel separat zugewiesen werden. Gleiches gilt für eine individuelle Kategorie-Erlebniswelt, die als Standard genutzt werden soll.</p><p><br /></p><p>Unsere Erweiterung <b>Globales Kategorie- und Produktseiten-Layout</b> nimmt Ihnen diese zeitaufwendige Arbeit ab. Sie müssen die Erlebniswelten nur einmal in der Konfiguration der Erweiterung hinterlegen. Diese werden dann automatisch bei allen Kategorien und Produkten übernommen, bei denen kein Erlebniswelten-Layout hinterlegt worden ist. Das gewählte Layout wird auch für Kategorien übernommen, die eins der Shopware Standard-Layouts verwenden. Eine händische Zuweisung einer anderen Erlebniswelt ist weiterhin möglich. So bleibt die flexible Gestaltung von unterschiedlichen Kategorie- und Produktseiten bestehen.</p>","installationManual":"<ul><li>Installieren Sie die Erweiterung über den Erweiterungs-Manager.</li><li>Wenn noch nicht geschehen, erstellen Sie Ihre angepasste Produkt-Erlebniswelt und/oder Kategorie-Erlebniswelt.</li><li>Rufen Sie nach der Installation im Erweiterungs-Manager die Konfiguration auf (Klick auf die drei Punkte).</li><li>Wählen Sie Ihre angepasste Produkt-Erlebniswelt und/oder Kategorie-Erlebniswelt und speichern Sie die Konfiguration.<br /><b>Achtung! </b>Bitte achten Sie darauf, dass die ausgewählte Erlebniswelt für die entsprechende Seitenart (Kategorie oder Produkt) geeignet ist.</li><li>Die Einstellungen sind für jeden Verkaufskanal individuell möglich.</li></ul><p></p><p><br /></p><p><b>Bitte beachten Sie:</b></p><p>Die neue Funktion der individuellen Produkt-Erlebniswelt wird noch nicht von allen Erweiterungen unterstützt, die ebenfalls Änderungen auf der Produkt-Detailseite vornehmen. Sollten Sie einen Fehler im Frontend feststellen, deaktivieren Sie bitte unsere Erweiterung und hinterlegen die angepasste Produkt-Erlebniswelt bei einem Artikel händisch. Prüfen Sie bitte anschließend, ob der Fehler im Frontend weiterhin auftritt. Wenn das der Fall ist, wenden Sie sich bitte an die Entwickler der entsprechenden Erweiterungen, da wir Sie im Support hier leider nur bedingt unterstützen können.</p>","version":"1.1.0","changelog":[{"version":"1.1.0","text":"<p></p><ul><li>Adaptation for Shopware 6.5.0</li><li>Plugin configuration improved by adding a pre-filtered selection of category and product pages</li></ul>","creationDate":{"date":"2023-03-15 10:56:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>First release of the extension</p>","creationDate":{"date":"2022-03-28 12:10:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=emcgn65626566532","redirectToStore":true,"lowestPriceValue":4.9}