{"id":14586,"name":"TmmsCmsElementPeriodRequestForm","code":"Tmms613947858939","lastChange":{"date":"2023-07-19 08:14:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIqRfN9","examplePageUrl":"","moduleKey":"TmmsCmsElementPeriodRequestForm","creationDate":{"date":"2022-01-03 14:24:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-01-11 14:43:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-01-04 12:49:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3293,"prefix":"Tmms","name":"Deutsche Telekom MMS GmbH","website":"//www.telekom-mms.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3293_telekom_logo.png"},"infos":[{"id":25392,"name":"Formular für Anfragen für die Erlebniswelten","description":"<h2>Support</h2><p>Treten Sie bei Fragen, wenn diese nicht bereits im Bereich \"<b>Häufig gestellte Fragen</b>\" beantwortet wurden, einfach über die E-Mail <b>shopware-apps-support@t-systems-mms.com</b> mit uns in Kontakt und wir helfen Ihnen gerne weiter. </p><h2>Beschreibung der App</h2><p>\n\nDie App \"Formular für Anfragen für die Erlebniswelten\" fügt ein <b>Anfrageformular zu den Erlebniswelten</b> hinzu, welches über den eigenen gleichnamigen <b>CMS-Block</b> oder das eigene gleichnamige <b>CMS-Element in einer Erlebniswelt platzieren werden kann</b>.</p><p>\n\nBeim Formular können folgende <b>Felder angezeigt und bei Bedarf als Pflichtfeld markiert werden</b>:\n\n</p><ul><li>Anrede</li><li>Vorname</li><li>Nachname</li><li>Straße</li><li>Postleitzahl</li><li>Ort</li><li>Land</li><li>E-Mail-Adresse</li><li>Telefonnummer</li><li>Kommentar</li><li>Datumsfeld</li><li>Datenschutzbestimmungen</li><li>bis zu 4 Felder für freie Eingaben&nbsp;(vom Typ Auswahl-, Eingabe- oder mehrzeiliges Eingabefeld).</li></ul><p>\n\nBeim <b>Datumsfeld kann</b> man zusätzlich ein <b>Start- und Enddatum festlegen</b> sowie <b>Daten eingeben, die nicht auswählbar sein sollen</b>. Des weiteren kann der <b>Kalender auch dauerhaft geöffnet angezeigt werden</b> oder man kann sich <b>2 Monate nebeneinander anzeigen lassen</b>. Das <b>Kommentarfeld</b>, das <b>Datumsfeld</b> und die <b>freien Eingaben können</b> bei Bedarf <b>auch oberhalb der Anrede angezeigt werden</b>.\n\n</p><p>\n\nÜber die Option \"<b>verfügbare, auswählbare Daten auch aus den Anfragen ermitteln</b>\" des Datumsfeldes ist es zudem möglich, das ein <b>bereits angefragter und durch den Shopbetreiber freigegebener Zeitraum beim Datumsfeld beziehungsweise beim Kalender</b>&nbsp;bei einem ausgewählten Produkt, Kategorie oder Landingpage, bei der das Formular über eine Erlebniswelt platziert wurde,&nbsp;auch <b>nicht mehr auswählbar und somit blockiert ist</b>, wodurch man eine Art \"Buchungskalender\" erhält, den man beispielsweise für Vermietungen einsetzen könnte. Dabei kann auch innerhalb der Erweiterungskonfiguration festgelegt werden, das eine Anfrage nicht extra freigegeben werden muss, damit ein Zeitraum sofort blockiert wird.\n\n</p><p>\nBei Bedarf kann auch die <b>Pflichtfeldinformation ausgeblendet</b> und auch der <b>Text der Absenden-Schaltfläche angepasst werden</b>.\n</p><p>\n\nÜber die Option \"<b>die Herkunft der Anfrage basierend auf dem Formular manuell festlegen</b>\" ist es zudem auch möglich, dass das gleiche Anfrageformular auf verschiedenen Seiten im Shop platziert werden kann und die ausgewählten und freigegebenen Zeiträume bei allen Seiten automatisch deaktiviert sind. Für diesen Fall legt man dazu beim Formular Werte bei \"<b>Herkunft</b>\", \"<b>Herkunftswert</b>\" und \"<b>individuelle ID der Herkunft</b>\" fest. Darüber hinaus ermöglicht es diese Funktion auch, auf der gleichen Seite, beispielsweise einer Übersichtsseite, mehrere verschiedene Anfrageformulare zu platzieren.&nbsp;\n\n</p><p>\n\n&nbsp;Beim <b>Formular können</b> unter anderem der <b>Titel</b>, ein <b>einleitender Text</b> und ein <b>Bestätigungstext festgelegt werden</b>. Das <b>Formular kann</b> entweder <b>per E-Mail an eine oder mehrere E-Mail-Adressen oder den Anfragenden versendet</b> und / oder dessen <b>eingegebene Daten in der Datenbank gespeichert werden</b>.&nbsp;&nbsp;\n\n</p><p>\n\nÜber den neuen Menüpunkt \"<b>Anfragen</b>\" unter \"<b>Kunden</b>\" kann man die <b>eingegangenen Anfragen verwalten</b> und auf diese Weise <b>eine Zeitraumsanfrage eines Kunden freigeben</b>, <b>sodass das angefragte Datum dann auch nicht mehr im Datumsfeld auf der jeweiligen Seite</b>, also bei der Kategorie, der Landingpage oder dem Produkt, wo das Formular über eine Erlebniswelt platziert wurde, <b>auswählbar ist</b>. Man kann aber auch innerhalb der Erweiterungskonfiguration festlegen, dass der Freigabestatus der Anfragen ignoriert werden soll, sodass die angefragten Daten bereits automatisch deaktiviert sind.\n\n</p><p>\n\nEs können auch manuell über das Administrationsmodul Anfragen hinzugefügt werden.\n\n</p><p>\n\nDurch das <b>beliebige Ausblenden der Felder</b> kann man das Formular aber auch nur für allgemeine Anfragen nutzen, also beispielsweise ohne Datumsauswahl, sodass es als <b>normales Kontaktformular genutzt werden kann</b>.\n\n</p><p><br><b>Die verfügbaren Textbausteine zum Individualisieren sind:</b></p><ul><li><b>tmms.periodRequestForm.salutation.label:</b> der Standardwert der Beschriftung der Anrede</li><li><b>tmms.periodRequestForm.salutation.placeholder:</b> der Standardwert des Platzhalters der Anrede</li><li><b>tmms.periodRequestForm.firstname.label:</b> der Standardwert der Beschriftung des Vornamens</li><li><b>tmms.periodRequestForm.firstname.placeholder:</b> der Standardwert des Platzhalters des Vornamens</li><li><b>tmms.periodRequestForm.lastname.label:</b> der Standardwert der Beschriftung des Nachnamens</li><li><b>tmms.periodRequestForm.lastname.placeholder:</b> der Standardwert des Platzhalters des Nachnamens</li><li><b>tmms.periodRequestForm.street.label:</b> der Standardwert der Beschriftung der Straße und Hausnummer</li><li><b>tmms.periodRequestForm.street.placeholder:</b> der Standardwert des Platzhalters der Straße und Hausnummer</li><li><b>tmms.periodRequestForm.zipcode.label:</b> der Standardwert der Beschriftung der Postleitzahl</li><li><b>tmms.periodRequestForm.zipcode.placeholder:</b> der Standardwert des Platzhalters der Postleitzahl</li><li><b>tmms.periodRequestForm.city.label:</b> der Standardwert der Beschriftung des Orts</li><li><b>tmms.periodRequestForm.city.placeholder:</b> der Standardwert des Platzhalters des Orts</li><li><b>tmms.periodRequestForm.country.label:</b> der Standardwert der Beschriftung des Landes</li><li><b>tmms.periodRequestForm.country.placeholder:</b> der Standardwert des Platzhalters der Landes</li><li><b>tmms.periodRequestForm.email.label:</b> der Standardwert der Beschriftung der E-Mail-Adresse</li><li><b>tmms.periodRequestForm.email.placeholder:</b> der Standardwert des Platzhalters der E-Mail-Adresse</li><li><b>tmms.periodRequestForm.phone.label:</b> der Standardwert der Beschriftung der Telefonnummer</li><li><b>tmms.periodRequestForm.phone.placeholder:</b> der Standardwert des Platzhalters der Telefonnummer</li><li><b>tmms.periodRequestForm.comment.label:</b> der Standardwert der Beschriftung des Kommentars</li><li><b>tmms.periodRequestForm.comment.placeholder:</b> der Standardwert des Platzhalters des Kommentars</li><li><b>tmms.periodRequestForm.date.dateLabel:</b> der Standardwert der Beschriftung des Zeitraums</li><li><b>tmms.periodRequestForm.date.datePlaceholder:</b> der Standardwert des Platzhalters des Zeitraums</li><li><b>tmms.periodRequestForm.date.dateRequiredErrorMessageLabel:</b> der Standardwert der Fehlermeldung, falls das Datumsfeld ein Pflichtfeld ist</li><li><b>tmms.periodRequestForm.date.dateFormat:</b> der Standardwert des Datumsformats des Kalenders</li><li><b>tmms.periodRequestForm.date.showWeeksNumbers:</b> der Standardwert der Anzeige der Kalenderwochen im Kalender</li><li><b>tmms.periodRequestForm.freeinput.label:</b> der Standardwert der Beschriftung der freien Eingabe</li><li><b>tmms.periodRequestForm.freeinput.placeholder:</b> der Standardwert des Platzhalters der freien Engabe</li><li><b>tmms.periodRequestForm.origin.productLabel:</b> der Standardwert der Herkunft des Produkts</li><li><b>tmms.periodRequestForm.origin.navigationLabel:</b> der Standardwert der Herkunft der Kategorie</li><li><b>tmms.periodRequestForm.origin.landingpageLabel:</b> der Standardwert der Herkunft der Landingpage</li><li><b>tmms.periodRequestForm.submitLabel:</b> der Standardwert der Absenden-Schaltfläche</li><li><b>tmms.periodRequestForm.inputMaxLength:</b> der Standardwert des maxlength-Attributs für einzeilige Eingabefelder</li><li><b>tmms.periodRequestForm.textareaMaxLength:</b> der Standardwert des maxlength-Attributs für mehrzeilige Eingabefelder</li><li><b>tmms.periodRequestForm.textareaNumberRows:</b> der Standardwert der Anzahl der Zeilen für mehrzeilige Eingabefelder</li></ul><p><br><b>Die verfügbaren Variablen zum Individualisieren des E-Mail-Templates \"Anfrageformular\" sind:</b><ul><li><b>periodRequestFormData.origin:</b> der Inhalt des Feldes für die Herkunft</li><li><b>periodRequestFormData.originName:</b> der Inhalt des Feldes für den Herkunftswert</li><li><b>periodRequestFormData.salutation:</b> der Inhalt des Feldes für die Anrede</li><li><b>periodRequestFormData.firstname:</b> der Inhalt des Feldes für den Vornamen</li><li><b>periodRequestFormData.lastname:</b> der Inhalt des Feldes für den Nachnamen</li><li><b>periodRequestFormData.street:</b> der Inhalt des Feldes für die Straße und Hausnummer</li><li><b>periodRequestFormData.zipcode:</b> der Inhalt des Feldes für die Postleitzahl</li><li><b>periodRequestFormData.city:</b> der Inhalt des Feldes für den Ort</li><li><b>periodRequestFormData.country:</b> der Inhalt des Feldes für das Land</li><li><b>periodRequestFormData.email:</b> der Inhalt des Feldes für die E-Mail-Adresse</li><li><b>periodRequestFormData.phone:</b> der Inhalt des Feldes für die Telefonnummer</li><li><b>periodRequestFormData.comment:</b> der Inhalt des Feldes für den Kommentar</li><li><b>periodRequestFormData.date:</b> der Inhalt des Feldes für den Zeitraum</li><li><b>periodRequestFormData.freeInputLabel:</b> der Inhalt des Feldes für die Beschriftung der ersten freien Eingabe</li><li><b>periodRequestFormData.freeInput:</b> der Inhalt des Feldes für die erste freie Eingabe</li><li><b>periodRequestFormData.freeInput2Label:</b> der Inhalt des Feldes für die Beschriftung der zweiten freien Eingabe</li><li><b>periodRequestFormData.freeInput2:</b> der Inhalt des Feldes für die zweite freie Eingabe</li><li><b>periodRequestFormData.freeInput3Label:</b> der Inhalt des Feldes für die Beschriftung der dritten freien Eingabe</li><li><b>periodRequestFormData.freeInput3:</b> der Inhalt des Feldes für die dritte freie Eingabe</li><li><b>periodRequestFormData.freeInput4Label:</b> der Inhalt des Feldes für die Beschriftung der vierten freien Eingabe</li><li><b>periodRequestFormData.freeInput4:</b> der Inhalt des Feldes für die vierte freie Eingabe</li></ul></p>\n","installationManual":"<ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Melden Sie sich in Ihren Shopware 6 Administrationsbereich an und navigieren Sie zu dem Menüpunkt Erweiterungen -> Meine Erweiterungen</li><li>Klicken Sie rechts oben auf \"Erweiterung hochladen\" und wählen Sie die heruntergeladene Erweiterung aus</li><li>Verwenden Sie das Menü rechts neben der Erweiterung um die Erweiterung zu installieren und zu konfigurieren und den Schalter links, um sie zu aktivieren</li></ol>","shortDescription":"Die App fügt ein Anfrageformular zu den Erlebniswelten hinzu, das per E-Mail an eine E-Mail-Adresse versendet und / oder dessen Daten in der Datenbank gespeichert werden können.","highlights":"ein eigenes Anfrageformular für die Erlebniswelten, bei dem folgende Felder auch als Pflichtfeld möglich sind: Anrede, Vorname, Nachname, Straße, Postleitzahl, Ort, Land, E-Mail-Adresse, Telefonnummer, Kommentar, Datumsfeld und bis zu 4 Felder für freie Eingaben\ndas Formular kann entweder per E-Mail an eine E-Mail-Adresse versendet und / oder dessen Daten in der Datenbank gespeichert werden, wo dann die Anfragen über das eigene Administrationsmodul verwaltet werden können\nbeim Datumsfeld kann zusätzlich ein Start- und Enddatum festgelegt sowie Daten eingegeben werden, die nicht auswählbar sein sollen\nein angefragtes Datum ist bei Bedarf dann auch nicht mehr beim Datumsfeld auf der jeweiligen Seite, also bei der Kategorie, der Landingpage oder dem Produkt, wo das Formular über eine Erlebniswelt platziert wurde, auswählbar\ndurch das beliebige Ausblenden der Felder kann das Formular auch nur für allgemeine Anfragen genutzt werden, sodass es auch nur als normales Kontaktformular genutzt werden kann","features":""},{"id":25393,"name":"Form for requests for the shopping experiences","description":"<h2>Support</h2><p>If you have any questions and if they have not already been answered in the area \"<b>Frequently Asked Questions</b>\", simply contact us via the email <b>shopware-apps-support@t-systems-mms.com</b> and we will be happy to help you.</p><h2>Description of the app</h2><p>\n\nThe app \"Form for requests for the shopping experiences\" adds a <b>request form to the CMS</b>, which can be <b>placed in a Shopping Experience</b> using the own <b>CMS block</b> of the same name or the own <b>CMS element</b> of the same name.\n\n</p>\n\nThe following <b>fields can be displayed in the form and, if necessary, marked as required fields</b>:\n\n<p></p><ul><li>salutation</li><li>first name</li><li>last name</li><li>street address</li><li>postal code</li><li>city</li><li>country</li><li>email</li><li>phone number</li><li>comment</li><li>date field</li><li>data protection information</li><li>up to 4 fields for free inputs&nbsp;(of the type select, input or textarea field).</li></ul><p>\n\nAt the <b>date field</b>, you can also <b>specify a start and end date</b> and <b>enter dates that should not be selectable</b>. Furthermore, the <b>calendar can also be displayed permanently open</b> or <b>you can display 2 months side by side</b>. The <b>comment</b>, the <b>date field</b> and the <b>free inputs can</b> also be <b>displayed above the salutation</b> if necessary.\n\n</p><p> Using the option \"<b>determine available, selectable data also from the requests</b>\" of the date field, it is possible that a <b>period that has already been requested and confirmed by the shop owner can no longer be selected at the date field or calendar at the selected product, category or landing page, where the form was placed via a shopping experience, and is therefore blocked</b>. So you have a kind of \"booking calendar\" that you could use for rentals, for example. It can also be specified within the extension configuration that a request does not have to be confirmed separately so that a period is blocked immediately. </p><p>\nIf required, the <b>required fields information can also be hidden</b> and the <b>text of the submit button can also be customized</b>.\n</p><p>\n\n\nWith the option \"<b>manually set the origin of the request based on the form</b>\" it is also possible that the same request form can be placed on different pages in the shop and the selected and confirmed periods are automatically deactivated on all pages. In this case, you specify values for \"<b>origin</b>\", \"<b>origin value</b>\" and \"<b>individual origin id</b>\" in the form. In addition, this function also makes it possible to place several different request forms on the same page, for example on an overview page.\n\n</p><p>\n\nAmong other things, the <b>title</b>, an <b>introductory text</b> and a <b>confirmation text can</b> be <b>specified for the form</b>. Furthermore the <b>form can</b> either be <b>sent by email to one or more email addresses or the requester</b> and / or the <b>data entered can be saved in the database</b>.&nbsp;\n\n</p><p>\n\nVia the new menu item \"<b>requests</b>\" under \"<b>customer</b>\" you can <b>manage the incoming requests</b> and <b>confirm a period request from a customer so that the requested date can not be longer selected in the date field on the respective page</b>, i.e. in the category, on the landing page or at the product where the form was placed via a shopping experience. You can also specify within the extension configuration that the confirmed status of the requests should be ignored so that the requested data is already automatically deactivated.\n\n</p><p>\n\nRequests can also be added manually via the administration module.\n\n</p><p>\n\nBy <b>hiding selected fields</b>, the form can also only be used for general requests, for example without a date selection, so that it <b>can be used as a normal contact form</b>.\n\n</p><p><br><b>The available snippets for customizing are:</b></p><ul><li><b>tmms.periodRequestForm.salutation.label:</b> the default value of the label of the salutation</li><li><b>tmms.periodRequestForm.salutation.placeholder:</b> the default value of the placeholder of the salutation</li><li><b>tmms.periodRequestForm.firstname.label:</b> the default value of the label of the first name</li><li><b>tmms.periodRequestForm.firstname.placeholder:</b> the default value of the placeholder of the first name</li><li><b>tmms.periodRequestForm.lastname.label:</b> the default value of the label of the last name</li><li><b>tmms.periodRequestForm.lastname.placeholder:</b> the default value of the placeholder of the last name</li><li><b>tmms.periodRequestForm.street.label:</b> the default value of the label of the street address</li><li><b>tmms.periodRequestForm.street.placeholder:</b> the default value of the placeholder of the street address</li><li><b>tmms.periodRequestForm.zipcode.label:</b> the default value of the label of the postal code</li><li><b>tmms.periodRequestForm.zipcode.placeholder:</b> the default value of the placeholder of the postal code</li><li><b>tmms.periodRequestForm.city.label:</b> the default value of the label of the city</li><li><b>tmms.periodRequestForm.city.placeholder:</b> the default value of the placeholder of the city</li><li><b>tmms.periodRequestForm.country.label:</b> the default value of the label of the country</li><li><b>tmms.periodRequestForm.country.placeholder:</b> the default value of the placeholder of the country</li><li><b>tmms.periodRequestForm.email.label:</b> the default value of the label of the email address</li><li><b>tmms.periodRequestForm.email.placeholder:</b> the default value of the placeholder of the email address</li><li><b>tmms.periodRequestForm.phone.label:</b> the default value of the label of the phone number</li><li><b>tmms.periodRequestForm.phone.placeholder:</b> the default value of the placeholder of the phone number</li><li><b>tmms.periodRequestForm.comment.label:</b> the default value of the label of the comment</li><li><b>tmms.periodRequestForm.comment.placeholder:</b> the default value of the placeholder of the comment</li><li><b>tmms.periodRequestForm.date.dateLabel:</b> the default value of the label of the period</li><li><b>tmms.periodRequestForm.date.datePlaceholder:</b> the default value of the placeholder of the period</li><li><b>tmms.periodRequestForm.date.dateRequiredErrorMessageLabel:</b> the default value of the error message if the date field is required</li><li><b>tmms.periodRequestForm.date.dateFormat:</b> the default value of the date format of the calendar</li><li><b>tmms.periodRequestForm.date.showWeeksNumbers:</b> the default value for displaying the calendar weeks in the calendar</li><li><b>tmms.periodRequestForm.freeinput.label:</b> the default value of the label of the free input</li><li><b>tmms.periodRequestForm.freeinput.placeholder:</b> the default value of the placeholder of the free input</li><li><b>tmms.periodRequestForm.origin.productLabel:</b> the default value of the origin of the product</li><li><b>tmms.periodRequestForm.origin.navigationLabel:</b> the default value of the origin of the category</li><li><b>tmms.periodRequestForm.origin.landingpageLabel:</b> the default value of the origin of the landing page</li><li><b>tmms.periodRequestForm.submitLabel:</b> the default value of the send button</li><li><b>tmms.periodRequestForm.inputMaxLength:</b> the default value of the maxlength attribute for single-line input fields</li><li><b>tmms.periodRequestForm.textareaMaxLength:</b> the default value of the maxlength attribute for multi-line input fields</li><li><b>tmms.periodRequestForm.textareaNumberRows:</b> the default value of the number of rows for multi-line input fields</li></ul><p><br><b>The available variables to customize the email template \"request form\" are:</b><ul><li><b>periodRequestFormData.origin:</b> the content of the field origin</li><li><b>periodRequestFormData.originName:</b> the content of the field origin name</li><li><b>periodRequestFormData.salutation:</b> the content of the field salutation</li><li><b>periodRequestFormData.firstname:</b> the content of the field first name</li><li><b>periodRequestFormData.lastname:</b> the content of the field last name</li><li><b>periodRequestFormData.street:</b> the content of the field street and house number</li><li><b>periodRequestFormData.zipcode:</b> the content of the field postal code</li><li><b>periodRequestFormData.city:</b> the content of the field city</li><li><b>periodRequestFormData.country:</b> the content of the field country</li><li><b>periodRequestFormData.email:</b> the content of the field email</li><li><b>periodRequestFormData.phone:</b> the content of the field phone</li><li><b>periodRequestFormData.comment:</b> the content of the field comment</li><li><b>periodRequestFormData.date:</b> the content of the field period</li><li><b>periodRequestFormData.freeInputLabel:</b> the content of the field for the label of the first free input</li><li><b>periodRequestFormData.freeInput:</b> the content of the field first free input</li><li><b>periodRequestFormData.freeInput2Label:</b> the content of the field for the label of the second free input</li><li><b>periodRequestFormData.freeInput2:</b> the content of the field second free input</li><li><b>periodRequestFormData.freeInput3Label:</b> the content of the field for the label of the third free input</li><li><b>periodRequestFormData.freeInput3:</b> the content of the field third free input</li><li><b>periodRequestFormData.freeInput4Label:</b> the content of the field for the label of the fourth free input</li><li><b>periodRequestFormData.freeInput4:</b> the content of the field fourth free input</li></ul></p>\n\n\n\n","installationManual":"<ol><li>Download the app from the store</li><li>Log in into your Shopware 6 administration area and navigate to extensions -> my extensions</li><li>Click on the right side on \"Upload extension\" and select the downloaded extension</li><li>Use the menu on the right side of the extension to install and configurate the extension and the switch button on the left side to activate it</li></ol>","shortDescription":"The app adds a request form to the shopping experiences, which can either be sent by email to an email address and / or the data can be saved in the database.","highlights":"a own request form for the shopping experiences, in which the following fields are possible, also as required fields: salutation, first name, last name, street address, postal code, city, country, email, phone number, comment, date field and up to 4 fields for free inputs\nthe form can either be sent by email to an email address and / or the data can be saved in the database, where the requests can be managed via the own administration module\na start and end date can also be specified for the date field and dates that should not be selectable can be entered\nif necessary, a requested date can not be longer selected in the date field on the respective page, i.e. in the category, on the landing page or at the product where the form was placed via an shopping experience\nby hiding selected fields, the form can also only be used for general requests, so that it can be used as a normal contact form","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":164742,"bookingKey":"Tmms613947858939","bookingText":"Form for requests for the shopping experiences","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyp2Mdr","preview":true,"priority":50,"id":79431},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMWfPFy","preview":false,"priority":49,"id":80097},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWesdom","preview":false,"priority":48,"id":80098},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMG0Vii","preview":false,"priority":47,"id":80099},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEH9NiK","preview":false,"priority":46,"id":79435},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeYEKWr","preview":false,"priority":45,"id":79436},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJXS3bZ","preview":false,"priority":44,"id":99725},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpB8D3V4","preview":false,"priority":43,"id":79438},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8vtLkS","preview":false,"priority":42,"id":82749},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcJ7p15","preview":false,"priority":41,"id":82750},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNAvYk2","preview":false,"priority":40,"id":99726},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyM8llV","preview":false,"priority":40,"id":99727},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php269by3","preview":false,"priority":40,"id":99728},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLRK5Z9","preview":false,"priority":40,"id":99729},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7y9ibj","preview":false,"priority":39,"id":79441},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHMtu5D","preview":false,"priority":38,"id":79442},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8zUs6W","preview":false,"priority":37,"id":99730},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpt0zFFL","preview":false,"priority":36,"id":99731},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCeChOk","preview":false,"priority":35,"id":99732},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQj5Iyb","preview":false,"priority":35,"id":99733},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoH55jX","preview":false,"priority":34,"id":79446},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIp8l3A","preview":false,"priority":33,"id":79447},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEQT54a","preview":false,"priority":32,"id":79448},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptALAWM","preview":false,"priority":31,"id":79449},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpf3upcl","preview":false,"priority":30,"id":99692},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvTwzPr","preview":false,"priority":29,"id":79423}],"comments":[{"authorName":"imc marketing &amp; consult gmbh","text":"Ein einfaches, funktionsfähiges Kontaktformular, welches mehr Optionen bietet als das im Shopware-Standard. Der Support leistet darüber hinaus sehr schnelle und zielführende Hilfe.","headline":"Einfaches, funktionsfähiges Kontaktformular","creationDate":{"date":"2023-07-04 14:50:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Jörg Bünger","text":"Wir nutzen seit der neuesten Version die Erweiterung auch, um nach dem Absenden der Anfrage einen Downloadlink anzuzeigen (Bestätigungstext als TinyMCE-Feld ). Diesen Wunsch hat das Support-Team perfekt trotz Gratis-Erweiterung umgesetzt. Herzlichen Dank!","headline":"Super Erweiterung und hervorragender Support","creationDate":{"date":"2023-02-15 13:46:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Leinweber Landtechnik","text":"Die Erweiterung funktioniert wie exakt wie beschrieben, bietet viele Komfortfunktionen und ist bestens ins Backend und Frontend integriert. Hier wurde durchdacht programmiert und sich wirklich Gedanken gemacht, wie man dem Shopbetreiber einen Mehrwert bieten kann.\nAls kostenfreie Erweiterung ein absolutes Muss für jeden Shopbetreiber!","headline":"Funktioniert einwandfrei und wie beschrieben","creationDate":{"date":"2023-01-26 07:36:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"AKUSTIK-PROJEKT","text":"Anfrageformular ist besser als das in Shopware enthaltene Kontaktformular. Bei Problemen reagiert der Pluginhersteller extrem schnell. Kann uneingeschränkt empfohlen werden.","headline":"Tolles Plugin, super Service","creationDate":{"date":"2022-10-27 10:37:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Robert","text":"Wir nutzen das Plugin hauptsächlich für das Sammeln von Buchungsanfragen zu unseren Produkten. Außerdem haben wir auch das Standard-Kontaktformular durch das Formular des Plugins ersetzt, sodass alle Anfragen an der gleichen Stelle in der Administration landen.","headline":"Klasse Plugin für Anfragen aller Art","creationDate":{"date":"2022-01-11 21:10:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Formular für Anfragen für die Erlebniswelten","description":"<h2>Support</h2><p>Treten Sie bei Fragen, wenn diese nicht bereits im Bereich \"<b>Häufig gestellte Fragen</b>\" beantwortet wurden, einfach über die E-Mail <b>shopware-apps-support@t-systems-mms.com</b> mit uns in Kontakt und wir helfen Ihnen gerne weiter. </p><h2>Beschreibung der App</h2><p>\n\nDie App \"Formular für Anfragen für die Erlebniswelten\" fügt ein <b>Anfrageformular zu den Erlebniswelten</b> hinzu, welches über den eigenen gleichnamigen <b>CMS-Block</b> oder das eigene gleichnamige <b>CMS-Element in einer Erlebniswelt platzieren werden kann</b>.</p><p>\n\nBeim Formular können folgende <b>Felder angezeigt und bei Bedarf als Pflichtfeld markiert werden</b>:\n\n</p><ul><li>Anrede</li><li>Vorname</li><li>Nachname</li><li>Straße</li><li>Postleitzahl</li><li>Ort</li><li>Land</li><li>E-Mail-Adresse</li><li>Telefonnummer</li><li>Kommentar</li><li>Datumsfeld</li><li>Datenschutzbestimmungen</li><li>bis zu 4 Felder für freie Eingaben (vom Typ Auswahl-, Eingabe- oder mehrzeiliges Eingabefeld).</li></ul><p>\n\nBeim <b>Datumsfeld kann</b> man zusätzlich ein <b>Start- und Enddatum festlegen</b> sowie <b>Daten eingeben, die nicht auswählbar sein sollen</b>. Des weiteren kann der <b>Kalender auch dauerhaft geöffnet angezeigt werden</b> oder man kann sich <b>2 Monate nebeneinander anzeigen lassen</b>. Das <b>Kommentarfeld</b>, das <b>Datumsfeld</b> und die <b>freien Eingaben können</b> bei Bedarf <b>auch oberhalb der Anrede angezeigt werden</b>.\n\n</p><p>\n\nÜber die Option \"<b>verfügbare, auswählbare Daten auch aus den Anfragen ermitteln</b>\" des Datumsfeldes ist es zudem möglich, das ein <b>bereits angefragter und durch den Shopbetreiber freigegebener Zeitraum beim Datumsfeld beziehungsweise beim Kalender</b> bei einem ausgewählten Produkt, Kategorie oder Landingpage, bei der das Formular über eine Erlebniswelt platziert wurde, auch <b>nicht mehr auswählbar und somit blockiert ist</b>, wodurch man eine Art \"Buchungskalender\" erhält, den man beispielsweise für Vermietungen einsetzen könnte. Dabei kann auch innerhalb der Erweiterungskonfiguration festgelegt werden, das eine Anfrage nicht extra freigegeben werden muss, damit ein Zeitraum sofort blockiert wird.\n\n</p><p>\nBei Bedarf kann auch die <b>Pflichtfeldinformation ausgeblendet</b> und auch der <b>Text der Absenden-Schaltfläche angepasst werden</b>.\n</p><p>\n\nÜber die Option \"<b>die Herkunft der Anfrage basierend auf dem Formular manuell festlegen</b>\" ist es zudem auch möglich, dass das gleiche Anfrageformular auf verschiedenen Seiten im Shop platziert werden kann und die ausgewählten und freigegebenen Zeiträume bei allen Seiten automatisch deaktiviert sind. Für diesen Fall legt man dazu beim Formular Werte bei \"<b>Herkunft</b>\", \"<b>Herkunftswert</b>\" und \"<b>individuelle ID der Herkunft</b>\" fest. Darüber hinaus ermöglicht es diese Funktion auch, auf der gleichen Seite, beispielsweise einer Übersichtsseite, mehrere verschiedene Anfrageformulare zu platzieren. \n\n</p><p>\n\n Beim <b>Formular können</b> unter anderem der <b>Titel</b>, ein <b>einleitender Text</b> und ein <b>Bestätigungstext festgelegt werden</b>. Das <b>Formular kann</b> entweder <b>per E-Mail an eine oder mehrere E-Mail-Adressen oder den Anfragenden versendet</b> und / oder dessen <b>eingegebene Daten in der Datenbank gespeichert werden</b>.  \n\n</p><p>\n\nÜber den neuen Menüpunkt \"<b>Anfragen</b>\" unter \"<b>Kunden</b>\" kann man die <b>eingegangenen Anfragen verwalten</b> und auf diese Weise <b>eine Zeitraumsanfrage eines Kunden freigeben</b>, <b>sodass das angefragte Datum dann auch nicht mehr im Datumsfeld auf der jeweiligen Seite</b>, also bei der Kategorie, der Landingpage oder dem Produkt, wo das Formular über eine Erlebniswelt platziert wurde, <b>auswählbar ist</b>. Man kann aber auch innerhalb der Erweiterungskonfiguration festlegen, dass der Freigabestatus der Anfragen ignoriert werden soll, sodass die angefragten Daten bereits automatisch deaktiviert sind.\n\n</p><p>\n\nEs können auch manuell über das Administrationsmodul Anfragen hinzugefügt werden.\n\n</p><p>\n\nDurch das <b>beliebige Ausblenden der Felder</b> kann man das Formular aber auch nur für allgemeine Anfragen nutzen, also beispielsweise ohne Datumsauswahl, sodass es als <b>normales Kontaktformular genutzt werden kann</b>.\n\n</p><p><br /><b>Die verfügbaren Textbausteine zum Individualisieren sind:</b></p><ul><li><b>tmms.periodRequestForm.salutation.label:</b> der Standardwert der Beschriftung der Anrede</li><li><b>tmms.periodRequestForm.salutation.placeholder:</b> der Standardwert des Platzhalters der Anrede</li><li><b>tmms.periodRequestForm.firstname.label:</b> der Standardwert der Beschriftung des Vornamens</li><li><b>tmms.periodRequestForm.firstname.placeholder:</b> der Standardwert des Platzhalters des Vornamens</li><li><b>tmms.periodRequestForm.lastname.label:</b> der Standardwert der Beschriftung des Nachnamens</li><li><b>tmms.periodRequestForm.lastname.placeholder:</b> der Standardwert des Platzhalters des Nachnamens</li><li><b>tmms.periodRequestForm.street.label:</b> der Standardwert der Beschriftung der Straße und Hausnummer</li><li><b>tmms.periodRequestForm.street.placeholder:</b> der Standardwert des Platzhalters der Straße und Hausnummer</li><li><b>tmms.periodRequestForm.zipcode.label:</b> der Standardwert der Beschriftung der Postleitzahl</li><li><b>tmms.periodRequestForm.zipcode.placeholder:</b> der Standardwert des Platzhalters der Postleitzahl</li><li><b>tmms.periodRequestForm.city.label:</b> der Standardwert der Beschriftung des Orts</li><li><b>tmms.periodRequestForm.city.placeholder:</b> der Standardwert des Platzhalters des Orts</li><li><b>tmms.periodRequestForm.country.label:</b> der Standardwert der Beschriftung des Landes</li><li><b>tmms.periodRequestForm.country.placeholder:</b> der Standardwert des Platzhalters der Landes</li><li><b>tmms.periodRequestForm.email.label:</b> der Standardwert der Beschriftung der E-Mail-Adresse</li><li><b>tmms.periodRequestForm.email.placeholder:</b> der Standardwert des Platzhalters der E-Mail-Adresse</li><li><b>tmms.periodRequestForm.phone.label:</b> der Standardwert der Beschriftung der Telefonnummer</li><li><b>tmms.periodRequestForm.phone.placeholder:</b> der Standardwert des Platzhalters der Telefonnummer</li><li><b>tmms.periodRequestForm.comment.label:</b> der Standardwert der Beschriftung des Kommentars</li><li><b>tmms.periodRequestForm.comment.placeholder:</b> der Standardwert des Platzhalters des Kommentars</li><li><b>tmms.periodRequestForm.date.dateLabel:</b> der Standardwert der Beschriftung des Zeitraums</li><li><b>tmms.periodRequestForm.date.datePlaceholder:</b> der Standardwert des Platzhalters des Zeitraums</li><li><b>tmms.periodRequestForm.date.dateRequiredErrorMessageLabel:</b> der Standardwert der Fehlermeldung, falls das Datumsfeld ein Pflichtfeld ist</li><li><b>tmms.periodRequestForm.date.dateFormat:</b> der Standardwert des Datumsformats des Kalenders</li><li><b>tmms.periodRequestForm.date.showWeeksNumbers:</b> der Standardwert der Anzeige der Kalenderwochen im Kalender</li><li><b>tmms.periodRequestForm.freeinput.label:</b> der Standardwert der Beschriftung der freien Eingabe</li><li><b>tmms.periodRequestForm.freeinput.placeholder:</b> der Standardwert des Platzhalters der freien Engabe</li><li><b>tmms.periodRequestForm.origin.productLabel:</b> der Standardwert der Herkunft des Produkts</li><li><b>tmms.periodRequestForm.origin.navigationLabel:</b> der Standardwert der Herkunft der Kategorie</li><li><b>tmms.periodRequestForm.origin.landingpageLabel:</b> der Standardwert der Herkunft der Landingpage</li><li><b>tmms.periodRequestForm.submitLabel:</b> der Standardwert der Absenden-Schaltfläche</li><li><b>tmms.periodRequestForm.inputMaxLength:</b> der Standardwert des maxlength-Attributs für einzeilige Eingabefelder</li><li><b>tmms.periodRequestForm.textareaMaxLength:</b> der Standardwert des maxlength-Attributs für mehrzeilige Eingabefelder</li><li><b>tmms.periodRequestForm.textareaNumberRows:</b> der Standardwert der Anzahl der Zeilen für mehrzeilige Eingabefelder</li></ul><p><br /><b>Die verfügbaren Variablen zum Individualisieren des E-Mail-Templates \"Anfrageformular\" sind:</b></p><ul><li><b>periodRequestFormData.origin:</b> der Inhalt des Feldes für die Herkunft</li><li><b>periodRequestFormData.originName:</b> der Inhalt des Feldes für den Herkunftswert</li><li><b>periodRequestFormData.salutation:</b> der Inhalt des Feldes für die Anrede</li><li><b>periodRequestFormData.firstname:</b> der Inhalt des Feldes für den Vornamen</li><li><b>periodRequestFormData.lastname:</b> der Inhalt des Feldes für den Nachnamen</li><li><b>periodRequestFormData.street:</b> der Inhalt des Feldes für die Straße und Hausnummer</li><li><b>periodRequestFormData.zipcode:</b> der Inhalt des Feldes für die Postleitzahl</li><li><b>periodRequestFormData.city:</b> der Inhalt des Feldes für den Ort</li><li><b>periodRequestFormData.country:</b> der Inhalt des Feldes für das Land</li><li><b>periodRequestFormData.email:</b> der Inhalt des Feldes für die E-Mail-Adresse</li><li><b>periodRequestFormData.phone:</b> der Inhalt des Feldes für die Telefonnummer</li><li><b>periodRequestFormData.comment:</b> der Inhalt des Feldes für den Kommentar</li><li><b>periodRequestFormData.date:</b> der Inhalt des Feldes für den Zeitraum</li><li><b>periodRequestFormData.freeInputLabel:</b> der Inhalt des Feldes für die Beschriftung der ersten freien Eingabe</li><li><b>periodRequestFormData.freeInput:</b> der Inhalt des Feldes für die erste freie Eingabe</li><li><b>periodRequestFormData.freeInput2Label:</b> der Inhalt des Feldes für die Beschriftung der zweiten freien Eingabe</li><li><b>periodRequestFormData.freeInput2:</b> der Inhalt des Feldes für die zweite freie Eingabe</li><li><b>periodRequestFormData.freeInput3Label:</b> der Inhalt des Feldes für die Beschriftung der dritten freien Eingabe</li><li><b>periodRequestFormData.freeInput3:</b> der Inhalt des Feldes für die dritte freie Eingabe</li><li><b>periodRequestFormData.freeInput4Label:</b> der Inhalt des Feldes für die Beschriftung der vierten freien Eingabe</li><li><b>periodRequestFormData.freeInput4:</b> der Inhalt des Feldes für die vierte freie Eingabe</li></ul>","installationManual":"<ol><li>Laden Sie sich die App aus dem Store herunter</li><li>Melden Sie sich in Ihren Shopware 6 Administrationsbereich an und navigieren Sie zu dem Menüpunkt Erweiterungen -&gt; Meine Erweiterungen</li><li>Klicken Sie rechts oben auf \"Erweiterung hochladen\" und wählen Sie die heruntergeladene Erweiterung aus</li><li>Verwenden Sie das Menü rechts neben der Erweiterung um die Erweiterung zu installieren und zu konfigurieren und den Schalter links, um sie zu aktivieren</li></ol>","version":"1.1.2","changelog":[{"version":"1.1.2","text":"<p>Fixed the problem that the captcha \"Google reCAPTCHA v3\" was no longer loaded under Shopware 6.5.</p>","creationDate":{"date":"2023-07-10 09:54:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"If a mail header and footer for the Email template was assigned to the sales channel, this will now be used when sending the data by email.","creationDate":{"date":"2023-07-04 09:41:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Established the compatibility with Shopware from version 6.5.0.0.</p><p>You can now determine whether the data protection information should be shown.</p><p>You can now determine whether the data protection information is to be treated as a required field and a checkbox field should be shown. </p><p>You can now determine whether the required fields information should be shown. </p><p>You can now set the text of the submit button. </p><p>It is now also possible to have several captcha methods active at the same time.</p>","creationDate":{"date":"2023-05-23 13:03:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.12","text":"<p>The field \"confirmation text\" in the configuration of the CMS element is now also provided as a TinyMCE field, so that its content is delivered as HTML code in the frontend.</p>","creationDate":{"date":"2023-02-06 12:33:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p>When data is sent by email, the customer email is now set as the reply address (Reply-To) for the recipients.</p>","creationDate":{"date":"2022-10-28 09:10:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"When sending emails, the AbstractMailService is now used instead of the MailService.","creationDate":{"date":"2022-10-27 08:29:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>You can now determine whether the period request form text should be shown after the successful submission of the form.</p><p>You can now set and show up to 4 free inputs.</p>","creationDate":{"date":"2022-10-06 09:10:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>The field type of the comment field and the free input field has been changed to LONGTEXT so that both fields can hold more characters.</p><p>All single-line and multi-line input fields now have the maxlength attribute.</p>","creationDate":{"date":"2022-08-08 15:42:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>established the compatibility with Shopware from version 6.4.14.0</p>","creationDate":{"date":"2022-08-01 20:00:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>The annotations of the controller have been replaced with Route defaults.</p>","creationDate":{"date":"2022-05-25 08:18:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>the captcha \"Google reCAPTCHA v3\", which is triggered when the privacy checkbox is clicked, is now possible at the request form.</p>","creationDate":{"date":"2022-05-04 08:26:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>You can now also send the email to several email receivers, which are separated by commas.</p><p>You can now also send the email to the requester.</p>","creationDate":{"date":"2022-04-28 09:40:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>established the compatibility with Shopware from version 6.4.10.0</p>","creationDate":{"date":"2022-04-13 09:15:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>You can now select the type of the free input, for example \"select field\", \"input field\" or \"textarea field\".</p><p>You can now also manually set the origin, the origin value and the origin id of the request in the form if necessary.</p><p>The code specifically for the validation of the captcha \"basic captcha\" has been optimized.</p>","creationDate":{"date":"2022-02-14 10:09:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>The captcha \"basic captcha\" is now possible at the request form</p>","creationDate":{"date":"2022-01-13 08:26:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release of the app</p>","creationDate":{"date":"2022-01-05 15:28:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Tmms613947858939","redirectToStore":false,"lowestPriceValue":0}