{"id":14622,"name":"JJIdeAfterware6","code":"JJIde91031044729","lastChange":{"date":"2023-07-18 11:16:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyXKF6o","examplePageUrl":"","moduleKey":"JJIdeAfterware6","creationDate":{"date":"2022-01-11 11:44:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-01-26 15:19:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-01-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-02-15 17:19:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3618,"prefix":"JJIde","name":"J&J Ideenschmiede GmbH","website":"//jj-ideenschmiede.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3618_favicon-big.jpg"},"infos":[{"id":25453,"name":"Afterbuy - Shopware 6 Schnittstelle","description":"<h2>J&amp;J Afterware 6 - die Schnittstellenanbindung zwischen Afterbuy und Shopware 6!</h2><p>Diese Schnittstellenlösung der J&amp;J Ideenschmiede verbindet Ihre Warenwirtschaft <b>Afterbuy</b> nahtlos mit Ihrem Onlineshop <b>Shopware 6</b> zum bidirektionalen Austausch folgender Daten:</p><p></p><ul><li><b>Produkte</b> aus Afterbuy in Shopware übertragen</li><li>Filtermöglichkeiten zur Übertragung auf: Entwurf, Produkt löschen, Produkt überspringen</li><li>Überführung des <b>Kategoriebaums</b> aus Afterbuy zu Shopware</li><li><b>Bilder</b> übermitteln und Medienstruktur in Shopware automatisiert aufbauen</li><li>separater Update Mechanismus für den <b>Bestandsabgleich</b> zur ständigen Synchronisierung der Lagerbestände</li><li>Keywords von Afterbuy als Schlagwörter zu Shopware übermitteln</li><li>Vollumfängliche <b>Bestellrückführung</b> aus Shopware in Afterbuy</li><li><b>Versandupdate</b> aus Afterbuy zu Shopware&nbsp;</li><li><b>Stornierungen </b>aus Afterbuy zu Shopware übergeben</li><li>Webbasierte <b>Statusübersicht</b> zum überprüfen der laufenden Prozesse und dem einsehen von Fehlern</li></ul><p>Doch der wichtigste Punkt: <b>Sie sind mehr als ein monatliches Abo für uns!</b></p><p>Wir bieten Ihnen einen ausführlichen Onboarding Prozess an und gehen auf Ihre Bedürfnisse ein, denn jedes Afterbuy ist anders und die Lösung so individualisierbar, wie Sie es benötigen!<b> Service und eine umfangreiche Beratung sind uns insbesondere beim Onboarding immens wichtig.&nbsp;</b></p><p><b>Mehr zu unserem Service finden Sie hier:&nbsp;</b><a href=\"https://schnittstellen24.de/unser-individueller-service/\" target=\"_blank\" rel=\"noreferrer\">Unser Service</a></p><h3><b>Weitere Vorteile einer Middleware Lösung von J&amp;J:</b></h3><p>Unsere Schnittstellenanbindungen sind aus einer Hand - zu 100% von uns programmiert! Dank des modularen Aufbaus und der hohen Variabilität unserer Schnittstelle bieten wir einen langfristigen und nachhaltigen Nutzen. Die Schnittstelle ist auf höchste Anforderungen ausgelegt und sehr performant, sodass Sie mit unseren Lösungen wachsen und Ihr Geschäfts skalieren können!</p><h4>Performanter Aufbau für Ihre Zufriedenheit:</h4><p></p><ul><li><b>Programmiersprache?</b> Go Lang. Sehr hohe Rechengeschwindigkeit und Objektorientiert ausgerichtet.</li><li><b>Datenbank?</b> redisJSON. No SQL Datenbank mit sehr hoher Rechengeschwindigkeit</li><li><b>Anwendungsumgebung?</b> Docker Container. Docker Container auf unseren Cloud Servern gehostet liefern die optimalen Umgebungsvariablen, um Ihre Schnittstelle jederzeit effizient laufen zu lassen.</li></ul><h3>Lizenzart &amp; Hosting:</h3><p>Unsere Softwarelösung \"J&amp;J Afterware 6\" bieten wir als <b>Kauflizenz</b>&nbsp;mit verbundenem <b>Cloud Service</b> an. Diese wird zu einem einmaligen Preis mit einer verbundenen fixen monatlichen Cloud Service Gebühr angeboten, sodass Sie keine monatlichen versteckten Kosten erwarten! Mit unserer Schnittstelle erhalten Sie eine zu 100% funktionierende Lösung, die wir vollumfänglich in Ihre Systeme integrieren.</p><h3>Folgende Lizenzen bieten wir an:</h3><p>Vollumfängliche Schnittstellenlösung: <b>Einmalig 1.375€</b></p><p>Bestellrückführung inkl. Versandupdate: <b>Einmalig 825€</b></p><p>Im Rahmen des <b>Cloud Service der Schnittstelle</b> auf unseren deutschen Cloud Servern bieten wir darüber hinaus folgende Benefits:</p><p></p><ul><li><b>ständige Überwachung</b> unserer Server dank hauseigener Server Überwachung</li><li><b>Funktionalität</b>&nbsp;der Schnittstelle ständig überwacht und somit jederzeit gewährleistet</li><li>Updaten und agiles anpassen der Schnittstelle möglich</li><li><b>Statusübersicht</b>&nbsp;für Sie zur Einsicht in eventuelle Errors und aktuelle Prozesse</li></ul><p>Die <b>Cloud Service Gebühren</b>&nbsp;liegen bei monatlich 35€ netto.</p><p>Wir garantieren die ständige <b>Erreichbarkeit und Funktionalität</b> der Schnittstelle. Sollten von uns unkontrollierbare Umwelteinflüsse eintrete, so unterstützen wir Sie gern im Rahmen unseres Supports, dieser wird auf Stundenbasis abgerechnet.</p><h3>Voraussetzungen für die Anbindung:</h3><p></p><ul><li>Shopware 6 als Shopsystem</li><li>Afterbuy als zentrale Produktdatenbasis (je nach Lizenz)</li><li>API Zugang für Afterbuy (Shop-Schnittstelle, XML-Schnittstelle)</li><li>Zugang zu Shopware 6</li></ul>","installationManual":"<h2>J&amp;J Afterware 6 installation:</h2><p>Die Schnittstellenkonfiguration bei Afterbuy ist etwas aufwendiger als bei der Integration eines herkömmlichen PlugIns.&nbsp;</p><p>Wir installieren die Schnittstelle für Sie und nehmen uns Zeit für das Onboarding, sodass die Lösung ohne Probleme implementiert werden kann und alle Umgebungsvariablen stimmen. Die Basis und der Türöffner hierfür ist zunächst die Installation der App in Ihrem Shopware Shop. Im folgenden gehen wir auf die Schritte ein, die Sie vorbereitend treffen müssen, sodass wir die Schnittstellenlösung für Sie implementieren können.</p><h3>1. Schnittstelle bestellen &amp; Onboarding durchführen</h3><p>Nachdem Sie die App installiert haben, werden Sie bei Klick auf die App zunächst zum Onboarding Formular gelangen. Bitte geben Sie alle Informationen an und bestellen Sie die entsprechend benötigte Schnittstelle in Ihrem Afterbuy System. Diese Informationen sind essenziell, um die Anbindung durchzuführen! Sobald Sie die Informationen bereitgestellt haben, werden Sie in Ihrer App alle Informationen zur Schnittstelle sowie ein ausführliches Onboarding Video finden. Prüfen Sie alles in Ruhe und schauen Sie sich alles im Detail an, sodass Sie die Funktionalität verstehen. Wir werden Sie zeitnah kontaktieren, um zu Ihren individuellen Anforderungen ins Detail zu gehen.</p><p>Sie benötigen Hilfe oder wollen die Schnittstelle und verbundene App gemeinsam mit uns einrichten? Kein Problem!&nbsp;<a href=\"https://meeting.jj-ideenschmiede.de/meetings/jan-droste/onboarding-meeting\" title=\"onboarding buchen\">Persönliches Onboarding Meeting buchen</a></p><h3>2. Shopware 6 auf die Schnittstellenanbindung vorbereiten</h3><p>Nun sind alle Rahmenbedingungen geklärt und Sie können den Shop noch entsprechend vorbereiten. Hierfür können Sie die Dokumentation, die in der App verlinkt ist, verwenden und die entsprechenden Vorbereitungen in Shopware treffen.</p><h3>3. Afterbuy auf die Schnittstellenanbindung vorbereiten</h3><p>Auch in Afterbuy können eventuell noch Änderungen von Nöten sein, nehmen Sie sich auch hier die in der App verlinkte Dokumentation zur Hand, um das Wertemapping zu prüfen. Sie können auch nach Anbindung selbstverständlich Produktdaten anpassen, wir aktualisieren die Produkte ständig.</p><h3>4. Abschluss der Schnittstelleninstallation</h3><p>Die App ist installiert, die Zugangsdaten sind vorhanden und beide Systeme sind vorbereitet, somit können wir nun die Installation zu einem vorab gemeinsam definierten Installationstermin durchführen. Dann können Sie anschließend die Anbindung testen und wenn alles für Sie und für uns passt, schließen wir die Installation ab und Afterbuy wurde erfolgreich mit Shopware 6 verbunden!</p>","shortDescription":"Schnittstellenanbindung zwischen Afterbuy und Shopware 6 zum Austausch von Produkt, Bestell- und Versanddaten ohne Kompromisse inklusive Installationsservice und persönlichem Onboarding","highlights":"Produkte inklusive Varianten, SEO Beschreibungen, Medien und Kategorien aus Afterbuy zu Shopware 6 übertragen\nStändiges Update der Bestände und Synchronisation mit Afterbuy - Überverkäufe vermeiden\nBestellungen vollumfänglich zurückführen\nVersanddaten in Afterbuy hinterlegen und automatisiert zu Shopware 6 zurück übertragen\nVollumfängliche Schnittstellenanbindung von Afterbuy und Shopware 6 ohne Kompromisse","features":"Produkte aus Afterbuy in Shopware übertragen\nFiltermöglichkeiten zur Übertragung auf: Entwurf, Produkt löschen, Produkt überspringen\nÜberführung des Kategoriebaums aus Afterbuy zu Shopware\nBilder übermitteln und Medienstruktur in Shopware automatisiert aufbauen\nseparater Update Mechanismus für den Bestandsabgleich zur ständigen Synchronisierung der Lagerbestände\nKeywords von Afterbuy als Schlagwörter zu Shopware übermitteln\nVollumfängliche Bestellrückführung aus Shopware in Afterbuy\nVersandupdate aus Afterbuy zu Shopware \nStornierungen aus Afterbuy zu Shopware\nWebbasierte Statusübersicht zum überprüfen der laufenden Prozesse und dem einsehen von Fehlern"},{"id":25454,"name":"Afterbuy - Shopware 6 Interface Solution","description":"<h2>J&amp;J Afterware 6 - the interface connection between Afterbuy and Shopware 6!</h2><p>This interface solution from the J&amp;J Ideenschmiede seamlessly connects your merchandise management system Afterbuy with your online shop Shopware 6 for the bidirectional exchange of the following data:</p><p></p><ul><li>Transfer products from Afterbuy to Shopware</li><li>Filter options for the transfer to: Draft, Delete product, Skip product</li><li>Transfer the category tree from Afterbuy to Shopware</li><li>Transfer images and build media structure in Shopware automatically</li><li>Separate update mechanism for stock updates for constant synchronisation of your Afterbuy stock</li><li>Transfer keywords from Afterbuy to Shopware</li><li>Full order transfer from Shopware to Afterbuy</li><li>Shipping update from Afterbuy to Shopware&nbsp;</li><li>Web-based status overview to check running processes and view errors</li></ul><p>But the most important point: <b>You are more than a monthly subscription to us!</b></p><p>We offer you a detailed onboarding process and respond to your needs, because every Afterbuy is different and the solution can be customized as you need it! <b>Service and comprehensive advice are immensely important to us, especially during the onboarding process.&nbsp;</b></p><p><b>You can find out more about our service here:&nbsp;</b><a href=\"https://schnittstellen24.de/unser-service/\" target=\"_blank\" rel=\"noreferrer\"><b>Our Service</b></a></p><h3>Further advantages of a middleware solution from J&amp;J:</h3><p>Our interface connections is a 100% programmed by us! Thanks to the modular structure and the high variability of our interface solutions, we offer long-term and sustainable benefits. The interface is designed to meet the highest requirements and is very performant, so that you can grow and scale your business with our solutions!</p><p><b>High-performance design for your satisfaction:</b></p><p></p><ul><li><b>Programming Language?</b> Go Lang. Very high computing speed and object-orientated.</li><li><b>Database?</b> redisJSON. No SQL database with very high computing speed</li><li><b>Application environment?</b> Docker Container. Docker containers hosted on our cloud servers provide the optimal environment variables to keep your interface running efficiently at all times.</li></ul><h3>Licensing &amp; Hosting:</h3><p>We offer our software solution \"J&amp;J Afterware 6\" as a <b>purchase licence</b>. This is offered at a one-time price, so you can expect no monthly hidden costs. With the purchase licence, you receive a 100% functioning solution that we fully integrate into your systems.</p><h3>We offer the following purchase licences:</h3><p>Fully comprehensive interface solution: <b>One-time 1.375€</b></p><p>Order feedback incl. shipping update: <b>One-time 825€</b></p><p>Within the scope of <b>hosting the interface solution</b> on our German cloud servers, we also offer the following benefits:</p><p></p><ul><li><b>constant monitoring</b> of our servers thanks to our in-house server monitoring software</li><li><b>Notification API</b>, which monitors all processes and sends us a notification immediately in case of irregularities</li><li>Functionality of the interface fully guaranteed at all times</li></ul><p>The <b>hosting costs </b>are 35€ net per month.</p><p>We guarantee the constant <b>accessibility and functionality</b> of the interface solution. Should uncontrollable environmental influences occur, we will gladly assist you within our support, this will be invoiced on an hourly basis.</p><h3>Requirements for the connection:</h3><p></p><ul><li>Shopware 6 as your shop system</li><li>Afterbuy as the central product database (depending on licence)</li><li>API access for Afterbuy (Shop interface, XML interface)</li><li>API access for Shopware 6</li></ul><p></p>","installationManual":"<h2>J&amp;J Afterware 6 installation:</h2><p>The interface configuration for Afterbuy is a bit more complex than integrating a traditional plug-in, which you just have to install.&nbsp;</p><p>We install the interface solution for you and take the time to onboard it so that the solution can be implemented without any problems and all environment variables are correct. Below we go through the steps to implement the interface solution for you.</p><h3>1. Order interface solution &amp; visit landing page</h3><p>After you have ordered our middleware, you will be taken to a landing page to get more information about the interface connection.</p><p>Here you will first be asked to enter your contact details and send them to us so that we can send you the detailed documentation of the interface solution.</p><p>Here you can find our landing page:&nbsp; <b>Visit landing page now</b></p><h3>2. Book an onboarding meeting with us</h3><p>After you have sent us the contact details and we have sent you the relevant information including the standardised value mapping, you can easily book an onboarding meeting with us: <b>Book Onboarding Meeting now</b></p><h3>3. Prepare Shopware 6 for the interface connection</h3><p>In this step, you create a Shopware user with all rights, including admin rights, in order to be able to address your online shop via API from the outside.</p><h3>4. Prepare Afterbuy for the interface connection</h3><p>After an account has been created for Shopware 6, we also need the Afterbuy access data and an interface, which must also be ordered in Afterbuy directly. The Shop and XML interface is required.</p><h3>5. Send your access data</h3><p>After you have created the access data and accounts, you can send them to us securely via our Encrypt service.</p><p>Here is the link to our encryption tool: <b>Encrypt access data now</b></p><p>Conveniently send us the generated encrypted code by e-mail. Only we can decrypt it locally on our PC.</p><h3>6. Maintain product data</h3><p>In this step, you should consider potential changes to the product database to connect the systems. In addition, the filter options via the levels in Afterbuy must be taken into account and we recommend individual prices for Shopware to be created in Afterbuy.</p><h3>7. Carry out the connection and complete the interface installation</h3><p>Once the preparations are completed, we will install the interface connection and inform you as soon as the connection has been successfully completed.</p><p>After the connection has been carried out, check your systems for any faults. The connection is successfully completed as soon as you are satisfied.</p>","shortDescription":"Interface connection between Afterbuy and Shopware 6 for the exchange of product, order and shipping data without compromise including installation service and personal onboarding.","highlights":"Transfer products including variants, SEO descriptions, media and categories from Afterbuy to Shopware 6\nConstant update of stock and synchronisation with Afterbuy - avoid overselling\nFull order transfer from Shopware to Afterbuy\nTransfer shipping data from Shopware to Afterbuy and automatically transfer it back to Shopware 6\nFull interface connection of Afterbuy and Shopware 6 without compromises","features":"Transfer products from Afterbuy to Shopware\nFilter options for the transfer to: Draft, Delete product, Skip product\nTransfer the category tree from Afterbuy to Shopware\nTransfer images and build media structure in Shopware automatically\nSeparate update mechanism for stock updates for constant synchronisation of your Afterbuy stock\nTransfer keywords from Afterbuy to Shopware\nFull order transfer from Shopware to Afterbuy\nShipping update from Afterbuy to Shopware \nWeb-based status overview to check running processes and view errors"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165017,"bookingKey":"JJIde91031044729","bookingText":"","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6ZXHuS","preview":true,"priority":0,"id":82922},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpecQlaL","preview":false,"priority":3,"id":105825},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5nNmhy","preview":false,"priority":2,"id":105731},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php84QTvg","preview":false,"priority":1,"id":82921}],"comments":[{"authorName":"Anita Schleicher","text":"","headline":"Alles funktioniert einwandfrei, der Support und Service ist super!","creationDate":{"date":"2023-02-15 11:32:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Alexander Kruse","text":"Super Anbindung. Onboarding und Support top. Kleine Probleme wurden sofort bearbeitet und behoben. Wünsche wurden zufriedenstellend umgesetzt.","headline":"Perfekt","creationDate":{"date":"2023-02-03 11:26:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Afterbuy - Shopware 6 Schnittstelle","description":"<h2>J&amp;J Afterware 6 - die Schnittstellenanbindung zwischen Afterbuy und Shopware 6!</h2><p>Diese Schnittstellenlösung der J&amp;J Ideenschmiede verbindet Ihre Warenwirtschaft <b>Afterbuy</b> nahtlos mit Ihrem Onlineshop <b>Shopware 6</b> zum bidirektionalen Austausch folgender Daten:</p><p></p><ul><li><b>Produkte</b> aus Afterbuy in Shopware übertragen</li><li>Filtermöglichkeiten zur Übertragung auf: Entwurf, Produkt löschen, Produkt überspringen</li><li>Überführung des <b>Kategoriebaums</b> aus Afterbuy zu Shopware</li><li><b>Bilder</b> übermitteln und Medienstruktur in Shopware automatisiert aufbauen</li><li>separater Update Mechanismus für den <b>Bestandsabgleich</b> zur ständigen Synchronisierung der Lagerbestände</li><li>Keywords von Afterbuy als Schlagwörter zu Shopware übermitteln</li><li>Vollumfängliche <b>Bestellrückführung</b> aus Shopware in Afterbuy</li><li><b>Versandupdate</b> aus Afterbuy zu Shopware </li><li><b>Stornierungen </b>aus Afterbuy zu Shopware übergeben</li><li>Webbasierte <b>Statusübersicht</b> zum überprüfen der laufenden Prozesse und dem einsehen von Fehlern</li></ul><p>Doch der wichtigste Punkt: <b>Sie sind mehr als ein monatliches Abo für uns!</b></p><p>Wir bieten Ihnen einen ausführlichen Onboarding Prozess an und gehen auf Ihre Bedürfnisse ein, denn jedes Afterbuy ist anders und die Lösung so individualisierbar, wie Sie es benötigen!<b> Service und eine umfangreiche Beratung sind uns insbesondere beim Onboarding immens wichtig. </b></p><p><b>Mehr zu unserem Service finden Sie hier: </b><a href=\"https://schnittstellen24.de/unser-individueller-service/\" target=\"_blank\" rel=\"noreferrer noopener\">Unser Service</a></p><h3><b>Weitere Vorteile einer Middleware Lösung von J&amp;J:</b></h3><p>Unsere Schnittstellenanbindungen sind aus einer Hand - zu 100% von uns programmiert! Dank des modularen Aufbaus und der hohen Variabilität unserer Schnittstelle bieten wir einen langfristigen und nachhaltigen Nutzen. Die Schnittstelle ist auf höchste Anforderungen ausgelegt und sehr performant, sodass Sie mit unseren Lösungen wachsen und Ihr Geschäfts skalieren können!</p><h4>Performanter Aufbau für Ihre Zufriedenheit:</h4><p></p><ul><li><b>Programmiersprache?</b> Go Lang. Sehr hohe Rechengeschwindigkeit und Objektorientiert ausgerichtet.</li><li><b>Datenbank?</b> redisJSON. No SQL Datenbank mit sehr hoher Rechengeschwindigkeit</li><li><b>Anwendungsumgebung?</b> Docker Container. Docker Container auf unseren Cloud Servern gehostet liefern die optimalen Umgebungsvariablen, um Ihre Schnittstelle jederzeit effizient laufen zu lassen.</li></ul><h3>Lizenzart &amp; Hosting:</h3><p>Unsere Softwarelösung \"J&amp;J Afterware 6\" bieten wir als <b>Kauflizenz</b> mit verbundenem <b>Cloud Service</b> an. Diese wird zu einem einmaligen Preis mit einer verbundenen fixen monatlichen Cloud Service Gebühr angeboten, sodass Sie keine monatlichen versteckten Kosten erwarten! Mit unserer Schnittstelle erhalten Sie eine zu 100% funktionierende Lösung, die wir vollumfänglich in Ihre Systeme integrieren.</p><h3>Folgende Lizenzen bieten wir an:</h3><p>Vollumfängliche Schnittstellenlösung: <b>Einmalig 1.375€</b></p><p>Bestellrückführung inkl. Versandupdate: <b>Einmalig 825€</b></p><p>Im Rahmen des <b>Cloud Service der Schnittstelle</b> auf unseren deutschen Cloud Servern bieten wir darüber hinaus folgende Benefits:</p><p></p><ul><li><b>ständige Überwachung</b> unserer Server dank hauseigener Server Überwachung</li><li><b>Funktionalität</b> der Schnittstelle ständig überwacht und somit jederzeit gewährleistet</li><li>Updaten und agiles anpassen der Schnittstelle möglich</li><li><b>Statusübersicht</b> für Sie zur Einsicht in eventuelle Errors und aktuelle Prozesse</li></ul><p>Die <b>Cloud Service Gebühren</b> liegen bei monatlich 35€ netto.</p><p>Wir garantieren die ständige <b>Erreichbarkeit und Funktionalität</b> der Schnittstelle. Sollten von uns unkontrollierbare Umwelteinflüsse eintrete, so unterstützen wir Sie gern im Rahmen unseres Supports, dieser wird auf Stundenbasis abgerechnet.</p><h3>Voraussetzungen für die Anbindung:</h3><p></p><ul><li>Shopware 6 als Shopsystem</li><li>Afterbuy als zentrale Produktdatenbasis (je nach Lizenz)</li><li>API Zugang für Afterbuy (Shop-Schnittstelle, XML-Schnittstelle)</li><li>Zugang zu Shopware 6</li></ul>","installationManual":"<h2>J&amp;J Afterware 6 installation:</h2><p>Die Schnittstellenkonfiguration bei Afterbuy ist etwas aufwendiger als bei der Integration eines herkömmlichen PlugIns. </p><p>Wir installieren die Schnittstelle für Sie und nehmen uns Zeit für das Onboarding, sodass die Lösung ohne Probleme implementiert werden kann und alle Umgebungsvariablen stimmen. Die Basis und der Türöffner hierfür ist zunächst die Installation der App in Ihrem Shopware Shop. Im folgenden gehen wir auf die Schritte ein, die Sie vorbereitend treffen müssen, sodass wir die Schnittstellenlösung für Sie implementieren können.</p><h3>1. Schnittstelle bestellen &amp; Onboarding durchführen</h3><p>Nachdem Sie die App installiert haben, werden Sie bei Klick auf die App zunächst zum Onboarding Formular gelangen. Bitte geben Sie alle Informationen an und bestellen Sie die entsprechend benötigte Schnittstelle in Ihrem Afterbuy System. Diese Informationen sind essenziell, um die Anbindung durchzuführen! Sobald Sie die Informationen bereitgestellt haben, werden Sie in Ihrer App alle Informationen zur Schnittstelle sowie ein ausführliches Onboarding Video finden. Prüfen Sie alles in Ruhe und schauen Sie sich alles im Detail an, sodass Sie die Funktionalität verstehen. Wir werden Sie zeitnah kontaktieren, um zu Ihren individuellen Anforderungen ins Detail zu gehen.</p><p>Sie benötigen Hilfe oder wollen die Schnittstelle und verbundene App gemeinsam mit uns einrichten? Kein Problem! <a href=\"https://meeting.jj-ideenschmiede.de/meetings/jan-droste/onboarding-meeting\">Persönliches Onboarding Meeting buchen</a></p><h3>2. Shopware 6 auf die Schnittstellenanbindung vorbereiten</h3><p>Nun sind alle Rahmenbedingungen geklärt und Sie können den Shop noch entsprechend vorbereiten. Hierfür können Sie die Dokumentation, die in der App verlinkt ist, verwenden und die entsprechenden Vorbereitungen in Shopware treffen.</p><h3>3. Afterbuy auf die Schnittstellenanbindung vorbereiten</h3><p>Auch in Afterbuy können eventuell noch Änderungen von Nöten sein, nehmen Sie sich auch hier die in der App verlinkte Dokumentation zur Hand, um das Wertemapping zu prüfen. Sie können auch nach Anbindung selbstverständlich Produktdaten anpassen, wir aktualisieren die Produkte ständig.</p><h3>4. Abschluss der Schnittstelleninstallation</h3><p>Die App ist installiert, die Zugangsdaten sind vorhanden und beide Systeme sind vorbereitet, somit können wir nun die Installation zu einem vorab gemeinsam definierten Installationstermin durchführen. Dann können Sie anschließend die Anbindung testen und wenn alles für Sie und für uns passt, schließen wir die Installation ab und Afterbuy wurde erfolgreich mit Shopware 6 verbunden!</p>","version":"1.0.4","changelog":[{"version":"1.0.4","text":"<p>fix: Update file structure.</p>","creationDate":{"date":"2023-01-23 11:47:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Adding Permissions and IFrame.</p>","creationDate":{"date":"2023-01-23 11:32:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>fix: update manifest.xml.</p><p><br /></p><p>It is a pseudo plugin as communicated with Frauke Terwege + Vladislav Gert.</p>","creationDate":{"date":"2022-10-28 17:44:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Upload of the landing page, as it is a placeholder app.</p><p>We have used the licence \"Mit\", but are unsure whether this is the right licence for our licensing model.</p><p><br /></p><p>We also use our own license check, as this only is a placeholder app.</p>","creationDate":{"date":"2022-02-16 09:48:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=JJIde91031044729","redirectToStore":false,"lowestPriceValue":0}