{"id":14670,"name":"ZeobvFacetedNavigation","code":"zeobv79942489849","lastChange":{"date":"2023-07-19 16:53:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBiXKnh","examplePageUrl":"","moduleKey":"ZeobvFacetedNavigation","creationDate":{"date":"2022-01-27 11:57:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-02-18 13:48:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-02-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-01-27 15:01:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":25538,"name":"Lesbare Filter-URLs und einzigartige Filterinhalte.","description":"Verwandeln Sie die URLs Ihrer Shopware 6 Filter mit unserer leistungsstarken Erweiterung - SEO Friendly Filter URLs. Verabschieden Sie sich von \"hässlichen\" und nicht benutzerfreundlichen URLs und heißen Sie lesbare und SEO-optimierte URLs willkommen, die das Ranking Ihrer Website in Suchmaschinen verbessern. Diese Erweiterung verbessert nicht nur die URL-Struktur, sondern ermöglicht es auch Händlern, SEO-Inhalte auf der Filter- oder Herstellerebene zu erstellen. Dadurch können Sie einzigartige und ansprechende Inhalte für verschiedene Filterkombinationen erstellen und Ihren Kunden ein personalisiertes Erlebnis bieten.\n\n\n\n\n<h3>Vorteile</h3><h4>Verbessertes SEO-Ranking</h4><p>Mit SEO Friendly Filter URLs wird das SEO-Ranking Ihrer Website erheblich verbessert. Die Suchmaschinen-Bots können Ihre Seiten leichter durchsuchen und indexieren, was zu einer höheren Sichtbarkeit in den Suchergebnissen und einer Steigerung des organischen Website-Traffics führt.</p><h4>Eindeutige und ansprechende Inhalte</h4><p>Unsere Erweiterung ermöglicht es Händlern, benutzerdefinierte SEO-Inhalte für verschiedene Filterkombinationen zu erstellen. Diese Funktion ermöglicht es Ihnen, Ihre Inhalte auf spezifische Kundensegmente zuzuschneiden und Ihre Website für diverse Zielgruppen relevanter und ansprechender zu gestalten.</p><h4>Dynamische Kategorietitel</h4><p>Nutzen Sie Platzhalter in Kategorietiteln, um diese automatisch basierend auf den angewendeten Filtern anzupassen. Dieser dynamische Ansatz stellt sicher, dass Ihre Kategorietitel immer relevant sind und die angezeigten Produkte genau widerspiegeln, wodurch die SEO-Performance Ihrer Website weiter optimiert wird.</p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>\n","installationManual":"<h2>Starten Sie mit dem Plugin:</h2><p><br></p><p></p><ul><li>Laden Sie das Optimalisation Faceted Navigation Plugin aus dem Community Store herunter</li><li>Aktivieren Sie das Plugin in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun. Alternativ können Sie auch den Button \"Plugin hochladen\" verwenden, um die ZIP-Datei des Plugins hochzuladen.</li><li>Ihre Filter-URLs werden nun auf magische Weise in SEO-freundliche URLs umgewandelt, die die angewendeten Filter beschreiben.</li></ul><p></p><p><br></p><p><br></p><h3>Konfiguration der dynamischen Inhaltserstellung</h3><p><br></p><p></p><ul><li>Gehen Sie zu Kataloge &gt; Eigenschaften.</li><li>Öffnen Sie die Details einer Eigenschaft Ihrer Wahl, für die \"Als Produktfilter anzeigen\" aktiviert ist.</li><li>Schalten Sie den Schalter \"Filter in die facettierte Navigation einbeziehen\" um. Dadurch werden zusätzliche Konfigurationsfelder angezeigt, mit denen Sie das Verhalten der facettierten Navigation für diese Eigenschaft Filter konfigurieren können.</li><li>Wenn Sie den Schalter \"Filter in die facettierte Navigation einbeziehen\" nicht sehen, stellen Sie sicher, dass Sie den Schalter \"In Produktfiltern anzeigen\" aktivieren.</li><li>Wenn Sie möchten, dass die Eigenschaft vor dem Kategorienamen angezeigt wird, geben Sie eine Position kleiner als 0 ein (z. B. -1 oder -2). Der Wert, den Sie hier eingeben, bestimmt die Reihenfolge der Werte im generierten Titel.</li><li>Das Feld Konjunktion wird verwendet, wenn mehrere Optionen eines bestimmten Filters ausgewählt werden. (z. B. rot, grün oder blau)</li><li>Das Präfix-Feld kann verwendet werden, um ein benutzerdefiniertes (übersetzbares) Wort vor den Optionsnamen zu setzen.</li><li>Das Suffix-Feld kann verwendet werden, um ein benutzerdefiniertes (übersetzbares) Wort hinter den Optionsnamen zu setzen.</li><li>Sowohl das Präfix als auch das Suffix sind optional und dienen dazu, die Lesbarkeit und Korrektheit des generierten facettierten Kategorienamens zu erhöhen.</li><li>Öffnen Sie nun die Details eines Eigenschaftswertes. Hier finden Sie zwei zusätzliche Konfigurationsfelder: \"Adjektiv\" und \"Plural\". Diese werden während des Generierungsprozesses verwendet und sind die Werte, die im endgültigen facettierten Navigationswert angezeigt werden.</li><li>Speichern Sie die Eigenschaft und wiederholen Sie die obigen Schritte für jede filterbare Eigenschaft, die Sie in die dynamische Inhaltserstellung aufnehmen möchten.</li></ul><p></p><p><br></p><p><br></p><h3>Rendering einzigartiger Inhalte auf Ihrer Storefront mit unserem Custom CMS Element</h3><p><br></p><p></p><ul><li>Jetzt, wo Sie Ihre Eigenschaften für die Generierung einzigartiger Kategorietitel vorbereitet haben, ist es an der Zeit, unser benutzerdefiniertes CMS-Element zu Ihrem Kategorielayout hinzuzufügen.</li><li>Gehen Sie zu dem Shopping Experience Layout Ihrer Wahl und fügen Sie einen neuen Block hinzu.</li><li>Wählen Sie die Kategorie \"Textblöcke\" und suchen Sie nach dem Element mit dem Namen \"Facettierter Navigationstext\".</li><li>Ziehen Sie diesen Block in Ihr Einkaufserlebnis und konfigurieren Sie den Inhalt der Vorlage nach Ihren Wünschen, aber achten Sie darauf, dass Sie das \"%faceted_navigation%\" weglassen.</li><li>Optional: Sie können zusätzliche Platzhalter zum Inhalt dieses CMS-Elements hinzufügen, indem Sie die %filter_property_id%-Syntax verwenden (z. B. %filter_75f353b589d04bf48e8a9ab1f5422b0e%)</li></ul><p><br></p><h3>Lassen Sie sich von Ihrem SEO-Spezialisten beraten, wie Sie Ihre Filterstruktur und Ihre facettierten Inhalte für Suchmaschinen optimieren können!</h3><p></p>","shortDescription":"This extension makes the filter URL structure readable & enables SEO content on filter/manufacturer level, creating engaging content for each filter combination.","highlights":"SEO-freundliche Filter-URL\nErstellung einzigartiger Inhalte mit einem benutzerdefinierten CMS-Element\nVerbessern Sie Ihren Google-Rang\nErhöhen Sie Ihre Klickrate\nVollständig übersetzbarer Inhalt","features":"Benutzerdefinierter Platzhalter für einen automatisch generierten Filterkategorietitel\nFallback-Inhalte mit Mailvorlagen-ähnlichen Platzhaltern, um alle gewünschten Kategorie-Informationen einzubinden.\nBenutzerdefinierte Filterplatzhalter, um Ihre Filter in Ihre Kategoriebeschreibungen aufzunehmen\nFilterlöschung, wenn der Filterplatzhalter nicht ausgefüllt werden konnte, wird er nicht in Ihrem Inhalt angezeigt\nJS-Filterung deaktiviert, um Crawlern die Indizierung von Filter-URLs zu ermöglichen"},{"id":25539,"name":"Readable filter URL's and unique filter content","description":"<p>Transform your Shopware 6 filter URLs with our powerful extension - SEO Friendly Filter URLs. Say goodbye to the \"ugly\" and non-user-friendly URLs and welcome readable and SEO optimized URLs that improve your website's search engine rankings. This extension not only enhances the URL structure but also empowers merchants to create SEO content on the filter or manufacturer level. As a result, you can have unique and engaging content for different filter combinations, providing a more personalized experience for your customers.</p><h3>Advantages</h3><h4>Improved SEO Ranking</h4><p>With SEO Friendly Filter URLs, your website's SEO ranking will witness significant improvements. The search engine bots will find it easier to crawl and index your pages, leading to higher visibility in search results and attracting more organic traffic to your site.</p><h4>Unique and Engaging Content</h4><p>Our extension allows merchants to create custom SEO content for various filter combinations. This feature enables you to tailor your content to specific customer segments, making your website more relevant and appealing to diverse audiences.</p><h4>Dynamic Category Titles</h4><p>Utilize placeholders in category titles to automatically adjust them based on the applied filters. This dynamic approach ensures that your category titles are always relevant and accurately reflect the products displayed, further optimizing your website's SEO performance.</p><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the extension changed or improved, contact us via the Shopware support portal by selecting the extension or by sending a message to <b>support@diztech.nl</b>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process, it's best to provide as much information as possible or provide us with access to your test environment. This way, we can reproduce the issue for ourselves and come up with a solution quicker.</p><h3>About us</h3><p>At DizTech, we have established our reputation by prioritizing quality and speed. Our focus has been on developing over 50 high-quality Shopware 6 extensions, which you can find below, leading to our recognition as a Shopware Premium Extension Partner. We deeply value the importance of providing personal and fast support whenever you need it, and we draw inspiration from you, our valued customers. This approach enables us to create extensions that are tailored to your needs as well as the needs of your customers. To get to know us better, please visit our website at&nbsp;<a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<h2>Get started with the plugin:</h2><p><br></p><p></p><ul><li>Download the Optimalisation Faceted Navigation plugin from the Community Store</li><li>Activate the plugin in your Shopware 6 installation – this can be done via Extensions &gt; My Extensions &gt; Apps. Alternatively, you can use the \"Upload plugin\" button to upload the plugin ZIP file.</li><li>Your filter URL's will now be magically transformed in SEO friendly urls, describing the filters that are applied.</li></ul><p></p><p><br></p><h3>Configuration of dynamic content generation</h3><p><br></p><p></p><ul><li>Head over to Catalogues &gt; Properties.</li><li>Open the details of a property of your choice that has \"Display as product filters\" enabled.</li><li>Toggle the \"Include filter in faceted navigation\" switch, this will display additional configuration fields to configure the Faceted navigation behavior for that Filter property.</li><li>If you don't see the \"Include filter in faceted navigation\" switch, be sure to enable the \"Display in product filters\" switch.</li><li>If you like property to appear in front of the category name be sure to enter a position lower than 0 (e.g. -1 or -2). The value you enter here determines the order of the values in the generated title.</li><li>The conjunction field is used in case multiple options of a certain filter are selected. (e.g. red, green or blue)</li><li>The prefix field can be used to place a custom (translatable) word in front of the option name.</li><li>The suffix field can be used to place a custom (translatable) word after the option name.</li><li>Both the prefix and suffix are optional and serve to be used to increase the readability and correctness of the generated faceted category name.</li><li>Now open the details of a property value. Here you'll find two additional configuration fields: \"Adjective\" and \"Plural\". These are used during the generation process and will be the values presented in the final faceted navigation value.</li><li>Save the property and repeat above steps for every filterable property you like to include in the dynamic content generation.</li></ul><p></p><p><br></p><h3>Rendering unique content on your Storefront using our Custom CMS element</h3><p><br></p><p></p><ul><li>Now you have prepared your properties for their use in the generation of some beautifully unique category titles it is time to add our custom CMS element to your category layout.</li><li>Head over to to Shopping Experience layout of your choice and add a new block.</li><li>Select the \"Text\" blocks category and look for the element with the name: \"Faceted navigation text\"</li><li>Drag this block into your Shopping Experience and configure the template content to your liking, but be sure to leave the \"%faceted_navigation%\" alone.</li><li>Optional: You can add extra placeholders to the content of this CMS element by using the %filter_property_id% syntax (e.g. %filter_75f353b589d04bf48e8a9ab1f5422b0e%)</li></ul><p><br></p><h3>Contact your SEO specialist for advice on how to optimize your filter structure and faceted content for search engines!</h3><p></p>\n","shortDescription":"This extension enhances the URL structure and empowers you to create SEO content on the filter or manufacturer level. As a result, engaging content per filter combination.","highlights":"SEO friendly filter URL\nUnique content generation using a custom CMS element\nBoost your Google rank\nUp your click rate\nFully translatable content","features":"Custom placeholder for an auto generated filter category title\nFallback content with mail template like placeholders to include any category information you require.\nCustom filter placeholder to include your filters in your category descriptions\nFilter clearing, if the filter placeholder could not be populated it won't show up in your content\nJS disabled filtering to allow crawlers to index filter URLs"}],"addons":["ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":171623,"bookingKey":"zeobv79942489849","bookingText":"Readable filter URL's and unique filter content","price":495,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":171622,"bookingKey":"zeobv79942489849_M","bookingText":"Readable filter URL's and unique filter content","price":45,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPUhXwr","preview":true,"priority":0,"id":81023},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php16kE3m","preview":false,"priority":0,"id":81024},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAuGBcH","preview":false,"priority":0,"id":81025},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDG4ZIh","preview":false,"priority":0,"id":81026},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpS4hBXF","preview":false,"priority":0,"id":81027}],"comments":[],"ratingAverage":0,"label":"Lesbare Filter-URLs und einzigartige Filterinhalte.","description":"Verwandeln Sie die URLs Ihrer Shopware 6 Filter mit unserer leistungsstarken Erweiterung - SEO Friendly Filter URLs. Verabschieden Sie sich von \"hässlichen\" und nicht benutzerfreundlichen URLs und heißen Sie lesbare und SEO-optimierte URLs willkommen, die das Ranking Ihrer Website in Suchmaschinen verbessern. Diese Erweiterung verbessert nicht nur die URL-Struktur, sondern ermöglicht es auch Händlern, SEO-Inhalte auf der Filter- oder Herstellerebene zu erstellen. Dadurch können Sie einzigartige und ansprechende Inhalte für verschiedene Filterkombinationen erstellen und Ihren Kunden ein personalisiertes Erlebnis bieten.\n\n\n\n\n<h3>Vorteile</h3><h4>Verbessertes SEO-Ranking</h4><p>Mit SEO Friendly Filter URLs wird das SEO-Ranking Ihrer Website erheblich verbessert. Die Suchmaschinen-Bots können Ihre Seiten leichter durchsuchen und indexieren, was zu einer höheren Sichtbarkeit in den Suchergebnissen und einer Steigerung des organischen Website-Traffics führt.</p><h4>Eindeutige und ansprechende Inhalte</h4><p>Unsere Erweiterung ermöglicht es Händlern, benutzerdefinierte SEO-Inhalte für verschiedene Filterkombinationen zu erstellen. Diese Funktion ermöglicht es Ihnen, Ihre Inhalte auf spezifische Kundensegmente zuzuschneiden und Ihre Website für diverse Zielgruppen relevanter und ansprechender zu gestalten.</p><h4>Dynamische Kategorietitel</h4><p>Nutzen Sie Platzhalter in Kategorietiteln, um diese automatisch basierend auf den angewendeten Filtern anzupassen. Dieser dynamische Ansatz stellt sicher, dass Ihre Kategorietitel immer relevant sind und die angezeigten Produkte genau widerspiegeln, wodurch die SEO-Performance Ihrer Website weiter optimiert wird.</p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.diztech.nl</a>.</p>","installationManual":"<h2>Starten Sie mit dem Plugin:</h2><p><br /></p><p></p><ul><li>Laden Sie das Optimalisation Faceted Navigation Plugin aus dem Community Store herunter</li><li>Aktivieren Sie das Plugin in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun. Alternativ können Sie auch den Button \"Plugin hochladen\" verwenden, um die ZIP-Datei des Plugins hochzuladen.</li><li>Ihre Filter-URLs werden nun auf magische Weise in SEO-freundliche URLs umgewandelt, die die angewendeten Filter beschreiben.</li></ul><p></p><p><br /></p><p><br /></p><h3>Konfiguration der dynamischen Inhaltserstellung</h3><p><br /></p><p></p><ul><li>Gehen Sie zu Kataloge &gt; Eigenschaften.</li><li>Öffnen Sie die Details einer Eigenschaft Ihrer Wahl, für die \"Als Produktfilter anzeigen\" aktiviert ist.</li><li>Schalten Sie den Schalter \"Filter in die facettierte Navigation einbeziehen\" um. Dadurch werden zusätzliche Konfigurationsfelder angezeigt, mit denen Sie das Verhalten der facettierten Navigation für diese Eigenschaft Filter konfigurieren können.</li><li>Wenn Sie den Schalter \"Filter in die facettierte Navigation einbeziehen\" nicht sehen, stellen Sie sicher, dass Sie den Schalter \"In Produktfiltern anzeigen\" aktivieren.</li><li>Wenn Sie möchten, dass die Eigenschaft vor dem Kategorienamen angezeigt wird, geben Sie eine Position kleiner als 0 ein (z. B. -1 oder -2). Der Wert, den Sie hier eingeben, bestimmt die Reihenfolge der Werte im generierten Titel.</li><li>Das Feld Konjunktion wird verwendet, wenn mehrere Optionen eines bestimmten Filters ausgewählt werden. (z. B. rot, grün oder blau)</li><li>Das Präfix-Feld kann verwendet werden, um ein benutzerdefiniertes (übersetzbares) Wort vor den Optionsnamen zu setzen.</li><li>Das Suffix-Feld kann verwendet werden, um ein benutzerdefiniertes (übersetzbares) Wort hinter den Optionsnamen zu setzen.</li><li>Sowohl das Präfix als auch das Suffix sind optional und dienen dazu, die Lesbarkeit und Korrektheit des generierten facettierten Kategorienamens zu erhöhen.</li><li>Öffnen Sie nun die Details eines Eigenschaftswertes. Hier finden Sie zwei zusätzliche Konfigurationsfelder: \"Adjektiv\" und \"Plural\". Diese werden während des Generierungsprozesses verwendet und sind die Werte, die im endgültigen facettierten Navigationswert angezeigt werden.</li><li>Speichern Sie die Eigenschaft und wiederholen Sie die obigen Schritte für jede filterbare Eigenschaft, die Sie in die dynamische Inhaltserstellung aufnehmen möchten.</li></ul><p></p><p><br /></p><p><br /></p><h3>Rendering einzigartiger Inhalte auf Ihrer Storefront mit unserem Custom CMS Element</h3><p><br /></p><p></p><ul><li>Jetzt, wo Sie Ihre Eigenschaften für die Generierung einzigartiger Kategorietitel vorbereitet haben, ist es an der Zeit, unser benutzerdefiniertes CMS-Element zu Ihrem Kategorielayout hinzuzufügen.</li><li>Gehen Sie zu dem Shopping Experience Layout Ihrer Wahl und fügen Sie einen neuen Block hinzu.</li><li>Wählen Sie die Kategorie \"Textblöcke\" und suchen Sie nach dem Element mit dem Namen \"Facettierter Navigationstext\".</li><li>Ziehen Sie diesen Block in Ihr Einkaufserlebnis und konfigurieren Sie den Inhalt der Vorlage nach Ihren Wünschen, aber achten Sie darauf, dass Sie das \"%faceted_navigation%\" weglassen.</li><li>Optional: Sie können zusätzliche Platzhalter zum Inhalt dieses CMS-Elements hinzufügen, indem Sie die %filter_property_id%-Syntax verwenden (z. B. %filter_75f353b589d04bf48e8a9ab1f5422b0e%)</li></ul><p><br /></p><h3>Lassen Sie sich von Ihrem SEO-Spezialisten beraten, wie Sie Ihre Filterstruktur und Ihre facettierten Inhalte für Suchmaschinen optimieren können!</h3><p></p>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<p>-   Introduced compatibility for Shopware 6.5.0</p><p><br /></p>","creationDate":{"date":"2023-04-13 11:39:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- Changed ListingCmsElementResolverDecorator dependency to CmsElementResolverInterface to improve decoratability.</p><p><br /></p>","creationDate":{"date":"2022-10-24 09:32:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Improve slug generation to better support German special characters. Slug regeneration is required!</p><p>- Added slug regeneration action to plugin configuration.</p>","creationDate":{"date":"2022-10-06 13:26:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>- Patch to avoid exception or redirect loop when the REDIRECT_URL server parameter is not present.</p><p>- Added new feature which allows the shop owner to configure SEO content on property option level which can be placed in a Category Shopping Experience via a placeholder</p><p>- Fixed small bug in values containing a ','</p>","creationDate":{"date":"2022-09-09 11:37:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- Changed ListingCmsElementResolver into a decorator to increase compatibility with other plugins</p><p><br /></p>","creationDate":{"date":"2022-06-04 02:50:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"- Re-adding missing Shopware headers which got removed after cloning the request.","creationDate":{"date":"2022-04-26 12:22:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"- Resolved another routing issue in combination with a specific trailing slash configuration. <p>- Resolved error on search pages due to missing filterParams variable.</p>","creationDate":{"date":"2022-04-26 10:26:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- Resolved another redirect issue related to SEO urls with a trailing slash, resulting in an infinite redirect loop.","creationDate":{"date":"2022-04-01 09:36:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"- Resolved redirect issue caused by incompatibility with the 'Instead of setting Canonical URLs directly redirect via HTTP 301 to the current URL' option","creationDate":{"date":"2022-03-29 15:54:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- Resolved sorting issue and replaced getCustomFields with getTranslation('customFields') to avoid language system issues","creationDate":{"date":"2022-03-28 19:27:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- Resolved error on installation for empty fallback languages.","creationDate":{"date":"2022-03-28 14:29:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- First version of the SEO optimization faceted navigation plugin for Shopware 6","creationDate":{"date":"2022-01-27 15:04:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv79942489849","redirectToStore":false,"lowestPriceValue":45}