{"id":14784,"name":"ZeobvBestPracticeCheckout","code":"zeobv58372766564","lastChange":{"date":"2023-07-19 16:32:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRpKEiL","examplePageUrl":"","moduleKey":"ZeobvBestPracticeCheckout","creationDate":{"date":"2022-02-18 13:51:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-04-19 10:12:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-04-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-03-22 15:16:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":25744,"name":"Best Practice Checkout","description":"<p>Untersuchungen haben ergeben, dass <b>die durchschnittliche Abbruchrate bei 68,53% liegt, wobei komplexe und zeitaufwändige Checkouts die Hauptursache sind</b>.* Wir haben es uns zur Aufgabe gemacht, diese Zahl zu senken, und genau das tut das Best Practice Checkout Plugin für Sie! <b>Wir haben mit den Experten von Molliezusammengearbeitet</b> und alle bisher bekannten Best Practices in einem einzigen Plugin zusammengefasst. Zusätzlich stehen Ihnen mehrere anpassbare Feldoptionen zur Verfügung, mit denen Sie den Checkout nach Ihren eigenen Vorstellungen gestalten können.</p><p><i>&nbsp;* Baymard Institute &amp; Google (2015)&nbsp;</i></p><h3>Vorteile&nbsp;</h3><p><b>Ein von Experten geprüfter Checkout!</b></p><p>Gemeinsam mit Mollie, einem Unternehmen mit mehr als zwei Jahrzehnten Erfahrung in den Bereichen Konvertierung und Zahlung, haben wir dieses Plugin entwickelt, um einen möglichst zuverlässigen und vollständigen Checkout zu gewährleisten. Wir haben eingehende Untersuchungen darüber angestellt, was funktioniert und was nicht, was zu einer Steigerung der Konversionsrate von über 20% geführt hat!</p><p><b>Zufriedene neue und wiederkehrende Kunden&nbsp;</b></p><p>Ständig ihre Daten ausfüllen zu müssen, kann für Verbraucher sehr frustrierend sein. Der Best-Practice-Checkout verhindert dies, indem er die Felder automatisch ausfüllt, sobald der Kunde seine E-Mail eingibt, und stellt so sicher, dass das Einkaufserlebnis so nahtlos wie möglich ist! Außerdem haben wir das Adressverwaltungssystem überarbeitet, so dass es für die Besucher einfacher und intuitiver ist, ihre aktuellen Adressdaten einzugeben oder zu ändern. Außerdem haben wir Sicherheitsmaßnahmen eingeführt, um eine sichere Umgebung zu gewährleisten.</p><p><b>Nach Belieben anpassbar&nbsp;</b></p><p>Wir haben Ihnen die Möglichkeit gegeben, benutzerdefinierte Felder für zusätzliche Kunden- oder Bestelldaten hinzuzufügen. Nutzen Sie diese nach Belieben, um zusätzliche und wichtige Informationen für Ihr Unternehmen zu sammeln oder um den Checkout einfach persönlicher und individueller zu gestalten.</p><h3>Noch nicht überzeugt?</h3><p>Zahlreiche Unternehmen aus verschiedenen Branchen haben den Best Practice Checkout bereits eingesetzt. Zum Beispiel haben die folgenden Shops das Plugin bereits in ihre Website integriert:</p><p><a href=\"https://www.holz-service-24.de/\" target=\"_blank\" rel=\"noreferrer\">https://www.holz-service-24.de/</a><br></p><a href=\"https://www.bridlery.com/\" target=\"_blank\" rel=\"noreferrer\">https://www.bridlery.com/</a>&nbsp;<p></p><h2><a href=\"https://zeos6test.hypernode.io\" target=\"_blank\" rel=\"noreferrer\">Oder probieren Sie es hier selbst aus!</a></h2><p></p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>Der Installationsvorgang</h3><p></p><ol><li>Installieren und aktivieren Sie das Plugin in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun. Stellen Sie sicher, dass</li><li>das Kontrollkästchen \"Inaktive Erweiterungen ausblenden\" deaktiviert ist und suchen Sie das Plugin \"Best Practice Checkout\".</li><li>Öffnen Sie die Plugin-Konfiguration über das horizontale Drei-Punkte-Menü.</li><li>Vergewissern Sie sich, dass der Schalter \"Kasse aktivieren\" für jeden Vertriebskanal, für den Sie die Kasse verwenden möchten, aktiviert ist.</li><li>Nach dem Speichern der Konfiguration und dem Leeren des Caches ist der Checkout nun für die entsprechenden Verkaufskanäle aktiv.</li></ol><h3>Zusätzliche Konfigurationsoptionen</h3><h4>Einstellungen zur Adresse</h4><p>Auf der Karte \"Adresseinstellungen\" können Sie eine CMS-Seite festlegen, die als Rückgabe- und Erstattungsrichtlinie verwendet werden soll. Dies ist sehr empfehlenswert, denn so erhalten Ihre Kunden die</p><p>Informationen zur Verfügung stellt, ohne dass der Kunde den Bestellvorgang abbrechen muss.</p><p>Suchen Sie nach der Karte \"Einstellungen für die Adressvalidierung\", um einen Adressvalidierungsdienst zu deaktivieren oder auszuwählen und zu konfigurieren.</p><p>Es ist auch möglich, eine Anzahl von Alleinstellungsmerkmalen festzulegen, die oben in der Kasse angezeigt werden. Die Icons werden in einem Format von 25x25 angezeigt. Es wird daher dringend empfohlen, verkleinerte Bilder mit den entsprechenden Abmessungen hochzuladen, um eine Beeinträchtigung der Seitengeschwindigkeit zu vermeiden.</p><h4>Benutzerdefinierte Felder</h4><p></p><ol><li>Wenn Sie zusätzliche Kunden- oder Bestelldaten in der Kaufabwicklung erfassen möchten, können Sie der Kaufabwicklung benutzerdefinierte Felder hinzufügen.</li><li>Navigieren Sie zu Einstellungen &gt; System &gt; Benutzerdefinierte Felder und erstellen Sie einen neuen Satz benutzerdefinierter Felder</li><li>Vergeben Sie eine beschreibende Bezeichnung für die Verwendung in der Verwaltung und wählen Sie \"Best Practice Checkout\" in der Dropdown-Liste \"Zuweisen zu\".</li><li>Nach Auswahl der Option \"Best Practice Checkout\" erscheinen 2 neue Felder \"Kundengruppe\" und \"Standort\".</li><li>Wählen Sie Kundengruppe, wenn Sie möchten, dass die Felder nur für eingeloggte Benutzer einer bestimmten Kundengruppe angezeigt werden.</li><li>Verwenden Sie das Feld Standort, um festzulegen, wo die Felder angezeigt werden sollen.</li></ol><ul><li>Die Option \"Vor der Schaltfläche \"Kasse\"\" fügt automatisch \"Bestellung\" zur Dropdown-Liste \"Zuordnen zu\" hinzu, da sie Daten auf der Ebene der Bestellung erfasst.</li><li>Die Option \"Ende des Adressbereichs\" fügt automatisch \"Kunde\" zur Dropdown-Liste \"Zuordnen zu\" hinzu, da sie Daten auf Kundenebene erfasst.</li></ul><h4>Über die Option zum Zusammenführen/Teilen von Straße und Hausnummer</h4><p>Seit v1.0.9 bieten wir die Konfigurationsoption, die Straße und die Hausnummer, die vom Benutzer in zwei getrennten Feldern angegeben werden, zusammenzuführen.</p><p>Dies kann für die Integration mit bestimmten ERP-Systemen und für die Kompatibilität mit dem nativen Shopware-Registrierungsprozess nützlich sein, bei dem die Straße und die Hausnummer in einem einzigen Feld mit der Bezeichnung \"Straße\" eingegeben werden. in einem einzigen Feld eingegeben werden, das normalerweise \"Straße\" oder \"Adresse\" heißt.</p><p>Es ist gut zu wissen, dass bei der Verwendung dieser Option einige Einschränkungen oder kleine Risiken zu beachten sind.</p><p>Straßenadressen sind in verschiedenen Ländern sehr unterschiedlich und dynamisch, was das Lesen der Hausnummer + optionalem Zusatz ziemlich schwierig macht.</p><p>Wir haben einen Algorithmus geschrieben, der eine ganze Reihe von Adressformaten unterstützt, aber wir haben nicht die Lösung, um jedes einzelne Adressformat zu unterstützen.</p><p>Aus diesem Grund kann es vorkommen, dass die Adresse in einigen Fällen falsch aufgeteilt wird, was dazu führt, dass der falsche Teil der Adresse im falschen Feld erscheint.</p><p>Das ist nichts, was zu Eingabefehlern oder einem Abbruch der Konvertierung führen sollte, aber es könnte zu Verwirrung beim Kunden führen, wenn eine Adresse, die zuvor eingegeben wurde, plötzlich anders dargestellt wird.</p><p>Nehmen Sie das folgende Beispiel:</p><p>Der Kunde gibt die folgenden Werte ein:</p><p></p><ul><li><b>Straße</b>: <i>17. 11 Downing Street</i></li><li><b>Nr. + Nebenstelle:</b><i>75 A</i></li><li><b>Land</b>: <i>Vereinigtes Königreich</i></li></ul><p>Dies führt zu der folgenden Ausgabe in Ihrer Datenbank und wird dem Benutzer in seiner Adresskartei angezeigt.</p><p></p><ul><li>&nbsp; <b>Straße</b>: <i>75 A 17th 11 downing street</i></li></ul><p>Jetzt ist alles gut (beachten Sie, dass die Eingabe des Feldes \"Nr + ext.\" vor der Straße steht, da es sich hier um eine britische Adresse handelt).</p><p>Wenn der Benutzer nun seine Adresse mit dem Adressmanager in der Kasse bearbeiten möchte, kann etwas Seltsames passieren, dem Kunden werden die folgenden Werte angezeigt:</p><p></p><ul><li><b>Straße</b>: <i>A 17th 11 Downing Street</i></li><li><b>Nr</b>.<b> + Durchwahl:</b><i>75</i></li></ul><p>In diesem Beispiel wurde die Durchwahl vergessen und im Feld Straße stehen gelassen.</p><p>Dieser Fehler könnte vom Kunden übersehen werden und er wäre verwirrt, dass das \"A\" im Feld \"Nr + ext\" fehlt und würde es erneut eingeben. Speichern der Adresse zu folgendem Ergebnis führen würde:</p><p><b>Straße</b>: <i>75 A A 17. 11 Downing Street</i></p><p>Wie Sie in bestimmten Fällen feststellen können, kann dies zu kleinen Fehlern bei der Adressänderung führen.</p><p>In Kombination mit einem Adressvalidierungsdienst wie Postcode NL oder Google Places werden die meisten Fehler jedoch erkannt und aufgrund der Feldvalidierung ist die Fehlermarge viel geringer als bei der Verwendung des nativen Feldes \"Straße\", was dazu führt, dass viele Kunden vergessen, ihre Straße/Hausnummer einzugeben.</p><p>Abschließend möchten wir Sie bitten, uns zu kontaktieren, wenn Sie Bedenken haben oder Adressformate finden, die wir nicht berücksichtigt haben. Wir werden uns bemühen, den Algorithmus zu optimieren den Algorithmus zu optimieren, um so viele Fehler wie möglich zu finden.</p>","shortDescription":"Diese Best-Practice-Kaufabwicklung wird Ihnen einen sofortigen Konversionsanstieg von 20 % bescheren - Sie glauben es nicht? Probieren Sie es einen Monat lang kostenlos aus.","highlights":"Erstellt in Zusammenarbeit mit der Zahlungs- und Konvergenzexpertin Mollie!\nUmsetzung aller bisher bekannten bewährten Praktiken, um einen möglichst vollständigen Checkout zu gewährleisten.\nGeprüft und empfohlen von Experten auf dem Gebiet der Kassentechnologien.\nVollständig anpassbar, um es an Ihre eigenen Wünsche und Vorlieben anzupassen.\nStändige Recherchen und Verbesserungen an Ihrer Kasse, ohne einen einzigen Finger zu rühren.","features":"Verbessertes Adressmanagement.\nEinseitiger Checkout mit Fokus auf das Wesentliche.\nAdressüberprüfung und automatische Vervollständigung mit der Google Places Autocomplete API.\nRegelbasierte Zustellungsauswahl, die es den Kunden ermöglicht, einen Zustellungszeitpunkt und eine Zustellungsmethode sowie die bevorzugte Zahlungsmethode zu wählen.\nOptionale Newsletter-Anmeldung beim Checkout.\nUmwandlung von Gästen in Kunden, indem Sie Ihren Besuchern ein optionales Passwortfeld und Gründe für die Erstellung eines Kundenkontos anbieten.\nUnterstützung für Offcanvas Warenkorb-management.\nBieten Sie Ihren Kunden direkt Informationen zu den Richtlinien an, z. B. zum Datenschutz, zur Rückerstattung und zur Rückgabe, sowie zu den Vertragsbedingungen ohne die checkout-Seite zu verlassen.\nKonfigurierbar und reaktionsschnell einzigartige Verkaufsargumente.\nBenutzerdefinierte Felder für zusätzliche Daten, z. B. zusätzliche Auftrags- oder Kundendaten."},{"id":25745,"name":"Best Practice Checkout","description":"<p>According to research, <b>the average cart abandonment rate is 68.53%</b>, with complex and<b> time-consuming checkouts </b>being <b>the main cause</b>.* Our mission is to lower this number, which is exactly what the Best Practice Checkout plugin does for you! <b>We have collaborated with experts from Mollie </b>and combined all of the well-known best practices to date and combined them into a single plugin. Additionally, you have several customizable field options at your disposal, enabling you to adjust the checkout to your own liking.</p><p><i>* Baymard Institute &amp; Google (2015) </i></p><h3>Advantages</h3><p><b>A checkout approved by experts!</b></p><p>Together with Mollie, a company with over two decades of expertise in both conversion and payment, we created this plugin to ensure the most reliable and complete checkout possible. We did extensive research about what does and does not work, leading to an increase in conversion rate of over 20%!</p><p><b>Satisfy new and recurring customers</b></p><p>Continuously having to fill out their details might frustrate consumers tremendously. The Best Practice Checkout prevents this by autocompleting the fields for them as soon as they enter their email, making sure their experience is as seamless as possible! Besides, we overhauled the address management system, making it easier and more intuitive for visitors to enter or modify their current address data. Additionally, we have implemented security measures to ensure a safe and secure environment.</p><p><b>Customizable to your liking</b></p><p>We have given you the opportunity to add custom fields for additional customer or order data. Use these to your liking to collect additional and crucial information for your business or use them to simply make the checkout more personal and customized.</p><p>Still not convinced?</p><p>Multiple businesses from different industries have adopted the Best Practice Checkout already. For example, the following shops have incorporated the plugin into their website already:</p><p></p><ul><li><a href=\"https://www.holz-service-24.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.holz-service-24.de/</a></li><li><a href=\"https://www.bridlery.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.bridlery.com/</a></li></ul><p></p><h2><a href=\"https://zeos6test.hypernode.io/\" target=\"_blank\" rel=\"noreferrer noopener\">Or try it for yourself here!</a></h2><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the extension changed or improved, contact us via the Shopware support portal by selecting the extension or by sending a message to <b>support@diztech.nl</b>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process, it's best to provide as much information as possible or provide us with access to your test environment. This way, we can reproduce the issue for ourselves and come up with a solution quicker.</p><h3>About us</h3><p>At DizTech, we have established our reputation by prioritizing quality and speed. Our focus has been on developing over 50 high-quality Shopware 6 extensions, which you can find below, leading to our recognition as a Shopware Premium Extension Partner. We deeply value the importance of providing personal and fast support whenever you need it, and we draw inspiration from you, our valued customers. This approach enables us to create extensions that are tailored to your needs as well as the needs of your customers. To get to know us better, please visit our website at&nbsp;<a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>The installation process</h3><p></p><ol><li>Install and activate the plugin in your Shopware 6 installation – this can be done via Extensions &gt; My Extensions &gt; Apps. Make sure that</li><li>the \"Hide inactive extensions\" check is disabled and locate the \"Best Practice Checkout\" plugin.</li><li>Open the plugin configuration using the horizontal three-dot menu.</li><li>Make sure the \"Enable checkout\" switch is activated for every Sales Channel you intend to use the checkout on.</li><li>After saving the configuration and clearing the cache the checkout will now be active on the corresponding Sales Channels.</li></ol><h3>Additional configuration options</h3><h4>Address settings</h4><p></p><ol><li>Within the \"Address settings\" card you can set a CMS Page to be used as Return and Refund policy. This is highly recommended since it provides your customer with</li><li>information that they are looking for without them having to abandon the checkout.</li><li>Look for the \"Address Validation Settings\" card to disable or select and configure an address validation service.</li><li>It is also possible to set a number of Unique Selling Points which will be displayed at the top of the checkout. Icons will be displayed in a format of 25x25, so it's highly recommended to upload minimized images with corresponding dimensions to avoid an impact on the page speed.</li></ol><h4>Custom fields</h4><p></p><ol><li>If you like to catch extra customer or order data in the checkout you can add custom fields to the checkout.</li><li>Navigate to Settings &gt; System &gt; Custom Fields and create a new custom field set</li><li>Assign a descriptive label for use in the admin and select \"Best Practice Checkout\" in the \"Assign to\" dropdown.</li><li>After selecting the \"Best Practice Checkout\" option 2 new fields will appear \"Customer Group\" and \"Location\"</li><li>Select customer group if you only want the fields to appear for logged-in users under a certain customer group.</li><li>Use the location field to determine where the fields will show up.</li></ol><ul><li>&nbsp; The \"Before checkout button\" option will automatically add \"order\" to the \"Assign to\" dropdown since it will catch data on the order level.</li><li>&nbsp; The \"End of address section\" option will automatically add \"customer\" to the \"Assign to\" dropdown since it will catch data on the customer level.</li></ul><h3>About the option to merge/split street and house number</h3><p>Since v1.0.9 we offer the configuration option to merge the street and house number which are given by the user in two separate fields.</p><p>This can be handy for integrating with certain ERP systems and for compatibility with the native Shopware registration process where the street and street number and</p><p>received in a single field usually named \"Street\" or \"Address\".</p><p>It is good to know that there are some limitations or small risks to be taken into account by using this option.</p><p>Street addresses are very diverse and dynamic for different countries, this makes reading the house number + optional addition quite a difficult thing to do.</p><p>We've written an algorithm that supports quite a range of address formats, but don't have the solution to support every single address format.</p><p>Because of this, it might happen that in some cases the address gets split incorrectly which results in the wrong part of the address appearing in the wrong field.</p><p>This is not something that should result in input errors or break conversion, but it could result in some confusion for the customer when an address that was entered before all of a sudden gets presented in a different way.</p><p>Take the following example:</p><p>The customer enters the following values:</p><p></p><ul><li><b>Street</b>: <i>17th 11 downing street</i></li><li><b>Nr + ext.</b>: <i>75 A</i></li><li><b>Country</b>: <i>United Kingdom</i></li></ul><p></p><p>This will result in the following output in your database and presented to the user in his address card.</p><p></p><ul><li><b>Street</b>: <i>75 A 17th 11 downing street</i></li></ul><p></p><p>All is good at this point (note the input of the \"Nr + ext.\" field is put in front of the street since we are dealing with a UK address here).</p><p>Now the user wants to edit his address using the address manager in the checkout, this is where something strange might happen, the customer will be presented with the following values:</p><p></p><ul><li><b>Street</b>: <i>A 17th 11 downing street</i></li><li><b>Nr + ext.</b>: <i>75</i></li></ul><p></p><p>In this example the extension was missed and left in the street field.</p><p>This error could be missed by the customer and he would be confused that the \"A\" is missing from the \"Nr + ext\" field and re-add it, which on</p><p>saving the address would lead to the following:</p><p></p><ul><li><b>Street</b>: <i>75 A A 17th 11 downing street</i></li></ul><p></p><p>As you can in specific cases this might lead to small errors occurring during address modification.</p><p>It should be noted though that in combination with using the address validation service like Postcode NL or Google places most errors will be</p><p>caught and because of the field validation in place, the error margin will be much lower than it would be when using the native \"Street\" field</p><p>resulting in many customers forgetting to enter their street/house number.</p><p>As a final note, please contact us if you have any concerns or find address formats that we haven't accounted for. We'll strive to keep optimizing</p><p>the algorithm to catch as many errors as possible.</p><p></p>","shortDescription":"Our optimized checkout can boost your conversion by 20%. Want to test it? We're offering a free one-month trial – and guarantee you'll love the results. Read more about it here.","highlights":"Created in collaboration with payment and conversion expert Mollie!\nImplementation of all previously known best practices to ensure the most complete checkout possible.\nLightning-fast due to the use of Progressive Web App technology.\nReviewed and recommended by experts in the area of checkout technologies.\nFully customizable to adjust it to your own desires and preferences.","features":"Enhanced address management.\nSingle page checkout with a focus on what actually matters.\nAddress validation and auto-completion using the Google Places Autocomplete API.\nRule-based delivery selections, allowing customers to choose a delivery moment and method, along with their preferred payment method.\nOptional newsletter signup option on checkout.\nGuest-to-customer conversion by presenting your visitors with an optional password field and reasons to create a customer account.\nOffcanvas cart management support.\nOffer customers policy information directly, such as information about yo ur privacy, refund, and return policies, along with the terms of agreement without leaving the checkout page.\nConfigurable and responsive Unique Selling Points.\nCustom Fields for additional data, such as extra order or customer data."}],"addons":["highlightInListing","ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":171575,"bookingKey":"zeobv58372766564","bookingText":"Best Practice Checkout","price":990,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":171574,"bookingKey":"zeobv58372766564_M","bookingText":"Best Practice Checkout","price":35,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCVvQPF","preview":true,"priority":110,"id":87755},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM18PZe","preview":false,"priority":100,"id":84878},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php939Lsx","preview":false,"priority":90,"id":87752},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpn0cE2u","preview":false,"priority":70,"id":87753},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptIjIC9","preview":false,"priority":60,"id":87754},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRq1WvL","preview":false,"priority":50,"id":85608},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTUMhH9","preview":false,"priority":40,"id":85606},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQ5LFMm","preview":false,"priority":0,"id":86667},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoQxMzP","preview":false,"priority":0,"id":86668},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFz9gZw","preview":false,"priority":0,"id":86669},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpea6wdS","preview":false,"priority":0,"id":86670},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphoPcQM","preview":false,"priority":0,"id":87365}],"comments":[{"authorName":"Tobias Plehn","text":"Wir haben gefühlt alle Checkout-Lösungen getestet, da uns der Shopware-Standard-Checkout nicht gefällt - verglichen mit den Lösungen von Shopify und Co.. Dieses Plugin weist für uns die beste Usability auf. Zu Beginn hatten wir einige Kompatibilitätsprobleme mit von uns eingesetzten Plugins. Diese wurden sehr schnell analysiert und die Kompatibilität hergestellt. Auch Sonderwünsche wurden zügig umgesetzt. Dieses Plugin und insbesondere dieser Hersteller können uneingeschränkt empfohlen werden. Danke!","headline":"Exzellenter und sehr schneller Kunden-Support","creationDate":{"date":"2023-01-25 17:33:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Steven de Haan","text":"The checkout works like other big websites. The checkout makes it for customers easy to work with . Also a lot of options you can add.","headline":"Great Checkout","creationDate":{"date":"2022-09-12 10:54:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Khalil Bijjou","text":"Vor der Migration auf Shopwar 6 war es uns wichtig, dass wir einen benutzerfreundlichen, simplen und konvertierungsstarken Checkout finden. Lange Zeit fand sich nichts und wir waren vom Klarna Checkout in Shopware 5 verwöhnt.\n\nAls dieser Checkout veröffentlicht worden ist, habe ich diesen sofort getestet und war endlos glücklich, einen solch guten Checkout zu finden. Bis heute frage ich mich, warum die anderen Checkout-Plugins so kompliziert gebaut worden sind. \n\nAuch der Support von Gydo war einwandfrei: sehr kurze Antwortzeiten und schnelle Lösungen! Er fragt ständig nach Feedback. \n\nVielen Dank für das tolle Plugin!","headline":"Was soll ich sagen.. der beste Checkout für Shopware 6!","creationDate":{"date":"2022-07-06 16:38:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Best Practice Checkout","description":"<p>Untersuchungen haben ergeben, dass <b>die durchschnittliche Abbruchrate bei 68,53% liegt, wobei komplexe und zeitaufwändige Checkouts die Hauptursache sind</b>.* Wir haben es uns zur Aufgabe gemacht, diese Zahl zu senken, und genau das tut das Best Practice Checkout Plugin für Sie! <b>Wir haben mit den Experten von Molliezusammengearbeitet</b> und alle bisher bekannten Best Practices in einem einzigen Plugin zusammengefasst. Zusätzlich stehen Ihnen mehrere anpassbare Feldoptionen zur Verfügung, mit denen Sie den Checkout nach Ihren eigenen Vorstellungen gestalten können.</p><p><i> * Baymard Institute &amp; Google (2015) </i></p><h3>Vorteile </h3><p><b>Ein von Experten geprüfter Checkout!</b></p><p>Gemeinsam mit Mollie, einem Unternehmen mit mehr als zwei Jahrzehnten Erfahrung in den Bereichen Konvertierung und Zahlung, haben wir dieses Plugin entwickelt, um einen möglichst zuverlässigen und vollständigen Checkout zu gewährleisten. Wir haben eingehende Untersuchungen darüber angestellt, was funktioniert und was nicht, was zu einer Steigerung der Konversionsrate von über 20% geführt hat!</p><p><b>Zufriedene neue und wiederkehrende Kunden </b></p><p>Ständig ihre Daten ausfüllen zu müssen, kann für Verbraucher sehr frustrierend sein. Der Best-Practice-Checkout verhindert dies, indem er die Felder automatisch ausfüllt, sobald der Kunde seine E-Mail eingibt, und stellt so sicher, dass das Einkaufserlebnis so nahtlos wie möglich ist! Außerdem haben wir das Adressverwaltungssystem überarbeitet, so dass es für die Besucher einfacher und intuitiver ist, ihre aktuellen Adressdaten einzugeben oder zu ändern. Außerdem haben wir Sicherheitsmaßnahmen eingeführt, um eine sichere Umgebung zu gewährleisten.</p><p><b>Nach Belieben anpassbar </b></p><p>Wir haben Ihnen die Möglichkeit gegeben, benutzerdefinierte Felder für zusätzliche Kunden- oder Bestelldaten hinzuzufügen. Nutzen Sie diese nach Belieben, um zusätzliche und wichtige Informationen für Ihr Unternehmen zu sammeln oder um den Checkout einfach persönlicher und individueller zu gestalten.</p><h3>Noch nicht überzeugt?</h3><p>Zahlreiche Unternehmen aus verschiedenen Branchen haben den Best Practice Checkout bereits eingesetzt. Zum Beispiel haben die folgenden Shops das Plugin bereits in ihre Website integriert:</p><p><a href=\"https://www.holz-service-24.de/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.holz-service-24.de/</a><br /></p><a href=\"https://www.bridlery.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.bridlery.com/</a> <p></p><h2><a href=\"https://zeos6test.hypernode.io\" target=\"_blank\" rel=\"noreferrer noopener\">Oder probieren Sie es hier selbst aus!</a></h2><p></p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>Der Installationsvorgang</h3><p></p><ol><li>Installieren und aktivieren Sie das Plugin in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun. Stellen Sie sicher, dass</li><li>das Kontrollkästchen \"Inaktive Erweiterungen ausblenden\" deaktiviert ist und suchen Sie das Plugin \"Best Practice Checkout\".</li><li>Öffnen Sie die Plugin-Konfiguration über das horizontale Drei-Punkte-Menü.</li><li>Vergewissern Sie sich, dass der Schalter \"Kasse aktivieren\" für jeden Vertriebskanal, für den Sie die Kasse verwenden möchten, aktiviert ist.</li><li>Nach dem Speichern der Konfiguration und dem Leeren des Caches ist der Checkout nun für die entsprechenden Verkaufskanäle aktiv.</li></ol><h3>Zusätzliche Konfigurationsoptionen</h3><h4>Einstellungen zur Adresse</h4><p>Auf der Karte \"Adresseinstellungen\" können Sie eine CMS-Seite festlegen, die als Rückgabe- und Erstattungsrichtlinie verwendet werden soll. Dies ist sehr empfehlenswert, denn so erhalten Ihre Kunden die</p><p>Informationen zur Verfügung stellt, ohne dass der Kunde den Bestellvorgang abbrechen muss.</p><p>Suchen Sie nach der Karte \"Einstellungen für die Adressvalidierung\", um einen Adressvalidierungsdienst zu deaktivieren oder auszuwählen und zu konfigurieren.</p><p>Es ist auch möglich, eine Anzahl von Alleinstellungsmerkmalen festzulegen, die oben in der Kasse angezeigt werden. Die Icons werden in einem Format von 25x25 angezeigt. Es wird daher dringend empfohlen, verkleinerte Bilder mit den entsprechenden Abmessungen hochzuladen, um eine Beeinträchtigung der Seitengeschwindigkeit zu vermeiden.</p><h4>Benutzerdefinierte Felder</h4><p></p><ol><li>Wenn Sie zusätzliche Kunden- oder Bestelldaten in der Kaufabwicklung erfassen möchten, können Sie der Kaufabwicklung benutzerdefinierte Felder hinzufügen.</li><li>Navigieren Sie zu Einstellungen &gt; System &gt; Benutzerdefinierte Felder und erstellen Sie einen neuen Satz benutzerdefinierter Felder</li><li>Vergeben Sie eine beschreibende Bezeichnung für die Verwendung in der Verwaltung und wählen Sie \"Best Practice Checkout\" in der Dropdown-Liste \"Zuweisen zu\".</li><li>Nach Auswahl der Option \"Best Practice Checkout\" erscheinen 2 neue Felder \"Kundengruppe\" und \"Standort\".</li><li>Wählen Sie Kundengruppe, wenn Sie möchten, dass die Felder nur für eingeloggte Benutzer einer bestimmten Kundengruppe angezeigt werden.</li><li>Verwenden Sie das Feld Standort, um festzulegen, wo die Felder angezeigt werden sollen.</li></ol><ul><li>Die Option \"Vor der Schaltfläche \"Kasse\"\" fügt automatisch \"Bestellung\" zur Dropdown-Liste \"Zuordnen zu\" hinzu, da sie Daten auf der Ebene der Bestellung erfasst.</li><li>Die Option \"Ende des Adressbereichs\" fügt automatisch \"Kunde\" zur Dropdown-Liste \"Zuordnen zu\" hinzu, da sie Daten auf Kundenebene erfasst.</li></ul><h4>Über die Option zum Zusammenführen/Teilen von Straße und Hausnummer</h4><p>Seit v1.0.9 bieten wir die Konfigurationsoption, die Straße und die Hausnummer, die vom Benutzer in zwei getrennten Feldern angegeben werden, zusammenzuführen.</p><p>Dies kann für die Integration mit bestimmten ERP-Systemen und für die Kompatibilität mit dem nativen Shopware-Registrierungsprozess nützlich sein, bei dem die Straße und die Hausnummer in einem einzigen Feld mit der Bezeichnung \"Straße\" eingegeben werden. in einem einzigen Feld eingegeben werden, das normalerweise \"Straße\" oder \"Adresse\" heißt.</p><p>Es ist gut zu wissen, dass bei der Verwendung dieser Option einige Einschränkungen oder kleine Risiken zu beachten sind.</p><p>Straßenadressen sind in verschiedenen Ländern sehr unterschiedlich und dynamisch, was das Lesen der Hausnummer + optionalem Zusatz ziemlich schwierig macht.</p><p>Wir haben einen Algorithmus geschrieben, der eine ganze Reihe von Adressformaten unterstützt, aber wir haben nicht die Lösung, um jedes einzelne Adressformat zu unterstützen.</p><p>Aus diesem Grund kann es vorkommen, dass die Adresse in einigen Fällen falsch aufgeteilt wird, was dazu führt, dass der falsche Teil der Adresse im falschen Feld erscheint.</p><p>Das ist nichts, was zu Eingabefehlern oder einem Abbruch der Konvertierung führen sollte, aber es könnte zu Verwirrung beim Kunden führen, wenn eine Adresse, die zuvor eingegeben wurde, plötzlich anders dargestellt wird.</p><p>Nehmen Sie das folgende Beispiel:</p><p>Der Kunde gibt die folgenden Werte ein:</p><p></p><ul><li><b>Straße</b>: <i>17. 11 Downing Street</i></li><li><b>Nr. + Nebenstelle:</b><i>75 A</i></li><li><b>Land</b>: <i>Vereinigtes Königreich</i></li></ul><p>Dies führt zu der folgenden Ausgabe in Ihrer Datenbank und wird dem Benutzer in seiner Adresskartei angezeigt.</p><p></p><ul><li>  <b>Straße</b>: <i>75 A 17th 11 downing street</i></li></ul><p>Jetzt ist alles gut (beachten Sie, dass die Eingabe des Feldes \"Nr + ext.\" vor der Straße steht, da es sich hier um eine britische Adresse handelt).</p><p>Wenn der Benutzer nun seine Adresse mit dem Adressmanager in der Kasse bearbeiten möchte, kann etwas Seltsames passieren, dem Kunden werden die folgenden Werte angezeigt:</p><p></p><ul><li><b>Straße</b>: <i>A 17th 11 Downing Street</i></li><li><b>Nr</b>.<b> + Durchwahl:</b><i>75</i></li></ul><p>In diesem Beispiel wurde die Durchwahl vergessen und im Feld Straße stehen gelassen.</p><p>Dieser Fehler könnte vom Kunden übersehen werden und er wäre verwirrt, dass das \"A\" im Feld \"Nr + ext\" fehlt und würde es erneut eingeben. Speichern der Adresse zu folgendem Ergebnis führen würde:</p><p><b>Straße</b>: <i>75 A A 17. 11 Downing Street</i></p><p>Wie Sie in bestimmten Fällen feststellen können, kann dies zu kleinen Fehlern bei der Adressänderung führen.</p><p>In Kombination mit einem Adressvalidierungsdienst wie Postcode NL oder Google Places werden die meisten Fehler jedoch erkannt und aufgrund der Feldvalidierung ist die Fehlermarge viel geringer als bei der Verwendung des nativen Feldes \"Straße\", was dazu führt, dass viele Kunden vergessen, ihre Straße/Hausnummer einzugeben.</p><p>Abschließend möchten wir Sie bitten, uns zu kontaktieren, wenn Sie Bedenken haben oder Adressformate finden, die wir nicht berücksichtigt haben. Wir werden uns bemühen, den Algorithmus zu optimieren den Algorithmus zu optimieren, um so viele Fehler wie möglich zu finden.</p>","version":"2.2.0","changelog":[{"version":"2.2.0","text":"<p>-   Bugfix in address splitting</p><p>-   Improved presentation of scrollbar in cart summary</p><p>-   Improved presentation of line item delete button in cart summary</p><p>-   Sustainability update allowing customers to offset their carbon footprint by supporting climate action</p><p><br /></p>","creationDate":{"date":"2023-06-28 11:07:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>-   Fixed bug in Mollie credit card component causing a Test mode error</p><p>-   Added help text with a new snippet 'zeobv-bpc.address.vatIdInfo' for the Vat ID field</p><p>-   Hid required asterisk for skeleton fields</p><p><br /></p>","creationDate":{"date":"2023-06-26 11:57:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>-   6.5.0 compatibility update</p><p><br /></p>","creationDate":{"date":"2023-06-19 16:42:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<p>- Fixed bug in Mollie credit card component causing a Test mode error</p><p>- Added help text with a new snippet 'zeobv-bpc.address.vatIdInfo' for the Vat ID field</p><p>- Hid required asterisk for skeleton fields</p><p><br /></p>","creationDate":{"date":"2023-06-26 11:18:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>- Added email confirmation support</p><p><br /></p>","creationDate":{"date":"2023-06-26 11:18:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>-   Added custom field support for the address form</p><p><br /></p>","creationDate":{"date":"2023-01-19 16:13:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>-   Fix for session loss on guest to customer conversion</p><p><br /></p>","creationDate":{"date":"2022-12-02 14:47:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>-   Upgraded all requests to use pure store-api routes resulting in a big performance increase</p><p><br /></p>","creationDate":{"date":"2022-11-30 10:04:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>-   Optimized the performance of the /checkout/confirm page by initializing the checkout from data available in TWIG</p><p><br /></p>","creationDate":{"date":"2022-11-28 14:46:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>-   Fix for Mollie Credit Card component validation issue</p><p>-   Fix for PayPal SEPA incompatibility</p>","creationDate":{"date":"2022-11-13 10:30:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.12","text":"<p>- Fixed Google places autocomplete highlighting issue</p><p><br /></p>","creationDate":{"date":"2022-10-13 16:24:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p>- Removed jQuery dependency</p><p>- Improved Google address autocomplete UX</p>","creationDate":{"date":"2022-07-20 12:40:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<p>- Added feature to configure custom fields for the checkout page.</p><p><br /></p>","creationDate":{"date":"2022-07-07 16:49:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>- Added option to merge and split the customer street and street number. Still experimental, if we missed any formats or something is not working as expected please contact us as soon as possible. See FAQ for supported street formats and further information on how we perform the splitting/merging of the street and street number.</p>","creationDate":{"date":"2022-06-08 03:30:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>- Performance update</p><p><br /></p>","creationDate":{"date":"2022-06-03 09:20:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"- Hotfix to postcodeNL autocomplete","creationDate":{"date":"2022-06-01 01:43:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- Added international address autocompletion support with Google Places integration.</p><p>- Added checkout status texts to keep the customer informed and engaged in the placing of the order and initiation of the payment.</p><p>- Fixed bug that in certain cases caused the checkout to fail.</p><p>- Fixed bug in passing of delivery moment information to order if a guest to customer registration was performed.</p><p><br /></p>","creationDate":{"date":"2022-05-31 04:24:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"- Made e-mail address editable for guest users","creationDate":{"date":"2022-05-12 17:10:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- Made ToS checkbox optional</p><p>- Fixed translation in configuration</p><p>- Improved spacing of password field when comment field is disabled</p><p>- Improved styling of country select box</p>","creationDate":{"date":"2022-05-09 13:27:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- Added help texts for email, birthday and phone number fields.</p><p>- Improved UX of birthday field.</p><p>- Added custom regular expression validation for zipcode field for German and Dutch addresses with fallback on a more flexible validation.</p><p><br /></p>","creationDate":{"date":"2022-05-03 11:35:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- Improved address management user experience.","creationDate":{"date":"2022-05-01 11:35:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Various improvements to the general flow</p><p>- Fixed small bug in Mollie Credit Card components</p><p>- Added cart recovery compatibility for Shopware &gt;6.4.10</p><p>- Added option to hide Salution field</p>","creationDate":{"date":"2022-04-28 16:28:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- First version of the Conversion Checkout for Shopware 6","creationDate":{"date":"2022-02-18 14:35:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv58372766564","redirectToStore":false,"lowestPriceValue":35}