{"id":14791,"name":"HeGuDeliveryTimeAsDate","code":"HeGu460599473764","lastChange":{"date":"2023-07-18 11:16:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1wBMsn","examplePageUrl":"","moduleKey":"HeGuDeliveryTimeAsDate","creationDate":{"date":"2022-02-21 14:49:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-02-22 15:12:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-02-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-29 11:53:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3412,"prefix":"HeGu","name":"Henrik Gurtmann","website":"//www.henrikgurtmann.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3412_shopware-store-icon.png"},"infos":[{"id":25758,"name":"Lieferzeit als Datum anzeigen","description":"<p>Mit dieser App zeigst du deinen Kunden die Lieferzeit deiner Artikel auf der Produktdetailseite als&nbsp;Datumsangabe an. Statt einer Angabe wie 1-2 Wochen wird dann eine genaue Angabe, zum Beispiel&nbsp;28.02.22 bis 07.03.22. Das gute: Du musst keine zusätzlichen Einstellungen oder Datenpflege vornehmen. Die App verwendet die Angabe der&nbsp;Lieferzeit aus dem Shopware Standard.</p><h3>Individuell einstellbares Format</h3><p>In den Einstellungen der App kannst du das Datumsformat individuell einstellen. Zusätzlich kann der Text für jede Sprache eingestellt werden, da diese als Textbausteine dynamisch eingebunden sind.&nbsp;Das Modul zur Verwaltung findest du in deiner Shopware Administration unter Einstellungen &gt; Shop &gt; Textbausteine.&nbsp;Folgende Textbausteine werden durch die App erstellt und können individuell angepasst werden:</p><ul><li>hegu.deliveryTimeAsDate.deliveryDate</li><li>hegu.deliveryTimeAsDate.deliveryDateBold<br></li></ul><p></p>","installationManual":"<h3>Installation der App</h3><p>Öffne die Shopware Administration deines Shopware Shops und klicke auf&nbsp;<b>Erweiterungen</b>&nbsp;&gt;&nbsp;<b>Meine Erweiterungen</b>. Anschließend klicke neben der App auf&nbsp;<b>App installieren</b>. Nach der Installation kannst du die App wie gewohnt aktivieren.</p><h3>Konfiguration der App</h3><p>Klicke neben der installierten und aktivierten App auf die drei Punkte am rechten Rand und anschließend auf&nbsp;<b>Konfiguration</b>. In der App-Konfiguration kannst du nun das Datumsformat auswählen und die Anzeige der Lieferzeit als Datum aktivieren. Bitte beachte, dass du je nach Cache-Einstellungen in deinem Shop den Cache manuell leeren musst, damit die Änderung wirksam wird.</p>","shortDescription":"Zeige deinen Kunden die Lieferzeit deiner Artikel auf der Produktdetailseite als Datumsangabe. Statt der Anzahl der Tage wird das entsprechende Datum angezeigt.","highlights":"Verfügbare für Self-Hosted Shops UND Shopware Cloud","features":"Auswahl aus verschiedenen Datumsformaten\nOptionale Hervorhebung durch fett angezeigten Text\nVollständig individuell einstellbarer Text für die Lieferzeit\nOptionale Erweiterung des Zeitraums um Wochenendtage"},{"id":25759,"name":"Show delivery time as date","description":"<p>With this app you show your customers the delivery time of your items on the product detail page as a date. Instead of an indication like 1-2 weeks, it becomes an exact indication, for example 28.02.22 to 07.03.22. The good thing: You don't have to make any additional settings or data maintenance. The app uses the delivery time information from the Shopware standard.</p><h3>Full customizable format</h3><p>In the settings of the app you can set the date format individually. In addition, the text can be set for each language, as these are dynamically integrated as text modules. You can find the administration module in your Shopware administration under Settings &gt; Shop &gt; Text modules. The following text modules are created by the app and can be customized:</p><p></p><ul><li>hegu.deliveryTimeAsDate.deliveryDate<br></li><li>hegu.deliveryTimeAsDate.deliveryDateBold</li></ul><p></p>","installationManual":"<h3>Installing the app</h3><p>Open the Shopware administration of your Shopware store and click on Extensions &gt; My Extensions. Then click on Install App next to the app. After the installation you can activate the app as usual.</p><p><h3>Configuration of the app</h3></p><p>Next to the installed and activated app, click on the three dots in the right margin and then on Configuration. In the app configuration you can now select the date format and activate the display of the delivery time as date. Please note that depending on the cache settings in your store, you may have to clear the cache manually for the change to take effect.</p>","shortDescription":"Show your customers the delivery time of your items on the product detail page as a date. Instead of the number of days, the corresponding date is displayed.","highlights":"Available for Self-Hosted Shops AND Shopware Cloud","features":"Choice of different date formats\nOptional bold text highlighting\nFully customizable text for delivery time\nOptional extension of the period to include weekend days"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165670,"bookingKey":"HeGu460599473764_M","bookingText":"Show delivery time as date","price":5.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":167758,"bookingKey":"HeGu460599473764_M12","bookingText":"Show delivery time as date","price":60,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprx8Ez4","preview":true,"priority":5,"id":83665},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpobgM8t","preview":false,"priority":4,"id":83664},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwhi60o","preview":false,"priority":3,"id":83764},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4CHWTS","preview":false,"priority":1,"id":83667},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPdNIDn","preview":false,"priority":1,"id":83668}],"comments":[{"authorName":"Ann-Kathrin Kälberer","text":"Nachdem ich jetzt mehrere Nachfragen hatte, die sich auf meine Lieferzeiten bezogen, weil die Tage irgendwie immer zu Verwirrungen geführt haben, hab ich mit dieser Erweiterung jetzt hoffentlich die Lösung dafür gefunden *.*\n\nTut das, was es soll, die Konfigurationen sind super easy gehalten und super ausgereift - meiner Meinung nach. \n\nFreue mich riesig, darüber gestolpert zu sein - und ein dickes Dankeschön an den:die Entwickler:in! Mega Tool!","headline":"Mega!","creationDate":{"date":"2022-04-22 21:40:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"true_drive GbR","text":"An sich ein schönes und noch dazu kostenloses Plugin, welches genau das tut, was die Beschreibung definiert.\nUm für uns jedoch auch im produktiven Betrieb geeignet zu sein, wäre es super, wenn man im Plugin das Wochenende als \"nicht Versandtage\" deklarieren könnte. \nAktuell wird bei einer Lieferzeit von 1-3 Tagen an einem Freitag das Lieferdatum \"zwischen 25.03. und 28.03.\" ausgegeben, da das Plugin nur die Tage zählt und nicht Feier- und Ruhetage beachtet.","headline":"Schönes Plugin mit einem kleinen Haken","creationDate":{"date":"2022-03-25 17:46:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Chris Calm","text":"Dieses Plugin ist super und ganz einfach zu installieren. Es kommt wie gerufen, denn momentan hatte ich noch ein ähnliches kostenpflichtiges Plugin und meine 30 Tage zum Ausprobieren wäre heute oder morgen abgelaufen und dann hätte ich mind. 20€ für das andere einmalig zahlen müssen, ist zwar nicht so viel, aber wenn man mehrere Shops hat, dann summiert sich das schon. Allerdings sollte man sich klar sein, dass man nicht so viele gestaltungsmöglichkeiten wie bei dem kostenpflichtigem hat. Bei dem anderen Plugin kann man mehrere Schriftarten bestimmeen und auch ob das Datum fett angeziegt werden soll und Details mit einem Link wr auch in einen kleinen Klammer zu sehen. Wenn man wenigstens das Datum auch hier fett anzeigen könnte, dann wäre das Plugin mehr als Perfekt. Vielleicht könnte man diese kleine Funktion noch einbauen...","headline":"Super Plugin und auch kostenlos","creationDate":{"date":"2022-02-22 18:35:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Lieferzeit als Datum anzeigen","description":"<p>Mit dieser App zeigst du deinen Kunden die Lieferzeit deiner Artikel auf der Produktdetailseite als Datumsangabe an. Statt einer Angabe wie 1-2 Wochen wird dann eine genaue Angabe, zum Beispiel 28.02.22 bis 07.03.22. Das gute: Du musst keine zusätzlichen Einstellungen oder Datenpflege vornehmen. Die App verwendet die Angabe der Lieferzeit aus dem Shopware Standard.</p><h3>Individuell einstellbares Format</h3><p>In den Einstellungen der App kannst du das Datumsformat individuell einstellen. Zusätzlich kann der Text für jede Sprache eingestellt werden, da diese als Textbausteine dynamisch eingebunden sind. Das Modul zur Verwaltung findest du in deiner Shopware Administration unter Einstellungen &gt; Shop &gt; Textbausteine. Folgende Textbausteine werden durch die App erstellt und können individuell angepasst werden:</p><ul><li>hegu.deliveryTimeAsDate.deliveryDate</li><li>hegu.deliveryTimeAsDate.deliveryDateBold<br /></li></ul><p></p>","installationManual":"<h3>Installation der App</h3><p>Öffne die Shopware Administration deines Shopware Shops und klicke auf <b>Erweiterungen</b> &gt; <b>Meine Erweiterungen</b>. Anschließend klicke neben der App auf <b>App installieren</b>. Nach der Installation kannst du die App wie gewohnt aktivieren.</p><h3>Konfiguration der App</h3><p>Klicke neben der installierten und aktivierten App auf die drei Punkte am rechten Rand und anschließend auf <b>Konfiguration</b>. In der App-Konfiguration kannst du nun das Datumsformat auswählen und die Anzeige der Lieferzeit als Datum aktivieren. Bitte beachte, dass du je nach Cache-Einstellungen in deinem Shop den Cache manuell leeren musst, damit die Änderung wirksam wird.</p>","version":"1.2.4","changelog":[{"version":"1.2.4","text":"<ul><li>Bugfix in the calculation of the date for the delivery time when the option \"Extend period by days on weekends\" is enabled.<br /></li></ul>","creationDate":{"date":"2023-05-15 22:14:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<p></p><ul><li>Bugfix for the calculation of the delivery date.</li><li>Display of the date limited to the product detail page or route 'frontend.detail.page'.</li></ul>","creationDate":{"date":"2023-03-31 17:29:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<ul><li>Troubleshooting the display of the date when using the replenishment time<br /></li></ul>","creationDate":{"date":"2023-03-31 10:35:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>Bugfix in the calculation of the date for the delivery time when the option \"Extend period by days on weekends\" is enabled.<br /></li></ul>","creationDate":{"date":"2023-02-28 15:17:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>In the app settings, it is now possible to set that the delivery period is extended by the days that fall on the weekend. With a delivery time of 1-3 days, this period is extended to 1-5 days if day 2 and 3 fall on a Saturday and Sunday, for example<br /></li></ul>","creationDate":{"date":"2022-03-25 20:47:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>In the app configuration it is now possible to optionally set that a part or the whole delivery date should be displayed bold / highlighted<br /></li></ul>","creationDate":{"date":"2022-02-22 21:31:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>First release of the app<br /></li></ul>","creationDate":{"date":"2022-02-21 15:41:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=HeGu460599473764","redirectToStore":true,"lowestPriceValue":5.99}