{"id":14837,"name":"MutoSuperiorPro","code":"muto435137201325","lastChange":{"date":"2023-07-19 09:35:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1Udxar","examplePageUrl":"","moduleKey":"MutoSuperiorPro","creationDate":{"date":"2022-03-01 08:14:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-03-16 10:34:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-03-01 09:15:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1454,"prefix":"muto","name":"muto.at","website":"//muto.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1454_logo-muto.jpg"},"infos":[{"id":25842,"name":"Superior PRO - Theme für Shopware 6","description":"<h2>Individuell anpassbar | Hervorragender Support&nbsp; | zukünftige Updates und Erweiterungen</h2><p>Mit unserem&nbsp;Superior PRO&nbsp;Theme für Shopware 6 entscheidest du dich für ein individuell anpassbares Theme, das farblich aber auch inhaltlich an deine Bedürfnisse angepasst werden kann. Durch die zahlreichen Konfigurationsmöglichkeiten bietet dir das Theme alles was du benötigst um deinen individuellen Shop zu gestalten.</p><h2>Individualität ohne Programmierkenntnisse.</h2><p>Mit dem&nbsp;Superior PRO&nbsp;Theme musst du kein Entwickler sein - denn hier gestaltest du mit nur wenigen Klicks dein individuelles Shop-Design. Durch die vielseitigen Individualisierungsmöglichkeiten bietet dir das&nbsp;Superior PRO&nbsp;Theme die Flexibilität, die Du brauchst.</p><p><b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\">Das Theme ist optimal für Shopbetreiber und Agenturen geeignet, um individuelle Shops zu gestalten.</b></p><h2>Folgende Erweiterungen sind in diesem Theme integriert:</h2><p></p><h3>Elemente &nbsp;</h3>(Die Elemente können in jeder gewünschten Spalte eines jeden Blocks hinzugefügt werden)<p></p><p></p><ul><li>Teaser Image Box</li><li>Accordion</li><li>Tabs</li><li>Erweitertes Text Element</li><li>HTML/CSS Element</li><li>Seiten/Kategorie Header</li></ul><p></p><h3>Spalten Layouts im 12er Bootstrap Grid:</h3><p></p><p></p><ul><li>12</li><li>6-6</li><li>4-4-4</li><li>3-3-3-3</li><li>2-2-2-2-2-2</li><li>3-9</li><li>9-3</li><li>4-8</li><li>8-4</li><li>3-3-6</li><li>6-3-3</li></ul><p><br></p>\n","installationManual":"<p>Eine Übersicht über die Funktionen und Hilfestellungen findest du in unserer Dokumentation:</p><p><a href=\"https://muto.at/superior-pro\" target=\"_blank\" rel=\"noreferrer\"><b>Dokumentation</b></a><br></p>","shortDescription":"Extrem anpassbares Theme für Shopware 6 mit zahlreichen Einstellungsmöglichkeiten. Das Theme ist optimal für Shopbetreiber und Agenturen geeignet, um individuelle Shops zu gestalten.","highlights":"CMS Elemente, Blöcke und Grids für mehr Layout- und Designmöglichkeiten\nverschiedene Header Styles (einzeilig, mehrzeilig)\nFullwidth &amp; Boxed Layout\nPreloader frei wählbar\nUSP Bereich mit 4 verkaufsfördernden Fakten","features":"<strong>CMS Elemente, Blöcke und Grids:</strong> Wir haben verschiedene CMS Elemente, CMS Layout Blöcke und diverse Grids in unser Theme integriert. Damit entstehen zahlreiche neue Möglichkeiten für die Gestaltung von verkaufsfördernden Erlebniswelten. Elemente wie \"Teaser Image Box\", \"erweitertes Text Element\", \"Seiten-/Kategorie Header\", \"HTML/CSS Element\", \"Accordion\", \"Tabs\" können in jede Spalte eines Layouts eingefügt werden.\n<strong>Kategorie-Header:</strong> Der Header auf den Kategorie-Übersichtsseiten kann mit Bild oder Hintergrundfarbe und Text mit inkludiertem Klickpfad angezeigt werden und bieten einen schöneren Einstieg in die Produktwelt.\n<strong>TopBar:</strong> Für die Anzeige der TopBar, welche die Inhalte \"Login oder Registrierung\", einen Marketing Text und Sprach- und Währungsswahl enthält, kannst du zwischen 3 verschiedenen Status wählen. Entweder du deaktivierst die TopBar komplett, zeigst diese immer an oder wählst die Möglichkeit, diese per zusätzlichen Icon im Header ein-und ausblenden zu lassen. Beim \"Ein- und Ausblenden\" merkt sich der Browser den Status beim Seitenreload.\n<strong>Footer:</strong> Der Footer hat 3 benutzerdefinierte Spalten mit jeweils einer Überschrift und einem Text und/oder Bild. Die Footerspalten sind in der Breite und in der Reihenfolge frei definierbar. Die Spalten-Breiten können zudem für Desktop und Tablet unterschiedliche Breiten haben.\n<strong>Social Media:</strong> Die Social Media Icons können als Spalte im Footer oder im unteren Teil des Footers als Zeile dargestellt werden. Auch die Farben für Hintergrund, Icon und Rahmen können jeweils für den Normalzustand und für Mouseover frei gewählt werden. Zusätzlich kann das Tooltip aktiviert oder deaktiviert werden.\n<strong>Loadingscreen:</strong> Das Theme enthält auch einen Loadingscreen mit verschiedenen Designs. Dieser kann farblich angepasst werden. Auch ein Deaktivieren des Loadingscreens ist möglich.\n<strong>Produktauflistung:</strong> Die Anzahl der Spalten für Desktop, Laptop, Tablet und Smartphones sind frei definierbar (zusätzlich wird unterschieden ob die Produktauflistung mit oder ohne Filter-Sidebar dargestellt wird)\n<strong>Produktboxen:</strong> Das Design der Produktboxen ist mit zahlreichen Optionen anpassbar. Auch können viele Bestandteile der Produktboxen deaktiviert werden, wie zB Beschreibungstext, Variantenmerkmale, Preis Einheit) Die Maximale Höhe der Produktbilder kann ebenfalls angepasst werden, sowie sämtliche Farbwerte.\n<strong>Typographie:</strong> Passe sämtliche Schriftgröße, Zeichenabstände, Schriftstärken, Schriftfarben, usw. an (H1, H2, H3, H4, H5, H6, Absatztext, ...)\n<strong>Logo:</strong> Die max. Höhe des Logos im Header kann jeweils für Desktop, Tablet und Smartphone frei definiert werden.\n<strong>Suche:</strong> Die Suche wurde in unserem Theme ebenfalls komplett überarbeitet. Diese kann entweder immer angezeigt oder über ein Such-Icon ein- und ausgeblendet werden. Das Suchfeld kann farblich angepasst werden.\n<strong>USPs:</strong> Die 4 USPs sind frei definierbar und im Design anpassbar. (Hintergrundfarbe, Schriftfarbe und Größe von Headline und Teasertext) Zusätzlich können die einzelnen USP Blöcke jeweils mit einer Unterseite verlinkt sein, wenn du dies willst.\n<strong>Sidebar Navigation:</strong> Die Sidebar Navigation (Kategoriemenü) auf Kategorieübersichtsseiten kann farblich individuell angepasst werden. (Hintergrund, Schriftfarbe, Rahmenfarbe, Abstand zwischen den Kategoriepunkten, ...)\n<strong>Filter:</strong> Die Produktfilter auf Kategorieübersichtsseiten können farblich individuell angepasst werden. (Hintergrund, Schriftfarbe, Rahmenfarbe, Abstand zwischen den Kategoriepunkten, ...)\n<strong>Formulare:</strong> Das Design der Formularfelder kann frei angepasst werden (Hintergrund, Schriftfarbe, Rahmenfarbe, Active Status, Placeholder-Schriftfarbe)"},{"id":25843,"name":"Superior PRO - Theme for Shopware 6","description":"<h2>Customizable | Excellent support | Future updates and extensions</h2>\nWith our Superior PRO Theme for Shopware 6 you decide for an individually customizable theme, which can be adapted to your needs in terms of color but also content. Through the numerous configuration options, the theme offers you everything you need to design your individual store.\n\n<h2>Individuality without programming knowledge.</h2>\nWith the Superior PRO theme you don't have to be a developer - because here you can create your individual store design with just a few clicks. Due to the versatile individualization options, the Superior PRO Theme offers you the flexibility you need.<p><b>The theme is ideal for store owners and agencies to create individual stores.</b></p><h2>The following extensions are integrated in this theme:</h2><p></p><h3>Elements</h3>(Elements can be added in any desired column of any block)<p></p><p></p><ul><li>Teaser Image Box</li><li>Accordion</li><li>Tabs</li><li>Extended Text Element</li><li>HTML/CSS Element</li><li>Page/Category Header</li></ul><p></p><h3>Column layouts in the 12-unit bootstrap grid:</h3><p></p><p></p><ul><li>12</li><li>6-6</li><li>4-4-4</li><li>3-3-3-3</li><li>2-2-2-2-2-2</li><li>3-9</li><li>9-3</li><li>4-8</li><li>8-4</li><li>3-3-6</li><li>6-3-3</li></ul><p><br></p>\n","installationManual":"<p>You can find an overview of the functions and help in our documentation:</p><p><a href=\"https://muto.at/superior-pro\" target=\"_blank\" rel=\"noreferrer\">Documentation</a><br></p>","shortDescription":"Extremely customizable theme for Shopware 6 with numerous setting options. The theme is ideal for shop owners and agencies to design individual shops.","highlights":"CMS elements and blocks for more layout and design options\nDifferent header styles (single-line, multi-line)\nPreloader freely selectable\nUSP area with 4 sales-promoting facts\nSticky main navigation and dropdown navigation","features":"<strong>CMS elements, blocks and grids:</strong> We have integrated various CMS elements, CMS layout blocks and diverse grids into our theme. This creates numerous new possibilities for the design of sales-promoting Shopping Experiences. Elements such as \"teaser image box\", \"extended text element\", \"page/category header\", \"HTML/CSS element\", \"accordion\", \"tabs\" can be inserted into every column of a layout.\n<strong>Category header:</strong> The header on the category overview pages can be displayed with an image or background color and text with an included click path and offer a nicer entry into the product world.\n<strong>TopBar:</strong> You can choose between 3 different statuses for the display of the TopBar, which contains the contents \"Login or registration\", a marketing text and language and currency selection. Either you deactivate the TopBar completely, always display it or choose the option to show and hide it via an additional icon in the header. When \"showing and hiding\", the browser remembers the status when the page is reloaded.\n<strong>Footer:</strong> The footer has 3 user-defined columns, each with a heading and text and/or image. The width and order of the footer columns can be freely defined. The column widths can also have different widths for desktop and tablet.\n<strong>Social Media:</strong> The social media icons can be displayed as a column in the footer or as a row in the lower part of the footer. The colors for the background, icon and frame can also be freely selected for the normal state and for mouseover. In addition, the tool tip can be activated or deactivated.\n<strong>Loadingscreen:</strong> The theme also includes a loadingscreen with different designs. This color can be adjusted. It is also possible to deactivate the loading screen.\n<strong>Product listing:</strong> The number of columns for desktop, laptop, tablet and smartphone can be freely defined (a distinction is also made as to whether the product listing is displayed with or without a filter sidebar)\n<strong>Product boxes:</strong> The design of the product boxes is customizable with numerous options. Many components of the product boxes can also be deactivated, such as description text, variant features, price unit) The maximum height of the product images can also be adjusted, as well as all color values.\n<strong>Typography:</strong> Adjust all font size, character spacing, font weight, font color, etc. (H1, H2, H3, H4, H5, H6, paragraph text, ...)\n<strong>Logo:</strong> The maximum height of the logo in the header can be freely defined for desktop, tablet and smartphone.\n<strong>Search:</strong> The search has also been completely revised in our theme. This can either always be displayed or displayed and hidden using a search icon. The color of the search field can be customized.\n<strong>USPs:</strong> The 4 USPs are freely definable and the design can be adapted. (Background color, font color and size of headline and teaser text) In addition, the individual USP blocks can each be linked to a subpage if you wish.\n<strong>Sidebar navigation:</strong> The color of the sidebar navigation (category menu) on category overview pages can be customized. (Background, font color, border color, distance between category points, ...)\n<strong>Filter:</strong> The color of the product filters on category overview pages can be adjusted individually. (Background, font color, border color, distance between category points, ...)\n<strong>Forms:</strong> The design of the form fields can be freely adjusted (background, font color, border color, active status, placeholder font color)"}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165101,"bookingKey":"muto435137201325","bookingText":"Superior PRO - Theme for Shopware 6","price":249,"subscription":true,"discount":28.65329512894,"discr":"priceModelBuy"},{"id":165100,"bookingKey":"muto435137201325_M","bookingText":"Superior PRO - Theme for Shopware 6","price":39,"duration":1,"trialPhaseIncluded":true,"discount":25.641025641026,"discountAppliesForMonths":12,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5o1L4D","preview":true,"priority":1000,"id":113736},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php50Ud0b","preview":false,"priority":975,"id":112623},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqIztXH","preview":false,"priority":950,"id":112610},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1q9PaJ","preview":false,"priority":850,"id":112604},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGSPTD5","preview":false,"priority":825,"id":112611},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuiwlPI","preview":false,"priority":800,"id":112615},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpctLb0s","preview":false,"priority":775,"id":112605},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJxnSrE","preview":false,"priority":750,"id":112609},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuO4W58","preview":false,"priority":700,"id":112607},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYZlcKx","preview":false,"priority":650,"id":112606},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWMrT2s","preview":false,"priority":600,"id":112608},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8TdWWY","preview":false,"priority":550,"id":112603},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEjCnpz","preview":false,"priority":0,"id":112613},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcbupes","preview":false,"priority":0,"id":112614}],"comments":[],"ratingAverage":0,"label":"Superior PRO - Theme für Shopware 6","description":"<h2>Individuell anpassbar | Hervorragender Support  | zukünftige Updates und Erweiterungen</h2><p>Mit unserem Superior PRO Theme für Shopware 6 entscheidest du dich für ein individuell anpassbares Theme, das farblich aber auch inhaltlich an deine Bedürfnisse angepasst werden kann. Durch die zahlreichen Konfigurationsmöglichkeiten bietet dir das Theme alles was du benötigst um deinen individuellen Shop zu gestalten.</p><h2>Individualität ohne Programmierkenntnisse.</h2><p>Mit dem Superior PRO Theme musst du kein Entwickler sein - denn hier gestaltest du mit nur wenigen Klicks dein individuelles Shop-Design. Durch die vielseitigen Individualisierungsmöglichkeiten bietet dir das Superior PRO Theme die Flexibilität, die Du brauchst.</p><p><b>Das Theme ist optimal für Shopbetreiber und Agenturen geeignet, um individuelle Shops zu gestalten.</b></p><h2>Folgende Erweiterungen sind in diesem Theme integriert:</h2><p></p><h3>Elemente  </h3>(Die Elemente können in jeder gewünschten Spalte eines jeden Blocks hinzugefügt werden)<p></p><p></p><ul><li>Teaser Image Box</li><li>Accordion</li><li>Tabs</li><li>Erweitertes Text Element</li><li>HTML/CSS Element</li><li>Seiten/Kategorie Header</li></ul><p></p><h3>Spalten Layouts im 12er Bootstrap Grid:</h3><p></p><p></p><ul><li>12</li><li>6-6</li><li>4-4-4</li><li>3-3-3-3</li><li>2-2-2-2-2-2</li><li>3-9</li><li>9-3</li><li>4-8</li><li>8-4</li><li>3-3-6</li><li>6-3-3</li></ul><p><br /></p>","installationManual":"<p>Eine Übersicht über die Funktionen und Hilfestellungen findest du in unserer Dokumentation:</p><p><a href=\"https://muto.at/superior-pro\" target=\"_blank\" rel=\"noreferrer noopener\"><b>Dokumentation</b></a><br /></p>","version":"1.2.7","changelog":[{"version":"1.2.7","text":"<ul><li>Additional CSS classes for sorting the footer columns</li></ul>","creationDate":{"date":"2023-07-19 09:34:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"<ul><li>Corrections and adjustments in Account Menu and Account Pages</li></ul>","creationDate":{"date":"2023-07-18 15:17:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"<p></p><ul><li>Optimisations and corrections in SCSS</li><li>Minimum height of the header can now be configured in the theme manager. </li><li>The border colour for a line above the navigation can now be defined in the theme manager. This makes it possible to visually separate header and navigation with the same background colour. </li><li>Revision of the product boxes</li><li> Alignment of the content of the product boxes can now be configured in the theme manager (left/centre/right).</li></ul>","creationDate":{"date":"2023-07-12 13:16:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"<p></p><ul><li>Extension of the sidebar category navigation. Further setting options available in the theme manager.</li><li>Extension of the flyout navigation. Further setting options available in the theme manager.</li></ul>","creationDate":{"date":"2023-06-26 15:01:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<p></p><ul><li><br />Adjustment SCSS search field button</li><li>Adjustment element \"Category Header\": Background Position centre active for Parallax</li><li>Adjustment SCSS Offcanvas</li><li>Adjustment in pagination.scss (line-height)</li><li>Wishlist icons in product boxes can now be adjusted in colour in the theme manager</li><li>Pagination buttons on category pages can now be adjusted in colour in the theme manager</li></ul>","creationDate":{"date":"2023-06-22 13:05:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<ul><li>Adjustments in the sidebar category Navigation.</li></ul>","creationDate":{"date":"2023-06-16 13:08:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p></p><ul><li>Corrections and adjustments for Shopware 6.5.2.1: Dropdown navigation effect, searchbar, text colour category header and icons in offcanvas navigation, various elements without border radius when inserted in a fullwidth section.</li><li>Tooltip background and text colour can now be defined in the theme manager.</li><li>Category header element: It is now possible to set whether the background should be displayed with or without parallax effect.</li></ul>","creationDate":{"date":"2023-06-16 10:20:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Corrections and adjustments for Shopware 6.5</li></ul>","creationDate":{"date":"2023-05-04 10:31:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<p></p><ul><li>The display of the category image in the flyout navigation can now be activated/deactivated in the theme manager. </li><li>Development of additional CSS classes for the shopping worlds in order to move the contents of a section above or below the section background. This results in new layout possibilities. Description and CSS classes can be found in the theme documentation. </li><li>Added additional colour settings in the theme manager for the arrow and dot navigation of the slider and carousels.</li></ul>","creationDate":{"date":"2023-05-02 11:16:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<ul><li>Extension of the \"Teaser Image Box\" element: It is now possible to choose between cover and stretch for the image format.</li><li>Adjustments in the CMS blocks</li><li>Adjustment of the \"Extended Text Element\". Now the text box is displayed at 100% height if no value is selected for the vertical alignment.</li></ul>","creationDate":{"date":"2023-04-14 12:13:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<ul><li>USP area above the footer can now be deactivated.</li><li>Adjustment of various distances</li></ul>","creationDate":{"date":"2023-04-13 16:11:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p></p><ul><li>Optimisation of the loading screen function</li><li>Enhancement of the Teaser Image Box element: Specification of the link target, shadow can be deactivated on hover, arrow can be deactivated on hover in the button.</li><li>Correction of Teaser Image Box element: Border radius and ZoomIn conflict in Safari. Border radius was ignored on hover.</li><li>Additional settings in the theme manager: Custom HTML, Custom CSS and Custom JS.</li></ul>","creationDate":{"date":"2023-04-13 12:07:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"Added new function for the distances between the columns. Now the distances between the columns in each individual block can be changed using predefined CSS classes. This opens up new design possibilities for your shop pages. You can find more information in the theme documentation.","creationDate":{"date":"2023-04-12 12:06:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p></p><ul><li>Extension of the theme with further header settings. You can now choose between a multi-line and a single-line header layout. With the multi-line header layout, the main navigation is below the logo and icon area, and with the single-line header layout, the main navigation is placed directly between the logo and icons. This results in numerous new design possibilities for your online shop.\n- Optimisation of the loading screen function</li><li>Optimisation of the sorting of the settings in the theme manager for a better overview. </li><li>Optimisation of the \"fixed header\" function</li></ul>","creationDate":{"date":"2023-04-07 09:07:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"Development of 2 new elements for the Shopping Experiences: <br /><p><b>Element \"HTML / CSS\"</b></p><p>With the element \"HTML / CSS\" you can integrate your own HTML and CSS code directly as an element in a page. This element is useful, for example, to integrate JS widgets from external providers (rating seals, booking calendars, etc.) into a page in your shop.</p><p><b>Element \"Extended Text Element\"</b></p><p>In this element, you can now change the text colour and the colour of the headings and store a background colour or a colour gradient for the text box. This creates many more layout options for your Shopping Experiences.\n </p>","creationDate":{"date":"2023-04-05 13:01:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"Minor adjustments and extensions","creationDate":{"date":"2023-04-04 16:20:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<b> New element \"Page Header / Category Header\"</b> developed for the Shopping Experiences. This element now replaces the previously existing category header, which appeared automatically when a category image and/or category description was set for a category. This means that there is now much more flexibility. For categories, datamapping can also be used to automatically use the category description text and image. In addition, this element can now also be used on pages.","creationDate":{"date":"2023-03-31 22:05:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"New element \"Tabs\" developed for the Shopping Experiences","creationDate":{"date":"2023-03-30 16:06:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"some minor adjustments","creationDate":{"date":"2023-03-28 19:19:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>Extension of the setting options for the Accordion element in the Shopping Experiences. The following additional settings can now be made: Font colour, Font size, Font thickness, Background, Font colour active, Background active</p>","creationDate":{"date":"2023-03-27 16:13:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>The following extensions for the worlds of experience have been added in this verison:</p><p><br /></p><p><b>Elements</b> (Elements can be added in any desired column of any block).</p><p></p><ul><li>Teaser Image Box</li><li>Accordion</li></ul><p><br /></p><p><b>Column layouts in the 12-unit bootstrap grid:</b></p><p></p><ul><li>12</li><li>6-6</li><li>4-4-4</li><li>3-3-3-3</li><li>2-2-2-2-2-2</li><li>3-9</li><li>9-3</li><li>4-8</li><li>8-4</li><li>3-3-6</li><li>6-3-3</li></ul><p></p><p></p>","creationDate":{"date":"2023-03-26 21:54:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"New layout blocks developed in the Shopping Experiences for more design options","creationDate":{"date":"2023-03-22 09:10:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"New category for the own layout blocks in the Shopping Experiences for a better overview","creationDate":{"date":"2023-03-20 22:18:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"New blocks developed for the Shopping Experiences","creationDate":{"date":"2023-03-16 19:21:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"Numerous functional enhancements and optimizations","creationDate":{"date":"2023-03-15 21:59:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- Release of first version","creationDate":{"date":"2022-03-01 08:46:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=muto435137201325","redirectToStore":false,"lowestPriceValue":39}