{"id":14889,"name":"AcrisPersonalContactCS","code":"acris68339766133","lastChange":{"date":"2023-07-18 19:11:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcNLcbj","examplePageUrl":"","moduleKey":"AcrisPersonalContactCS","creationDate":{"date":"2022-03-08 10:05:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2023-02-14 15:37:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-01-30 20:28:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":25932,"name":"Persönlicher Ansprechpartner + regelgesteuert + gruppiert anzeigen lassen","description":"<h2>Zweck des Plugins</h2><p>Gerade im B2B ist es wichtig, die wichtigsten Ansprechpartner 1:1 dem richtigen Kunden anzeigen zu lassen. Mit diesem Plugin ist es möglich, diese entweder im \"Mein Konto Bereich\" oder als eigene Erlebniswelt in einer beliebigen Kategorie / Landingpage anzeigen zu lassen.&nbsp; <br></p><p>Dazu ist es möglich verschiedene Ansprechpartner anzulegen (z.B. alle Vertriebsmitarbeiter, Projektverantwortliche, Buchhaltung, usw.) und diese in Gruppen einzuteilen. <br></p><p>Die Ansprechpartner können mittels RuleBuilder Regeln und Prioritäten gesteuert werden. Sogar eine 1:1 Beziehung zwischen Ansprechpartner und Kunde ist möglich - sofern gewünscht. Zusätzlich können Prioritäten vergeben werden, sodass es möglich ist, die Ansprechpartner Gruppen zu reihen als auch die Ansprechpartner innerhalb einer Gruppe. Sollte nur ein Ansprechpartner je Gruppe gewünscht sein, so ist auch dies möglich.</p><p><br></p><h2>Plugin Konfiguration<br></h2><p>Nach erfolgter Installation des Plugins stehen einige Plugin Konfigurationen zur Verfügung:<br><i>Admin &gt; Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS Ansprechpartner Konfiguration</i></p><p><br></p><ul><li>Verkaufskanal: Alle Verkaufskanäle oder nur einen bestimmter Verkaufskanal konfigurieren<br></li><li>Anzeige der / des \"Persönliche Ansprechpartner im Kundenkonto anzeigen\" <br>(wenn dies deaktiviert wird, muss die Anzeige der Ansprechpartner über die neu zu erstellenden Erlebniswelten möglich)</li><li>&nbsp;Beschriftung für den Tab im Kundenbereich</li><li>Tab Positionierung: Position im Mein Konto Bereich festlegen</li><li>Text wenn keine persönlichen Ansprechpartner zur Verfügung stehen\n            </li><li>Gruppennamen der persönlichen Kontakte anzeigen</li><li>Überschrift der Ansprechpartner\n            </li><li>Bild - Text Positionierung<br></li><li>Bild - Text Positionierung (Anzeige des Bild - rund oder eckig)</li><li>Rahmen um den Kontakt anzeigen\n            </li></ul><p><br></p><h2>Nutzung des Plugins</h2><p><i>Admin &gt; Einstellungen &gt; Erweiterungen &gt; Ansprechpartner &gt; Ansprechpartner Gruppen bzw. Ansprechpartner<br></i></p><p><br></p><h3>Ansprechpartner Gruppen<br></h3><p>In der Ansprechpartner Gruppenübersicht sieht man alle angelegten Gruppen, diese können bearbeitet oder neue Gruppen hinzugefügt werden - folgende Felder stehen zur Verfügung:<br><b>Konfigurationen<br></b></p><ul><li>Interner Name: wird zur Anzeige in der Übersicht verwendet</li><li>Name: dies wird in der Storefront angezeigt</li><li>Gruppen Name auf der Website anzeigen: wenn aktiv, dann wird der zuvor definierte Name in der Storefront (einmalig je Gruppe) angezeigt.</li><li>Aktiv: ja/nein</li><li>Priorität: je höher die Zahl, dest wichtiger. Definiert die Reihenfolge der Anzeige in der Storefront, wenn es mehrere Ansprechpartner Gruppen gibt.</li></ul><p><br></p><p><b>Anzeige Einstellungen für Ansprechpartner\n                    </b></p><ul><li>Nur den ersten Ansprechpartner anzeigen (höchste Priorität): wenn mehrere Ansprechpartner durch die Regeln zurtreffen, wir nur der mit der höchste Priorität angezeigt, wenn diese Option aktiv ist.\n</li><li>Ansprechpartner Überschrift anzeigen: Ist diese Einstellung aktiv, werden die Überschriften der Ansprechpartner dieser Gruppe angezeigt</li><li>Ansprechpartner Name anzeigen: Ist diese Einstellung aktiv, werden die Namen der Ansprechpartner dieser Gruppe angezeigt.</li><li>Ansprechpartner Bild anzeigen: Ist diese Einstellung aktiv, werden die Bilder der Ansprechpartner dieser Gruppe angezeigt.</li><li>Zusätzliche Kontakzeile anzeigen: Ist diese Einstellung aktiv, werden die zusätzlichen Kontaktzeilen der Ansprechpartner dieser Gruppe angezeigt.</li><li>E-Mail anzeigen: Ist diese Einstellung aktiv, werden die E-Mails der Ansprechpartner dieser Gruppe angezeigt.</li><li>Telefonnummer anzeigen: Ist diese Einstellung aktiv, werden die Telefonnummern der Ansprechpartner dieser Gruppe angezeigt.</li></ul><p><br></p><h3>Ansprechpartner<br></h3><p>Bei den Ansprechpartner können eine beliebige Anzahl neue angelegt werden und den Ansprechpartner Gruppen zugeordnet werden - es stehen folgende Felder zur Verfügung:</p><p><br></p><p></p><p><b>Konfiguration</b></p><ul><li>Interner Name: wird in der Ansprechpartner Übersicht angezeigt</li><li>Aktiv: ja / nein</li><li>Zugewiesene Regeln: Hier können zuvor angelegte RuleBuilder Regeln verwendet werden wie z.B. Land,Postleitzahlen Gebiete, usw.</li><li>und/oder zugewiesene Kunden: Der Ansprechpartner kommt immer dann zur Anzeige, wenn der Kunde und \neine der angegebenen Regeln übereinstimmt (ODER-Verknüpfung). Der Kunde kann entweder über den Namen oder der Kundennummer gesucht werden.</li><li>Priorität: Je höher die Priorität, desto weiter vorne wird der Ansprechpartner gereiht.</li><li>Ansprechpartner Gruppe: Zuordnung zu den zuvor angelegten Ansprechpartner Gruppe (es kann nur eine ausgewählt werden)</li></ul><p><br></p><p><b>Ansprechpartnerdaten\n                    </b></p><ul><li>Ansprechpartner Überschrift: Die Überschrift wird automatisch über dem Ansprechpartner namen \nangezeigt. Ist dieses Feld leer, wird automatisch der \nÜberschriften-Textbaustein aus der Plugin Konfiguration geladen.</li><li>Name: Dieser Name wird auf der Webseite angezeigt.</li><li>Bild: Diese Bild wird in der Storefront angezeigt - die Formatierung wird in der Ansprechpartner Gruppe festgelegt.</li><li>Zusätzliche Kontaktzeile: Hier kann ein HTML formatierter Text eingegeben werden, dieser kann in der Storefront angezeigt werden - sofern in der Ansprechpartner Gruppe festgelegt.</li><li>Telefonnummer: wird in der Storefront angezeigt - sofern in der Ansprechpartner Gruppe festgelegt.</li><li>E-Mail: wird in der Storefront angezeigt - sofern in der Ansprechpartner Gruppe festgelegt.\n            </li></ul><p><br></p>","installationManual":"<p>Installation erfolgt wie in Shopware üblich, danach stehen Plugin Konfigurationen (Admin &gt; Erweiterungen &gt; Meine Erweiterungen &gt; Ansprechpartner) <br></p><p>sowie eine Verwaltung von Ansprechpartner Gruppen und Ansprechpartnern zur Verfügung. (Admin &gt; Einstellungen &gt; Erweiterungen &gt; Ansprechpartner)<br></p>","shortDescription":"Speziell im B2B gibt es persönliche Vertriebsmitarbeiter und  weitere Ansprechpartner. Diese können in Gruppen gegliedert, regelgesteuert und persönlichen im Konto angezeigt werden.","highlights":"Anzeige der Ansprechpartner (auch gruppiert) im \"Mein Konto Bereich\" oder auf einer Landingpage / Kategorie (Erlebniswelten Element / Block wird mitgeliefert)\nBeliebige Ansprechpartner anlegen mit Bild und Zusatzinformationen\nAnsprechpartner in Gruppen zusammenfassen und gemeinsam anzeigen lassen (Vertrieb, Buchhaltung,..)\nRegelgesteuerte Anzeige der Ansprechpartner (mit RuleBuilder z.B. auf Länder, Postleitzahlen, oder sonstige sinnvolle Regeln)\nVerschiedene Anzeige Optionen, Reihenfolgen und Gruppierungen möglich","features":"Anlage von beliebigen Ansprechpartner Gruppen (z.B. Vertrieb, Buchhaltung, Geschäftsführung, Technischer Ansprechpartner,..)\nAnzeige im Bereich \"Mein Konto\" und / oder auf Kategorien bzw. Landingpages möglich\nVerwaltung von beliebiger Anzahl an Ansprechpartnern, welche den Gruppen zugewiesen werden\nAnsprechpartner Informationen sond frei definierbar\nAnzeige ist regelgesteuert durch RuleBuilder Regeln und/oder direkt zugewiesene Kunden\nErlebniswelten Element / Erlebniswelten Blöcke werden mitgeliefert\nSteuerung der Reihenfolgen durch Prioritäten (sowohl Gruppen als auch Ansprechpartner)"},{"id":25933,"name":"Display personal contact + rule-based + grouped","description":"<h2>Purpose of the plugin</h2>Especially in B2B it is important to display the most important contacts 1:1 to the right customer. With this plugin it is possible to display them either in the \"My account area\" or as a separate experience in any category / landing page. <br><p>For this purpose, it is possible to create different contact persons (e.g. all sales employees, project managers, accounting, etc.) and divide them into groups.The contact persons can be controlled by RuleBuilder rules and priorities. Even a 1:1 relationship between contact person and customer is possible - if desired. In addition, priorities can be assigned, so that it is possible to arrange the contact persons in groups as well as the contact persons within a group. If only one contact person per group is desired, this is also possible.</p><p><br></p><h2>Plugin Configuration</h2><p>After successful installation of the plugin, some plugin configurations are available:<br><i>Admin &gt; Extensions &gt; My extensions &gt; ACRIS contact configuration.<br></i><br></p><ul><li>&nbsp;&nbsp;&nbsp; Sales Channel: Configure all sales channels or only a specific sales channel.</li><li>&nbsp;&nbsp;&nbsp; Display the / of the \"Show personal contacts in customer account\".</li><li>&nbsp;&nbsp;&nbsp; (if this is deactivated, the display of the contact persons must be possible via the new experience worlds to be created)</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Labeling for the tab in the customer area</li><li>&nbsp;&nbsp;&nbsp; Tab positioning: set position in My Account area</li><li>&nbsp;&nbsp;&nbsp; Text if no personal contacts are available</li><li>&nbsp;&nbsp;&nbsp; Show group names of personal contacts</li><li>&nbsp;&nbsp;&nbsp; Heading of the contact persons</li><li>&nbsp;&nbsp;&nbsp; Image - text positioning</li><li>&nbsp;&nbsp;&nbsp; Image - text positioning (display the image - round or square)</li><li>&nbsp;&nbsp;&nbsp; Show frame around contact </li></ul><p><br></p><h2>Use of the plugin</h2><p><i>Admin &gt; Settings &gt; Extensions &gt; Contact persons &gt; Contact persons groups or contact persons<br></i><br></p><h3>Contact person groups</h3><p>In the contact person group overview you can see all created groups, these can be edited or new groups can be added - the following fields are available:<b><br></b></p><p><b><br></b></p><p><b>Configurations</b><br></p><ul><li>&nbsp;&nbsp;&nbsp; Internal name: this is used for display in the overview</li><li>&nbsp;&nbsp;&nbsp; Name: this will be displayed in the storefront</li><li>&nbsp;&nbsp;&nbsp; Show group name on website: if active, the previously defined name will be displayed in the storefront (once per group).</li><li>&nbsp;&nbsp;&nbsp; Active: yes/no</li><li>&nbsp;&nbsp;&nbsp; Priority: the higher the number, the more important. Defines the order of display in the storefront if there are multiple contact groups.</li></ul><p><br><b>Display settings for contact persons<br></b></p><ul><li>&nbsp;&nbsp;&nbsp; Show only the first contact (highest priority): if several contacts arrive by the rules, only the one with the highest priority will be shown if this option is active.</li><li>&nbsp;&nbsp;&nbsp; Show contact headers: If this setting is active, the headers of the contact persons in this group will be displayed.</li><li>&nbsp;&nbsp;&nbsp; Show contact name: If this setting is active, the names of the contact persons of this group will be displayed.</li><li>&nbsp;&nbsp;&nbsp; Show contact person picture: If this setting is active, the pictures of the contact persons of this group will be displayed.</li><li>&nbsp;&nbsp;&nbsp; Show additional contact line: If this setting is active, the additional contact lines of the contacts of this group will be displayed.</li><li>&nbsp;&nbsp;&nbsp; Show email: If this setting is active, the emails of the contacts of this group will be displayed.</li><li>&nbsp;&nbsp;&nbsp; Show phone number: If this setting is active, the phone numbers of the contacts of this group are displayed.</li></ul><p><b><br></b></p><h3>Contact persons</h3><p>Any number of new contact persons can be created and groups can be assigned to the contact persons - the following fields are available:<br><br><b>Configuration<br></b></p><ul><li>&nbsp;&nbsp;&nbsp; Internal name: is displayed in the contact person overview</li><li>&nbsp;&nbsp;&nbsp; Active: yes / no</li><li>&nbsp;&nbsp;&nbsp; Assigned rules: Previously created RuleBuilder rules can be used here such as country,zip code areas, etc.</li><li>&nbsp;&nbsp;&nbsp; and/or assigned customers: The contact person will always be displayed if the customer and one of the specified rules match (OR operation). The customer can be searched either by name or by customer number.</li><li>&nbsp;&nbsp;&nbsp; Priority: The higher the priority, the further forward the contact person is ranked.</li><li>&nbsp;&nbsp;&nbsp; Contact person group: Assignment to the previously created contact person group (only one can be selected).</li></ul><p><b><br></b></p><p><b>Contact person data<br></b></p><ul><li>&nbsp;&nbsp;&nbsp; Contact person heading: The heading is automatically displayed above the contact person name. If this field is empty, the headline text module from the plugin configuration is automatically loaded.</li><li>&nbsp;&nbsp;&nbsp; Name: This name will be displayed on the web page.</li><li>&nbsp;&nbsp;&nbsp; Image: This image will be displayed in the storefront - the formatting is set in the contact person group.</li><li>&nbsp;&nbsp;&nbsp; Additional contact line: HTML formatted text can be entered here, this can be displayed in the storefront - if set in the contact person group.</li><li>&nbsp;&nbsp;&nbsp; Phone number: will be displayed in the storefront - if defined in the contact group.</li><li>&nbsp;&nbsp;&nbsp; Email: will be displayed in the storefront - if defined in the contact group. </li></ul>","installationManual":"<p>Installation is done as usual in Shopware, after that plugin configurations (Admin &gt; Extensions &gt; My Extensions &gt; Contact Persons) are available.</p><p>as well as a management of contact person groups and contact persons are available. (Admin &gt; Settings &gt; Extensions &gt; Contact persons)</p>","shortDescription":"Especially in B2B, there are personal sales representatives and other contacts. These can be organized into groups, rule-controlled and displayed personally in the account.","highlights":"Display of contact persons (also grouped) in the \"My account area\" or on a landing page / category (Shoppint Experience element / block is supplied)\nCreate any contact person with picture and additional information\nCombine contact persons in groups and display them together (sales, accounting,..)\nRule-controlled display of contact persons (with RuleBuilder e.g. on countries, postal codes, or other meaningful rules)\nDifferent display options, orders and groupings possible","features":"Creation of any contact person groups (e.g. sales, accounting, management, technical contact,..)\nDisplay in the \"My account\" area and / or on categories or landing pages possible\nManagement of any number of contact persons, which are assigned to the groups\nContact person information is freely definable\nDisplay is rule-driven by RuleBuilder rules and/or directly assigned customers\nWorlds of experience element / Worlds of experience blocks are supplied\nSequences controlled by priorities (both groups and contacts)"}],"addons":["enterpriseCertified","highlightInListing","emotionPreset"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167162,"bookingKey":"acris68339766133","bookingText":"Display personal contact + rule-based + grouped","price":99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":167161,"bookingKey":"acris68339766133_M","bookingText":"Display personal contact + rule-based + grouped","price":19.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmh4DEC","preview":true,"priority":0,"id":85123},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLq2dDx","preview":false,"priority":0,"id":106325},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGnjSCf","preview":false,"priority":0,"id":106326},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplvYTIv","preview":false,"priority":0,"id":106338},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phph7GggJ","preview":false,"priority":0,"id":106340},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpezmbNF","preview":false,"priority":0,"id":106347},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9k9XmB","preview":false,"priority":0,"id":106348},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRd23Bz","preview":false,"priority":0,"id":106349},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJWosG9","preview":false,"priority":0,"id":106350},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaeMQLk","preview":false,"priority":0,"id":106351},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpO2gxkU","preview":false,"priority":0,"id":106352},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUfp7PG","preview":false,"priority":0,"id":106353},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplndr7B","preview":false,"priority":0,"id":106354},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4DwOYz","preview":false,"priority":0,"id":106355},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1wbUe6","preview":false,"priority":0,"id":106356},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5NQEFL","preview":false,"priority":0,"id":106357},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDtb30i","preview":false,"priority":0,"id":106358}],"comments":[],"ratingAverage":0,"label":"Persönlicher Ansprechpartner + regelgesteuert + gruppiert anzeigen lassen","description":"<h2>Zweck des Plugins</h2><p>Gerade im B2B ist es wichtig, die wichtigsten Ansprechpartner 1:1 dem richtigen Kunden anzeigen zu lassen. Mit diesem Plugin ist es möglich, diese entweder im \"Mein Konto Bereich\" oder als eigene Erlebniswelt in einer beliebigen Kategorie / Landingpage anzeigen zu lassen.  <br /></p><p>Dazu ist es möglich verschiedene Ansprechpartner anzulegen (z.B. alle Vertriebsmitarbeiter, Projektverantwortliche, Buchhaltung, usw.) und diese in Gruppen einzuteilen. <br /></p><p>Die Ansprechpartner können mittels RuleBuilder Regeln und Prioritäten gesteuert werden. Sogar eine 1:1 Beziehung zwischen Ansprechpartner und Kunde ist möglich - sofern gewünscht. Zusätzlich können Prioritäten vergeben werden, sodass es möglich ist, die Ansprechpartner Gruppen zu reihen als auch die Ansprechpartner innerhalb einer Gruppe. Sollte nur ein Ansprechpartner je Gruppe gewünscht sein, so ist auch dies möglich.</p><p><br /></p><h2>Plugin Konfiguration<br /></h2><p>Nach erfolgter Installation des Plugins stehen einige Plugin Konfigurationen zur Verfügung:<br /><i>Admin &gt; Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS Ansprechpartner Konfiguration</i></p><p><br /></p><ul><li>Verkaufskanal: Alle Verkaufskanäle oder nur einen bestimmter Verkaufskanal konfigurieren<br /></li><li>Anzeige der / des \"Persönliche Ansprechpartner im Kundenkonto anzeigen\" <br />(wenn dies deaktiviert wird, muss die Anzeige der Ansprechpartner über die neu zu erstellenden Erlebniswelten möglich)</li><li> Beschriftung für den Tab im Kundenbereich</li><li>Tab Positionierung: Position im Mein Konto Bereich festlegen</li><li>Text wenn keine persönlichen Ansprechpartner zur Verfügung stehen\n            </li><li>Gruppennamen der persönlichen Kontakte anzeigen</li><li>Überschrift der Ansprechpartner\n            </li><li>Bild - Text Positionierung<br /></li><li>Bild - Text Positionierung (Anzeige des Bild - rund oder eckig)</li><li>Rahmen um den Kontakt anzeigen\n            </li></ul><p><br /></p><h2>Nutzung des Plugins</h2><p><i>Admin &gt; Einstellungen &gt; Erweiterungen &gt; Ansprechpartner &gt; Ansprechpartner Gruppen bzw. Ansprechpartner<br /></i></p><p><br /></p><h3>Ansprechpartner Gruppen<br /></h3><p>In der Ansprechpartner Gruppenübersicht sieht man alle angelegten Gruppen, diese können bearbeitet oder neue Gruppen hinzugefügt werden - folgende Felder stehen zur Verfügung:<br /><b>Konfigurationen<br /></b></p><ul><li>Interner Name: wird zur Anzeige in der Übersicht verwendet</li><li>Name: dies wird in der Storefront angezeigt</li><li>Gruppen Name auf der Website anzeigen: wenn aktiv, dann wird der zuvor definierte Name in der Storefront (einmalig je Gruppe) angezeigt.</li><li>Aktiv: ja/nein</li><li>Priorität: je höher die Zahl, dest wichtiger. Definiert die Reihenfolge der Anzeige in der Storefront, wenn es mehrere Ansprechpartner Gruppen gibt.</li></ul><p><br /></p><p><b>Anzeige Einstellungen für Ansprechpartner\n                    </b></p><ul><li>Nur den ersten Ansprechpartner anzeigen (höchste Priorität): wenn mehrere Ansprechpartner durch die Regeln zurtreffen, wir nur der mit der höchste Priorität angezeigt, wenn diese Option aktiv ist.\n</li><li>Ansprechpartner Überschrift anzeigen: Ist diese Einstellung aktiv, werden die Überschriften der Ansprechpartner dieser Gruppe angezeigt</li><li>Ansprechpartner Name anzeigen: Ist diese Einstellung aktiv, werden die Namen der Ansprechpartner dieser Gruppe angezeigt.</li><li>Ansprechpartner Bild anzeigen: Ist diese Einstellung aktiv, werden die Bilder der Ansprechpartner dieser Gruppe angezeigt.</li><li>Zusätzliche Kontakzeile anzeigen: Ist diese Einstellung aktiv, werden die zusätzlichen Kontaktzeilen der Ansprechpartner dieser Gruppe angezeigt.</li><li>E-Mail anzeigen: Ist diese Einstellung aktiv, werden die E-Mails der Ansprechpartner dieser Gruppe angezeigt.</li><li>Telefonnummer anzeigen: Ist diese Einstellung aktiv, werden die Telefonnummern der Ansprechpartner dieser Gruppe angezeigt.</li></ul><p><br /></p><h3>Ansprechpartner<br /></h3><p>Bei den Ansprechpartner können eine beliebige Anzahl neue angelegt werden und den Ansprechpartner Gruppen zugeordnet werden - es stehen folgende Felder zur Verfügung:</p><p><br /></p><p></p><p><b>Konfiguration</b></p><ul><li>Interner Name: wird in der Ansprechpartner Übersicht angezeigt</li><li>Aktiv: ja / nein</li><li>Zugewiesene Regeln: Hier können zuvor angelegte RuleBuilder Regeln verwendet werden wie z.B. Land,Postleitzahlen Gebiete, usw.</li><li>und/oder zugewiesene Kunden: Der Ansprechpartner kommt immer dann zur Anzeige, wenn der Kunde und \neine der angegebenen Regeln übereinstimmt (ODER-Verknüpfung). Der Kunde kann entweder über den Namen oder der Kundennummer gesucht werden.</li><li>Priorität: Je höher die Priorität, desto weiter vorne wird der Ansprechpartner gereiht.</li><li>Ansprechpartner Gruppe: Zuordnung zu den zuvor angelegten Ansprechpartner Gruppe (es kann nur eine ausgewählt werden)</li></ul><p><br /></p><p><b>Ansprechpartnerdaten\n                    </b></p><ul><li>Ansprechpartner Überschrift: Die Überschrift wird automatisch über dem Ansprechpartner namen \nangezeigt. Ist dieses Feld leer, wird automatisch der \nÜberschriften-Textbaustein aus der Plugin Konfiguration geladen.</li><li>Name: Dieser Name wird auf der Webseite angezeigt.</li><li>Bild: Diese Bild wird in der Storefront angezeigt - die Formatierung wird in der Ansprechpartner Gruppe festgelegt.</li><li>Zusätzliche Kontaktzeile: Hier kann ein HTML formatierter Text eingegeben werden, dieser kann in der Storefront angezeigt werden - sofern in der Ansprechpartner Gruppe festgelegt.</li><li>Telefonnummer: wird in der Storefront angezeigt - sofern in der Ansprechpartner Gruppe festgelegt.</li><li>E-Mail: wird in der Storefront angezeigt - sofern in der Ansprechpartner Gruppe festgelegt.\n            </li></ul><p><br /></p>","installationManual":"<p>Installation erfolgt wie in Shopware üblich, danach stehen Plugin Konfigurationen (Admin &gt; Erweiterungen &gt; Meine Erweiterungen &gt; Ansprechpartner) <br /></p><p>sowie eine Verwaltung von Ansprechpartner Gruppen und Ansprechpartnern zur Verfügung. (Admin &gt; Einstellungen &gt; Erweiterungen &gt; Ansprechpartner)<br /></p>","version":"3.0.0","changelog":[{"version":"3.0.0","text":"<p>Compatibility established with SW 6.5</p>","creationDate":{"date":"2023-05-05 12:12:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<ul><li>Error fixed during plugin installation<br /></li></ul>","creationDate":{"date":"2023-02-01 10:23:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<ul><li>When installing the plugin, an own media folder is created for the images</li><li>Metadata for the contact page in the customer area adapted<br /></li></ul>","creationDate":{"date":"2023-01-31 14:49:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<ul><li>Store Release, Veröffentlichung</li></ul>","creationDate":{"date":"2023-01-30 13:44:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-12-01 17:15:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<ul><li>Optimizes plugin image.</li><li>Improves compatibility with Shopware &gt;= 6.4.10.0.</li><li>Optimizes plugin color in administration.</li></ul>","creationDate":{"date":"2022-04-25 14:08:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<ul><li>Store Release, Veröffentlichung</li></ul>","creationDate":{"date":"2022-03-08 10:08:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris68339766133","redirectToStore":false,"lowestPriceValue":19.99}