{"id":14939,"name":"MutoVerticly","code":"muto905902738012","lastChange":{"date":"2023-07-18 11:16:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxeALYZ","examplePageUrl":"","moduleKey":"MutoVerticly","creationDate":{"date":"2022-03-15 20:29:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-03-21 14:07:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-03-15 20:32:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1454,"prefix":"muto","name":"muto.at","website":"//muto.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1454_logo-muto.jpg"},"infos":[{"id":26017,"name":"VERTICLY - Theme für Shopware 6","description":"<h2>Vertikales Shopdesign | Individuell anpassbar | Hervorragender Support&nbsp; | zukünftige Updates und Erweiterungen</h2><p>Mit unserem&nbsp;VERTICLY Theme für Shopware 6 entscheidest du dich für ein individuell anpassbares Theme, das farblich aber auch inhaltlich an deine Bedürfnisse angepasst werden kann. Mit über 200 Konfigurationsmöglichkeiten bietet dir das Theme alles was du benötigst um deinen individuellen Shop zu gestalten.</p><h2>Individualität ohne Programmierkenntnisse.</h2><p>Mit dem&nbsp;VERTICLY Theme musst du kein Entwickler sein - denn hier gestaltest du mit nur wenigen Klicks dein individuelles Shop-Design. Durch die vielseitigen Individualisierungsmöglichkeiten bietet dir das&nbsp;VERTICLY Theme die Flexibilität, die Du brauchst.</p><p><br></p><p><b>Das Theme ist optimal für Shopbetreiber und Agenturen geeignet, um individuelle Shops zu gestalten.</b></p><p><b><br></b></p><p>Gerne übernehmen wir auf Wunsch auch Individualisierungen des Themes für deinen Onlineshop. Schreibe uns dazu einfach über unser Kontaktformular unter&nbsp;<a href=\"https://muto.at/kontakt/\" target=\"_blank\" rel=\"noreferrer\">https://muto.at/kontakt/</a></p>","installationManual":"","shortDescription":"Theme für Shopware 6 mit über 200 Einstellungsmöglichkeiten. Das Theme ist optimal für Shopbetreiber und Agenturen geeignet, um individuelle Shops zu gestalten.","highlights":"Vertikales Shopdesign mit fixierter Sidebar\nFlyout Navigation groß und übersichtlich\nSuche über den ganzen Bildschirm\nUSPs über dem Footer\nFarblich individuell anpassbar","features":"<strong>Footer:</strong> Der Footer hat 3 benutzerdefinierte Spalten mit jeweils einer Überschrift und einem Text und/oder Bild. Die Footerspalten sind in der Breite und in der Reihenfolge frei definierbar. Die Spalten-Breiten können zudem für Desktop und Tablet unterschiedliche Breiten haben.\n<strong>Sidebar:</strong> Die Sidebar beinhaltet das Logo, die Shopfunktionen wie Warenkorb, Merkzettel, Benutzermenü und Suchfunktion. Die Breite der Sidebar kann frei definiert werden. Auch die verschiedenen Farben der Sidebar (Hintergründe, Navigation, Icons) können für Normalzustand und Mouseover frei gewählt werden. Zusätzlich kann eine Infobox aktiviert werden, in der verkaufsfördernde Informationen, Rabatt-Codes oder Infos zum Sale präsentiert werden können.\n<strong>Social Media:</strong> Die Social Media Icons können als Spalte im Footer oder im unteren Teil des Footers als Zeile dargestellt werden. Auch die Farben für Hintergrund, Icon und Rahmen können jeweils für den Normalzustand und für Mouseover frei gewählt werden. Zusätzlich kann das Tooltip aktiviert oder deaktiviert werden.\n<strong> Versand und Zahlung:</strong> Die Versand- und Zahlungsicons können als Spalte oder als Zeile im Footer dargestellt werden. Möchtest du die Icons nicht im Footer anzeigen lassen, kannst du diese auch ganz deaktivieren.\n<strong>Loadingscreen:</strong> Das Theme enthält auch einen Loadingscreen mit verschiedenen Designs. Dieser kann farblich angepasst werden. Auch ein Deaktivieren des Loadingscreens ist möglich.\n<strong>Produktauflistung:</strong> Die Anzahl der Spalten für Desktop, Laptop, Tablet und Smartphones sind frei definierbar (zusätzlich wird unterschieden ob die Produktauflistung mit oder ohne Filter-Sidebar dargestellt wird)\n<strong>Produktboxen:</strong> Das Design der Produktboxen ist mit zahlreichen Optionen anpassbar. Auch können viele Bestandteile der Produktboxen deaktiviert werden, wie zB Beschreibungstext, Variantenmerkmale, Preis Einheit) Die Maximale Höhe der Produktbilder kann ebenfalls angepasst werden, sowie sämtliche Farbwerte.\n<strong>Typographie:</strong> Passe sämtliche Schriftgröße, Zeichenabstände, Schriftstärken, Schriftfarben, usw. an (H1, H2, H3, H4, H5, H6, Absatztext, ...)\n<strong>Logo:</strong> Die max. Logohöhe im Header (Sidebar) kann ebenfalls modifiziert werden.\n<strong>Suche:</strong> Die Suche wurde in unserem Theme ebenfalls komplett überarbeitet. Diese wird neben der Sidebar über den kompletten Bildschirm durch Klick auf das Such-Icon geöffnet. Das Suchfenster und auch das Eingabefeld kann farblich angepasst werden.\n<strong>Großflächige Flyout Navigation</strong>: Die Flyout Navigation (Untermenü) kann im Design frei definiert werden (Hintergrund, Schrifgröße, der einzelnen Menüebenen, Höhe des Bildes in der Flyout Navigation, uvm.)\n<strong>USPs:</strong> Die 4 USPs sind frei definierbar und im Design anpassbar. (Hintergrundfarbe, Schriftfarbe und Größe von Icon, Headline und Teasertext) Zusätzlich können die einzelnen USP Blöcke jeweils mit einer Unterseite verlinkt sein, wenn du dies willst.  Du kannst ebenfalls bestimmen, ob zB Icons oder Subtexte angezeigt werden sollen oder nicht. Für die Icons werden die \"Fontawesome 6.1 free solid\" Icons verwendet, die dazu lokal im Theme integriert sind.\n<strong>Sidebar Navigation:</strong> Die Sidebar Navigation (Kategoriemenü) auf Kategorieübersichtsseiten kann farblich individuell angepasst werden. (Hintergrund, Schriftfarbe, Rahmenfarbe, Abstand zwischen den Kategoriepunkten, ...)\n<strong>Formulare:</strong> Das Design der Formularfelder kann frei angepasst werden (Hintergrund, Schriftfarbe, Rahmenfarbe, Active Status, Placeholder-Schriftfarbe)"},{"id":26018,"name":"VERTICLY - Theme for Shopware 6","description":"<h2>Vertical shop design | Customizable | Excellent support | future updates and enhancements</h2><p>With our VERTICLY theme for Shopware 6, you choose an individually adaptable theme, which can be adapted to your needs in terms of color and content. With over 200 configuration options, the theme offers you everything you need to design your individual shop.</p><h2>Individuality without programming knowledge.</h2><p>With&nbsp; VERTICLY&nbsp;Theme you don't have to be a developer - because here you can design your individual shop design with just a few clicks. Thanks to the versatile customization options, the&nbsp; VERTICLY&nbsp;theme offers you the flexibility you need.</p><p><br></p><p><b>The theme is ideal for shop owners and agencies to design individual shops.</b></p>","installationManual":"","shortDescription":"Extremely customizable theme for Shopware 6 with over 200 setting options. The theme is ideal for shop owners and agencies to design individual shops.","highlights":"Vertical shop design with fixed sidebar\nFlyout navigation large and clear\nFull screen search\nUSPs above the footer\nCustomizable in colour","features":"<strong>Footer:</strong> The footer has 3 user-defined columns, each with a heading and text and/or image. The width and order of the footer columns can be freely defined. The column widths can also have different widths for desktop and tablet.\n<strong>Sidebar:</strong> The sidebar contains the logo, the shop functions such as the shopping cart, notepad, user menu and search function. The width of the sidebar can be freely defined. The different colors of the sidebar (backgrounds, navigation, icons) can also be freely selected for normal status and mouseover. In addition, an info box can be activated in which sales-promoting information, discount codes or information about the sale can be presented.\n<strong>Social Media:</strong> The social media icons can be displayed as a column in the footer or as a row in the lower part of the footer. The colors for the background, icon and frame can also be freely selected for the normal state and for mouseover. In addition, the tool tip can be activated or deactivated.\n<strong>Shipping and payment:</strong> The shipping and payment icons can be displayed as a column or as a row in the footer. If you do not want the icons to be displayed in the footer, you can also deactivate them completely.\n<strong>Loadingscreen:</strong> The theme also includes a loadingscreen with different designs. This color can be adjusted. It is also possible to deactivate the loading screen.\n<strong>Product listing:</strong> The number of columns for desktop, laptop, tablet and smartphone can be freely defined (a distinction is also made as to whether the product listing is displayed with or without a filter sidebar)\n<strong>Product boxes:</strong> The design of the product boxes is customizable with numerous options. Many components of the product boxes can also be deactivated, such as description text, variant features, price unit) The maximum height of the product images can also be adjusted, as well as all color values.\n<strong>Typography:</strong> Adjust all font size, character spacing, font weight, font color, etc. (H1, H2, H3, H4, H5, H6, paragraph text, ...)\n<strong>Logo:</strong> The maximum logo height in the header (sidebar) can also be modified.\n<strong>Search:</strong> The search has also been completely revised in our theme. This is opened next to the sidebar across the entire screen by clicking on the search icon. The color of the search window and the input field can be adjusted.\n<strong>Large flyout navigation</strong>: The flyout navigation (submenu) can be freely defined in the design (background, font size, the individual menu levels, height of the image in the flyout navigation, etc.)\n<strong>USPs:</strong> The 4 USPs are freely definable and the design can be adapted. (Background color, font color and size of icon, headline and teaser text) In addition, the individual USP blocks can each be linked to a subpage if you want. You can also determine whether, for example, icons or subtexts should be displayed or not. The \"Fontawesome 6.1 free solid\" icons are used for the icons, which are integrated locally in the theme.\n<strong>Sidebar navigation:</strong> The color of the sidebar navigation (category menu) on category overview pages can be customized. (Background, font color, border color, distance between category points, ...)\n<strong>Forms:</strong> The design of the form fields can be freely adjusted (background, font color, border color, active status, placeholder font color)"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165216,"bookingKey":"muto905902738012","bookingText":"VERTICLY Theme for Shopware 6","price":349,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":165215,"bookingKey":"muto905902738012_M","bookingText":"VERTICLY Theme for Shopware 6","price":39,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6K2hoh","preview":true,"priority":0,"id":85632},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPcRHTg","preview":false,"priority":110,"id":86112},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyG7uha","preview":false,"priority":100,"id":85633},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpni8n3j","preview":false,"priority":90,"id":85634},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzpx26n","preview":false,"priority":80,"id":85699},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3D8L9D","preview":false,"priority":1,"id":85627}],"comments":[],"ratingAverage":0,"label":"VERTICLY - Theme für Shopware 6","description":"<h2>Vertikales Shopdesign | Individuell anpassbar | Hervorragender Support  | zukünftige Updates und Erweiterungen</h2><p>Mit unserem VERTICLY Theme für Shopware 6 entscheidest du dich für ein individuell anpassbares Theme, das farblich aber auch inhaltlich an deine Bedürfnisse angepasst werden kann. Mit über 200 Konfigurationsmöglichkeiten bietet dir das Theme alles was du benötigst um deinen individuellen Shop zu gestalten.</p><h2>Individualität ohne Programmierkenntnisse.</h2><p>Mit dem VERTICLY Theme musst du kein Entwickler sein - denn hier gestaltest du mit nur wenigen Klicks dein individuelles Shop-Design. Durch die vielseitigen Individualisierungsmöglichkeiten bietet dir das VERTICLY Theme die Flexibilität, die Du brauchst.</p><p><br /></p><p><b>Das Theme ist optimal für Shopbetreiber und Agenturen geeignet, um individuelle Shops zu gestalten.</b></p><p><b><br /></b></p><p>Gerne übernehmen wir auf Wunsch auch Individualisierungen des Themes für deinen Onlineshop. Schreibe uns dazu einfach über unser Kontaktformular unter <a href=\"https://muto.at/kontakt/\" target=\"_blank\" rel=\"noreferrer noopener\">https://muto.at/kontakt/</a></p>","installationManual":"","version":"1.1.0","changelog":[{"version":"1.1.0","text":"<ul><li>Corrections and adjustments for Shopware 6.5</li></ul>","creationDate":{"date":"2023-05-04 12:25:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>Release of first version<br /></li></ul>","creationDate":{"date":"2022-03-16 10:12:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=muto905902738012","redirectToStore":false,"lowestPriceValue":39}