{"id":15054,"name":"LenzPlatformPlentyConnector","code":"lenz994885766428","lastChange":{"date":"2023-07-18 11:16:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTz9N9R","examplePageUrl":"","moduleKey":"LenzPlatformPlentyConnector","creationDate":{"date":"2022-04-07 09:27:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-07-26 14:17:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-07-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-07-22 15:46:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":245,"prefix":"lenz","name":"LENZ eBusiness GmbH","website":"//lenz-ebusiness.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod245_scs-hersteller-logo.png"},"infos":[{"id":26226,"name":"plentymarkets Connector","description":"<p>Der plentymarkets Connector synchronisiert wichtige Daten zwischen plentymarkets und Shopware. So überträgt der Connector Artikel- und Kategoriedaten aus plentymarkets zu Shopware. Von Shopware überträgt der Connector alle Daten zu den Bestellungen an plentymarkets. Auf diese Weise können die Daten optimal gepflegt werden und sind immer aktuell. <br>Zu den Artikeldaten, die übertragen werden, gehören zusätzliche Freitextfelder, Artikelbilder, Hersteller und Eigenschaften wie Farbe, Größe, Gewicht usw.<br>Für den Bestellprozess passt unser Connector automatisch den Bestell- und Zahlungsstatus in plentymarkets an, damit die Bestellungen effizient verarbeitet werden können. So wird der Bestellstatus \"komplett abgeschlossen/komplett ausgeliefert\" einer Bestellung vom Connector von Shopware zu plentymarkets übertragen und dort als versendet markiert. Damit die Status korrekt zugeordnet werden können, muss in der jeweiligen Versand- und Zahlungsart in einem Zusatzfeld die passende Plenty ID hinterlegt werden. <br>Optional hast Du die Möglichkeit in Shopware im Verkaufskanal die plentmarkets Auftragsherkunft/Markt/Verkaufskanal-ID zu hinterlegen. Dadurch werden Artikel, denen im plentymarkets diese ID zugeordnet ist, auch nur in diesem Verkaufskanal sichtbar.<br>Die Daten werden in regelmäßigen Abständen zwischen plentymarkets und Shopware synchronisiert.</p><p><b>Wichtig:</b> Es ist kein zusätzliches Plugin in plentymarkets notwendig.&nbsp;</p><h2>Voraussetzungen</h2><p>Es wird ein Memory Limit von mindestens 1 GB benötigt. Je mehr Artikeldaten vorhanden sind desto mehr Speicher wird benötigt.</p><h2>Konfiguration</h2><p><b>Plenty ID:</b>&nbsp;Hinterlege hier Deine plentymarkets ID.<br><b>Plenty URL:</b>&nbsp;Gib hier die Plenty URL Deiner plentymarkets-WaWi an.<br><b>Plenty Benutzername:&nbsp;</b>Trage hier Deine plentymarkets Benutzernamen ein.<br><b>Plenty Passwort:</b>&nbsp;Hinterlege hier Dein plentymarkets Passwort.<br><b>Sprachen:</b>&nbsp;Lege hier die Sprache Deines Standard-Shops fest.<br><b>Standort ID:&nbsp;</b>Hinterlege hier die Standort ID. Der Connector nutzt die Standort ID um sich die Informationen für die benötigen Steuerangaben zu holen und diese zu hinterlegen. Dies ist besonders wichtig, wenn in plentymarkets mehrere Standorte hinterlegt sind.<br><b>Market ID:</b>&nbsp;Setze hier die Market ID von Shopware 6 ein.<br><b>Vk-Preis-ID:&nbsp;</b>Hier muss die ID des Verkaufspreises angegeben werden, damit der Connector die korrekten Preise zu Shopware übertragen kann.<br><b>UVP-Preis-ID:</b>&nbsp;Hier muss die UVP-Preis-ID angegeben werden, damit der Connector die korrekten Preise zu Shopware übertragen kann.<br><b>Lager-IDs für Bestände verwenden:&nbsp;</b>Die Hinterlegung der Lager-ID ist nötig, damit der Connector die Lagerbestände aus dem korrekten Lager an Shopware übermittelt.<br><b>Shopware übergeordnete Kategorie:</b>&nbsp;Gib hier an welche Kategorie die übergeordnete Kategorie in Deinem Shopware Onlineshop ist. Die Kategorien aus plentymarkets werden dieser Kategorie untergeordnet und bilden somit Dein Menü im Onlineshop.<br><b>Standard-Kategorie-CMS-Seite:&nbsp;</b>Hier kannst Du das gewünschte Layout für Deine Kategorie-Seiten hinterlegen. Bei der ersten Synchronisation, wenn die Kategorien angelegt werden, wird dieses Layout automatisch verwendet.<br><b>Bestellung synchronisieren ab:&nbsp;</b>Wenn im Shop Bestellungen vorhanden sind, die nicht zu plentymarkets übermittelt werden sollen da diese durch einen anderen Connector übertragen wurden, kannst Du hier einstellen ab wann die Bestellungen übertragen werden. Sofern hier nichts eingetragen ist, werden keine Bestellungen übertragen.<br><b>Produktdatenabgleich aktiv:&nbsp;</b>Aktiviere diese Option, wenn dieser Typ des Datenabgleichs gewünscht ist.<br><b>Lagerbestandabgleich aktiv:&nbsp;</b>Aktiviere diese Option, wenn dieser Typ des Datenabgleichs gewünscht ist.<br><b>Bestellabgleich aktiv: </b>Aktiviere diese Option, wenn dieser Typ des Datenabgleichs gewünscht ist.</p><h2>Individuelle Konfiguration</h2><p>Der Connector wird mit einer Standard-Konfiguration für diverse Dinge (z.B. welcher Status wird wann in Shopware/plentymarkets gesetzt) ausgeliefert. Dieses Verhalten lässt sich individuell anpassen und kann bei uns kostenpflichtig beauftragt werden. <a href=\"https://bit.ly/plenty-connector-individualisieren\">Vereinbare jetzt einen kostenfreien Termin mit uns</a>, um Deine gewünschte Konfiguration mit uns zu besprechen.<br>Alternativ kannst Du selbständig Anpassungen mit unserem Customization-Plugin vornehmen. Download:&nbsp;<a href=\"https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip</a></p><h2>Weitere Informationen</h2><p><b>Allgemein&nbsp;<br></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der Apps nicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können.&nbsp;</p><p><b>Kompatibilität&nbsp;<br></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der App-Beschreibung an. <br>Wir können die Kompatibilität unserer Apps zu Apps anderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angeboten Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support&nbsp;<br></b>Wir prüfen ob der angegebene Fehler von unserer App verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unsere App vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion&nbsp;<br></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unser App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicherzugehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen<br></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p style=\"color: rgb(96, 113, 130);\">Fehlt Dir für unser App, die in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion?&nbsp;<a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"nooper\">Dann teile uns Deinen Featurewunsch mit.</a></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur&nbsp;<a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"nooper\">Newsletter Anmeldung</a>.<br>Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt.&nbsp;","installationManual":"<p>Die Installationsanleitung findest Du auf unsere Webseite:&nbsp;<a href=\"https://lenz-ebusiness.de/plentymarkets-connector-shopware-6/\" target=\"_blank\" rel=\"noreferrer\">https://lenz-ebusiness.de/plentymarkets-connector-shopware-6/</a></p><p><br></p><p>Hinweis zur Installationsanleitung: Bei allen von Shopware zertifizierten Hostern kann ein Cronjob angelegt werden.</p><p>---</p><p>Download des Customization-Plugins:&nbsp;<a href=\"https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip</a></p>","shortDescription":"Der plentymarkets Connector bietet Dir die Möglichkeit ohne großen Aufwand wichtige Daten, wie Artikeldaten, zwischen plentymarkets und Shopware zu synchronisieren.","highlights":"Beratung und Demo vor dem Kauf der App möglich\nKundenservice per Telefon erreichbar\nEinfache Pflege der Daten zwischen plentymarkets und Shopware +++ Für Agenturen: Austauschgruppe zum Connector in Microsoft Teams\nRegelmäßige Synchronisation der Daten +++ Statusanzeige des Sync-Fortschritts im Shopware Adminbereich\nDirekte Verbindung zwischen plentymarkets und Shopware +++ kein Plugin in Plentymarkets notwendig","features":"Übertragung aller Artikeldaten zu Shopware\n-> Übertragung der Artikelverfügbarkeiten\n-> Übertragen der Kategorien\n-> Übertragen der Hersteller\n-> Übertragen der Steuersätze\n-> Übertragen der Eigenschaften\n-> Übertragen der Einheiten\n-> Übertragen der Artikel-Bilder\n-> Übertragen der Artikel\nÜbertragung der Bestellungen zu plentymarkets\n-> Pro Zahlungsart einstellbar: Übertragung der Zahlungen zu plentymarkets\n-> Übertragung des Bestellstatus von plentymarkets zu Shopware\nIndividualisierbare Datenübertragung (Artikeldaten und Bestelldaten) mit Customization-Plugin: https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip"},{"id":26227,"name":"plentymarkets Connector","description":"<p>The plentymarkets Connector synchronises important data between plentymarkets and Shopware. The connector transfers article and category data from plentymarkets to Shopware. From Shopware, the Connector transfers all data on orders to plentymarkets. In this way, the data can be optimally maintained and is always up-to-date. <br>The item data that is transferred includes additional free text fields, item images, manufacturers and properties such as colour, size, weight etc.<br>For the order process, our connector automatically adjusts the order and payment status in plentymarkets so that orders can be processed efficiently. For example, the order status \"fully completed/completely shipped\" of an order is transferred from Shopware to plentymarkets by the connector and marked as shipped there.&nbsp;In order for the statuses to be correctly assigned, the appropriate Plenty ID must be stored in an custom field in the respective shipping and payment type.<br>Optionally, you have the option in Shopware to store the plentymarkets order referrer/market/sales channel ID in the sales channel. This means that articles to which this ID is assigned in plentymarkets are only visible in this sales channel.<br></p><p>The data is synchronised between plentymarkets and Shopware at regular intervals.</p><h2>Configuration</h2><p><b>Plenty ID:</b>&nbsp;Enter your plentymarkets ID here.<br><b>Plenty URL:</b>&nbsp;Enter here the Plenty URL of your plentymarkets-WaWi.<br><b>Plenty username:</b>&nbsp;Enter your plentymarkets username here.<br><b>Plenty password:</b>&nbsp;Enter your plentymarkets password here.<br><b>Languages:</b>&nbsp;Set the language of your default shop here.<br><b>Location ID:</b>&nbsp;Store the location ID here. The connector uses the location ID to get the information for the required tax details and to store them. This is particularly important if several locations are stored in plentymarkets.<br><b>Market ID:&nbsp;</b>Set the Market ID of Shopware 6 here.<br><b>Retail price ID:</b>&nbsp;The ID of the sales price must be entered here so that the connector can transfer the correct prices to Shopware.<br><b>Suggested retail price ID:</b>&nbsp;The suggested retail price ID must be entered here so that the connector can transfer the correct prices to Shopware.<br><b>Use warehouse IDs für stocks:</b>&nbsp;The storage of the warehouse ID is necessary so that the Connector transmits the warehouse stocks from the correct warehouse to Shopware.<br><b>Shopware parent category:</b>&nbsp;Specify here which category is the parent category in your Shopware online shop. The categories from plentymarkets are subordinated to this category and thus form your menu in the online shop.<br><b>Standard-Category CMS-page:</b>&nbsp;Here you can store the desired layout for your category pages. This layout will be used automatically during the first synchronisation when the categories are created.<br><b>Sync orders from:&nbsp;</b>If there are orders in the shop that are not to be transferred to plentymarkets because they were transferred through another connector, you can set here from when the orders are transferred.If nothing is entered here, no orders will be transferred.<br><b>Product sync active:&nbsp;</b>Activate this option if this type of data matching is desired.<br><b>Stock sync active:</b> Activate this option if this type of data matching is desired.<br><b>Order sync active</b>:&nbsp;Activate this option if this type of data matching is desired.</p><h2>Individual configuration</h2><p>The connector is delivered with a standard configuration for various things (e.g. which status is set when in Shopware/plentymarkets). This behaviour can be customised and can be ordered from us for a fee. <a href=\"https://bit.ly/plenty-connector-individualisieren\">Please arrange a free appointment with us </a> to discuss your desired configuration.</p>","installationManual":"<p>You can find the installation instructions on our website:&nbsp;<a href=\"https://lenz-ebusiness.de/plentymarkets-connector-shopware-6/\" target=\"_blank\" rel=\"noreferrer\">https://lenz-ebusiness.de/plentymarkets-connector-shopware-6/</a></p>","shortDescription":"The plentymarkets Connector offers you the possibility to synchronise important data, such as item data, between plentymarkets and Shopware without much effort.","highlights":"Consultation and demo possible before purchasing the app\nCustomer service available by phone\nEasy data maintenance between plentymarkets and Shopware +++ For agencies: Exchange group on the Connector in Microsoft Teams\nRegular synchronisation of data +++ Status display of the sync progress in the Shopware admin area\nDirect connection between plentymarkets and Shopware +++ No plugin in Plentymarkets necessary","features":"Transfer of all item data to Shopware\n-> Transfer of the article availabilities\n-> Transfer of the categories\n-> Transfer of the manufacturers\n-> Transfer of the tax rates\n-> Transfer of the properties\n-> Transfer of the units\n-> Transferring the article images\n-> Transfer of articles\nTransfer of orders to plentymarkets\n-> Adjustable per payment type: Transfer of payments to plentymarkets\n-> Transfer of order status from plentymarkets to Shopware\nNote: Multilingualism will be added with one of the next updates!\nCustomisable data transfer (item data and order data)"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165389,"bookingKey":"lenz994885766428_M","bookingText":"Plentymarkets Connector","price":149,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuXbUuv","preview":true,"priority":0,"id":93781},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phph2dmp8","preview":false,"priority":0,"id":93989},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyJuDo6","preview":false,"priority":0,"id":93990},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0vL3M0","preview":false,"priority":0,"id":93991},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkRsbiW","preview":false,"priority":0,"id":93992},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRnki8F","preview":false,"priority":0,"id":94242}],"comments":[{"authorName":"HANV UG","text":"Wir sind in letzter Minute von einem anderen Anbieter auf den Lenz Connector  umgestiegen bzw. mussten dies gezwungener Maßen, da der vorherige Connector extrem problembehaftet war und der Support absolut mangelhaft. Diese Entscheidung haben wir keine Sekunde bereut. Der Connector läuft stabil ohne Übertragungsprobleme und ist vom Handling her super.\nDer gesamte Einrichtungsprozess war unkompliziert und wir sind extrem gut vom Lenz Team betreut worden.\nAlle nötigen Anpassungen wurden schnell umgesetzt. Bei Problemen oder Unklarheiten wurde sofort lösungsorientiert daran gearbeitet, diese zu lösen.\nAllgemein gibt der Connector viel Spielraum, um individuelle Anpassungen vorzunehmen. \nVom Support her ist Lenz eines der besten IT-Unternehmen, mit denen wir je zusammen gearbeitet haben. Wir haben hier sofort einen Ansprechpartner gehabt, der sich ebenfalls sofort um unser Anliegen gekümmert hat. Auf Notfälle wurde in der Regel in unter 4 Stunden reagiert und eine Lösung angeboten. Der Mitarbeiter, der uns unterstützt hat, war immer hilfreich, interessiert und zielorientiert. \nJeder Cent ist hier bestens investiert. Wir würden uns jederzeit wieder für Lenz entscheiden.","headline":"Zuverlässiger Connector","creationDate":{"date":"2022-08-09 22:34:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"plentymarkets Connector","description":"<p>Der plentymarkets Connector synchronisiert wichtige Daten zwischen plentymarkets und Shopware. So überträgt der Connector Artikel- und Kategoriedaten aus plentymarkets zu Shopware. Von Shopware überträgt der Connector alle Daten zu den Bestellungen an plentymarkets. Auf diese Weise können die Daten optimal gepflegt werden und sind immer aktuell. <br />Zu den Artikeldaten, die übertragen werden, gehören zusätzliche Freitextfelder, Artikelbilder, Hersteller und Eigenschaften wie Farbe, Größe, Gewicht usw.<br />Für den Bestellprozess passt unser Connector automatisch den Bestell- und Zahlungsstatus in plentymarkets an, damit die Bestellungen effizient verarbeitet werden können. So wird der Bestellstatus \"komplett abgeschlossen/komplett ausgeliefert\" einer Bestellung vom Connector von Shopware zu plentymarkets übertragen und dort als versendet markiert. Damit die Status korrekt zugeordnet werden können, muss in der jeweiligen Versand- und Zahlungsart in einem Zusatzfeld die passende Plenty ID hinterlegt werden. <br />Optional hast Du die Möglichkeit in Shopware im Verkaufskanal die plentmarkets Auftragsherkunft/Markt/Verkaufskanal-ID zu hinterlegen. Dadurch werden Artikel, denen im plentymarkets diese ID zugeordnet ist, auch nur in diesem Verkaufskanal sichtbar.<br />Die Daten werden in regelmäßigen Abständen zwischen plentymarkets und Shopware synchronisiert.</p><p><b>Wichtig:</b> Es ist kein zusätzliches Plugin in plentymarkets notwendig. </p><h2>Voraussetzungen</h2><p>Es wird ein Memory Limit von mindestens 1 GB benötigt. Je mehr Artikeldaten vorhanden sind desto mehr Speicher wird benötigt.</p><h2>Konfiguration</h2><p><b>Plenty ID:</b> Hinterlege hier Deine plentymarkets ID.<br /><b>Plenty URL:</b> Gib hier die Plenty URL Deiner plentymarkets-WaWi an.<br /><b>Plenty Benutzername: </b>Trage hier Deine plentymarkets Benutzernamen ein.<br /><b>Plenty Passwort:</b> Hinterlege hier Dein plentymarkets Passwort.<br /><b>Sprachen:</b> Lege hier die Sprache Deines Standard-Shops fest.<br /><b>Standort ID: </b>Hinterlege hier die Standort ID. Der Connector nutzt die Standort ID um sich die Informationen für die benötigen Steuerangaben zu holen und diese zu hinterlegen. Dies ist besonders wichtig, wenn in plentymarkets mehrere Standorte hinterlegt sind.<br /><b>Market ID:</b> Setze hier die Market ID von Shopware 6 ein.<br /><b>Vk-Preis-ID: </b>Hier muss die ID des Verkaufspreises angegeben werden, damit der Connector die korrekten Preise zu Shopware übertragen kann.<br /><b>UVP-Preis-ID:</b> Hier muss die UVP-Preis-ID angegeben werden, damit der Connector die korrekten Preise zu Shopware übertragen kann.<br /><b>Lager-IDs für Bestände verwenden: </b>Die Hinterlegung der Lager-ID ist nötig, damit der Connector die Lagerbestände aus dem korrekten Lager an Shopware übermittelt.<br /><b>Shopware übergeordnete Kategorie:</b> Gib hier an welche Kategorie die übergeordnete Kategorie in Deinem Shopware Onlineshop ist. Die Kategorien aus plentymarkets werden dieser Kategorie untergeordnet und bilden somit Dein Menü im Onlineshop.<br /><b>Standard-Kategorie-CMS-Seite: </b>Hier kannst Du das gewünschte Layout für Deine Kategorie-Seiten hinterlegen. Bei der ersten Synchronisation, wenn die Kategorien angelegt werden, wird dieses Layout automatisch verwendet.<br /><b>Bestellung synchronisieren ab: </b>Wenn im Shop Bestellungen vorhanden sind, die nicht zu plentymarkets übermittelt werden sollen da diese durch einen anderen Connector übertragen wurden, kannst Du hier einstellen ab wann die Bestellungen übertragen werden. Sofern hier nichts eingetragen ist, werden keine Bestellungen übertragen.<br /><b>Produktdatenabgleich aktiv: </b>Aktiviere diese Option, wenn dieser Typ des Datenabgleichs gewünscht ist.<br /><b>Lagerbestandabgleich aktiv: </b>Aktiviere diese Option, wenn dieser Typ des Datenabgleichs gewünscht ist.<br /><b>Bestellabgleich aktiv: </b>Aktiviere diese Option, wenn dieser Typ des Datenabgleichs gewünscht ist.</p><h2>Individuelle Konfiguration</h2><p>Der Connector wird mit einer Standard-Konfiguration für diverse Dinge (z.B. welcher Status wird wann in Shopware/plentymarkets gesetzt) ausgeliefert. Dieses Verhalten lässt sich individuell anpassen und kann bei uns kostenpflichtig beauftragt werden. <a href=\"https://bit.ly/plenty-connector-individualisieren\">Vereinbare jetzt einen kostenfreien Termin mit uns</a>, um Deine gewünschte Konfiguration mit uns zu besprechen.<br />Alternativ kannst Du selbständig Anpassungen mit unserem Customization-Plugin vornehmen. Download: <a href=\"https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip\" target=\"_blank\" rel=\"noreferrer noopener\">https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip</a></p><h2>Weitere Informationen</h2><p><b>Allgemein <br /></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der Apps nicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können. </p><p><b>Kompatibilität <br /></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der App-Beschreibung an. <br />Wir können die Kompatibilität unserer Apps zu Apps anderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angeboten Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support <br /></b>Wir prüfen ob der angegebene Fehler von unserer App verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unsere App vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion <br /></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unser App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicherzugehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen<br /></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unser App, die in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion? <a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"noreferrer noopener\">Dann teile uns Deinen Featurewunsch mit.</a></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur <a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter Anmeldung</a>.<br />Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt. ","installationManual":"<p>Die Installationsanleitung findest Du auf unsere Webseite: <a href=\"https://lenz-ebusiness.de/plentymarkets-connector-shopware-6/\" target=\"_blank\" rel=\"noreferrer noopener\">https://lenz-ebusiness.de/plentymarkets-connector-shopware-6/</a></p><p><br /></p><p>Hinweis zur Installationsanleitung: Bei allen von Shopware zertifizierten Hostern kann ein Cronjob angelegt werden.</p><p>---</p><p>Download des Customization-Plugins: <a href=\"https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip\" target=\"_blank\" rel=\"noreferrer noopener\">https://lenz-ebusiness.de/files/lenz-ebusiness/download/LenzPlatformPlentyConnectorCustomization.zip</a></p>","version":"5.0.0","changelog":[{"version":"5.0.0","text":"<p>IMPROVEMENT | Check if order exists in plentymarkets before creating.</p><p>IMPROVEMENT | Use PIM route for stock update.</p><p>IMPROVEMENT | Stock update for product sync modified.</p><p>IMPROVEMENT | Titles longer than 40 characters are truncated.</p><p>IMPROVEMENT | Shipping discounts are synced now.</p><p><br /></p><p><b>Notices:</b></p><p>- Please update your mapping definitions for `lenz_platform_plenty_connector.mapping.product_stock` if modified.</p><p>- Product stock is only synced once via product sync and then with product stock sync.</p><p>- Titles longer than 40 characters are truncated due to a limitation in plentymarkets.</p>","creationDate":{"date":"2023-07-14 09:29:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- TASK | Compatibility with Shopware 6.5.</p><p><br /></p><p>Requirements:</p><p>- The plugin now requires at least Shopware version 6.5.0.0.</p><p><b>Note: BEFORE UPDATING TO SHOPWARE 6.5.0.0, deactivate the app, then update, then activate.</b></p>","creationDate":{"date":"2023-04-06 15:50:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- BUGFIX | Meta description is now cut off after 255 characters.</p><p>- IMPROVEMENT | Company accounts are created and linked on order sync.</p>","creationDate":{"date":"2023-04-04 09:49:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- IMPROVEMENT | Order sync: Added mail address to address.</p><p>- IMPROVEMENT | Order sync: Added title to address.</p><p>- IMPROVEMENT | Order sync: Corrected vat id and phone number mapping.</p><p>- TASK | General sourcecode improvements.</p><p>- IMPROVEMENT | Added error handling for api errors.</p><p>- IMPROVEMENT | Added mapping events to allow easy mapping manipulation.</p><p>- IMPROVEMENT | Added default value to MappingField.</p><p>- IMPROVEMENT | Added method to create unified Context for AbstractProcessService.</p><p>- TASK | Added info variables to OrderSyncCommand.</p><p>- IMPROVEMENT | Added ORDER_ENTRY_AT when syncing orders to plentymarkets.</p><p>- BUGFIX | Use last transactions payment method instead of first, because of payment method changes.</p><p>- BUGFIX | Corrected tax handling on order sync.</p><p>- BUGFIX | Adjusted StateMachineStates on updateing states from plentymarkets.</p><p>- IMPROVEMENT | Update order state from shopware only if there was a change since last sync.</p><p>- FEATURE | Added option to use \"stock\" as \"available stock\".</p><p>- TASK | Minor code quality updates.</p><p>- BUGFIX | Added handling for empty unit.</p><p>- TASK | PHP 7.4 compatibility.</p><p>- IMPROVEMENT | Basic support for codegiganten - Earn Bonus Points With Purchases.</p><p>- IMPROVEMENT | Improved empty phone number handling.</p><p>- TASK | Improved error handling for contact creation.</p><p>- IMPROVEMENT | Use time() for detecting item stock updates.</p><p>- TASK | Order updates from Shopware are synced at least for 7 days.</p><p>- IMPROVEMENT | Added error mail for order update from plentymarkets.</p><p><br /></p><p>Please test this update in a staging environment before installing in production system!</p>","creationDate":{"date":"2022-11-21 16:20:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- IMPROVEMENT | Added flock() in console commands.</p><p>- BUGFIX | Prevent warning if no warehouse is assigned to an item.</p><p>- BUGFIX | Product category assignment corrected.</p><p>- BUGFIX | Product property assignment corrected.</p><p>- BUGFIX | Product option assignment corrected.</p><p>- IMPROVEMENT | Added variation name to mapping.</p><p>- IMPROVEMENT | Added notification to administration, if full sync is reset.</p><p>- IMPROVEMENT | By default only sales warehouses are used for stock calculation.</p><p>- FEATURE | Multiple languages can now be synced.</p>","creationDate":{"date":"2022-08-03 21:43:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- BUGFIX | Update custom fields on plugin update.</p><p>- BUGFIX | Sales channel assignment corrected.</p><p>- TASK | Updated translations for settings.</p><p>- FEATURE | Reset full sync via button in administration.</p><p>- IMPROVEMENT | Added more information for syncs to administration.</p><p>- BUGFIX | Stock calculation corrected.</p>","creationDate":{"date":"2022-07-28 01:08:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- TASK | Corrected typos.</p><p>- FEATURE | Added support for cart-discounts in order sync.</p><p>- IMPROVEMENT | Set mail addresses for sync notifications dynamically.</p><p>- FEATURE | Sales channel assignment for products by market id via custom field.</p>","creationDate":{"date":"2022-07-27 12:10:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- BUGFIX | Minor bugfixes.</p>","creationDate":{"date":"2022-07-25 11:55:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release for Shopware 6.</p>","creationDate":{"date":"2022-07-22 15:49:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=lenz994885766428","redirectToStore":false,"lowestPriceValue":149}