{"id":15187,"name":"AlphaSEOApp","code":"alpha52548085954","lastChange":{"date":"2023-07-18 11:16:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbQzzFz","examplePageUrl":"","moduleKey":"AlphaSEOApp","creationDate":{"date":"2022-04-29 13:54:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-06-14 15:32:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-06-30 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-12-16 11:58:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1046,"prefix":"alpha","name":"alphanauten - Agentur für Digitale Markenwelten","website":"//alphanauten.de","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod1046_icon_128x128.jpg"},"infos":[{"id":26461,"name":"SEO Suite - Das #01 Tool für Shopware Suchmaschinenoptimierung","description":"<p>Seit Suchmaschinenoptimierung oder kurz SEO zu einem zentralen Thema in der digitalen E-Commerce-Welt geworden ist, suchen Marketing Teams und Shop-Betreiber nach Mitteln und Wegen ihrer Seiten zu optimieren. Mit unserem SEO Suite Plugin wollen wir allen die Chance geben, das Ranking der Produkte und Inhalte effizient zu verbessern.</p><p><br></p><h2>SEO Suite Shopware</h2><p>Unsere Cloud-basierte SEO Suite App stellt die wichtigsten Metriken für die Suchmaschinenoptimierung übersichtlich dar. Das Toolset hilft nicht nur dabei, Beschreibungen, Titel und Meta-Daten zu optimieren, sondern bietet auch die Möglichkeit, die SEO Performance der Produkte oder Kategorieseiten nachzuvollziehen.&nbsp;Dabei haben wir versucht, ein möglichst einfaches Interface zu schaffen, dass sich nahtlos in die Shopware 6 Welt eingliedern soll, um jedem Anwender möglichst einen einfachen Einstieg zu ermöglichen.&nbsp;Im Laufe der Zeit werden immer mehr Features hinzugefügt, um SEO in seinem ganzen Spektrum abzubilden. Du kannst dich auf Keyword-Analysen und AI-gesteuerte Textvorschläge freuen.&nbsp;</p><p><br></p><p>Die SEO Suite hilft die <b>Best Practices</b> der SEO-Komponenten der Produkte und weiterer Seiten für &nbsp;Titel, Beschreibungen, Keywords, Metadaten und vieles mehr umzusetzen. Dabei wird besonders auf die Textlänge, Lesbarkeit und Struktur geachtet.&nbsp;Wir wollen die technische Basis von Shopware im Bereich SEO weiter verbessern und eine All-in-One-Lösung für jeden Shopware-Shop bieten.&nbsp; Unser Plugin setzt keine SEO Kenntnisse voraus. Es ist intuitiv zu bedienen.</p><br><h3>Allgemeiner SEO-Score</h3><p>Unsere App analysiert alle Produkte des Systems auf ihren Inhalt und führt dabei unterschiedlichste Metriken zusammen um einen globalen SEO Score zu ermitteln. Über eine einfache Darstellung lässt sich auch leicht nachvollziehen, wie viele Produkte bereits optimiert sind und welche Produkte noch Arbeit benötigen.</p><p><br></p><h3>Einfaches und intuitives Interface</h3><p>Das Plugin wurde von uns erstellt um eine hervorragende Erfahrung bei der Optimierung von Suchmaschinen zu erzeugen. Daher haben wir das Interface intuitiv aufgebaut und versuchen, die wichtigsten Mittel unmittelbar zur Verfügung zu stellen. Auch ohne technische Vorkenntnisse, Kurse oder Schulungen, lässt sich die App im Bereich SEO nutzen, um Schritt für Schritt an den Inhalten zu arbeiten und das Ranking des Shops zu verbessern.</p><p><br></p><h3>Lesbarkeitsanalyse</h3><p>Die SEO Suite App errechnet durch verschiedene Algorithmen auch die Lesbarkeit der Inhalte und bietet damit einen schnellen Überblick über Verbesserungspotentiale der Inhalte, die auch ohne SEO wichtig sind.</p><p><br></p><h3>Google Vorschau bzw. SERP-Vorschau</h3><p>Außerdem zeigt die App auch eine Vorschau der SERP bzw. Suchmaschineneinträge, was bedeutet, dass man eine einfache Möglichkeit hat, die Meta-Daten und die Darstellung bei Google und Co direkt zu kontrollieren.</p><h4><br></h4><h3>Lighthouse - SEO Metriken (Google)</h3><p>Mit Suchmaschinenoptimierung verbinden viele hauptsächlich die Optimierung der Inhalte. Genauso wichtig ist eine technisch gute und optimierte Basis des Shops. Daher haben wir den von Google zur Verfügung gestellten Lighthouse Scan mit integriert, der eine Basis für technische SEO darstellt. Ein guter Lighthouse Performance Score ist ungemein wichtig für das Ranking in Suchmaschinen. Google und auch andere Suchmaschinen nehmen die&nbsp;<a href=\"https://support.google.com/webmasters/answer/9205520\">Core Web Vitals</a> &nbsp;(CWV) sehr ernst. Die Darstellung des Spielstands war damit für uns selbstverständlich um einen Überblick über die technische Basis zu schaffen.</p><br><h2>Inbound &amp; Outbound Link Checker (bald verfügbar)</h2><p>Um seine Inhalte für Suchmaschinen zu optimieren sind Inbound und Outbound Links sehr wichtig. Unser Plugin prüft die ausgehenden und querverweisenden Links und zeigt damit Potentiale auf.</p><p><br></p><h2>Bilder-SEO</h2><p>Bilder sind ein grundlegender Bestandteil des WWW, daher sollten diese auch optimiert sein, um bei SEO zu überzeugen. Unser Plugin überprüft die Bilder auf genau solche SEO-Merkmale.&nbsp;</p><p><br></p><p>Wenn Du Fragen hast oder Hilfe brauchst, melde Dich gerne bei uns. Deine galaktische Crew der alphanauten SW Entwickler und SEO Techniker freut sich auf dein Feedback und alle Rückfragen. Anbei ein Link zu einer&nbsp;<a href=\"https://alphanauten.de/shopware/plugin-entwicklung/seo-suite/\" target=\"_blank\" rel=\"noreferrer\">SEO Suite Vorstellung</a>&nbsp;auf der alphanauten Homepage.</p><p><br></p><h2>Coming soon - Neue Funktionen</h2><ul><li>Verwandte Keywords - Schlüsselwörter anzeigen</li><li>SEO Meta Beschreibung Generator (AI)</li><li>Focus Keyword generieren / Selektor</li><li>Keyword Density Checker</li><li>Plagiat-Prüfung / Inhaltskopie-Prüfung</li><li>Inhalt Einzigartigkeitsprüfung</li><li>Grammatik-Prüfer</li><li>Tag-Generator mit vorgeschlagenen Keywords</li><li>Google Search Console-Integration</li><li>Google Schema-Auszeichnung(en)</li></ul><h2></h2><p></p>","installationManual":"<p>Nach der Installation wird das Plugin unter dem Menüpunkt: <b>Inhalte </b>angezeigt.</p><p>Hier wird die Analyse angestoßen. Diese nimmt erstmal etwas Zeit in Anspruch je nachdem wie viele Produkte im Shop vorhanden sind.</p><p><br></p><p>Sollte es bei dem Analyse-Prozess zu Problemen kommen, zögern Sie nicht uns anzusprechen. Wir helfen gerne weiter.</p><p><br></p>","shortDescription":"Auf der Suche nach einem professionellen SEO Plugin für deinen Shopware Shop? Dann ist unsere SEO Suite das perfekte SEO Tool Bundle um deinen SW Shop für Suchmaschinen zu optimieren.","highlights":"Lighthouse Performance Score\nFokus Keyword Analyse für SEO\nKeyword Density Checker","features":"Textlängenüberprüfung für Titel, Beschreibung und Metadaten\nAnalyse der Keywords in Texten und Headern\nÜberprüft die Struktur der Beschreibung auf SEO\nLesbarkeitsanalyse (Readability Score)\nBilder werden auf fehlende Alt-Tags gecheckt"},{"id":26462,"name":"SEO Suite - The #01 tool for Shopware search engine optimization","description":"<p>Since Search Engine Optimization, popularly known as SEO is playing a vital role to be ranked on Google and others, we have decided to create a plugin to boost your products and shop content.&nbsp;Our Cloud-based SEO Suite Plugin itself is easy to use and it will give you a seamless SEO experience for your online shop. Since it is a Cloud-based plugin, you will never feel a speed problem with your website after installing it. Not only that, our plugin will let you know some of the very important Technical SEO aspects that should follow. The intuitive design will fit with your existing website and you can check your website’s overall SEO score at a glance.</p><p><br></p><h2>SEO Suite Shopware Plugin</h2><p>SEO Suite will recommend to you the best practices SEO metrics for your products such as Title, Description, Focus Keywords, Alt Text, Overall SEO Score, Keyword Density Checker, SEO Word Counter and many more.&nbsp;As you already know, Shopware itself already has some SEO options nevertheless we have added many more features in our Plugin. That’s why our plugin is kind of All-in-one SEO for Shopware shops. Let’s explain why we say that…</p><p><br></p><h3>Overall SEO Score</h3><p>Our plugin’s built-in system will analyze your content and show you an overall SEO Score or Report. By checking that score you can optimize your content further. This is really a handy option to optimize your content in one place.&nbsp;</p><p><br></p><h3>Clean and easy-to-use interface</h3><p>This plugin is made to give a great experience of doing SEO. That’s why we have built it as clean as possible with an easy-to-use interface. Without any technical knowledge you can use our plugin. It will show you the step by step process of SEO.</p><p><br></p><h3>Readability Analysis</h3><p>SEO Suite Plugin has an option where you can see your content’s readability score and suggestions so that you can optimize more and get better results.</p><p><br></p><h3>Google Preview or SERP Preview</h3><p>In our plugin you can see the SERP or Search Engine Result Page preview that means you have the option to see how it will look like in the giant Search Engine Google.</p><p><br></p><h3>Lighthouse Performance Score</h3><p>We also have a very important feature called Lighthouse Performance Score. This built-in feature is one of the vital pillars when it comes to doing Technical SEO. A good Lighthouse Performance Score is very important to have a good score on search engines. Google is taking the&nbsp;<a href=\"https://support.google.com/webmasters/answer/9205520\" target=\"_blank\" rel=\"noreferrer\">Core Web Vitals</a>&nbsp;(CWV) report so seriously. And we are happy that with our plugin you can check the things you should optimize to get a great score.</p><p><br></p><p><br></p><h2>Individual SEO results for each segment</h2><p>With our plugin you can check SEO results for each and every segment of your content such as SEO Title Score, Keyword Density Score, Title Length Checker etc.</p><p><br></p><p><br></p><h2>Control your SEO Title and Meta</h2><p>SEO Suite Plugin will give you a chance to optimize your Title, Meta Description on the fly and see the preview too.&nbsp;</p><p><br></p><p><br></p><h2>Inbound &amp; Outbound Link Checker</h2><p>To optimize your content for search engines, to have Inbound and Outbound links are very important. And our plugin will check whether your content has Inbound and Outbound links or not.</p><p><br></p><h2>Image SEO</h2><p>Image is also a big part of the web. So images should be also optimized for a good SEO rank. That’s why we have image SEO built-in checkers. It will suggest and let you know if you forget to add Alt Text Attributes on your images.</p><p><br></p><p><br></p><p>Coming soon features:&nbsp;</p><p></p><ul><li>Showing Related Keywords</li><li>SEO Meta Description Generator</li><li>Focus Keyword Maker / Selector</li><li>Keyword Density Checker</li><li>Plagiarism Checker / Copy Content Checker</li><li>Content Uniqueness Checker</li><li>Grammar Checker</li><li>Tag generator with suggested keywords</li><li>Google Search Console Integration</li><li>Google Schema Markup</li></ul><p></p><h2><p></p></h2><p></p>","installationManual":"<p>After the installation of the plugin it is available at the <b>content </b>menu.</p><p>Here you will start the analysis process. This will take some time depending on how many product will be analyzed.</p><p><br></p><p>If any problems occur while this process is running, don't hesitate to contact us. We'd love helping you.</p><p><br></p>","shortDescription":"Are you looking for a professional SEO plugin for your Shopware store? Then our SEO Suite is the perfect SEO tool bundle to optimize your SW store for search engines.","highlights":"Lighthouse Performance Score\nFocus Keyword box for SEO\nBuilt-in Keyword Density Checker","features":"Meta description character score/scale \nKeywords in Meta Description Checker\nPermalink checker whether it has a focus keyword or not\nChecks the first paragraph to see whether it has a focus keyword or not\nCount words for SEO health\nShows the Readability Score\nImage Alt Text Attribute Checker\nChecks whether the sub-heading has Focus Keywords or not\nChecks whether the description has an Image and Video or not"}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165603,"bookingKey":"alpha52548085954_M","bookingText":"SEO Suite - The tool for search engine optimization","price":29,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZ1o4B6","preview":true,"priority":6,"id":94697},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpi3sCmS","preview":false,"priority":10,"id":94691},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3KVjyR","preview":false,"priority":9,"id":94689},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRgWJpp","preview":false,"priority":8,"id":94686},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5zAokD","preview":false,"priority":7,"id":94693},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcXvhof","preview":false,"priority":4,"id":94696},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdGJTxc","preview":false,"priority":3,"id":94700},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprDG73Z","preview":false,"priority":2,"id":94685}],"comments":[{"authorName":"Jan Becher","text":"Ein super Tool für die Suchmaschinenoptimierung. Meine Anmerkungen wurden direkt aufgenommen und sollen bald umgesetzt werden. Aber schon jetzt kann man mit der Seo Suite super die Produkte optimieren. Die Vorschläge für Keywords sind hilfreich und die Page Speed Analyse ein toller Bonus. Weiter so.","headline":"Top Tool! Einfach, schnell und übersichtlich","creationDate":{"date":"2022-10-18 12:31:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Karim Garbers","text":"Das Tool macht einen sehr guten Eindruck. Man kann die SEO Einstellungen für jedes Produkt separat optimieren. Der Support antwortet sehr sehr schnell!!!! Vielen Dank noch einmal;-)","headline":"Macht einen sehr guten Eindruck/ Super Support!","creationDate":{"date":"2022-06-16 08:29:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"SEO Suite - Das #01 Tool für Shopware Suchmaschinenoptimierung","description":"<p>Seit Suchmaschinenoptimierung oder kurz SEO zu einem zentralen Thema in der digitalen E-Commerce-Welt geworden ist, suchen Marketing Teams und Shop-Betreiber nach Mitteln und Wegen ihrer Seiten zu optimieren. Mit unserem SEO Suite Plugin wollen wir allen die Chance geben, das Ranking der Produkte und Inhalte effizient zu verbessern.</p><p><br /></p><h2>SEO Suite Shopware</h2><p>Unsere Cloud-basierte SEO Suite App stellt die wichtigsten Metriken für die Suchmaschinenoptimierung übersichtlich dar. Das Toolset hilft nicht nur dabei, Beschreibungen, Titel und Meta-Daten zu optimieren, sondern bietet auch die Möglichkeit, die SEO Performance der Produkte oder Kategorieseiten nachzuvollziehen. Dabei haben wir versucht, ein möglichst einfaches Interface zu schaffen, dass sich nahtlos in die Shopware 6 Welt eingliedern soll, um jedem Anwender möglichst einen einfachen Einstieg zu ermöglichen. Im Laufe der Zeit werden immer mehr Features hinzugefügt, um SEO in seinem ganzen Spektrum abzubilden. Du kannst dich auf Keyword-Analysen und AI-gesteuerte Textvorschläge freuen. </p><p><br /></p><p>Die SEO Suite hilft die <b>Best Practices</b> der SEO-Komponenten der Produkte und weiterer Seiten für  Titel, Beschreibungen, Keywords, Metadaten und vieles mehr umzusetzen. Dabei wird besonders auf die Textlänge, Lesbarkeit und Struktur geachtet. Wir wollen die technische Basis von Shopware im Bereich SEO weiter verbessern und eine All-in-One-Lösung für jeden Shopware-Shop bieten.  Unser Plugin setzt keine SEO Kenntnisse voraus. Es ist intuitiv zu bedienen.</p><br /><h3>Allgemeiner SEO-Score</h3><p>Unsere App analysiert alle Produkte des Systems auf ihren Inhalt und führt dabei unterschiedlichste Metriken zusammen um einen globalen SEO Score zu ermitteln. Über eine einfache Darstellung lässt sich auch leicht nachvollziehen, wie viele Produkte bereits optimiert sind und welche Produkte noch Arbeit benötigen.</p><p><br /></p><h3>Einfaches und intuitives Interface</h3><p>Das Plugin wurde von uns erstellt um eine hervorragende Erfahrung bei der Optimierung von Suchmaschinen zu erzeugen. Daher haben wir das Interface intuitiv aufgebaut und versuchen, die wichtigsten Mittel unmittelbar zur Verfügung zu stellen. Auch ohne technische Vorkenntnisse, Kurse oder Schulungen, lässt sich die App im Bereich SEO nutzen, um Schritt für Schritt an den Inhalten zu arbeiten und das Ranking des Shops zu verbessern.</p><p><br /></p><h3>Lesbarkeitsanalyse</h3><p>Die SEO Suite App errechnet durch verschiedene Algorithmen auch die Lesbarkeit der Inhalte und bietet damit einen schnellen Überblick über Verbesserungspotentiale der Inhalte, die auch ohne SEO wichtig sind.</p><p><br /></p><h3>Google Vorschau bzw. SERP-Vorschau</h3><p>Außerdem zeigt die App auch eine Vorschau der SERP bzw. Suchmaschineneinträge, was bedeutet, dass man eine einfache Möglichkeit hat, die Meta-Daten und die Darstellung bei Google und Co direkt zu kontrollieren.</p><h4><br /></h4><h3>Lighthouse - SEO Metriken (Google)</h3><p>Mit Suchmaschinenoptimierung verbinden viele hauptsächlich die Optimierung der Inhalte. Genauso wichtig ist eine technisch gute und optimierte Basis des Shops. Daher haben wir den von Google zur Verfügung gestellten Lighthouse Scan mit integriert, der eine Basis für technische SEO darstellt. Ein guter Lighthouse Performance Score ist ungemein wichtig für das Ranking in Suchmaschinen. Google und auch andere Suchmaschinen nehmen die <a href=\"https://support.google.com/webmasters/answer/9205520\">Core Web Vitals</a>  (CWV) sehr ernst. Die Darstellung des Spielstands war damit für uns selbstverständlich um einen Überblick über die technische Basis zu schaffen.</p><br /><h2>Inbound &amp; Outbound Link Checker (bald verfügbar)</h2><p>Um seine Inhalte für Suchmaschinen zu optimieren sind Inbound und Outbound Links sehr wichtig. Unser Plugin prüft die ausgehenden und querverweisenden Links und zeigt damit Potentiale auf.</p><p><br /></p><h2>Bilder-SEO</h2><p>Bilder sind ein grundlegender Bestandteil des WWW, daher sollten diese auch optimiert sein, um bei SEO zu überzeugen. Unser Plugin überprüft die Bilder auf genau solche SEO-Merkmale. </p><p><br /></p><p>Wenn Du Fragen hast oder Hilfe brauchst, melde Dich gerne bei uns. Deine galaktische Crew der alphanauten SW Entwickler und SEO Techniker freut sich auf dein Feedback und alle Rückfragen. Anbei ein Link zu einer <a href=\"https://alphanauten.de/shopware/plugin-entwicklung/seo-suite/\" target=\"_blank\" rel=\"noreferrer noopener\">SEO Suite Vorstellung</a> auf der alphanauten Homepage.</p><p><br /></p><h2>Coming soon - Neue Funktionen</h2><ul><li>Verwandte Keywords - Schlüsselwörter anzeigen</li><li>SEO Meta Beschreibung Generator (AI)</li><li>Focus Keyword generieren / Selektor</li><li>Keyword Density Checker</li><li>Plagiat-Prüfung / Inhaltskopie-Prüfung</li><li>Inhalt Einzigartigkeitsprüfung</li><li>Grammatik-Prüfer</li><li>Tag-Generator mit vorgeschlagenen Keywords</li><li>Google Search Console-Integration</li><li>Google Schema-Auszeichnung(en)</li></ul><h2></h2><p></p>","installationManual":"<p>Nach der Installation wird das Plugin unter dem Menüpunkt: <b>Inhalte </b>angezeigt.</p><p>Hier wird die Analyse angestoßen. Diese nimmt erstmal etwas Zeit in Anspruch je nachdem wie viele Produkte im Shop vorhanden sind.</p><p><br /></p><p>Sollte es bei dem Analyse-Prozess zu Problemen kommen, zögern Sie nicht uns anzusprechen. Wir helfen gerne weiter.</p><p><br /></p>","version":"1.1.2","changelog":[{"version":"1.1.2","text":"<p>Improved compatibility with Shopware 6.5</p>","creationDate":{"date":"2023-04-28 13:10:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Sales channel from the plugin configuration decides which url is analyzed.</p>","creationDate":{"date":"2022-11-07 18:04:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Improvements in visuals and new features</p>","creationDate":{"date":"2022-07-04 15:46:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p><b>Release Version</b></p><p><br /></p><p>The kickstarter for SEO</p>","creationDate":{"date":"2022-05-11 23:07:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=alpha52548085954","redirectToStore":false,"lowestPriceValue":29}