{"id":15255,"name":"DvsnLiveshopping","code":"dvsn459222995475","lastChange":{"date":"2023-07-25 08:00:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGejqO7","examplePageUrl":"","moduleKey":"DvsnLiveshopping","creationDate":{"date":"2022-05-11 09:12:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-06-02 08:15:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-05-11 09:14:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":26575,"name":"Liveshopping","description":"\n\n\n\n\n\n\n<h2>\n    Liveshopping - automatisierte Rabattaktionen\n\n</h2><p>\n\n\n\n\n\nDie Shopware AG wird für das Liveshopping Plugin keinen Nachfolger für\nShopware 6 veröffentlichen. Somit müssen alle Shopbetreiber mit Shopware 6 auf dieses\nmächtige Martketing-Instrument verzichten. Bis jetzt...\n\n\n\n\n</p><p>\n\n\n\nDieses Liveshopping Plugin tritt in die großen Fußstapfen des beliebten\nShopware 5 Plugins und verbessert es in zahlreichen Punkten noch weiter. Mit diesem Plugin\nkönnen Sie automatisierte Rabattaktionen in der Zukunft steuern. Die Aktionen werden\ndabei optisch stark hervorgehoben und unterstützen neben steigenden oder fallenden Preisen\nauch begrenzte Bestände.\n\n</p><h4>Standard Rabattaktion</h4><p>\n\nDefinieren Sie eine Rabattaktion für einen Zeitraum in der Zukunft. Der Artikel wird\ninnerhalb des Zeitraums mit einem rabattierten Preis angeboten.\n\n</p><h4>Steigende / fallende Preise</h4><p>\n\n\n\nStatt eines festen Preises für eine Aktion können Sie für den definierten Zeitraum\nauch einen Start- und einen Endpreis angeben. Das Produkt wird dann während des Zeitraums\nimmer günstiger bzw. teurer. Das Interval (z.B. jede Minute, jede Stunde) können Sie\ndabei individuell angeben. Der Kunde wird mit einem interaktiven Countdown darauf hingewiesen\nwann sich ein Produkt verteuert bzw. vergünstigt.\n\n\n\n</p><p>\n\nBei steigenden Preisen werden Kunden belohnt, die schnell zugreifen. Fallende Preise sind\ninsbesondere sinnvoll, wenn Sie den Bestand der Aktion begrenzen. So können Ihre Kunden eine\nWette eingehen, ob sie lieber noch ein wenig warten (für einen günstigeren Preis) oder\ndirekt zuschlagen, um sich ein Produkt aus dem begrenzten Bestand zu sichern.\n\n\n</p><h4>Begrenzter Bestand</h4><p>\n\nSie können für die Aktionen einen begrenzten Bestand hinterlegen, so dass z.B. maximal 10 Stück\ninnerhalb des Zeitraums verkauft werden dürfen. Je nach Einstellung können Sie den Kunden\ndarüber informieren und den Restbestand anzeigen, um ihn für einen schnellen Kauf zu\nanimieren. Sie können wahlweise den Shopware Bestand als maximale Menge hinterlegen - in diesem\nFall wird das Produkt automatisch als \"Abverkauf\" markiert - oder Sie definieren eine\nindividuelle maximale Menge - z.B. 10 Stück. Diese maximale Menge ist unabhängig vom\nShopware Bestand und verfügbarem Bestand und wird bei jedem Kauf automatisch reduziert.\nWährend einer Aktion können Sie diesen Bestand beliebig erhöhen oder verringern.\n\n</p><h4>Ankündigung</h4><p>\n\n\nEine geplante Aktion können Sie auf Wunsch entsprechend ankündigen. In diesem Fall wird\ndarauf hingewiesen, dass das Produkt in Kürze günstiger zu kaufen ist. Zudem können\nSie definieren, ob das Produkt ausschließlich im Zeitraum kaufbar ist. In diesem Fall\nwäre das Produkt vorher nicht kaufbar und ein Countdown zeigt an, wann das Produkt zu kaufen ist.\n\n</p><h4>Preise</h4><p>\n\nFür jede Preisregel können Sie individuelle Preise definieren - z.B. andere Preise für\nHändler oder Stammkunden. Zu jedem Preis können Sie zudem einen beliebigen Streichpreis\nund/oder einen \"Günstigster Preis der letzten 30 Tage\" definieren.\n\n</p><h4>SEO</h4><p>\n\nDas Plugin achtet auf korrekte SEO Angaben und passt z.B. das meta itemprop \"priveValidUntil\"\nautomatisch an den Endzeitpunkt der Aktion an. So haben Sie in Suchmaschinen stets die korrekten Daten.\n\n</p><h4>Dynamische Produkgruppen</h4><p>\n\n\nDas Plugin nutzt für den Status und den Zeitraum einer Aktion die Standard\nZusatzfelder von Produkten. Innerhalb von dynamischen Produktgruppen können Sie somit auf diese\nEigenschaften zugreifen und entsprechende Kategorien oder Übersichtsseiten bilden.\nEin Bereich auf der Startseite könnte so z.B. alle laufenden oder zukünftigen\nAktionen zeigen. Somit sind Sie Ihren Kunden gegenüber stets transparent und können\njede Aktion maximal und vollautomatisch bewerben.\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>im Reiter \"Liveshopping\" von Produkten können Sie beliebige Aktionen definieren</li><li>bitte achten Sie dabei stets auf sinnvolle und vollständige Daten</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"\n\n\n\n<h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>im Reiter \"Liveshopping\" von Produkten können Sie beliebige Aktionen definieren</li><li>bitte achten Sie dabei stets auf sinnvolle und vollständige Daten</li></ul>\n\n\n","shortDescription":"Liveshopping für Shopware 6 - automatisierte Rabattaktionen innerhalb eines gewünschten/zukünftigen Zeitraums mit wahlweise steigenden/fallenden Preisen und begrenzten Beständen","highlights":"","features":""},{"id":26576,"name":"Liveshopping","description":"\n\n\n\n\n\n\n<h2>\n    Liveshopping - automated discount promotions\n\n</h2><p>\n\n\n\n\n\nShopware AG will not publish a successor for the liveshopping plugin for Shopware 6. This means that all shop operators with Shopware 6 will have to do without this powerful marketing tool. Until now...\n\n\n\n\n</p><p>\n\n\n\nThis liveshopping plugin follows in the big footsteps of the popular Shopware 5 plugin and improves it even further in numerous points. With this plugin, you can control automated discount promotions in the future. The promotions are thereby visually highlighted and support not only rising or falling prices but also limited stocks.\n\n</p><h4>Standard discount promotion</h4><p>\n\nDefine a discount promotion for a period in the future. The item is offered at a discounted price within the period.\n\n</p><h4>Rising / falling prices</h4><p>\n\n\n\nInstead of a fixed price for a promotion, you can also specify a start and end price for the defined period. The product then becomes cheaper or more expensive during the period. You can specify the interval (e.g. every minute, every hour) individually. The customer is informed by an interactive countdown when a product becomes more expensive or cheaper.\n\n\n\n</p><p>\n\nWhen prices rise, customers who grab quickly are rewarded. Falling prices are especially useful if you limit the stock of the promotion. This way, your customers can make a bet on whether they'd rather wait a little longer (for a lower price) or go straight for it to secure a product from the limited stock.\n\n\n</p><h4>Limited stock</h4><p>\n\nYou can store a limited stock for the promotions, so that, for example, a maximum of 10 pieces may be sold within the period. Depending on the setting, you can inform the customer of this and display the remaining stock to encourage them to make a quick purchase. You can either store the Shopware stock as the maximum quantity - in this case the product is automatically marked as \"sold out\" - or you can define an individual maximum quantity - e.g. 10 pieces. This maximum quantity is independent of the Shopware stock and available stock and is automatically reduced with each purchase. During a promotion, you can increase or decrease this stock as you wish.\n\n\n\n\n</p><h4>Announcement</h4><p>\n\n\nIf you wish, you can announce a planned promotion accordingly. In this case, you will be informed that the product will soon be available for purchase at a lower price. You can also define whether the product is only available for purchase during the period. In this case, the product would not be available for purchase beforehand and a countdown indicates when the product is available for purchase.\n\n\n\n\n</p><h4>Prices</h4><p>\n\nFor each price rule you can define individual prices - e.g. different prices for traders or regular customers. For each price you can also define any strike price and/or a \"Cheapest price of the last 30 days\".\n\n</p><h4>SEO</h4><p>\n\nThe plugin pays attention to correct SEO data and automatically adjusts the meta itemprop \"priveValidUntil\" to the end time of the action, for example. This way you always have the correct data in search engines.\n\n</p><h4>Dynamic product groups</h4><p>\n\n\nThe plugin uses the standard additional fields of products for the status and time period of an action. Within dynamic product groups, you can thus access these properties and create corresponding categories or overview pages. For example, an area on the start page could show all current or future promotions. In this way, you are always transparent to your customers and can advertise each promotion to the maximum and fully automatically.\n\n\n\n\n\n</p><h4>Instructions</h4><ul><li>install the app</li><li>in the \"Liveshopping\" tab of products, you can define any actions you want</li><li>please always ensure that the data is meaningful and complete.</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8.x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"\n<h4>Instructions</h4><ul><li>install the app</li><li>in the \"Liveshopping\" tab of products, you can define any actions you want</li><li>please always ensure that the data is meaningful and complete.</li></ul>\n","shortDescription":"Liveshopping for Shopware 6 - automated discount promotions within a desired/future time period with optional rising/falling prices and limited stock.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165601,"bookingKey":"dvsn459222995475","bookingText":"Liveshopping","price":449.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":165600,"bookingKey":"dvsn459222995475_M","bookingText":"Liveshopping","price":69,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMdHryr","preview":true,"priority":9900,"id":89949},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4fRprZ","preview":false,"priority":9800,"id":89950},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpP2EE6Y","preview":false,"priority":9700,"id":89951},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPV5uzV","preview":false,"priority":9600,"id":89952},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8isFUi","preview":false,"priority":8900,"id":89953},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSFaR4G","preview":false,"priority":8800,"id":89954},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpn6X0K9","preview":false,"priority":7900,"id":89955},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBSv6U8","preview":false,"priority":6900,"id":89956},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWBo8RF","preview":false,"priority":4900,"id":89961},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpy3hw0E","preview":false,"priority":4800,"id":89959},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRko9eb","preview":false,"priority":2900,"id":89960}],"comments":[],"ratingAverage":0,"label":"Liveshopping","description":"<h2>\n    Liveshopping - automatisierte Rabattaktionen\n\n</h2><p>\n\n\n\n\n\nDie Shopware AG wird für das Liveshopping Plugin keinen Nachfolger für\nShopware 6 veröffentlichen. Somit müssen alle Shopbetreiber mit Shopware 6 auf dieses\nmächtige Martketing-Instrument verzichten. Bis jetzt...\n\n\n\n\n</p><p>\n\n\n\nDieses Liveshopping Plugin tritt in die großen Fußstapfen des beliebten\nShopware 5 Plugins und verbessert es in zahlreichen Punkten noch weiter. Mit diesem Plugin\nkönnen Sie automatisierte Rabattaktionen in der Zukunft steuern. Die Aktionen werden\ndabei optisch stark hervorgehoben und unterstützen neben steigenden oder fallenden Preisen\nauch begrenzte Bestände.\n\n</p><h4>Standard Rabattaktion</h4><p>\n\nDefinieren Sie eine Rabattaktion für einen Zeitraum in der Zukunft. Der Artikel wird\ninnerhalb des Zeitraums mit einem rabattierten Preis angeboten.\n\n</p><h4>Steigende / fallende Preise</h4><p>\n\n\n\nStatt eines festen Preises für eine Aktion können Sie für den definierten Zeitraum\nauch einen Start- und einen Endpreis angeben. Das Produkt wird dann während des Zeitraums\nimmer günstiger bzw. teurer. Das Interval (z.B. jede Minute, jede Stunde) können Sie\ndabei individuell angeben. Der Kunde wird mit einem interaktiven Countdown darauf hingewiesen\nwann sich ein Produkt verteuert bzw. vergünstigt.\n\n\n\n</p><p>\n\nBei steigenden Preisen werden Kunden belohnt, die schnell zugreifen. Fallende Preise sind\ninsbesondere sinnvoll, wenn Sie den Bestand der Aktion begrenzen. So können Ihre Kunden eine\nWette eingehen, ob sie lieber noch ein wenig warten (für einen günstigeren Preis) oder\ndirekt zuschlagen, um sich ein Produkt aus dem begrenzten Bestand zu sichern.\n\n\n</p><h4>Begrenzter Bestand</h4><p>\n\nSie können für die Aktionen einen begrenzten Bestand hinterlegen, so dass z.B. maximal 10 Stück\ninnerhalb des Zeitraums verkauft werden dürfen. Je nach Einstellung können Sie den Kunden\ndarüber informieren und den Restbestand anzeigen, um ihn für einen schnellen Kauf zu\nanimieren. Sie können wahlweise den Shopware Bestand als maximale Menge hinterlegen - in diesem\nFall wird das Produkt automatisch als \"Abverkauf\" markiert - oder Sie definieren eine\nindividuelle maximale Menge - z.B. 10 Stück. Diese maximale Menge ist unabhängig vom\nShopware Bestand und verfügbarem Bestand und wird bei jedem Kauf automatisch reduziert.\nWährend einer Aktion können Sie diesen Bestand beliebig erhöhen oder verringern.\n\n</p><h4>Ankündigung</h4><p>\n\n\nEine geplante Aktion können Sie auf Wunsch entsprechend ankündigen. In diesem Fall wird\ndarauf hingewiesen, dass das Produkt in Kürze günstiger zu kaufen ist. Zudem können\nSie definieren, ob das Produkt ausschließlich im Zeitraum kaufbar ist. In diesem Fall\nwäre das Produkt vorher nicht kaufbar und ein Countdown zeigt an, wann das Produkt zu kaufen ist.\n\n</p><h4>Preise</h4><p>\n\nFür jede Preisregel können Sie individuelle Preise definieren - z.B. andere Preise für\nHändler oder Stammkunden. Zu jedem Preis können Sie zudem einen beliebigen Streichpreis\nund/oder einen \"Günstigster Preis der letzten 30 Tage\" definieren.\n\n</p><h4>SEO</h4><p>\n\nDas Plugin achtet auf korrekte SEO Angaben und passt z.B. das meta itemprop \"priveValidUntil\"\nautomatisch an den Endzeitpunkt der Aktion an. So haben Sie in Suchmaschinen stets die korrekten Daten.\n\n</p><h4>Dynamische Produkgruppen</h4><p>\n\n\nDas Plugin nutzt für den Status und den Zeitraum einer Aktion die Standard\nZusatzfelder von Produkten. Innerhalb von dynamischen Produktgruppen können Sie somit auf diese\nEigenschaften zugreifen und entsprechende Kategorien oder Übersichtsseiten bilden.\nEin Bereich auf der Startseite könnte so z.B. alle laufenden oder zukünftigen\nAktionen zeigen. Somit sind Sie Ihren Kunden gegenüber stets transparent und können\njede Aktion maximal und vollautomatisch bewerben.\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>im Reiter \"Liveshopping\" von Produkten können Sie beliebige Aktionen definieren</li><li>bitte achten Sie dabei stets auf sinnvolle und vollständige Daten</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>im Reiter \"Liveshopping\" von Produkten können Sie beliebige Aktionen definieren</li><li>bitte achten Sie dabei stets auf sinnvolle und vollständige Daten</li></ul>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"- added app configuration to exclude liveshopping products from promotions","creationDate":{"date":"2023-05-02 19:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"- added shopware 6.5 compatibility","creationDate":{"date":"2023-04-04 10:44:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- added scheduled tasks to clean faulty liveshopping elements within translations","creationDate":{"date":"2023-02-08 17:07:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2022-05-11 10:57:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn459222995475","redirectToStore":false,"lowestPriceValue":69}