{"id":15289,"name":"AcrisPriceOnRequestCS","code":"acris48535681722","lastChange":{"date":"2023-07-18 19:11:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php41rubi","examplePageUrl":"","moduleKey":"AcrisPriceOnRequestCS","creationDate":{"date":"2022-05-19 08:36:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-07-27 07:25:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-07-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-01-09 12:47:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":26636,"name":"Preis auf Anfrage Pro - B2B Preisanfrage + Preis Anzeige nach Login / Freischaltung / Anfrage","description":"<h2>Preise erst nach Login / Freischaltung einblenden und / oder ein Preis auf Anfrage Formular anbieten...</h2><p>Dieses Plugin ist unerlässlich für B2B Projekte aber auch für B2C Projekte in speziellen Anwendungsfällen sinnvoll. So besteht die Möglichkeit den \"in den Warenkorb Button\" gegen andere Funktionen \"auszutauschen\" z.B. Preis auf Anfrage, Bitte zuerst einloggen, sonstige Hinweistexte,&nbsp; Ebenso besteht die Möglichkeit Preise auszublenden und eventuell Regelgesteuert einzublenden (z.B. nach Freischaltung bzw. nach Login). Das mitgelieferte CMS Formular kann nicht nur die Nutzdaten abfragen, sondern kann sogar mit Einfachauswahl, Mehrfachauswahl, Text und Kommentarfeldern umfangreiche Anfragen an den Shopbetreiber ermöglichen.<br></p><p><br></p><h2>Grundfunktionen des Plugins<br></h2><ul><li>Preise und Preis auf Anfragen für dynamische Produktgruppen (z.B. ganze \nKategorien, Gruppen von Produkten oder auch einzelne Produkte)</li><li>Preise ausblenden (dynamische Produktgruppen und zusätzlich mit Rule Builder Regeln)</li><li>Anzeige der Preise erst nach Freischaltung bzw. nach erfolgreichem Login</li><li>Preis auf Anfrage Formular statt Warenkorb Button anzeigen</li><li>Anstelle eines Preises oder Warenkorb Buttons kann auch ein Infotext eingeblendet werden (z.B. Produkte derzeit nicht verfügbar)</li><li>Wenn das Preis auf Anfrage Formular zur Anwendung kommt, dann werden diese im Admin Bereich gesammelt und auch per Mail an den Shopbetreiber geschickt.</li><li>Zusätzlich steht im Admin die Möglichkeit zur Verfügung, die Anfragen als beantwortet zu markieren um eine Übersicht der offenen Anfragen zu erhalten.</li><li>Mit dem Plugin wird auch eine Erlebniswelt mit dem ACRIS CMS Element Preis auf Anfrage mitgeliefert - hier stehen zahlreiche Optionen zur Verfügung.</li><li>Das Preis auf Anfrage Formular wird (sofern der User eingeloggt ist) auch mit den Kundendaten befüllt <br></li></ul><p><br></p><p><b>Mögliche Optionen zur Anzeige anstelle des \"in den Warenkorb Buttons\"<br></b></p><ul><li>Anfrage Formular</li></ul><ul><li>Warenkorb Button und Anfrage Formular</li></ul><ul><li>Login erforderlich</li></ul><ul><li>Standard Warenkorb Button</li></ul><ul><li>Infotext</li></ul><ul><li>Anfrageformular und Infotext</li></ul><ul><li>Anfrageformular und Login Button</li><li>Standard Warenkorb Button und Info Text</li><li>Login erforderlich und&nbsp; Info Text<br></li></ul><p><br></p><h2>Nutzung des Plugins<br></h2><h4>Vorbereitungen: Dynamische Produktgrupen anlegen, bei Bedarf Rule Builder Regeln, Erlebniswelten mit Preis auf Anfrage Formular </h4><p><i><b>Dynamischer Produktgruppen<br></b></i>Zuerst macht die Anlage von dynamischen Produktgruppen Sinn, da diese dann bei den Preis auf Anfrage \"Regeln\" hinterlegt werden.<br>Es können mehrere Preis auf Anfragen erstellt werden - diese können mit Priorisierungen versehen werden - falls es Überschneidungen bei den dynamischen Produktgruppen gibt). <br><i><b>Rule Builder Regeln<br></b></i>Zusätzlich ist es möglich, die Preis auf Anfrage \"Regeln\" mit Rule Builder Rule zu versehen - dies macht bei manchen Einstellungen Sinn (z.B. Wenn \"Anfrageformular und Infotext\" ausgewählt wird, dann soll dies nur angezeigt werden, wenn die User nicht eingeloggt bzw. Freigeschaltet sind) - daher bitte falls Rule Builder Regeln benötigt werden, auch diese anlegen, damit diese später zugeordnet werden können.<br>Dieses Plugin liefert eine wichtige Regel mit:<i><b></b>ACRIS Preis auf Anfrage - Kunde ist nicht eingeloggt.</i><br></p><p><i><b>Erlebniswelt mir ACRIS Preis auf Anfrage Formular<br></b></i></p><p>Mit der Installation des Plugins wird bereits eine vorgefertigte Erlebniswelt mitgeliefert, diese kann verwendet werden oder als Vorlage für eigene Formulare dienen.<br><i><b>Inhalte &gt; Erlebniswelten &gt; Preis auf Anfrage &gt; ACRIS Standard Preis auf Anfrage Formular</b></i></p><p><br></p><h2>Anlegen Preis auf Anfragen bzw. von Regeln für Preis Anzeige<br></h2><p><i><b>Einstellungen &gt; Erweiterungen &gt; Preis auf Anfrage &gt; Preis auf Anfrage Formulare<br></b></i></p><p>Wenn bereits bereits Preis auf Anfrage Formulare bzw. die Regeln zur Preisanzeige erstellt wurden, dann sind diese in der Übersicht aufgelistet. Über den Button \"hinzufügen\" erscheint das Fenster zur Anlage neuer Preis auf Anfrage Formularen.</p><p><br></p><h4>Bereich Grundeinstellungen:<br></h4><ul><li><b>Interner Name:</b> wird zur Anzeige in der Übersicht verwendet, wenn mehrere Regeln angelegt werden kann eine Nummerierung Sinn machen.</li><li><b>Aktiv:</b> aktiv / inaktiv</li><li><b>Priorität</b>: erwartet wird eine Zahl, je höher, desto wichtiger. Dies kommt dann zur Anwendung, wenn bei einem Produkt mehrere Preis auf Anfrage Regeln zur Anwendung kommen.</li></ul><p><b>Bereich Anzeigebedingungen:<br></b></p><ul><li><b>Dynamische Produktgruppen</b>: Wenn hier eine oder mehrere Dynamische Produktgruppen angegeben werden, dann trifft dies nur auf diese Produkte zu.<br>Wird das Feld leer gelassen, dann wird dies für alle Produkte angewandt.</li><li><b>Zusätzliche Rule Builder Regeln</b>: Die Preis auf Anfrage Regel wird für alle Produkte aus den zugewiesenen dynamischen Produktgruppen angewendet, wenn eine der angegebenen Regeln übereinstimmt (ODER-Verknüpfung). Wird keine Regel ausgewählt, trifft dies immer zu.<br></li></ul><p><b>Bereich Preisanzeige:<br></b></p><ul><li><b>Preisanzeige</b>: Preis anzeigen (Shopware Standard) oder Preis ausblenden</li><li><b>Erweiterte Einstellungen &gt; Metadaten Einstellungen</b>: <br>Diese Optionen wirken sich auf die Meta Daten des Produkts aus - bitte besprechen sie dies mit ihrem SEO Betreuer, was am meisten Sinn macht.<br>Im Standard blenden wir die Preis für die Suchmaschinen aus, jedoch kommt es deswegen zu Fehlermeldungen beim Crawlen wegen der fehlenden Preise.<br></li></ul><p></p><p><b>Bereich Anzeigekonfiguration - Warenkorb Button</b> Optionen / Konfiguration:<br></p><ul><li><b>Option: Anfrage Formular</b>:&nbsp; <br>Wird diese Option gewählt, dann wird anstelle des \"in den Warenkorb Button\" ein neue Button \"Anfrage Formular\" eingeblendet.<br>Darunter blendet sich der <b>Bereich Anfrageformular </b>mit folgenden Feldern ein<b>:</b><br>&gt; <b>Preis auf Anfrage Button Text:</b>&nbsp; Hier kann der Text des \"neuen\" Buttons eingegeben werden (je Sprache unterschiedlich)<br>&gt; <b>Anfrage Button Typ</b>: Hier wird die Farbe des Buttons eingestellt<br>&gt; <b>ACRIS Standard Price on request form:</b> Hier kann die von ACRIS vorgefertigte Erlebniswelt mit dem Preis auf Anfrage Formular verwendet werden, oder es kann eine neu angelegte Eröebniswelt zugeordnet werden.<br>Darunter werden die Formularfelder des zugeordneten Formulars angezeigt - wir empfehlen zuerst die gewünschte Erlebniswelt mit dem Preis auf Anfrage Formular zu erstellen (Inhalte &gt; Erlebniswelten) und hier keine Bearbeitung durchzuführen.<br></li></ul><ul><li><b>Option: Warenkorb Button und Anfrage Formular:<br></b>Wird diese Option gewählt, dann steht der Warenkorb Button und zusätzlich ein Preis auf Anfragebutton zur Verfügung.<br>Die Felder sind (wie oben dokumentiert) einstellbar<br></li></ul><ul><li><b>Option: Login erforderlich</b><br>Wird diese Option gewählt, dann wird anstelle des \"in den Warenkorb Button\" ein \"Login Button\" eingeblendet.<br>Es erscheint im Admin ein Bereich Login Button: <br>&gt;&gt; <b>Login Button Text</b>: Dieser Text wird anstelle des \"in den Warenkorb\" Buttons angezeigt<br>&gt;&gt; <b>Login Button Typ</b>: Hier wird die Farbe des Buttons eingestellt.<br><b>HINWEIS: </b><br>Wird diese Option verwendet, dann sollte im Bereich Anzeigebedingungen zusätzlich eine Rule Builder Regel angegeben werden (z.B. die von ACRIS mitgelieferte \"Preis auf Anfrage - Kunde ist nicht eingeloggt\" Regel), sonst wird niemals ein Kunde einen Preis sehen (oder einen Artikel in den Warenkorb legen können)<b><br></b></li><li><b>Option: Standard Warenkorb Button<br></b>Diese Option macht dann Sinn, wenn sehr viele Produkte mit \"Preis auf Anfrage\" ausgeblendet werden, aber mache davon trotzdem bestellbar sein sollen. Eine entsprechende Rule Builder Regel würde in diesem Fall Sinn machen.<br></li></ul><ul><li><b>Option Infotext</b>:<br>Wird diese Option gewählt, dann wird der \"in den Warenkorb\" Button gegen den unten einzugebenden Text ersetzt.<b><br>HINWEIS: </b><br>Wird diese Option verwendet, dann sollte im \nBereich Anzeigebedingungen zusätzlich eine Rule Builder Regel angegeben \nwerden (z.B. die von ACRIS mitgelieferte \"Preis auf Anfrage - Kunde ist \nnicht eingeloggt\" Regel), sonst wird niemals ein Kunde einen Preis sehen\n (oder einen Artikel in den Warenkorb legen können)<b><br></b></li><li><b>Option Anfrageformular und Infotext:<br></b>Wird diese Option gewählt. dann erscheint ein Button für das Anfrageformular und darunter ein Infotext.<br></li><li><b>Option: Anfrageformular und Login Button</b>:<br>Wird diese Option gewählt, dann stehen anstelle des in den Warenkorb Buttons ein \"Preis auf Anfrage\" und ein \"Login Button\" zur Verfügung.<br>Es kann Sinn machen, eine Rulebuilder Regel hinzuzufügen, damit für eingeloggte Kunden keine / eine andere \"Preis auf Anfrage Regel\" zurtrifft. <br></li></ul><p><br></p><h3>Erlebniswelt Preis auf Anfrage <br></h3><p><i><b>Inhalte &gt; Erlebniswelten &gt; Preis auf Anfrage &gt; ACRIS Standard Preis auf Anfrage Formular</b></i><br>Mit der Installation des Plugins wir eine Erlebniswelt mit dem ACRIS Preis auf Anfrage Formular mitgeliefert - dies hat sehr viele Einstellungsmöglichkeiten.</p><p>Wenn Formular-Felder oder E-Mail Adresse angepasst werden soll, bitte eine Kopie der vorgefertigten Erlebniswelt erstellen, danach:<br></p><p>Mit Klick auf das Zahnrad im Element kommen sie auf das Formular, welches dann aus 2 Bereichen besteht:<br></p><h4><br></h4><h4>Felder:</h4><p>&nbsp;&nbsp; Verschiedene Felder sind voreingestellt, diese können verschoben und\n angepasst werden (ein/ausblendbar, Titel ausblenden, Pflichtfelder...)<br>&nbsp;&nbsp; In dem Formular stehen folgende Felder zur Verwendung zur Verfügung:<br><b>&nbsp;&nbsp; Persönliche Daten:</b> Anrede | Vorname | Nachname | Strasse | PLZ | Stadt | Land | Telefonnummer | E-Mail<br><b>&nbsp;&nbsp; B2B:</b> Firma | Abteilung | UstID | Adresszusatzzeile 1<br><b>&nbsp;&nbsp; Select Felder:</b> Einfachauswahl | Mehrfachauswahl<br><b>&nbsp;&nbsp; Zusätzlich:</b> Textfeld | Kommentar</p><h4><br></h4><h4>Grundeinstellungen:</h4><ul><li><b>Empfänger-Adressen</b>: Hier wird bei der Installation die Shopbetreiber E-Mail Adresse ausgelesen, diese kann gelöscht und gegen eine neue ersetzt werden. Auch mehrere Adressen sind möglich. Hinweis: diese Feld ist \"Sprachenübergreifend\" gleich.</li><li><b>Webservice URL:</b> Dieses Feature ist ein Funktion, welche nur für Spezialisten geeignet ist - daher bei Bedarf eine Supportanfrage an uns stellen.&nbsp; Hier kann ein externer Webservice zur Übermittlung der Preis auf Anfrage Daten angegeben werden.</li><li><b>Interner Name:</b> Sinnvoll, wenn mehrere Formulare erstellt werden</li><li><b>Button Text</b>: Dieser Text wird auf der Produktdetailseite angezeigt - auch Sprachabhängig möglich.</li><li><b>Text bei erfolgreichem absenden</b>: Dieser Text wird nach dem Absenden des Formular im Frontend angezeigt.<br></li></ul><p><b>HINWEIS</b>: Es wird nach Absenden der Preisanfrage ein Mail an den Shopbetreiber gesandt - falls Anpassungen erforderlich sind, bitte im Flowbulider den Prozess bzw. bei den E-Mail Vorlagen das Mail anpassen.<br></p><p></p><br><h2>Erhaltene Preisanfragen<br></h2><p>Die ehaltenen Preisanfragen stehen in 2 Bereichen im Admin zur Verfügung - beide Bereiche haben dieselbe Funktion.<br><i><b>&nbsp; &gt;&gt; Einstellungen &gt; Erweiterungen &gt; Preis auf Anfrage &gt; Erhaltene Preisanfragen<br>&nbsp; &gt;&gt; Katalog &gt; Preisanfragen<br></b></i></p><p><i><b><br></b></i></p><h3>Preis auf Anfrage Übersicht&nbsp;</h3>Es stehen relevante Informationen zur Preisanfrage zur Verfügung:<br><ul><li><b>Anfrage gesendet am</b>: Datum und Uhrzeit der Anfrage (kann auch zur Sortierung verwendet werden)</li><li><b>Produktnummer</b>: dies ist die Produktnummer / Artikelnummer (kann auch zur Sortierung verwendet werden)</li><li><b>Produkt</b>: dies ist der Produktname zur leichteren Orientierung</li><li><b>E-Mail</b>: E-Mail Adresse des Kunden</li><li><b>Kunde</b>: Vorname und Nachname des Kunden</li><li><b>Benachrichtig</b>t: hier wird entweder OFFEN oder das Benachrichtigungsdatum angezeigt</li><li><b>... </b>: hier gehts zu den Preis auf Anfrage Details&nbsp;<br></li></ul><p></p><p><br></p><h3>Preis auf Anfrage Details <br></h3>Es stehen relevante Informationen zur Preisanfrage zur Verfügung:<br><p></p><h4>Bereich Anfrage<br></h4><p>Hier werden die Daten des vom Kunden ausgefüllten Preis auf Anfrage Formulars angezeigt - welche Felder angezeigt werden ist abhängig vom erstellten Preis auf Anfrage Formular.&nbsp; <br></p><h4>Bereich Produkt</h4><p>Es&nbsp; wird die Produktnummmer, der Produktname (ist mit dem Produkt verlinkt) und dem aktuellen Verkaufspreis angezeigt.<br></p><h4>Bereich Status<br></h4><p></p><p>Mit ändern des Schiebereglers \"Der Kunde wurde nicht benachrichtigt\" ändert sich das Feld auf \" Der Kunde wurde benachrichtigt und darunter aktiviert sich ein Datum/Zeit Fenster. Wenn dies ausgefüllt und die Preis auf Anfrage Details gespeichert wurden, ändert sich auch der Status in der Übersichtsseite.</p><p><br></p><h2>Plugin Konfiguration</h2><p>Im Shopware Admin (<i>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS Preis auf Anfrage Professional &gt; Konfiguration</i>) stehen folgende Optionen zur Verfügung:<br><b>Dies betrifft die Art der Vrobefüllung des neuen ACRIS CMS Elements: Preis auf Anfrage Formular und kann im Bedarfsfall geändert werden.<b><br></b><br></b></p><p><b>Vorausfüllen von Kundendaten</b><b><br></b></p><ul><li>Vorausfüllen (Der Kunde muss eingeloggt sein, damit das Vorausfüllen der Daten funktioniert) = Standard Einstellung<br>&gt;&gt; Das bedeutet, wenn ein User sich eingeloggt hat, dann werden die Daten in das Formular vorausgefüllt.<br></li></ul><ul><li>Vorausfüllen und verstecken (Wenn der Kundendaten zur Verfügung hat, z. B. E-Mail, Straße...: das Feld wird vorausgefüllt, aber ausgeblendet)<br>&gt;&gt; Diese Funktion macht im Prinzip dasselbe wie die davor, jedoch werden alle vorbefüllten Formularfelder ausgeblendet und es bleiben nur die übrig, welche nicht vorausgefüllt werden können.<br></li></ul><p><br></p><h3>Hinweise / Bekannte Einschränkungen:</h3><ul><li> Rule BuilderRegeln: Es können nicht alle technisch möglichen Rule Builder Regeln verwendet werden, bitte achten sie auf einen sinnvollen Usecase.<br></li></ul>","installationManual":"<ul><li>Die Installation erfolgt wie in Shopware üblich. <br></li></ul><ul><li>Danach stehen <b>Plugin Konfigurationen</b> (<i>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS Preis auf Anfrage Professional &gt; Konfiguration</i>) zur Verfügung.</li><li>Die <b>Preis auf Anfrage Verwaltung </b>sind unter<b></b><i>Einstellungen &gt; Erweiterungen &gt; Preis auf Anfrage &gt; Preis auf Anfrage Formulare bzw. erhaltene Preisanfragen</i> zu finden.</li><li>Die<b> erhaltenen Anfragen</b> stehen auch unter <i>Kataloge &gt; Preisanfragen</i> zur Verfügung <br></li><li>Eine Erlebniswelt mit dem<b> CMS Element Preis auf Anfrage Formular</b>&nbsp; steht unter <i>Inhalte &gt; Erlebniswelten &gt; ACRIS Standard Preis auf Anfrage Formular</i> im Typ Preis auf Anfrage zur Verfügung - für Anpassungen bitte eine Kopie der Erlebniswelt erstellen.<br></li><li>Im <b>Flow Builder</b> wird ein Prozess angelegt<b> Preis auf Anfrage Formular wurde gesendet&nbsp;</b><br></li><li>Eine <b>E-Mail Vorlage</b> wird angelegt <b>Preis auf Anfrag</b>e diese wird im Flowbuilder verwendet. <br></li><li>Es wird auch noch eine <b>Rule Builder Regel </b>angelegt <b>Preis auf Anfrage - Kunde ist nicht eingeloggt</b>. <br>Diese kann zusätzlich zu den Dynamischen Produktgruppen als Regel verwendet werden um sinnvolle Ein/Ausblendung der Buttons zu ermöglichen<br></li></ul><p><br></p>","shortDescription":"Im B2B unerlässlich - Preise erst nach Freischaltung bzw. nach einem Login anzeigen. Preis auf Anfrage Formular / Buttons regelgesteuert für dynamische Produktgruppen einblenden.","highlights":"Preise und Preis auf Anfragen (mit / ohne Preisanzeige, Warenkorb Button oder Infotext, Anfrageformular uvm.) perfekt anzeigen\nfür dynamische Produktgruppen (z.B. ganze Kategorien, Gruppen von Produkten oder auch einzelne Produkte) und wahlweise zusätzlich mit Rule Builder Regeln \nPreisanfragen gesammelt im Admin ersichtlich, können im Admin zur besseren Übersicht als benachrichtigt markiert werden\nVorgefertigte Erlebniswelt mit Preis auf Anfrage Formular kann individuell angepasst werden (bitte Kopie erstellen) - CMS Element: Preis auf Anfrage Formular mit individuell anpassbare Formularfelder wird mitgeliefert\nWenn User eingeloggt sind, wird das CMS Preis auf Anfrage Formular bereits VORBEFÜLLT","features":"Preise erst nach erfolgter Freischaltung oder Login ersichtlich (Rule Builder Regel: Preis auf Anfrage - Kunde ist nicht eingeloggt) wird mitgeliefert\nWahlweise kann anstelle des Warenkorb Buttons folgendes eingeblendet werden (für dynamische Produktgruppen, zusätzlich nich Rulebuilder Regel möglich):  \nAnfrage Formular (Button) |   Warenkorb Button und Anfrage Formular (Button)  | Login erforderlich |  Standard Warenkorb Button | Infotext | Anfrageformular und Infotext | Anfrageformular und Login Button\nAnfrage Formular wird mit Kundendaten vorbefüllt (wenn User eingeloggt ist)\nCMS Element Preis auf Anfrage Formular kann individuell angepasst werden (Felder, Beschriftungen, Inhalte der Felder, E-Mail Empfänger) - bitte ein Kopie der Erlebniswelt erstellen\nNach einer Anfrage wird ein E-Mail mit der Anfrage an den Shopbetreiber geschickt - es kann auch zusätzlich mittels Flowbuilder dem Kunden eine Info geschickt werden.\nAlle Anfragen werden in einer Übersicht im Admin gesammelt - zusätzlich steht eine Option \"benachrichtigt am\" zur Verfügung"},{"id":26637,"name":"Price on request Pro - B2B price request + price display after login / activation","description":"<h2>Show prices only after login / activation and / or offer a price on request form...</h2>This plugin is essential for B2B projects but also useful for B2C projects in special use cases. So there is the possibility to \"exchange\" the \"add to cart button\" against other functions, e.g. price on request, please log in first, other information texts, also there is the possibility to hide prices and possibly show rule-controlled (e.g. after activation or after login). The included CMS form can not only query the user data, but can even with single selection, multiple selection, text and comment fields allow extensive requests to the store owner.<p><br></p><h3>Basic functions of the plugin</h3><ul><li>&nbsp;&nbsp;&nbsp; Prices and price on requests for dynamic product groups (e.g. whole categories, groups of products or even single products)</li><li>&nbsp;&nbsp;&nbsp; Hide prices (dynamic product groups and additionally with Rule Builder rules)</li><li>&nbsp;&nbsp;&nbsp; Display of prices only after activation or after successful login</li><li>&nbsp;&nbsp;&nbsp; Show price on request form instead of shopping cart button</li><li>&nbsp;&nbsp;&nbsp; Instead of a price or shopping cart button, an info text can also be displayed (e.g. products currently not available)</li><li>&nbsp;&nbsp;&nbsp; If the price on request form is used, then these are collected in the admin area and also sent by mail to the store owner.</li><li>&nbsp;&nbsp;&nbsp; In addition, the option is available in the admin to mark the requests as answered to get an overview of the open requests.</li><li>&nbsp;&nbsp;&nbsp; With the plugin is also an experience with the ACRIS CMS element price on request supplied - here are numerous options available:</li><li>&nbsp;&nbsp;&nbsp; Various fields are preset, these can be moved and customized (show/hide, hide title, mandatory fields...).</li><li>&nbsp;&nbsp;&nbsp; The following fields are available for use in the form:<br>&nbsp;&nbsp;&nbsp; &gt;&gt; Personal data: Salutation | First name | Last name | Street | Postcode | City | Country | Phone number | E-mail<br>&nbsp;&nbsp;&nbsp; &gt;&gt; B2B: Company | Department | UstID | Address supplement line 1<br>&nbsp;&nbsp;&nbsp; &gt;&gt; Select fields: Single selection | Multiple selection<br>&nbsp;&nbsp;&nbsp; &gt;&gt; Additional: Text field | Comment</li><li>&nbsp;&nbsp;&nbsp; The price on request form will (if the user is logged in) also be filled with the customer data </li></ul><br><h3>Possible options to display instead of the \"add to cart\" button</h3><ul><li>&nbsp;&nbsp;&nbsp; Inquiry form</li><li>&nbsp;&nbsp;&nbsp; Shopping cart button and request form</li><li>&nbsp;&nbsp;&nbsp; Login required</li><li>&nbsp;&nbsp;&nbsp; Standard shopping cart button</li><li>&nbsp;&nbsp;&nbsp; Infotext</li><li>&nbsp;&nbsp;&nbsp; Inquiry form and infotext</li><li>&nbsp;&nbsp;&nbsp; Inquiry form and login button</li><li>&nbsp;&nbsp;&nbsp; Standard shopping cart Button and Info text</li><li>&nbsp;&nbsp;&nbsp; Login required and Info text</li></ul><p><br></p><h2>Usage of the plugin</h2><p><b>Preparations: </b>Create dynamic product groups and Rule Builder rules if needed.<br>First of all, creating dynamic product groups makes sense, as these will then be stored with the price on request \"rules\".<br>Multiple price on request can be created - these can be prioritized - in case there are overlaps in the dynamic product groups).<br>In addition, it is possible to provide the price on request \"rules\" with rule builder rule - this makes sense for some settings (eg If \"Request form and info text\" is selected, then this should be displayed only if the users are not logged in or enabled) - so please if Rule Builder rules are needed, also create them, so that they can be assigned later.</p><p><br></p><h2>Create price on request or price display rules</h2><p>Settings &gt; Extensions &gt; Price on request &gt; Price on request forms<br><br>If price on request forms or price display rules have already been created, they are listed in the overview. Via the button \"add\" the window for creating new price on request forms appears.<br><br></p><h3>Basic settings section:</h3><p>&nbsp;&nbsp;&nbsp; Internal name: is used for display in the overview, if several rules are created a numbering can make sense.<br>&nbsp;&nbsp;&nbsp; Active: active / inactive<br>&nbsp;&nbsp;&nbsp; Priority: a number is expected, the higher, the more important. This is used when multiple price on demand rules are applied to a product.<br></p><h3>Display conditions area:</h3><p>&nbsp;&nbsp;&nbsp; Dynamic Product Groups: If one or more Dynamic Product Groups are specified here, then this will only apply to those products.<br>&nbsp;&nbsp;&nbsp; If the field is left blank, then this will be applied to all products.<br>&nbsp;&nbsp;&nbsp; Additional Rule Builder Rules: The price on demand rule will be applied to all products from the assigned Dynamic Product Groups if any of the specified rules match (OR operation). If no rule is selected, this will always apply.<br></p><h3>Price Display section:</h3><p>&nbsp;&nbsp;&nbsp; Price Display: show price (Shopware default) or hide price.<br>&nbsp;&nbsp;&nbsp; Advanced Settings &gt; Metadata Settings:<br>&nbsp;&nbsp;&nbsp; These options affect the product's meta data - please discuss with your SEO supervisor what makes the most sense.<br>&nbsp;&nbsp;&nbsp; By default we hide the price for the search engines, however this will cause error messages when crawling because of the missing prices.<br></p><h3>Display configuration area - shopping cart button options / configuration:</h3><ul><li><b>&nbsp;&nbsp;&nbsp; Option: Request Form: </b></li></ul><p>&nbsp;&nbsp;&nbsp; If this option is selected, then instead of the \"add to cart button\" a new button \"request form\" is displayed.<br>&nbsp;&nbsp;&nbsp; Below this, the Inquiry form area appears with the following fields:<br>&nbsp;&nbsp;&nbsp; &gt; Price on request button Text:&nbsp; Here you can enter the text of the \"new\" button (different for each language).<br>&nbsp;&nbsp;&nbsp; &gt; Request Button Type: Here you can set the color of the button.<br>&nbsp;&nbsp;&nbsp; &gt; ACRIS Standard Price on request form: Here you can use the predefined ACRIS experience world with the price on request form, or you can assign a newly created experience world.<br>&nbsp;&nbsp;&nbsp; Below the form fields of the assigned form are displayed - we recommend to create the desired experience world with the price on request form first (Content &gt; Experience Worlds) and not to edit it here.<br></p><ul><li><b>&nbsp;&nbsp;&nbsp; Option: Shopping cart button and request form:</b></li></ul><p>&nbsp;&nbsp;&nbsp; If this option is selected, then the shopping cart button and additionally a price on request button will be available.<br>&nbsp;&nbsp;&nbsp; The fields are adjustable (as documented above)<b><br></b></p><ul><li><b>&nbsp;&nbsp;&nbsp; Option: Login required</b></li></ul><p>&nbsp;&nbsp;&nbsp; If this option is selected, then instead of the \"add to cart button\" a \"login button\" is displayed.<br>&nbsp;&nbsp;&nbsp; A Login Button area will appear in the admin:<br>&nbsp;&nbsp;&nbsp; &gt;&gt; Login Button Text: This text will be displayed instead of the \"add to cart\" button.<br>&nbsp;&nbsp;&nbsp; &gt;&gt; Login Button Type: Here you can set the color of the button.<br><b>&nbsp;&nbsp;&nbsp; NOTE:<br></b>&nbsp;&nbsp;&nbsp; If this option is used, then a Rule Builder rule should also be specified in the Display Conditions area (e.g. the \"Price on request - customer is not logged in\" rule provided by ACRIS), otherwise no customer will ever see a price (or be able to add an item to the cart)<br></p><ul><li><b>&nbsp;&nbsp;&nbsp; Option: Standard shopping cart button</b></li></ul><p>&nbsp;&nbsp;&nbsp; This option makes sense if a lot of products with \"Price on request\" are hidden, but some of them should still be orderable. A corresponding Rule Builder rule would make sense in this case.<br></p><ul><li><b>&nbsp;&nbsp;&nbsp; Infotext option:</b></li></ul><p>&nbsp;&nbsp;&nbsp; If this option is selected, then the \"add to cart\" button will be replaced with the text to be entered below.<br><b>&nbsp;&nbsp;&nbsp; NOTE:<br></b>&nbsp;&nbsp;&nbsp; If this option is used, then a Rule Builder rule should also be specified in the Display Conditions section (e.g. the \"price on request - customer is not logged in\" rule provided by ACRIS), otherwise no customer will ever see a price (or be able to add an item to the cart)<br>&nbsp;&nbsp;&nbsp; Request form and info text option:<br>&nbsp;&nbsp;&nbsp; If this option is selected. then an inquiry form button will appear with an info text below it.<br></p><ul><li><b>&nbsp;&nbsp;&nbsp; Option: Inquiry form and login button:</b></li></ul><p>&nbsp;&nbsp;&nbsp; If this option is selected, then a \"price on request\" and a \"login button\" are available instead of the add to cart button.<br>&nbsp;&nbsp;&nbsp; It may make sense to add a rulebuilder rule, so that for logged in customers no / another \"price on request rule\" applies. <br></p><p><br></p><p><br></p><h3>Shopping experience world -&nbsp; Price on request</h3><p>Content &gt; World of Experience &gt; Price on Request &gt; ACRIS Standard Price on Request Form<br>With the installation of the plugin we deliver an experience world with the ACRIS price on request form - this has a lot of setting possibilities.<br>If form fields or email address is to be customized, please make a copy of the pre-made experience, then:<br>By clicking on the cogwheel in the element you will get to the form, which then consists of 2 areas:<br></p><h4>Fields:</h4><p></p><ul><li>&nbsp;&nbsp; Various fields are preset, these can be moved and customized (show/hide, hide title, mandatory fields...).<br>The following fields are available for use in the form:<br>Personal data: Salutation | First name | Last name | Street | Postcode | City | Country | Phone number | E-mail<br>B2B: Company | Department | UstID | Address supplement line 1<br>Select fields: Single selection | Multiple selection<br>Additional: Text field | Comment<br></li></ul><h4><br></h4><h4>General settings:</h4><p></p><ul><li>Recipient addresses: Here the store operator email address is read during installation, this can be deleted and replaced with a new one. Multiple addresses are also possible. Note: this field is the same for all languages.</li><li>Webservice URL: This feature is a function, which is only suitable for specialists - therefore, if necessary, send a support request to us.&nbsp; Here you can specify an external webservice to send the price on request data.</li><li>Internal Name: Useful if multiple forms are created</li><li>Button Text: This text will be displayed on the product detail page - also possible language dependent.</li><li>Text on successful submission: This text is displayed in the frontend after the form has been submitted.<br></li></ul><p><b><br></b></p><p><b>NOTE</b>: <br>After submitting the price request, a mail is sent to the store owner - if adjustments are necessary, please adjust the process in the Flowbulider or the mail in the e-mail templates.<br></p><p><br></p><h2>Received price requests</h2><p>The ehaltene price requests are available in 2 areas in the admin - both areas have the same function.<br>&nbsp; &gt;&gt; Settings &gt; Extensions &gt; Price on request &gt; Received price requests<br>&nbsp; &gt;&gt; Catalog &gt; Price requests<br></p><h3><br></h3><h3>Price on request overview </h3><p>Relevant information about the price request is available:<br></p><ul><li>&nbsp;&nbsp;&nbsp; Request sent on: Date and time of the request (can also be used for sorting)</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Product number: this is the product number / item number (can also be used for sorting)</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Product: this is the product name for easier orientation</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Email: Email address of the customer</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Customer: first and last name of the customer</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Notified: either OPEN or the notification date is displayed here</li></ul><ul><li>&nbsp;&nbsp;&nbsp; ... : here you can see the price on request details </li></ul><p><br></p><p><br></p><p><br></p><h3>Price on request details</h3><p>Relevant information about the price request is available:<br></p><h4>Inquiry area</h4><p>Here the data of the price on request form filled in by the customer is displayed - which fields are displayed depends on the price on request form created. <br></p><p></p><h4>Product area</h4><p>The product number, the product name (linked to the product) and the current sales price are displayed.<br></p><h4>Status area</h4><p>By changing the slider \"The customer has not been notified\" the field changes to \"The customer has been notified\" and below it a date/time window is activated. When this is filled in and the price on request details are saved, the status in the overview page will also change.<br><br></p><h2>Plugin configuration</h2><p>In Shopware Admin (Extensions &gt; My Extensions &gt; ACRIS Price on Demand Professional &gt; Configuration) the following options are available:<br>This affects the type of vrobe filling of the new ACRIS CMS element: price on request form and can be changed if necessary.<br></p><p><br></p><h3>Prefill customer data</h3><p></p><ul><li>Prefill (The customer must be logged in for the prefilling of the data to work) = Default Setting<br>&nbsp;&gt;&gt; This means that if a user is logged in, then the data will be prefilled into the form.&nbsp;&nbsp;&nbsp; <br></li><li>Prefill and hide (If the customer has data available, e.g. e-mail, street...: the field will be prefilled, but hidden).<br>&gt;&gt; This function does basically the same as the one before, but all pre-filled form fields are hidden, leaving only those that cannot be pre-filled.<br></li></ul><p><br></p><h2>Notes / Known Limitations:</h2><ul><li>Rule BuilderRules: Not all technically possible rule builder rules can be used, please make sure you use a reasonable usecase.<br></li></ul>","installationManual":"<ul><li>The installation is done as usual in Shopware. </li></ul><ul><li>After that plugin configurations (Extensions &gt; My Extensions &gt; ACRIS Price on Request Professional &gt; Configuration) are available.</li><li>The price on request management can be found under Settings &gt; Extensions &gt; Price on request &gt; Price on request forms or received price requests.</li><li>The received requests are also available under Catalogs &gt; Price requests</li><li>An experience world with the CMS element Price on Request Form is available under Contents &gt; Experience Worlds &gt; ACRIS Standard Price on Request Form in the type Price on Request - for customizing please make a copy<br></li><li>A process is created in the Flow Builder Price on request form was sent&nbsp;</li><li>An email template is created Price on request this is used in the flow builder.</li><li>A Rule Builder rule is also created Price on request - customer is not logged in.</li><li>This can be used as a rule in addition to the dynamic product groups to enable sensible display/hiding of the buttons.</li></ul>","shortDescription":"Essential in B2B - show prices only after activation or after a login. Price on request Show form / buttons rule-controlled for dynamic product groups.","highlights":"perfectly display prices and price on inquiries (with / without price display, shopping cart button or info text, inquiry form and much more)\nfor dynamic product groups (e.g. whole categories, groups of products or even single products) and optionally additionally with rule builder rules \nPrice requests collected in the admin visible, can be marked as notified in the admin for a better overview\nPrefabricated experience world with price on request form can be customized individually\nCMS element: price on request form with individually customizable form fields is supplied","features":"Prices only visible after successful activation or login (Rule Builder rule: price on request - customer is not logged in) is included\nOptionally the following can be displayed instead of the shopping cart button (for dynamic product groups, additionally not Rulebuilder rule possible):  \nInquiry form (button) | Shopping cart button and Inquiry form (button) | Login required | Standard shopping cart button | Infotext | Inquiry form and Infotext | Inquiry form and Login button\nInquiry form is prefilled with customer data (if user is logged in)\nCMS element price on request Form can be customized (fields, labels, content of fields)\nAfter a request, an email with the request is sent to the store owner - it can also be sent additionally via Flowbuilder to the customer info.\nAll requests are collected in an overview in the admin - additionally an option \"notified on\" is available"}],"addons":["enterpriseCertified","highlightInListing","emotionPreset"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165990,"bookingKey":"acris48535681722","bookingText":"","price":199,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":165989,"bookingKey":"acris48535681722_M","bookingText":"","price":39.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzcnSGD","preview":true,"priority":0,"id":93844},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3sdflO","preview":false,"priority":20,"id":93822},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1hLLHx","preview":false,"priority":19,"id":93824},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2x0cQn","preview":false,"priority":18,"id":93823},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMspwSC","preview":false,"priority":17,"id":93821},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQLteTg","preview":false,"priority":16,"id":93825},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJ5mCoC","preview":false,"priority":10,"id":93903},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpK88FGw","preview":false,"priority":9,"id":93904},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3QbCAW","preview":false,"priority":8,"id":93905},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVK8FcB","preview":false,"priority":7,"id":93906},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplCzusC","preview":false,"priority":6,"id":93907},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfyx33B","preview":false,"priority":5,"id":93908},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyepppn","preview":false,"priority":0,"id":93884},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAqGuNm","preview":false,"priority":0,"id":93885},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOyXpMg","preview":false,"priority":0,"id":93886},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDmy7qA","preview":false,"priority":0,"id":93887},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqyus24","preview":false,"priority":0,"id":93888},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpU72O8n","preview":false,"priority":0,"id":93889},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEgySwp","preview":false,"priority":0,"id":93890},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYnF7Jk","preview":false,"priority":0,"id":93891},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNCiHLY","preview":false,"priority":0,"id":93892},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptH4Igf","preview":false,"priority":0,"id":93893},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbwqrQk","preview":false,"priority":0,"id":93894},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptRJ7Vo","preview":false,"priority":0,"id":93895},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz9K9R0","preview":false,"priority":0,"id":93896},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLe9BgI","preview":false,"priority":0,"id":93897},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsFHFbP","preview":false,"priority":0,"id":93898},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1AbNdo","preview":false,"priority":0,"id":93899},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSzLMvi","preview":false,"priority":0,"id":93900},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1i0wvN","preview":false,"priority":0,"id":93901},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxxjUzg","preview":false,"priority":0,"id":93902}],"comments":[{"authorName":"Matt White","text":"I am thrilled with this plugin! It offers a wide range of features that make it perfect for displaying prices and price inquiries on my website. Whether I want to display prices directly or prefer to show an inquiry form, the plugin allows me to do so in various ways.\n\nOne of the most impressive aspects is the flexibility it provides in managing dynamic product groups. I can select entire categories, groups of products, or even individual products and use the Rule Builder to set specific rules for displaying price inquiries. This gives me full control over how the inquiries are presented.\n\nAnother highlight is the ability to show prices only after approval or upon login. With the help of the Rule Builder, I can precisely determine when prices should be visible.\n\nFurthermore, the plugin provides alternative options instead of the shopping cart button, such as displaying an inquiry form, informational text, or a login requirement. This allows me to customize the user experience on my website.\n\nCommunication with customers is also optimized by the plugin. After an inquiry, an email is automatically sent to the shop owner, and there is even an option to send additional information to the customer using the Flow Builder.\n\nOverall, I am extremely satisfied with this plugin. It offers extensive functionality for effectively managing prices and price inquiries, enhancing the user experience. The clarity in the admin area and the customization options for the price inquiry form are particularly noteworthy. I highly recommend this plugin!","headline":"Great extension with many functions and perfect support!","creationDate":{"date":"2023-06-14 09:49:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Nico","text":"Ein tolles Plugin, das im Grunde genau unsere Anforderungen erfüllt. Installation verlief problemlos. Es traten lediglich Probleme im Zusammenhang mit einem anderen Plugin auf. Hier hat uns der Support aber super schnell und freundlich geholfen. Auch nach mehrmaligen hin- und herschreiben wurde man nicht ignoriert. Weiter so! ;-)","headline":"Super Plugin / Leicht einzurichten","creationDate":{"date":"2023-02-09 11:19:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"kontorplus.de","text":"Hallo, \ndieses Plugin funktioniert leider dem Anschein nach nicht mit der aktuellen SW6 Version 6.4.18.0 - ganz entgegen der hier gemachten Angabe des Anbieters. :((\n\nHaben am 05.01.2023 ein Update des Grundsystems von SW6 Version 6.4.16.0 auf SW6 Version 6.4.18.0. durchgeführt. Haben natürlich vorher extra hier eure hier gemachte Angabe geprüft, ob dies produktiv benötigte Plugin mit der Version 6.4.18.0 kompatibel ist und hätten andernfalls ein Update vorerst verworfen.\n\nLeider wurde nun beim Update des SW6 Grundsystems dieses Plugin als nicht kompatibel erkannt sowie automatisch deaktiviert und lässt sich nun auch nicht updaten/ fehlerfrei aktivieren, wird aber produktiv benötigt in der laufenden SW6 Version 6.4.180. Auch mag nicht das Plugin nicht vollständig deinstallieren, weil ich die bereits gemachten Einstellungen (Produkt auf Anfrage) eigentlich nicht verlieren und neu anlegen will.\n\nWir bitten dies zeitnah zu fixen / um Unterstützung, zumal das letzte Update und dessen möglichen Eigenheiten (vom SW6-Grundsystem auf Version 6.4.18.0 - von Anfang Dezember 2022) bei den Entwicklern bereits bekannt sein sollte/n. \n\nVielen Dank für eine zeitnahe Reaktion diesbezüglich!\nKontorplus.de\n\n// Nachtrag vom 10.01.2023: \n\nDer Installations-Fehler wurde vom Entwickler-Team behoben und das Plugin läuft (nach 5 Tagen) nun wieder Bewertungssterne entsprechend wieder angepasst. :)\n\nVielen Dank!","headline":"War nicht kompatibel mit der SW6 Version 6.4.18.0 in Kombination mit meiner mySQL Version !!!","creationDate":{"date":"2023-01-05 09:49:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Preis auf Anfrage Pro - B2B Preisanfrage + Preis Anzeige nach Login / Freischaltung / Anfrage","description":"<h2>Preise erst nach Login / Freischaltung einblenden und / oder ein Preis auf Anfrage Formular anbieten...</h2><p>Dieses Plugin ist unerlässlich für B2B Projekte aber auch für B2C Projekte in speziellen Anwendungsfällen sinnvoll. So besteht die Möglichkeit den \"in den Warenkorb Button\" gegen andere Funktionen \"auszutauschen\" z.B. Preis auf Anfrage, Bitte zuerst einloggen, sonstige Hinweistexte,  Ebenso besteht die Möglichkeit Preise auszublenden und eventuell Regelgesteuert einzublenden (z.B. nach Freischaltung bzw. nach Login). Das mitgelieferte CMS Formular kann nicht nur die Nutzdaten abfragen, sondern kann sogar mit Einfachauswahl, Mehrfachauswahl, Text und Kommentarfeldern umfangreiche Anfragen an den Shopbetreiber ermöglichen.<br /></p><p><br /></p><h2>Grundfunktionen des Plugins<br /></h2><ul><li>Preise und Preis auf Anfragen für dynamische Produktgruppen (z.B. ganze \nKategorien, Gruppen von Produkten oder auch einzelne Produkte)</li><li>Preise ausblenden (dynamische Produktgruppen und zusätzlich mit Rule Builder Regeln)</li><li>Anzeige der Preise erst nach Freischaltung bzw. nach erfolgreichem Login</li><li>Preis auf Anfrage Formular statt Warenkorb Button anzeigen</li><li>Anstelle eines Preises oder Warenkorb Buttons kann auch ein Infotext eingeblendet werden (z.B. Produkte derzeit nicht verfügbar)</li><li>Wenn das Preis auf Anfrage Formular zur Anwendung kommt, dann werden diese im Admin Bereich gesammelt und auch per Mail an den Shopbetreiber geschickt.</li><li>Zusätzlich steht im Admin die Möglichkeit zur Verfügung, die Anfragen als beantwortet zu markieren um eine Übersicht der offenen Anfragen zu erhalten.</li><li>Mit dem Plugin wird auch eine Erlebniswelt mit dem ACRIS CMS Element Preis auf Anfrage mitgeliefert - hier stehen zahlreiche Optionen zur Verfügung.</li><li>Das Preis auf Anfrage Formular wird (sofern der User eingeloggt ist) auch mit den Kundendaten befüllt <br /></li></ul><p><br /></p><p><b>Mögliche Optionen zur Anzeige anstelle des \"in den Warenkorb Buttons\"<br /></b></p><ul><li>Anfrage Formular</li></ul><ul><li>Warenkorb Button und Anfrage Formular</li></ul><ul><li>Login erforderlich</li></ul><ul><li>Standard Warenkorb Button</li></ul><ul><li>Infotext</li></ul><ul><li>Anfrageformular und Infotext</li></ul><ul><li>Anfrageformular und Login Button</li><li>Standard Warenkorb Button und Info Text</li><li>Login erforderlich und  Info Text<br /></li></ul><p><br /></p><h2>Nutzung des Plugins<br /></h2><h4>Vorbereitungen: Dynamische Produktgrupen anlegen, bei Bedarf Rule Builder Regeln, Erlebniswelten mit Preis auf Anfrage Formular </h4><p><i><b>Dynamischer Produktgruppen<br /></b></i>Zuerst macht die Anlage von dynamischen Produktgruppen Sinn, da diese dann bei den Preis auf Anfrage \"Regeln\" hinterlegt werden.<br />Es können mehrere Preis auf Anfragen erstellt werden - diese können mit Priorisierungen versehen werden - falls es Überschneidungen bei den dynamischen Produktgruppen gibt). <br /><i><b>Rule Builder Regeln<br /></b></i>Zusätzlich ist es möglich, die Preis auf Anfrage \"Regeln\" mit Rule Builder Rule zu versehen - dies macht bei manchen Einstellungen Sinn (z.B. Wenn \"Anfrageformular und Infotext\" ausgewählt wird, dann soll dies nur angezeigt werden, wenn die User nicht eingeloggt bzw. Freigeschaltet sind) - daher bitte falls Rule Builder Regeln benötigt werden, auch diese anlegen, damit diese später zugeordnet werden können.<br />Dieses Plugin liefert eine wichtige Regel mit:<i><b></b>ACRIS Preis auf Anfrage - Kunde ist nicht eingeloggt.</i><br /></p><p><i><b>Erlebniswelt mir ACRIS Preis auf Anfrage Formular<br /></b></i></p><p>Mit der Installation des Plugins wird bereits eine vorgefertigte Erlebniswelt mitgeliefert, diese kann verwendet werden oder als Vorlage für eigene Formulare dienen.<br /><i><b>Inhalte &gt; Erlebniswelten &gt; Preis auf Anfrage &gt; ACRIS Standard Preis auf Anfrage Formular</b></i></p><p><br /></p><h2>Anlegen Preis auf Anfragen bzw. von Regeln für Preis Anzeige<br /></h2><p><i><b>Einstellungen &gt; Erweiterungen &gt; Preis auf Anfrage &gt; Preis auf Anfrage Formulare<br /></b></i></p><p>Wenn bereits bereits Preis auf Anfrage Formulare bzw. die Regeln zur Preisanzeige erstellt wurden, dann sind diese in der Übersicht aufgelistet. Über den Button \"hinzufügen\" erscheint das Fenster zur Anlage neuer Preis auf Anfrage Formularen.</p><p><br /></p><h4>Bereich Grundeinstellungen:<br /></h4><ul><li><b>Interner Name:</b> wird zur Anzeige in der Übersicht verwendet, wenn mehrere Regeln angelegt werden kann eine Nummerierung Sinn machen.</li><li><b>Aktiv:</b> aktiv / inaktiv</li><li><b>Priorität</b>: erwartet wird eine Zahl, je höher, desto wichtiger. Dies kommt dann zur Anwendung, wenn bei einem Produkt mehrere Preis auf Anfrage Regeln zur Anwendung kommen.</li></ul><p><b>Bereich Anzeigebedingungen:<br /></b></p><ul><li><b>Dynamische Produktgruppen</b>: Wenn hier eine oder mehrere Dynamische Produktgruppen angegeben werden, dann trifft dies nur auf diese Produkte zu.<br />Wird das Feld leer gelassen, dann wird dies für alle Produkte angewandt.</li><li><b>Zusätzliche Rule Builder Regeln</b>: Die Preis auf Anfrage Regel wird für alle Produkte aus den zugewiesenen dynamischen Produktgruppen angewendet, wenn eine der angegebenen Regeln übereinstimmt (ODER-Verknüpfung). Wird keine Regel ausgewählt, trifft dies immer zu.<br /></li></ul><p><b>Bereich Preisanzeige:<br /></b></p><ul><li><b>Preisanzeige</b>: Preis anzeigen (Shopware Standard) oder Preis ausblenden</li><li><b>Erweiterte Einstellungen &gt; Metadaten Einstellungen</b>: <br />Diese Optionen wirken sich auf die Meta Daten des Produkts aus - bitte besprechen sie dies mit ihrem SEO Betreuer, was am meisten Sinn macht.<br />Im Standard blenden wir die Preis für die Suchmaschinen aus, jedoch kommt es deswegen zu Fehlermeldungen beim Crawlen wegen der fehlenden Preise.<br /></li></ul><p></p><p><b>Bereich Anzeigekonfiguration - Warenkorb Button</b> Optionen / Konfiguration:<br /></p><ul><li><b>Option: Anfrage Formular</b>:  <br />Wird diese Option gewählt, dann wird anstelle des \"in den Warenkorb Button\" ein neue Button \"Anfrage Formular\" eingeblendet.<br />Darunter blendet sich der <b>Bereich Anfrageformular </b>mit folgenden Feldern ein<b>:</b><br />&gt; <b>Preis auf Anfrage Button Text:</b>  Hier kann der Text des \"neuen\" Buttons eingegeben werden (je Sprache unterschiedlich)<br />&gt; <b>Anfrage Button Typ</b>: Hier wird die Farbe des Buttons eingestellt<br />&gt; <b>ACRIS Standard Price on request form:</b> Hier kann die von ACRIS vorgefertigte Erlebniswelt mit dem Preis auf Anfrage Formular verwendet werden, oder es kann eine neu angelegte Eröebniswelt zugeordnet werden.<br />Darunter werden die Formularfelder des zugeordneten Formulars angezeigt - wir empfehlen zuerst die gewünschte Erlebniswelt mit dem Preis auf Anfrage Formular zu erstellen (Inhalte &gt; Erlebniswelten) und hier keine Bearbeitung durchzuführen.<br /></li></ul><ul><li><b>Option: Warenkorb Button und Anfrage Formular:<br /></b>Wird diese Option gewählt, dann steht der Warenkorb Button und zusätzlich ein Preis auf Anfragebutton zur Verfügung.<br />Die Felder sind (wie oben dokumentiert) einstellbar<br /></li></ul><ul><li><b>Option: Login erforderlich</b><br />Wird diese Option gewählt, dann wird anstelle des \"in den Warenkorb Button\" ein \"Login Button\" eingeblendet.<br />Es erscheint im Admin ein Bereich Login Button: <br />&gt;&gt; <b>Login Button Text</b>: Dieser Text wird anstelle des \"in den Warenkorb\" Buttons angezeigt<br />&gt;&gt; <b>Login Button Typ</b>: Hier wird die Farbe des Buttons eingestellt.<br /><b>HINWEIS: </b><br />Wird diese Option verwendet, dann sollte im Bereich Anzeigebedingungen zusätzlich eine Rule Builder Regel angegeben werden (z.B. die von ACRIS mitgelieferte \"Preis auf Anfrage - Kunde ist nicht eingeloggt\" Regel), sonst wird niemals ein Kunde einen Preis sehen (oder einen Artikel in den Warenkorb legen können)<b><br /></b></li><li><b>Option: Standard Warenkorb Button<br /></b>Diese Option macht dann Sinn, wenn sehr viele Produkte mit \"Preis auf Anfrage\" ausgeblendet werden, aber mache davon trotzdem bestellbar sein sollen. Eine entsprechende Rule Builder Regel würde in diesem Fall Sinn machen.<br /></li></ul><ul><li><b>Option Infotext</b>:<br />Wird diese Option gewählt, dann wird der \"in den Warenkorb\" Button gegen den unten einzugebenden Text ersetzt.<b><br />HINWEIS: </b><br />Wird diese Option verwendet, dann sollte im \nBereich Anzeigebedingungen zusätzlich eine Rule Builder Regel angegeben \nwerden (z.B. die von ACRIS mitgelieferte \"Preis auf Anfrage - Kunde ist \nnicht eingeloggt\" Regel), sonst wird niemals ein Kunde einen Preis sehen\n (oder einen Artikel in den Warenkorb legen können)<b><br /></b></li><li><b>Option Anfrageformular und Infotext:<br /></b>Wird diese Option gewählt. dann erscheint ein Button für das Anfrageformular und darunter ein Infotext.<br /></li><li><b>Option: Anfrageformular und Login Button</b>:<br />Wird diese Option gewählt, dann stehen anstelle des in den Warenkorb Buttons ein \"Preis auf Anfrage\" und ein \"Login Button\" zur Verfügung.<br />Es kann Sinn machen, eine Rulebuilder Regel hinzuzufügen, damit für eingeloggte Kunden keine / eine andere \"Preis auf Anfrage Regel\" zurtrifft. <br /></li></ul><p><br /></p><h3>Erlebniswelt Preis auf Anfrage <br /></h3><p><i><b>Inhalte &gt; Erlebniswelten &gt; Preis auf Anfrage &gt; ACRIS Standard Preis auf Anfrage Formular</b></i><br />Mit der Installation des Plugins wir eine Erlebniswelt mit dem ACRIS Preis auf Anfrage Formular mitgeliefert - dies hat sehr viele Einstellungsmöglichkeiten.</p><p>Wenn Formular-Felder oder E-Mail Adresse angepasst werden soll, bitte eine Kopie der vorgefertigten Erlebniswelt erstellen, danach:<br /></p><p>Mit Klick auf das Zahnrad im Element kommen sie auf das Formular, welches dann aus 2 Bereichen besteht:<br /></p><h4><br /></h4><h4>Felder:</h4><p>   Verschiedene Felder sind voreingestellt, diese können verschoben und\n angepasst werden (ein/ausblendbar, Titel ausblenden, Pflichtfelder...)<br />   In dem Formular stehen folgende Felder zur Verwendung zur Verfügung:<br /><b>   Persönliche Daten:</b> Anrede | Vorname | Nachname | Strasse | PLZ | Stadt | Land | Telefonnummer | E-Mail<br /><b>   B2B:</b> Firma | Abteilung | UstID | Adresszusatzzeile 1<br /><b>   Select Felder:</b> Einfachauswahl | Mehrfachauswahl<br /><b>   Zusätzlich:</b> Textfeld | Kommentar</p><h4><br /></h4><h4>Grundeinstellungen:</h4><ul><li><b>Empfänger-Adressen</b>: Hier wird bei der Installation die Shopbetreiber E-Mail Adresse ausgelesen, diese kann gelöscht und gegen eine neue ersetzt werden. Auch mehrere Adressen sind möglich. Hinweis: diese Feld ist \"Sprachenübergreifend\" gleich.</li><li><b>Webservice URL:</b> Dieses Feature ist ein Funktion, welche nur für Spezialisten geeignet ist - daher bei Bedarf eine Supportanfrage an uns stellen.  Hier kann ein externer Webservice zur Übermittlung der Preis auf Anfrage Daten angegeben werden.</li><li><b>Interner Name:</b> Sinnvoll, wenn mehrere Formulare erstellt werden</li><li><b>Button Text</b>: Dieser Text wird auf der Produktdetailseite angezeigt - auch Sprachabhängig möglich.</li><li><b>Text bei erfolgreichem absenden</b>: Dieser Text wird nach dem Absenden des Formular im Frontend angezeigt.<br /></li></ul><p><b>HINWEIS</b>: Es wird nach Absenden der Preisanfrage ein Mail an den Shopbetreiber gesandt - falls Anpassungen erforderlich sind, bitte im Flowbulider den Prozess bzw. bei den E-Mail Vorlagen das Mail anpassen.<br /></p><p></p><br /><h2>Erhaltene Preisanfragen<br /></h2><p>Die ehaltenen Preisanfragen stehen in 2 Bereichen im Admin zur Verfügung - beide Bereiche haben dieselbe Funktion.<br /><i><b>  &gt;&gt; Einstellungen &gt; Erweiterungen &gt; Preis auf Anfrage &gt; Erhaltene Preisanfragen<br />  &gt;&gt; Katalog &gt; Preisanfragen<br /></b></i></p><p><i><b><br /></b></i></p><h3>Preis auf Anfrage Übersicht </h3>Es stehen relevante Informationen zur Preisanfrage zur Verfügung:<br /><ul><li><b>Anfrage gesendet am</b>: Datum und Uhrzeit der Anfrage (kann auch zur Sortierung verwendet werden)</li><li><b>Produktnummer</b>: dies ist die Produktnummer / Artikelnummer (kann auch zur Sortierung verwendet werden)</li><li><b>Produkt</b>: dies ist der Produktname zur leichteren Orientierung</li><li><b>E-Mail</b>: E-Mail Adresse des Kunden</li><li><b>Kunde</b>: Vorname und Nachname des Kunden</li><li><b>Benachrichtig</b>t: hier wird entweder OFFEN oder das Benachrichtigungsdatum angezeigt</li><li><b>... </b>: hier gehts zu den Preis auf Anfrage Details <br /></li></ul><p></p><p><br /></p><h3>Preis auf Anfrage Details <br /></h3>Es stehen relevante Informationen zur Preisanfrage zur Verfügung:<br /><p></p><h4>Bereich Anfrage<br /></h4><p>Hier werden die Daten des vom Kunden ausgefüllten Preis auf Anfrage Formulars angezeigt - welche Felder angezeigt werden ist abhängig vom erstellten Preis auf Anfrage Formular.  <br /></p><h4>Bereich Produkt</h4><p>Es  wird die Produktnummmer, der Produktname (ist mit dem Produkt verlinkt) und dem aktuellen Verkaufspreis angezeigt.<br /></p><h4>Bereich Status<br /></h4><p></p><p>Mit ändern des Schiebereglers \"Der Kunde wurde nicht benachrichtigt\" ändert sich das Feld auf \" Der Kunde wurde benachrichtigt und darunter aktiviert sich ein Datum/Zeit Fenster. Wenn dies ausgefüllt und die Preis auf Anfrage Details gespeichert wurden, ändert sich auch der Status in der Übersichtsseite.</p><p><br /></p><h2>Plugin Konfiguration</h2><p>Im Shopware Admin (<i>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS Preis auf Anfrage Professional &gt; Konfiguration</i>) stehen folgende Optionen zur Verfügung:<br /><b>Dies betrifft die Art der Vrobefüllung des neuen ACRIS CMS Elements: Preis auf Anfrage Formular und kann im Bedarfsfall geändert werden.<b><br /></b><br /></b></p><p><b>Vorausfüllen von Kundendaten</b><b><br /></b></p><ul><li>Vorausfüllen (Der Kunde muss eingeloggt sein, damit das Vorausfüllen der Daten funktioniert) = Standard Einstellung<br />&gt;&gt; Das bedeutet, wenn ein User sich eingeloggt hat, dann werden die Daten in das Formular vorausgefüllt.<br /></li></ul><ul><li>Vorausfüllen und verstecken (Wenn der Kundendaten zur Verfügung hat, z. B. E-Mail, Straße...: das Feld wird vorausgefüllt, aber ausgeblendet)<br />&gt;&gt; Diese Funktion macht im Prinzip dasselbe wie die davor, jedoch werden alle vorbefüllten Formularfelder ausgeblendet und es bleiben nur die übrig, welche nicht vorausgefüllt werden können.<br /></li></ul><p><br /></p><h3>Hinweise / Bekannte Einschränkungen:</h3><ul><li> Rule BuilderRegeln: Es können nicht alle technisch möglichen Rule Builder Regeln verwendet werden, bitte achten sie auf einen sinnvollen Usecase.<br /></li></ul>","installationManual":"<ul><li>Die Installation erfolgt wie in Shopware üblich. <br /></li></ul><ul><li>Danach stehen <b>Plugin Konfigurationen</b> (<i>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS Preis auf Anfrage Professional &gt; Konfiguration</i>) zur Verfügung.</li><li>Die <b>Preis auf Anfrage Verwaltung </b>sind unter<b></b><i>Einstellungen &gt; Erweiterungen &gt; Preis auf Anfrage &gt; Preis auf Anfrage Formulare bzw. erhaltene Preisanfragen</i> zu finden.</li><li>Die<b> erhaltenen Anfragen</b> stehen auch unter <i>Kataloge &gt; Preisanfragen</i> zur Verfügung <br /></li><li>Eine Erlebniswelt mit dem<b> CMS Element Preis auf Anfrage Formular</b>  steht unter <i>Inhalte &gt; Erlebniswelten &gt; ACRIS Standard Preis auf Anfrage Formular</i> im Typ Preis auf Anfrage zur Verfügung - für Anpassungen bitte eine Kopie der Erlebniswelt erstellen.<br /></li><li>Im <b>Flow Builder</b> wird ein Prozess angelegt<b> Preis auf Anfrage Formular wurde gesendet </b><br /></li><li>Eine <b>E-Mail Vorlage</b> wird angelegt <b>Preis auf Anfrag</b>e diese wird im Flowbuilder verwendet. <br /></li><li>Es wird auch noch eine <b>Rule Builder Regel </b>angelegt <b>Preis auf Anfrage - Kunde ist nicht eingeloggt</b>. <br />Diese kann zusätzlich zu den Dynamischen Produktgruppen als Regel verwendet werden um sinnvolle Ein/Ausblendung der Buttons zu ermöglichen<br /></li></ul><p><br /></p>","version":"3.0.6","changelog":[{"version":"3.0.6","text":"<p>Product box view optimized.</p>","creationDate":{"date":"2023-07-14 13:51:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.5","text":"<ul><li>Improved storefront compatibility with other plugins.</li></ul>","creationDate":{"date":"2023-06-19 07:58:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"<ul><li>Fixed product box price visible on search pages.</li></ul>","creationDate":{"date":"2023-05-17 15:41:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<ul><li>Added a request function under the product details button in the listing.</li></ul>","creationDate":{"date":"2023-05-12 09:39:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>Fixes a possible problem when uninstalling the plugin.</p>","creationDate":{"date":"2023-05-08 13:12:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<ul><li>Fixed error on installing the plugin.</li></ul>","creationDate":{"date":"2023-05-05 13:25:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>Compatibility established for SW 6.5</p>","creationDate":{"date":"2023-05-03 14:41:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.10","text":"<p>Product box view optimized.</p>","creationDate":{"date":"2023-07-14 13:50:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.9","text":"<ul><li>Fixed product box price visible on search pages.</li></ul>","creationDate":{"date":"2023-05-17 15:30:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.8","text":"<ul><li>Added request functionality below the product details button in the listing.</li></ul>","creationDate":{"date":"2023-05-11 12:29:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.7","text":"<p>Fixes a possible problem when uninstalling the plugin.</p>","creationDate":{"date":"2023-05-08 13:13:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.6","text":"<ul><li>Fixed price display bug.</li></ul>","creationDate":{"date":"2023-04-17 13:46:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.5","text":"<ul><li>Fixes a problem with the display of sales units<br /></li></ul>","creationDate":{"date":"2023-03-30 10:24:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.4","text":"<ul><li>Fixes a problem when displaying the scale prices<br /></li></ul>","creationDate":{"date":"2023-03-23 15:33:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.3","text":"<ul><li>Fixes a problem when hiding prices on the product detail page</li><li>Fixes a display error of the postal code in the mail template</li></ul>","creationDate":{"date":"2023-03-23 13:47:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.2","text":"<ul><li>Optimised request functionality for shopware standard product layout.</li></ul>","creationDate":{"date":"2023-03-21 14:02:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.0","text":"<ul><li>Text option added to price display.</li><li>Added info text position.</li><li>Fixed price display bug.</li></ul>","creationDate":{"date":"2023-02-14 11:45:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.5","text":"<ul><li>Fixes a problem on uninstalling the plugin<br /></li></ul>","creationDate":{"date":"2023-02-10 09:09:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.4","text":"<ul><li>Plugin compatibility improved.</li></ul>","creationDate":{"date":"2023-02-02 13:17:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.3","text":"<ul><li>Optimised compatibility with ACRIS Quantity Requirement Calculator.</li></ul>","creationDate":{"date":"2023-02-01 10:13:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.2","text":"<ul><li>Optimised compatibility with ACRIS Search Plugin.</li></ul>","creationDate":{"date":"2023-01-23 15:03:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.1","text":"<ul><li>Updated minimum version required for Shopware.</li></ul>","creationDate":{"date":"2023-01-23 14:59:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.0","text":"<ul><li>Optimizes loading of the price on requests.</li></ul>","creationDate":{"date":"2023-01-23 14:55:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.6","text":"<ul><li>Optimised product delivery information display compatibility.</li></ul>","creationDate":{"date":"2023-01-16 14:49:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.5","text":"<ul><li>Fixed error on plugin update.</li></ul>","creationDate":{"date":"2023-01-05 13:49:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.4","text":"<ul><li>Corrected VAT form field snippet in Storefront.</li></ul>","creationDate":{"date":"2023-01-04 19:54:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.3","text":"<ul><li>Fixed delivery information display.</li></ul>","creationDate":{"date":"2022-12-22 13:28:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"<ul><li>Added option to individually assign request form configuration for product box, detail or both.</li></ul>","creationDate":{"date":"2022-12-05 18:06:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<ul><li>Added new options \"Default cart button and info text\" and \"Login button and info text\" to Add to cart display settings.</li></ul>","creationDate":{"date":"2022-11-24 12:20:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.5","text":"<ul><li>Fixed error in Storefront template.</li></ul>","creationDate":{"date":"2022-11-24 09:13:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.4","text":"<ul><li>Optimizes request form functionality if it is sent from a standard shop page in Storefront.</li></ul>","creationDate":{"date":"2022-11-23 11:28:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.3","text":"<p>Optimizes displaying of the info text in the Storefront.</p>","creationDate":{"date":"2022-11-21 13:41:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<ul><li> Allows you to show or hide product delivery information in price request configuration.</li></ul>","creationDate":{"date":"2022-10-21 14:16:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<ul><li>Allows you to sort options for request form single and multi select field type.</li></ul><ul><li>Added checkbox field type to request form in shopping experience.</li></ul><ul><li>Optimised price on request email template.</li></ul>","creationDate":{"date":"2022-09-13 13:36:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<ul><li>Allows you to set sizes for every form field.</li></ul>","creationDate":{"date":"2022-09-05 12:01:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>- Fixes an issue where the Shopware Captcha was ignored.</p>","creationDate":{"date":"2022-08-18 12:31:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Correction of the default language when inserting the email templates.</p>","creationDate":{"date":"2022-08-08 12:58:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul><li>Optimised modal title display.</li></ul><ul><li>Updated shopware version requirements.</li></ul>","creationDate":{"date":"2022-07-29 11:17:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.3","text":"<p>Fixes an issue where the Shopware Captcha was ignored.</p>","creationDate":{"date":"2022-08-18 13:45:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.2","text":"<p>Correction of the default language when inserting the email templates.</p>","creationDate":{"date":"2022-08-08 12:59:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.11","text":"<ul><li>Fixed issue displaying the price advanced pricing when the plugin is deactivated.</li></ul>","creationDate":{"date":"2022-07-28 10:04:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.10","text":"<ul><li>Fixed issue when loading the received request in administration</li></ul>","creationDate":{"date":"2022-07-25 12:02:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.9","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-24 19:08:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.8","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-20 16:10:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.3","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-18 17:02:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.2","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-18 09:02:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.0","text":"<ul><li>Store Release, Veröffentlichung</li></ul>","creationDate":{"date":"2022-07-06 14:10:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.3","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-05-19 08:38:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris48535681722","redirectToStore":false,"lowestPriceValue":39.99}