{"id":15303,"name":"VimirLabHelpDesk","code":"Vimir12711748283","lastChange":{"date":"2023-07-24 08:28:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLNUfdO","examplePageUrl":"","moduleKey":"VimirLabHelpDesk","creationDate":{"date":"2022-05-23 14:25:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-07-06 07:53:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-09-05 15:13:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3054,"prefix":"Vimir","name":"VimirLab Solutions","website":"//vimirlab.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3054_128-128.png"},"infos":[{"id":26664,"name":"HelpDesk - Ticketing Solution","description":"<h4></h4><h4>Bei der Helpdesk-Erweiterung geht es darum, die Probleme der Kunden zu lösen. Kunden können erhöhen das Ticket im Zusammenhang mit ihren Problemen über das Kundenkonto-Dashboard, gibt es eine Registerkarte mit dem Namen Ihr Ticket. Kunden können auch mit dem Helpdesk-Administrator kommunizieren, um das Problem zu lösen ihre Ticketausgabe, Beschwerden, Rückfragen, Probleme.</h4><p><br /></p><h4>Tickets können auch vom Administrator aus dem Backend erstellt werden. Auch der Administrator kann FAQ vom Backend hinzufügen.</h4><p></p><p></p><p><br /></p><h4>Um ein Ticket zu erstellen, müssen Kunden danach auf der Website eingeloggt sein Sie erstellen ein Ticket und reichen es ein. Danach wird der Helpdesk-Administrator zugewiesen Ein Agent zu diesem Ticket und machte sich an die Arbeit.</h4><p><br /></p><h4>Kunden können jedes Ticket mit allen Informationen wie (Betreff, Name, E-Mail, Tickettyp, Priorität, Status und Erstellungsdatum) und siehe auch Admin zum Kunden Nachrichtenthread.</h4><p><br /></p><p></p><h4>Diese Erweiterung ermöglicht es dem Administrator, den Ticketstatus zu ändern, Agenten zuzuweisen, mit Kunden zu kommunizieren und FAQ hinzuzufügen.</h4><p></p><p></p><p><b><br /></b></p><p></p><h2><b>Die Unterstützung</b></h2><p><b><br /></b></p><h4>Für Unterstützung besuchen Sie bitte <a href=\"https://www.vimirlab.com/\">https://www.vimirlab.com</a></h4><p><br />Diese Erweiterung aktivieren/deaktivieren Sie über die Registerkarte <b>Erweiterung -&gt; Meine Erweiterung -&gt; HelpDesk</b>. </p><p>Bitte wenden Sie sich bei Fragen an Ihren vimirlab-Vertreter.</p><p></p><p><br /></p><p><b><br /></b></p><p></p>","installationManual":"<h2>Installieren und aktivieren Sie einfach das Plugin Konfigurationen vornehmen Fertig!</h2><p><br></p><h2><b>Konfigurationen</b></h2><p><br></p><h4>Gehen Sie zu<b> Erweiterung -&gt; Meine Erweiterung </b>und suchen Sie die Registerkarte <b>HelpDesk </b>und klicken Sie auf&nbsp; Konfigurationsregisterkarte.</h4><p><br></p><h3><b>Ermöglichen</b></h3><p></p><h4></h4><ul><li>Unter Einstellungen hat der Administrator eine Option zum Aktivieren oder Deaktivieren der Erweiterung.</li></ul><p><br></p><h4><b>FAQ im Konto aktivieren</b></h4><p></p><ul><li>Unter Einstellungen hat der Administrator die Möglichkeit, die FAQ im Konto zu aktivieren oder zu deaktivieren.</li></ul><p></p><p><br></p><h4><b>FAQ in Navbar aktivieren</b></h4><p></p><ul><li>Unter Einstellungen hat der Administrator eine Option zum Aktivieren/Deaktivieren der FAQ von Navbar.</li></ul><p></p><p><br></p><h3><b>E-Mail Ermöglichen</b></h3><h4></h4><ul><li>Unter Einstellungen hat der Administrator die Möglichkeit, das Senden zu aktivieren oder zu deaktivieren Ticket erstellt Bestätigungsmail</li></ul><p><br></p><h3><b>Absender E-Mail</b></h3><h4></h4><ul><li>Der Administrator kann die E-Mail-Adresse des E-Mail-Absenders hinzufügen/bearbeiten.</li></ul><p><br></p><h3><b>Absender&nbsp;Name</b></h3><h4></h4><ul><li>Der Administrator kann auch den Namen des E-Mail-Absenders hinzufügen/bearbeiten</li></ul><p><br></p><h2><b>Schritte</b></h2><p><br></p><h4>Es gibt mehrere Schritte, um ein Ticket zu erstellen. Einige dieser Schritte sind</h4><h4>immer gleich. Führen Sie die folgenden Schritte aus, damit der Administrator ein Ticket erstellen kann:</h4><h4>1) Ticketstatus erstellen</h4><h4>2) Tickettyp (Kategorie) erstellen</h4><h4>3) Ticketpriorität erstellen</h4><h4>4) Erstellen Sie eine Agentenposition</h4><h4>5) Ticket-Agent erstellen</h4><h4>6) Ticket erstellen</h4><p></p><h4>7) Kommunizieren Sie mit dem Kunden</h4><h4>8)&nbsp;FAQ erstellen</h4><p><br></p><p></p><h2><b>1. Ticketstatus erstellen</b></h2><p></p><h4></h4><ul><li>Der Ticketstatus wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie jetzt hinzufügen möchten Neuer Ticketstatus im Dashboard können Sie&nbsp;<b>Inhalt-&gt;HelpDesk sehen.&nbsp;</b></li><li>Gehen Sie zu <b>HelpDesk -&gt; Ticket hinzufügen -&gt; Status</b>. Klicken Sie auf dieser Seite auf Status hinzufügen.</li></ul><p><br></p><h2><b>2. Tickettyp erstellen (Kategorie)</b></h2><p></p><h4></h4><ul><li>Die Ticketkategorie wird aus der Backend-Konfiguration hinzugefügt. Nun, wenn Sie wollen Wenn Sie eine neue Ticketkategorie im Dashboard hinzufügen, können Sie <b>Inhalt-&gt;HelpDesk</b> sehen.</li><li>Gehen Sie zu <b>HelpDesk -&gt; Ticket hinzufügen -&gt; Kategorie</b> hinzufügen. Klicken Sie auf dieser Seite auf Neue Kategorie hinzufügen.</li></ul><p></p><p><br></p><h2><b>3. Ticketpriorität erstellen</b></h2><h4></h4><ul><li>Die Ticketpriorität wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie jetzt eine neue Ticketpriorität im Dashboard hinzufügen möchten, können Sie <b>Inhalt-&gt;HelpDesk</b> sehen.</li><li>Gehen Sie zu <b>Helpdesk-&gt;Ticket hinzufügen-&gt;Priorität hinzufügen</b> Klicken Sie auf dieser Seite auf Neue Priorität hinzufügen.</li></ul><p><br></p><h2><b>4. Erstellen Sie eine Agentenposition</b></h2><h4></h4><ul><li>Die Agentenposition wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie jetzt eine neue hinzufügen möchten Agentenposition im Dashboard können Sie&nbsp;<b>Inhalt-&gt;HelpDesk </b>sehen.</li><li>Gehen Sie zu <b>Helpdesk-&gt;Ticket hinzufügen-&gt;Position hinzufügen.</b> Klicken Sie auf dieser Seite auf Neue Position hinzufügen.</li></ul><p></p><p><br></p><h2><b>5. Ticket-Agent erstellen</b></h2><h4></h4><ul><li>Ticket Agent wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie einen neuen Agenten zum Dashboard hinzufügen möchten, sehen Sie <b>Inhalt-&gt;HelpDesk.</b></li><li>Gehen Sie zu <b>HelpDesk -&gt; Ticket hinzufügen -&gt; Agent hinzufügen.</b> Klicken Sie auf dieser Seite auf Neu hinzufügen Agent.</li></ul><p></p><p><br></p><h2><b>6. Ticket erstellen</b></h2><p></p><h4></h4><h4></h4><h4></h4><ul><li>Der Administrator kann ein Ticket für den Kunden gemäß Kundenanfrage vom Backend erstellen Konfigurationen. Wenn Sie jetzt ein neues Ticket im Dashboard hinzufügen möchten, können Sie sehen <b>Inhalt-&gt;HelpDesk</b></li></ul><ul><li>Gehen Sie zu <b>HelpDesk-&gt;Ticket hinzufügen.</b> Klicken Sie auf die Schaltfläche Neues Ticket hinzufügen.</li><li>Der Administrator kann den Betreff des Tickets, den Kundennamen, die E-Mail-Adresse des Kunden und das Ticket angeben Kategorie, Ticketagent, Ticketstatus nach Backend.</li><li>Außerdem kann der Administrator Ticketpriorität, Ticketbeschreibung, Anhang und Hinzufügen zuweisen E-Mail-Adresse des Empfängers.</li></ul><p><br></p><h2>7. Kommunizieren Sie mit dem Kunden</h2><p></p><p></p><h4></h4><ul><li>Der Administrator kann mit Kunden kommunizieren, um ihre Probleme gemäß den Anforderungen des Kunden zu lösen. <b>Inhalt-&gt;HelpDesk.</b></li><li><p>Wenn Sie nun über das Dashboard mit Kunden kommunizieren möchten.</p></li><li>Gehen Sie zu <b>HelpDesk-&gt; Nachricht Ticket</b> auswählen klicken Sie auf Name des Tickets</li><li>Admin Klicken Sie auf Nachricht und überprüfen Sie die Kundennachricht.</li><li>Danach kann der Administrator mit dem Kunden kommunizieren</li></ul><p><br></p><h3><b>8.&nbsp;&nbsp;FAQ erstellen</b></h3><h4><ul><li>Der Administrator kann FAQ vom Backend erstellen. Kann eine Reihe von FAQ vom Administrator hinzufügen.</li><li>Der Administrator kann Kategorien verwalten und sie vom Backend aus bearbeiten</li><li>Der Administrator kann FAQ nach Kategorien gruppieren und filtern.</li></ul><p><br></p>Der Administrator kann FAQ für Kunden gemäß Kundenanfragen aus der Backend-Konfiguration erstellen. Wenn Sie jetzt eine neue FAQ im Dashboard hinzufügen möchten, können Sie <b>Content-&gt; HelpDesk sehen</b><br><p><b><br></b></p></h4><h4>Gehen Sie zu <b>Helpdesk-&gt;Ticket hinzufügen-&gt;FAQ.</b>&nbsp; Klicken Sie auf dieser Seite auf Neue FAQ hinzufügen.</h4><p><br></p><p></p><h2><b>Am Frontend</b></h2><h4></h4><h4></h4><ul><li>Damit Kunden Tickets zu ihrem Problem erstellen können. Es gibt ein paar Schritte zum Erstellen eines Tickets. Einige dieser Schritte sind immer gleich.</li></ul><h4></h4><h4></h4><h4></h4><h4></h4><ul><li>Um ein Ticket zu erstellen, muss der Kunde auf der Website angemeldet sein, danach kann er einsehen Kundenkonto-Dashboard,Es gibt eine Registerkarte namens Help Desk Klicken Sie auf und dann Ticket erstellen.</li></ul><h4></h4><ul><li>Wenn Sie ein Ticket erstellen möchten, klicken Sie auf TICKET ERSTELLEN.</li></ul><h4></h4><h4></h4><ul><li>Wenn Sie mit dem Helpdesk-Administrator kommunizieren möchten, um Ihr Ticketproblem zu lösen, und auch Sehen Sie sich Ihre Konvertierung an und klicken Sie dann auf Anzeigen.</li></ul><h4></h4><ul><li>Danach können Sie mit dem Helpdesk-Administrator kommunizieren und Ihre sehen zuvor Konvertierung</li><li>Benutzer können ihre Fragen zu Fragen aus FAQ-Funktionen überprüfen.</li><li>FAQ ist nach Kategorien gruppiert, damit Benutzer die Frage leicht finden können.</li><li>Benutzer können die Registerkarte „FAQ“ in der Navigationsleiste sehen, sodass Benutzer von dort aus einfach auf FAQ zugreifen können, ohne die FAQ auf der Website durchsuchen zu müssen.</li></ul><p><br></p><h2><b>Kundenvorteile</b></h2><p><b>Durch Erstellen von Tickets. Die HelpDesk-Erweiterung hilft Kunden, ihre Ticketprobleme einfach zu lösen. Es spart dem Kunden Zeit, die normalerweise mit der Lösung seines Problems verschwendet wird.</b><br></p><p><b><br></b></p><h2><b>Erweiterung deinstallieren</b></h2><p><b>Der Administrator kann die Erweiterung einfach über das Backend deinstallieren.</b><br></p><p><br></p><p></p><p></p><p></p>","shortDescription":"Diese Erweiterung hilft beim Erstellen von Tickets zu ihrem Problem. Sie haben Möglichkeiten dazu Tickets erstellen und mit den Kunden kommunizieren Sowohl im Admin als auch im Frontend","highlights":"","features":""},{"id":26665,"name":"HelpDesk - Ticketing Solution","description":"<h4>Helpdesk extension is all about solving customers' problems. Customers can raise the ticket related to their problems via the customer Account Dashboard, there is a tab named Your Ticket. Customers can also communicate with helpdesk admin to solve their ticket issues, complaints, queries, and problems.</h4><p><br></p><h4>Tickets may also be created by the admin from the backend.&nbsp;&nbsp;Also admin can add FAQs from the backend.&nbsp;<b></b></h4><p><b></b></p><b></b><p><br></p><p></p><h4>To create a ticket, customers must be logged in to the website after that they will create a ticket and submit it. After that Helpdesk admin assigned An Agent to that Ticket and got to work.</h4><p><br></p><h4>Customers can see each ticket with all the information like (subject, name, email, ticket type, priority, status, and created date) and also see the admin to the customer message thread.</h4><p><br></p><p></p><h4>This Extension allows the admin to change ticket status, assign agents, communicate with customers, and Add FAQs.</h4><p></p><p><br></p><h2><b>Support</b></h2><h4>For Support please Visit&nbsp;&nbsp;<a href=\"https://www.vimirlab.com/\">https://www.vimirlab.com</a></h4><h4>This extension enable/disable from Extension -&gt; My Extension-&gt; HelpDesk tab. Please contact your vimirlab representative for any queries.</h4><p><br></p>","installationManual":"<h3><b>Installation Guide</b></h3><p>Simply install and activate the plugin</p><p>Make configurations</p><p>Finished!</p><p><br></p><h2><b>Configuration</b></h2><p></p><p>Go to <b>Extension -&gt; My Extension</b> and find the <b>HelpDesk </b>Tab and click on the <b>Configuration </b>tab</p><p><br></p><h3><b>Enabled</b></h3><p></p><ul><li>Under settings, the admin has an option to enable or disable the Extension.</li></ul><h3><b>Enable FAQ in the account</b></h3><p></p><ul><li>Under setting, the admin has an option to enable or disable the FAQ in the account.</li></ul><h3><b>Enable FAQ in Navbar</b></h3><p></p><p></p><ul><li>Under Setting, Admin has an option to enable/disable the FAQ from Navbar.</li></ul><h3><b>Email Enable</b></h3><p></p><p></p><ul><li>&nbsp;Under settings, the admin has an option to enable or disable the sending ticket created confirmation mail</li></ul><h3><b>Sender Email</b></h3><p></p><ul><li>Admin can add/edit Email sender email address.</li></ul><h3><b>Sender Name</b></h3><p></p><ul><li>Admin can also add/edit the Email sender names.</li></ul><p><br></p><h2><b>Steps</b></h2><p></p><p>There are multiple steps to creating a ticket. Some of these steps are always the same. For the admin to create a Ticket follow the below steps:</p><p>1.&nbsp;Create Ticket Status</p><p>2.&nbsp;Create Ticket Type (Category)<br></p><p>3.&nbsp;Create Ticket Priority</p><p>4.&nbsp;Create Agent Position</p><p>5.&nbsp;Create&nbsp; Ticket Agent</p><p>6.&nbsp;Create Ticket</p><p>7.&nbsp;Communicate with Customer</p><p>8. Create FAQ&nbsp;</p><p></p><p><br></p><h2><b>1.&nbsp;Create Ticket Status</b></h2><p>Ticket Status is added from the backend configuration. Now if you want to add new ticket status in Dashboard you can see <b>Content-&gt;HelpDesk.</b></p><p><b><br></b></p><p>Go to <b>HelpDesk-&gt;Add Ticket -&gt; Status. </b>On this page, Click on Add Status.</p><p><br></p><h2><b>2.&nbsp;Create Ticket Type (Category)</b></h2><p>Ticket Category is added from backend configuration. Now if you want to add a new ticket category in Dashboard you can see <b>Content-&gt;</b><b>HelpDesk</b>.</p><p><br></p><p>Go to <b>HelpDesk-&gt;Add Ticket -&gt; Add Category. </b>On this page, click on Add New Category.&nbsp;&nbsp;</p><p></p><p><br></p><h2><b>3.&nbsp;Create Ticket Priority</b></h2><p>Agent Position is added from backend configuration. Now if you want to add a new agent position in Dashboard you can see <b>Content-&gt;</b><b>HelpDesk.</b></p><p><b><br></b></p><p>Go to <b>Helpdesk-&gt;Add Ticket-&gt;Add Position. </b>On this page, click on Add New Position.</p><p><br></p><h2><b>4.&nbsp;Create Agent Position</b></h2><p>Ticket Priority is added from the backend configuration. Now if you want to add a new ticket priority in Dashboard you can see <b>Content-&gt;</b><b>HelpDesk.</b></p><p><b><br></b></p><p>Go to <b>Helpdesk-&gt;Add Ticket-&gt; Add Priority</b> On this page, click on Add New Priority.</p><p><br></p><h2><b>5.&nbsp;Create&nbsp; Ticket Agent</b></h2><p>Ticket Agent is added from backend configuration. Now if you want to add a new agent in Dashboard you can see <b>Content-&gt;</b><b>HelpDesk.</b></p><p><b><br></b></p><p>Go to to HelpDesk-&gt;Add Ticket -&gt; Add Agent. On this page, click on Add New Agent.</p><p><br></p><h2><b>6.&nbsp;Create Ticket</b></h2><p>Admin can create Tickets for customers as per customer request from backend configuration. Now if you want to add a new ticket in Dashboard you can see <b>Content-&gt;</b><b>HelpDesk</b><b></b></p><p><b><br></b></p><p><b></b></p><b></b><p>Go to <b>HelpDesk-&gt;Add Ticket. </b>Click on Add New Ticket button.</p><p><br></p><p>Admin can give ticket subject, customer name, customer email, ticket category, and ticket agent ticket status by the backend.</p><p><br></p><p></p><p>Also, the admin can give ticket priority, ticket description, attachments, and add Recipients' Email addresses.</p><p><br></p><p></p><p>Here the admin can assign an agent to the ticket, and change ticket status, and priority. For this, select a ticket and click on it and edit Ticket.</p><p><br></p><h2><b>7.&nbsp;Communicate with Customer</b></h2><p>Admin can communicate with customers to solve their issues as per customer request. Now if you want to communicate with customers on Dashboard you can see <b>Content-&gt;</b><b>HelpDesk.</b></p><p><b><br></b></p><p>Go to <b>HelpDesk-&gt; Message </b>select ticket click on <b>Name </b>of ticket</p><p><br></p><p>Admin Click on Message and check customer message.</p><p><br></p><p></p><p>After that admin can communicate with the customer.</p><p><br></p><h3><b>8.&nbsp; Create FAQ</b></h3><p>Admin can create FAQ From backend. Can add number of &nbsp;FAQ from admin.</p><p></p><p>Admin can manage categories and edit them from backend.</p><p></p><p>Admin can group and filter FAQ by categories.</p><p><br></p><p>Admin can create faq for customers as per customer queries from&nbsp;backend configuration. Now if you want to add a new FAQ in Dashboard you can see&nbsp;<b>Content-&gt;</b><b></b><b>HelpDesk</b></p><p>Go to&nbsp;<b>Helpdesk-&gt;Add Ticket-&gt;</b><b>&nbsp;FAQ </b>On this page, click on Add New&nbsp;FAQ.</p><p></p><p><br></p><p></p><h2><b>At Frontend</b></h2><p></p><p>For customers to create tickets related to their problem. There are a few steps to create a ticket. Some of these steps are always the same.</p><p><br></p><p></p><p>To create a ticket, customers must be logged in website after that they can see in the customer Account Dashboard, that there is a tab named Help Desk. Click on and then create a ticket.</p><p><br></p><p>You can see in the above image that you can create a ticket as well as see your previously created ticket.</p><p><br></p><p>If you want to create a ticket then click on <b>CREATE TICKET&nbsp;</b></p><p><b><br></b></p><p>If you want to communicate with the helpdesk admin to solve your ticket issue and also see your conversion, then click on <b>View.</b></p><p><b><br></b></p><p>After that, you can communicate with the helpdesk admin and see your previous conversion.</p><p><br></p><p>User can check their queries related to questions from FAQ features.</p><p></p><p>FAQ is grouped by categories so users can easily find the question. </p><p></p><p>Users can see the FAQ tab in the navbar so from there users can easily access FAQ no need to search FAQ on the site.</p><p><br></p><p></p><h2><b>Customer Benefits</b></h2><p></p><p>By creating tickets. HelpDesk extension helps customers easily resolve their ticket issues. It saves the time of the customer which is normally wasted in solving their issue.</p><p><br></p><h2><b>Uninstall Extension&nbsp;</b></h2><p>Admin can easily uninstall the extension from the backend.</p><p><b><br></b></p><p><br></p><p><b></b></p><p><b></b></p><b></b><p></p>","shortDescription":"This extension helps to create tickets related to their issue. You have options to \ncreate tickets and communicate with the customers in backend as well as frontend.","highlights":"","features":""}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165650,"bookingKey":"Vimir12711748283","bookingText":"","price":199,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":165649,"bookingKey":"Vimir12711748283_M","bookingText":"","price":29,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaowDOy","preview":true,"priority":100,"id":91407},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcnvc6I","preview":false,"priority":102,"id":91410},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxX8XUC","preview":false,"priority":101,"id":91409},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaYfSBd","preview":false,"priority":100,"id":91406},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFQ1CGH","preview":false,"priority":98,"id":91412},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnujtGA","preview":false,"priority":96,"id":91404},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpG2KEYB","preview":false,"priority":95,"id":91408},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCtdNBE","preview":false,"priority":93,"id":92077},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4Fiixc","preview":false,"priority":91,"id":92080},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYh1VUa","preview":false,"priority":0,"id":91386},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpa4VjUe","preview":false,"priority":0,"id":91387},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPyhAqr","preview":false,"priority":0,"id":91388},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHHLIHC","preview":false,"priority":0,"id":91389},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNv2ehi","preview":false,"priority":0,"id":91390},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgqqWgE","preview":false,"priority":0,"id":91391},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpw7Opcx","preview":false,"priority":0,"id":91392},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphzVn75","preview":false,"priority":0,"id":91393},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppNzybp","preview":false,"priority":0,"id":91394},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoxiIIy","preview":false,"priority":0,"id":91395},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpj0k1Md","preview":false,"priority":0,"id":91396},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcpTrlE","preview":false,"priority":0,"id":91397},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php72mSlC","preview":false,"priority":0,"id":91398},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDfb9iz","preview":false,"priority":0,"id":91399},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaLmPsz","preview":false,"priority":0,"id":91400},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptG1tka","preview":false,"priority":0,"id":91401},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZ6nVPe","preview":false,"priority":0,"id":91402},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQOlaEi","preview":false,"priority":0,"id":91403},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSUsoeb","preview":false,"priority":0,"id":91405},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdBUbXf","preview":false,"priority":0,"id":91411},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0CNYvi","preview":false,"priority":0,"id":91413},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHMb0p5","preview":false,"priority":0,"id":92074},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpefhAVN","preview":false,"priority":0,"id":92075},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOwfeTW","preview":false,"priority":0,"id":92076},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUa6h0b","preview":false,"priority":0,"id":92078},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRSckM9","preview":false,"priority":0,"id":92079}],"comments":[],"ratingAverage":0,"label":"HelpDesk - Ticketing Solution","description":"<h4></h4><h4>Bei der Helpdesk-Erweiterung geht es darum, die Probleme der Kunden zu lösen. Kunden können erhöhen das Ticket im Zusammenhang mit ihren Problemen über das Kundenkonto-Dashboard, gibt es eine Registerkarte mit dem Namen Ihr Ticket. Kunden können auch mit dem Helpdesk-Administrator kommunizieren, um das Problem zu lösen ihre Ticketausgabe, Beschwerden, Rückfragen, Probleme.</h4><p><br /></p><h4>Tickets können auch vom Administrator aus dem Backend erstellt werden. Auch der Administrator kann FAQ vom Backend hinzufügen.</h4><p></p><p></p><p><br /></p><h4>Um ein Ticket zu erstellen, müssen Kunden danach auf der Website eingeloggt sein Sie erstellen ein Ticket und reichen es ein. Danach wird der Helpdesk-Administrator zugewiesen Ein Agent zu diesem Ticket und machte sich an die Arbeit.</h4><p><br /></p><h4>Kunden können jedes Ticket mit allen Informationen wie (Betreff, Name, E-Mail, Tickettyp, Priorität, Status und Erstellungsdatum) und siehe auch Admin zum Kunden Nachrichtenthread.</h4><p><br /></p><p></p><h4>Diese Erweiterung ermöglicht es dem Administrator, den Ticketstatus zu ändern, Agenten zuzuweisen, mit Kunden zu kommunizieren und FAQ hinzuzufügen.</h4><p></p><p></p><p><b><br /></b></p><p></p><h2><b>Die Unterstützung</b></h2><p><b><br /></b></p><h4>Für Unterstützung besuchen Sie bitte <a href=\"https://www.vimirlab.com/\">https://www.vimirlab.com</a></h4><p><br />Diese Erweiterung aktivieren/deaktivieren Sie über die Registerkarte <b>Erweiterung -&gt; Meine Erweiterung -&gt; HelpDesk</b>. </p><p>Bitte wenden Sie sich bei Fragen an Ihren vimirlab-Vertreter.</p><p></p><p><br /></p><p><b><br /></b></p><p></p>","installationManual":"<h2>Installieren und aktivieren Sie einfach das Plugin Konfigurationen vornehmen Fertig!</h2><p><br /></p><h2><b>Konfigurationen</b></h2><p><br /></p><h4>Gehen Sie zu<b> Erweiterung -&gt; Meine Erweiterung </b>und suchen Sie die Registerkarte <b>HelpDesk </b>und klicken Sie auf  Konfigurationsregisterkarte.</h4><p><br /></p><h3><b>Ermöglichen</b></h3><p></p><h4></h4><ul><li>Unter Einstellungen hat der Administrator eine Option zum Aktivieren oder Deaktivieren der Erweiterung.</li></ul><p><br /></p><h4><b>FAQ im Konto aktivieren</b></h4><p></p><ul><li>Unter Einstellungen hat der Administrator die Möglichkeit, die FAQ im Konto zu aktivieren oder zu deaktivieren.</li></ul><p></p><p><br /></p><h4><b>FAQ in Navbar aktivieren</b></h4><p></p><ul><li>Unter Einstellungen hat der Administrator eine Option zum Aktivieren/Deaktivieren der FAQ von Navbar.</li></ul><p></p><p><br /></p><h3><b>E-Mail Ermöglichen</b></h3><h4></h4><ul><li>Unter Einstellungen hat der Administrator die Möglichkeit, das Senden zu aktivieren oder zu deaktivieren Ticket erstellt Bestätigungsmail</li></ul><p><br /></p><h3><b>Absender E-Mail</b></h3><h4></h4><ul><li>Der Administrator kann die E-Mail-Adresse des E-Mail-Absenders hinzufügen/bearbeiten.</li></ul><p><br /></p><h3><b>Absender Name</b></h3><h4></h4><ul><li>Der Administrator kann auch den Namen des E-Mail-Absenders hinzufügen/bearbeiten</li></ul><p><br /></p><h2><b>Schritte</b></h2><p><br /></p><h4>Es gibt mehrere Schritte, um ein Ticket zu erstellen. Einige dieser Schritte sind</h4><h4>immer gleich. Führen Sie die folgenden Schritte aus, damit der Administrator ein Ticket erstellen kann:</h4><h4>1) Ticketstatus erstellen</h4><h4>2) Tickettyp (Kategorie) erstellen</h4><h4>3) Ticketpriorität erstellen</h4><h4>4) Erstellen Sie eine Agentenposition</h4><h4>5) Ticket-Agent erstellen</h4><h4>6) Ticket erstellen</h4><p></p><h4>7) Kommunizieren Sie mit dem Kunden</h4><h4>8) FAQ erstellen</h4><p><br /></p><p></p><h2><b>1. Ticketstatus erstellen</b></h2><p></p><h4></h4><ul><li>Der Ticketstatus wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie jetzt hinzufügen möchten Neuer Ticketstatus im Dashboard können Sie <b>Inhalt-&gt;HelpDesk sehen. </b></li><li>Gehen Sie zu <b>HelpDesk -&gt; Ticket hinzufügen -&gt; Status</b>. Klicken Sie auf dieser Seite auf Status hinzufügen.</li></ul><p><br /></p><h2><b>2. Tickettyp erstellen (Kategorie)</b></h2><p></p><h4></h4><ul><li>Die Ticketkategorie wird aus der Backend-Konfiguration hinzugefügt. Nun, wenn Sie wollen Wenn Sie eine neue Ticketkategorie im Dashboard hinzufügen, können Sie <b>Inhalt-&gt;HelpDesk</b> sehen.</li><li>Gehen Sie zu <b>HelpDesk -&gt; Ticket hinzufügen -&gt; Kategorie</b> hinzufügen. Klicken Sie auf dieser Seite auf Neue Kategorie hinzufügen.</li></ul><p></p><p><br /></p><h2><b>3. Ticketpriorität erstellen</b></h2><h4></h4><ul><li>Die Ticketpriorität wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie jetzt eine neue Ticketpriorität im Dashboard hinzufügen möchten, können Sie <b>Inhalt-&gt;HelpDesk</b> sehen.</li><li>Gehen Sie zu <b>Helpdesk-&gt;Ticket hinzufügen-&gt;Priorität hinzufügen</b> Klicken Sie auf dieser Seite auf Neue Priorität hinzufügen.</li></ul><p><br /></p><h2><b>4. Erstellen Sie eine Agentenposition</b></h2><h4></h4><ul><li>Die Agentenposition wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie jetzt eine neue hinzufügen möchten Agentenposition im Dashboard können Sie <b>Inhalt-&gt;HelpDesk </b>sehen.</li><li>Gehen Sie zu <b>Helpdesk-&gt;Ticket hinzufügen-&gt;Position hinzufügen.</b> Klicken Sie auf dieser Seite auf Neue Position hinzufügen.</li></ul><p></p><p><br /></p><h2><b>5. Ticket-Agent erstellen</b></h2><h4></h4><ul><li>Ticket Agent wird aus der Backend-Konfiguration hinzugefügt. Wenn Sie einen neuen Agenten zum Dashboard hinzufügen möchten, sehen Sie <b>Inhalt-&gt;HelpDesk.</b></li><li>Gehen Sie zu <b>HelpDesk -&gt; Ticket hinzufügen -&gt; Agent hinzufügen.</b> Klicken Sie auf dieser Seite auf Neu hinzufügen Agent.</li></ul><p></p><p><br /></p><h2><b>6. Ticket erstellen</b></h2><p></p><h4></h4><h4></h4><h4></h4><ul><li>Der Administrator kann ein Ticket für den Kunden gemäß Kundenanfrage vom Backend erstellen Konfigurationen. Wenn Sie jetzt ein neues Ticket im Dashboard hinzufügen möchten, können Sie sehen <b>Inhalt-&gt;HelpDesk</b></li></ul><ul><li>Gehen Sie zu <b>HelpDesk-&gt;Ticket hinzufügen.</b> Klicken Sie auf die Schaltfläche Neues Ticket hinzufügen.</li><li>Der Administrator kann den Betreff des Tickets, den Kundennamen, die E-Mail-Adresse des Kunden und das Ticket angeben Kategorie, Ticketagent, Ticketstatus nach Backend.</li><li>Außerdem kann der Administrator Ticketpriorität, Ticketbeschreibung, Anhang und Hinzufügen zuweisen E-Mail-Adresse des Empfängers.</li></ul><p><br /></p><h2>7. Kommunizieren Sie mit dem Kunden</h2><p></p><p></p><h4></h4><ul><li>Der Administrator kann mit Kunden kommunizieren, um ihre Probleme gemäß den Anforderungen des Kunden zu lösen. <b>Inhalt-&gt;HelpDesk.</b></li><li><p>Wenn Sie nun über das Dashboard mit Kunden kommunizieren möchten.</p></li><li>Gehen Sie zu <b>HelpDesk-&gt; Nachricht Ticket</b> auswählen klicken Sie auf Name des Tickets</li><li>Admin Klicken Sie auf Nachricht und überprüfen Sie die Kundennachricht.</li><li>Danach kann der Administrator mit dem Kunden kommunizieren</li></ul><p><br /></p><h3><b>8.  FAQ erstellen</b></h3><h4></h4><ul><li>Der Administrator kann FAQ vom Backend erstellen. Kann eine Reihe von FAQ vom Administrator hinzufügen.</li><li>Der Administrator kann Kategorien verwalten und sie vom Backend aus bearbeiten</li><li>Der Administrator kann FAQ nach Kategorien gruppieren und filtern.</li></ul><p><br /></p>Der Administrator kann FAQ für Kunden gemäß Kundenanfragen aus der Backend-Konfiguration erstellen. Wenn Sie jetzt eine neue FAQ im Dashboard hinzufügen möchten, können Sie <b>Content-&gt; HelpDesk sehen</b><br /><p><b><br /></b></p><h4>Gehen Sie zu <b>Helpdesk-&gt;Ticket hinzufügen-&gt;FAQ.</b>  Klicken Sie auf dieser Seite auf Neue FAQ hinzufügen.</h4><p><br /></p><p></p><h2><b>Am Frontend</b></h2><h4></h4><h4></h4><ul><li>Damit Kunden Tickets zu ihrem Problem erstellen können. Es gibt ein paar Schritte zum Erstellen eines Tickets. Einige dieser Schritte sind immer gleich.</li></ul><h4></h4><h4></h4><h4></h4><h4></h4><ul><li>Um ein Ticket zu erstellen, muss der Kunde auf der Website angemeldet sein, danach kann er einsehen Kundenkonto-Dashboard,Es gibt eine Registerkarte namens Help Desk Klicken Sie auf und dann Ticket erstellen.</li></ul><h4></h4><ul><li>Wenn Sie ein Ticket erstellen möchten, klicken Sie auf TICKET ERSTELLEN.</li></ul><h4></h4><h4></h4><ul><li>Wenn Sie mit dem Helpdesk-Administrator kommunizieren möchten, um Ihr Ticketproblem zu lösen, und auch Sehen Sie sich Ihre Konvertierung an und klicken Sie dann auf Anzeigen.</li></ul><h4></h4><ul><li>Danach können Sie mit dem Helpdesk-Administrator kommunizieren und Ihre sehen zuvor Konvertierung</li><li>Benutzer können ihre Fragen zu Fragen aus FAQ-Funktionen überprüfen.</li><li>FAQ ist nach Kategorien gruppiert, damit Benutzer die Frage leicht finden können.</li><li>Benutzer können die Registerkarte „FAQ“ in der Navigationsleiste sehen, sodass Benutzer von dort aus einfach auf FAQ zugreifen können, ohne die FAQ auf der Website durchsuchen zu müssen.</li></ul><p><br /></p><h2><b>Kundenvorteile</b></h2><p><b>Durch Erstellen von Tickets. Die HelpDesk-Erweiterung hilft Kunden, ihre Ticketprobleme einfach zu lösen. Es spart dem Kunden Zeit, die normalerweise mit der Lösung seines Problems verschwendet wird.</b><br /></p><p><b><br /></b></p><h2><b>Erweiterung deinstallieren</b></h2><p><b>Der Administrator kann die Erweiterung einfach über das Backend deinstallieren.</b><br /></p><p><br /></p><p></p><p></p><p></p>","version":"1.0.2","changelog":[{"version":"1.0.2","text":"<p>-compatible with shopware version 6.5</p>","creationDate":{"date":"2023-06-02 13:54:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Feature: Added Snippets</p><p>Bugfix: Suggestion of FAQ<br /></p><p><br /></p>","creationDate":{"date":"2022-09-05 13:26:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- Initial Release</p><p>- fully compatible with latest version</p>","creationDate":{"date":"2022-06-07 11:39:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Vimir12711748283","redirectToStore":false,"lowestPriceValue":29}