{"id":15346,"name":"DvsnShippingPage","code":"dvsn826948024929","lastChange":{"date":"2023-07-25 08:00:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz0lN7v","examplePageUrl":"","moduleKey":"DvsnShippingPage","creationDate":{"date":"2022-06-03 10:03:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-06-22 08:39:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-06-03 10:05:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":26739,"name":"Versandkosten als Tabelle automatisch generieren","description":"\n\n\n\n\n\n\n<h2>\n    Versandkosten als Tabelle automatisch generieren\n\n</h2><p>\n\n\n\n\nMit diesem Plugin müssen Sie keine Versandkosten mehr doppelt pflegen!\nSie definieren Ihre Versandkosten in den Einstellungen und alle gewünschten\nVersandarten werden übersichtlich und korrekt auf einer Seite dargestellt.\nDabei werden selbstverständlich sämtliche Regeln und Preismatrizen\nbeachtet.\n\n\n\n\n</p><p>\n\n\n\n\nUm nicht jede beliebige, gerne auch intern genutzte Versandart automatisch\nin der Versandkosten Tabelle anzuzeigen, muss jede Versandart explizit in\nden Zusatzfeldern freigeschaltet werden. Bitte achten Sie also darauf,\ndass Sie die gewünschten Versandarten aktivieren, bevor Sie die Versandkosten\nTabelle aufrufen.\n\n\n\n</p><h4>Preismatrizen</h4><p>\n\n\nDas Plugin unterstützt die Anzeige aller Preise von Preismatrizen, die auf\nvorgegebenen Warenkorbeigenschaften oder individuell erstellten Regeln basieren.\nSomit werden unterstützt:\n\n<ul><li>Anzahl Produkte</li><li>Warenkorb Wert</li><li>Gewicht</li><li>Volumen</li><li>Individuelle Regeln</li></ul></p><h4>Versandarten und Preismatrizen filtern</h4><p>\n\n\n\nIm Plugin Standard wird jede Versandart angezeigt, die Sie in den Zusatzfeldern\nentsprechend markiert haben und die dem aktuellen Verkaufskanal zugewiesen ist.\nSomit zeigen Sie auch Versandarten an, die im aktuellen Kontext ungültig sind -\nz.B. Versandkosten für Händler, obwohl der Kunde ein Shopkunde ist oder Versandkosten\nins Ausland, obwohl die aktuelle Lieferanschrift innerhalb von Deutschland ist.\nSomit hat der Kunde stets den kompletten Überblick über alle verfügbaren Versandarten.\nSie können in der Plugin Konfiguration jedoch definieren, dass ungültige Versandarten\nund/oder ungültige Preismatrizen ausgeblendet werden sollen. Zudem\nkönnen Sie in den Zusatzfeldern von Regeln definieren, dass jede Versandart und/oder\nPreismatriz mit dieser Regel niemals angezeigt werden soll. Das könnte\nman z.B. für intern genutzte Versandarten oder stark ermäßigte Versandarten\nfür Sonder-Kunden nutzen.\n\n\n\n</p><h4>Weitere Informationen</h4><p>\n\n\n\nSie können pro Versandart eine individuelle Kopf- und Fußzeile angeben.\nSo können Sie jede einzelne Tabelle mit weiteren Informationen füllen.\nZusätzlich haben Sie die Möglichkeit jeweils einen Standard Shopware \"Hinweis\" (blauer Hintergrund)\nund eine \"Erfolgsmeldung\" (grüner Hintergrund) anzuzeigen. Diese Informationen\nerwecken sofort die Aufmerksamkeit des Kunden und können z.B. auf\nversandkostenfreie Lieferungen hinweisen.\n\n\n</p><h4>Verkaufskanal</h4><p>\n\n\n\nUnabhängig von den verfügbaren Regeln werden selbstverständlich nur Versandarten\nangezeigt, die dem aktuellen Verkaufskanal zugewiesen sind. Alle nicht zugewiesenen\nVersandarten werden nicht aufgelistet.\n\n\n\n</p><h4>SEO Url</h4><p>\n\n\nSie können eine SEO Url angeben, die Sie direkt verlinken können. So kann die\nVersandkosten Tabelle z.B. unter https://www.domain.de/versandkosten-tabelle erreichbar\nsein. Bitte tragen Sie dazu in der Plugin Konfiguration die gewünschte SEO Url ohne (!) die\nDomain ein - also z.B. \"versandkosten-tabelle\". Die technische, immer erreichbare Url\nder Versandkosten Tabelle lautet https://www.domain.de/dvsn/shipping-page\n\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>aktivieren Sie die gewünschten Versandarten in den Zusatzfeldern</li><li>nutzen Sie die SEO Url (standardmäßig www.domain.de/versandkosten) oder die technische Url (www.domain.de/dvsn/shipping-page) um die Versandkosten Tabelle anzuzeigen</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>aktivieren Sie die gewünschten Versandarten in den Zusatzfeldern</li><li>nutzen Sie die SEO Url (standardmäßig www.domain.de/versandkosten) oder die technische Url (www.domain.de/dvsn/shipping-page) um die Versandkosten Tabelle anzuzeigen</li></ul>\n\n","shortDescription":"Lassen Sie eine Tabelle für Ihre Versandkosten im Shop automatisch generieren ohne manuelle Preisänderungen von DHL, GLS, Hermes etc. ständig zu korrigieren.","highlights":"","features":""},{"id":26740,"name":"Generate dispatch costs table","description":"\n\n\n\n\n\n\n\n<h2>\n    Automatically generate shipping costs as a table\n\n</h2><p>\n\n\n\n\nWith this plugin you no longer have to maintain shipping costs twice! You define your shipping costs in the settings and all the desired shipping methods are displayed clearly and correctly on one page. Of course, all rules and price matrices are observed. are observed.\n\n\n\n\n</p><p>\n\n\n\n\nIn order not to automatically display any shipping method, even those used internally, in the shipping costs table, each shipping method must be explicitly activated in the additional fields. Please make sure that you activate the desired shipping methods before you call up the shipping costs table.\n\n\n\n</p><h4>Preismatrizen</h4><p>\n\n\nThe plugin supports the display of all prices of price matrices based on predefined shopping basket properties or individually created rules. Thus, the following are supported:\n\n<ul><li>Number of products</li><li>Shopping cart value</li><li>Weight</li><li>Volume</li><li>Individual rules</li></ul></p><h4>Filter shipping types and price matrices</h4><p>\n\n\n\nBy default every shipping method is displayed that you have marked accordingly in the additional fields and that is assigned to the current sales channel. Thus, you also display shipping methods that are invalid in the current context - e.g. shipping costs for merchants, although the customer is a shop customer, or shipping costs abroad, although the current delivery address is within Germany. This way, the customer always has a complete overview of all available shipping methods. However, you can define in the plugin configuration that invalid shipping methods and/or invalid price matrices are to be hidden. In addition, you can define in the additional fields of rules that each dispatch type and/or price matrix with this rule should never be displayed. You could use this, for example, for shipping types used internally or heavily discounted shipping types for special customers.\n\n\n\n</p><h4>Further information</h4><p>\n\n\n\nYou can specify an individual header and footer for each dispatch type. This allows you to fill each individual table with further information. In addition, you have the option of displaying a standard Shopware \"Note\" (blue background) and a \"Success message\" (green background). This information immediately catches the customer's attention and can, for example, refer to free shipping.\n\n\n</p><h4>Sales channel</h4><p>\n\n\n\nRegardless of the available rules, only shipping methods that are assigned to the current sales channel are displayed, of course. All unassigned shipping types are not listed.\n\n\n\n</p><h4>SEO Url</h4><p>\n\n\nYou can specify an SEO url that you can link to directly. For example, the shipping costs table can be accessed at https://www.domain.de/versandkosten-tabelle. Please enter the desired SEO url without (!) the domain in the plugin configuration - e.g. \"shipping-cost-table\". The technical, always accessible url of the shipping costs table is https://www.domain.de/dvsn/shipping-page\n\n\n\n</p><h4>Instructions</h4><ul><li>install the app</li><li>activate the desired shipping methods in the additional fields</li><li>use the SEO url (by default www.domain.de/versandkosten) or the technical url (www.domain.de/dvsn/shipping-page) to display the shipping costs table</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8.x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"\n<h4>Instructions</h4><ul><li>install the app</li><li>activate the desired shipping methods in the additional fields</li><li>use the SEO url (by default www.domain.de/versandkosten) or the technical url (www.domain.de/dvsn/shipping-page) to display the shipping costs table</li></ul>\n","shortDescription":"Let the shop automatically generate a table for your shipping costs without having to constantly correct manual price changes by DHL, GLS, Hermes etc.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165707,"bookingKey":"dvsn826948024929","bookingText":"Generate dispatch costs table","price":89.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":165706,"bookingKey":"dvsn826948024929_M","bookingText":"Generate dispatch costs table","price":25,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxthUKP","preview":true,"priority":9900,"id":91288},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPOysRP","preview":false,"priority":9800,"id":91289},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYUTUWV","preview":false,"priority":8900,"id":91296},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVmiZg1","preview":false,"priority":8800,"id":91297},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKBM18D","preview":false,"priority":4900,"id":91298},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoHSIFG","preview":false,"priority":4800,"id":91299},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfkeD0w","preview":false,"priority":3900,"id":91300},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyCPK2p","preview":false,"priority":1900,"id":91301}],"comments":[],"ratingAverage":0,"label":"Versandkosten als Tabelle automatisch generieren","description":"<h2>\n    Versandkosten als Tabelle automatisch generieren\n\n</h2><p>\n\n\n\n\nMit diesem Plugin müssen Sie keine Versandkosten mehr doppelt pflegen!\nSie definieren Ihre Versandkosten in den Einstellungen und alle gewünschten\nVersandarten werden übersichtlich und korrekt auf einer Seite dargestellt.\nDabei werden selbstverständlich sämtliche Regeln und Preismatrizen\nbeachtet.\n\n\n\n\n</p><p>\n\n\n\n\nUm nicht jede beliebige, gerne auch intern genutzte Versandart automatisch\nin der Versandkosten Tabelle anzuzeigen, muss jede Versandart explizit in\nden Zusatzfeldern freigeschaltet werden. Bitte achten Sie also darauf,\ndass Sie die gewünschten Versandarten aktivieren, bevor Sie die Versandkosten\nTabelle aufrufen.\n\n\n\n</p><h4>Preismatrizen</h4><p>\n\n\nDas Plugin unterstützt die Anzeige aller Preise von Preismatrizen, die auf\nvorgegebenen Warenkorbeigenschaften oder individuell erstellten Regeln basieren.\nSomit werden unterstützt:\n\n</p><ul><li>Anzahl Produkte</li><li>Warenkorb Wert</li><li>Gewicht</li><li>Volumen</li><li>Individuelle Regeln</li></ul><h4>Versandarten und Preismatrizen filtern</h4><p>\n\n\n\nIm Plugin Standard wird jede Versandart angezeigt, die Sie in den Zusatzfeldern\nentsprechend markiert haben und die dem aktuellen Verkaufskanal zugewiesen ist.\nSomit zeigen Sie auch Versandarten an, die im aktuellen Kontext ungültig sind -\nz.B. Versandkosten für Händler, obwohl der Kunde ein Shopkunde ist oder Versandkosten\nins Ausland, obwohl die aktuelle Lieferanschrift innerhalb von Deutschland ist.\nSomit hat der Kunde stets den kompletten Überblick über alle verfügbaren Versandarten.\nSie können in der Plugin Konfiguration jedoch definieren, dass ungültige Versandarten\nund/oder ungültige Preismatrizen ausgeblendet werden sollen. Zudem\nkönnen Sie in den Zusatzfeldern von Regeln definieren, dass jede Versandart und/oder\nPreismatriz mit dieser Regel niemals angezeigt werden soll. Das könnte\nman z.B. für intern genutzte Versandarten oder stark ermäßigte Versandarten\nfür Sonder-Kunden nutzen.\n\n\n\n</p><h4>Weitere Informationen</h4><p>\n\n\n\nSie können pro Versandart eine individuelle Kopf- und Fußzeile angeben.\nSo können Sie jede einzelne Tabelle mit weiteren Informationen füllen.\nZusätzlich haben Sie die Möglichkeit jeweils einen Standard Shopware \"Hinweis\" (blauer Hintergrund)\nund eine \"Erfolgsmeldung\" (grüner Hintergrund) anzuzeigen. Diese Informationen\nerwecken sofort die Aufmerksamkeit des Kunden und können z.B. auf\nversandkostenfreie Lieferungen hinweisen.\n\n\n</p><h4>Verkaufskanal</h4><p>\n\n\n\nUnabhängig von den verfügbaren Regeln werden selbstverständlich nur Versandarten\nangezeigt, die dem aktuellen Verkaufskanal zugewiesen sind. Alle nicht zugewiesenen\nVersandarten werden nicht aufgelistet.\n\n\n\n</p><h4>SEO Url</h4><p>\n\n\nSie können eine SEO Url angeben, die Sie direkt verlinken können. So kann die\nVersandkosten Tabelle z.B. unter https://www.domain.de/versandkosten-tabelle erreichbar\nsein. Bitte tragen Sie dazu in der Plugin Konfiguration die gewünschte SEO Url ohne (!) die\nDomain ein - also z.B. \"versandkosten-tabelle\". Die technische, immer erreichbare Url\nder Versandkosten Tabelle lautet https://www.domain.de/dvsn/shipping-page\n\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>aktivieren Sie die gewünschten Versandarten in den Zusatzfeldern</li><li>nutzen Sie die SEO Url (standardmäßig www.domain.de/versandkosten) oder die technische Url (www.domain.de/dvsn/shipping-page) um die Versandkosten Tabelle anzuzeigen</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie die Erweiterung</li><li>aktivieren Sie die gewünschten Versandarten in den Zusatzfeldern</li><li>nutzen Sie die SEO Url (standardmäßig www.domain.de/versandkosten) oder die technische Url (www.domain.de/dvsn/shipping-page) um die Versandkosten Tabelle anzuzeigen</li></ul>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"- added shopware 6.5 compatibility","creationDate":{"date":"2023-04-03 11:14:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- fixed faulty custom field translations","creationDate":{"date":"2023-06-22 11:23:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- fixed html content within header and footer of shipping methods","creationDate":{"date":"2023-02-15 10:54:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2022-06-03 17:37:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn826948024929","redirectToStore":false,"lowestPriceValue":25}