{"id":15412,"name":"StripePaymentsApp","code":"strip68410137126","lastChange":{"date":"2023-07-18 11:16:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phph81ewN","examplePageUrl":"","moduleKey":"StripePaymentsApp","creationDate":{"date":"2022-06-16 13:09:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-04-19 15:55:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-01-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-29 16:48:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":735,"prefix":"stripe","name":"Stripe","website":"//www.stripe.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod735_Stripe%2Bicon%2B-%2Bsquare%2B%2528small%2529-128x128-6b30e82.png"},"infos":[{"id":26858,"name":"Stripe Integration","description":"<p>Der Stripe Connector für Shopware 6 bietet eine globale, skalierbare Integration für Zahlungen. Integrieren Sie den Connector in Ihren Online-Shop von Shopware, erstellen Sie ein Stripe-Konto bzw. verknüpfen Sie Ihr bestehendes Konto und beginnen Sie sofort mit der Zahlungsannahme.&nbsp;</p><br><p><b>Optimieren Sie Konversionen und steigern Sie Ihren Umsatz</b><br>Erhöhen Sie den Umsatz, indem Sie Ihren Bezahlvorgang modernisieren. Verbessern Sie Ihre Konversionsrate mit Link, eine Ein-Klick-Lösung, die den Bezahlvorgang Ihrer Kundinnen und Kunden auf nur sechs Sekunden verkürzt – neunmal schneller als ohne Link. Optimieren Sie den Bezahlvorgang fortlaufend mit der integrierten Konversionslogik, die für ein besseres Kundenerlebnis sorgt und sich an das jeweilige Gerät anpasst.&nbsp;</p><p><b><br></b></p><p><b>Expandieren Sie international mit beliebten Zahlungsmethoden</b><br>Erfüllen Sie Kundenwünsche und steigern Sie die Konversionsraten global mit lokalen Zahlungsmethoden wie SEPA-Lastschrift, iDEAL, Bancontact, P24, EPS, GiroPay, FPX, beliebten Wallets wie Apple Pay und Google Pay sowie „Jetzt kaufen, später bezahlen“-Zahlungsmethoden. Aktivieren Sie auf einfache Weise mehr als 40 Zahlungsmethoden ohne zusätzlichen technischen Aufwand und präsentieren Sie dynamisch die relevantesten Zahlungsmethoden je nach Standort und Gerät Ihrer Kundschaft.</p><p><b><br></b></p><p><b>Geschaffen für eine Plattform, der Millionen vertrauen</b><br>Der Stripe Connector für Shopware 6 wurde geschaffen für eine Plattform, der Millionen von E-Commerce-Unternehmen auf der ganzen Welt vertrauen. Es handelt sich dabei um eine zuverlässige und sichere Plattform, die Ihre Kundinnen und Kunden vor Datenlecks, Betrug und Sicherheitsrisiken schützt. Stellen Sie die Einhaltung der SCA-Anforderungen der zweiten Zahlungsdiensterichtlinie (PSD2) in Europa sicher, und das ganz ohne zusätzlichen technischen Aufwand.&nbsp;</p><p><b><br></b></p><p><b>Vollkommen transparente Preisgestaltung</b><br>Es gibt weder Einrichtungs- und Monatsgebühren noch versteckte Kosten. Sie bezahlen nur für erfolgreiche Belastungen von Karten. Informieren Sie sich über unsere&nbsp;<a href=\"https://stripe.com/de/pricing\" target=\"_blank\" rel=\"noreferrer\">Preise</a>. Wir bieten maßgeschneiderte Preisstrategien für Unternehmen mit hohen Zahlungsvolumen und besonderen Geschäftsmodellen.&nbsp;<a href=\"https://stripe.com/de/contact/sales\" target=\"_blank\" rel=\"noreferrer\">Kontaktieren Sie unser Sales-Team</a>, um zu erfahren, wie Stripe Sie unterstützen kann.</p>","installationManual":"<p>Der Einstieg bei Stripe ist kinderleicht und umfasst drei Schritte:</p><ol><li><p>Eröffnen Sie ein Stripe-<a href=\"https://dashboard.stripe.com/register\">Konto</a>.</p></li><li><p>Aktivieren Sie Ihr Stripe-<a href=\"https://dashboard.stripe.com/account/details\">Konto</a>.</p></li><li><p>Installieren Sie den Stripe Connector für Shopware 6 über den Plugin-Manager und geben Sie Ihre Stripe-Kontodaten ein.</p></li></ol><p><br></p><p>Weitere Informationen zur Integration und Aktivierung von Zahlungsmethoden entnehmen Sie der&nbsp;<a href=\"https://stripe.com/docs/plugins/shopware6\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">Plugin-Dokumentation</a>.</p><p><br></p><p>Nutzer/innen, die noch eine frühere Version des Stripe-Connectors nutzen, aber schon auf Shopware 6 umgestiegen sind, können die Software wie folgt aktualisieren:</p><ol><li><p>Begeben Sie sich zu Meine Erweiterungen im Shopware-Backoffice: Erweiterungen &gt; Meine Erweiterungen &gt; standardmäßig gelangen Sie zum Bereich Apps.</p></li><li><p>Falls ein neues Update verfügbar ist, erscheint neben der aktuellen Version die Option Aktualisieren.</p></li><li><p>Klicken Sie auf Aktualisieren, um den Vorgang zu starten. Nach Abschluss des Vorgangs erhalten Sie eine Bestätigungsnachricht.</p></li></ol><p><br></p><p>Nutzer/innen, die ein Upgrade ihrer vorherigen Version des Stripe Connectors für Shopware 5 auf den Stripe Connector für Shopware 6 durchführen möchten, müssen zunächst von Shopware 5 auf Shopware 6 umsteigen. Danach kann der Stripe Connector für Shopware 6 installiert werden. Weitere Informationen zum Umstieg von Shopware 5 auf Shopware 6 <a href=\"https://www.shopware.com/de/migration/shopware-5-zu-shopware-6/\">entnehmen Sie dieser Anleitung</a>.</p>","shortDescription":"Stripe ist eine Finanzinfrastruktur-Plattform für Unternehmen. Nutzen Stripe, um Zahlungen zu akzeptieren, ihre Umsätze zu erhöhen und sich neue Geschäftsfelder zu erschließen.","highlights":"One-Click-Checkout mit Link in nur sechs Sekunden\nTransparente Preisgestaltung – Sie zahlen nur für Ihre tatsächliche Nutzung\nProblemlose Einhaltung der SCA-Anforderungen der PSD2  + Zertifiziert nach PCI DSS Level 1\nErstellung manueller Zahlungen und Abwicklung von Rückerstattungen in Ihrem Shopware-Backend\nKundenfreundliches Dashboard mit aktuellsten Zahlungsdetails, Abrechnungsvorgängen in Echtzeit und einfachen Rückerstattungen","features":"Integrierte Konversionslogik: Steigern Sie die Konversionsrate, indem Sie das Nutzererlebnis runder gestalten und Nutzerfehler reduzieren – mit automatischer Adressvervollständigung, Kartenvalidierung in Echtzeit, beschreibenden Fehlermeldungen, Autofill von Drittanbietern und vielem mehr.\nGlobale Zahlungskonversion: Dynamische Anzeige der richtigen Sprache, Währung und Zahlungsmethoden, um die Konversionsrate zu verbessern. Stripe unterstützt über 25 Sprachen, 135 Währungen und 40 Zahlungsmethoden, darunter beliebte Wallets wie Apple Pay und Google Pay.\nZahlungen autorisieren und später erfassen: Stripe unterstützt die getrennte Autorisierung und Erfassung von Karten. Dadurch können Sie Kartendaten erfassen, um sicherzustellen, dass ausreichend Guthaben vorhanden ist, und anschließend den Gesamtbetrag nach dem Versand erfassen.\nFür jedes Gerät optimiert: Bieten Sie eine reibungslose Kundenerfahrung auf Mobilgeräten, Tablets und Desktops mit einem reaktionsschnellen Bezahlvorgang.\nIntuitives Dashboard: Die Zahlungsdaten können direkt den Bestellungen entnommen werden und sind mit dem Stripe-Dashboard verlinkt. Verwenden Sie unsere statistischen Tools, um Ihre Daten in CSV-Dateien zu exportieren. Diese sind auch über unsere iOS-App verfügbar.\nTransparente Preisgestaltung: Sie zahlen nur für Ihre tatsächliche Nutzung. Es gibt weder Einrichtungs- und Monatsgebühren noch versteckte Kosten.\nEin Vertrag für alle Zahlungsmethoden: Sie müssen nicht jede Zahlungsmethode einzeln einrichten.\nBetrugsbekämpfung: Radar ist unser System zur Prävention vor Betrug, das auf maschinellem Lernen beruht. Es prüft automatisch Zahlungen in Echtzeit, damit Sie Betrüger/innen von der Kundschaft unterscheiden können. Radar nutzt auf dynamische Weise 3D Secure bei hochriskanten Zahlungen."},{"id":27084,"name":"Stripe Payments for Shopware 6 App","description":"<p>The Stripe Payments for Shopware 6 App offers a global, scalable integration for payments.&nbsp;Improve how your customers check out and accept payments using the Stripe Connector for Shopware 6.Install the connector on your Shopware online store, create a Stripe account or connect your existing one, and start accepting payments immediately.&nbsp;</p><br><p><b>Optimise conversions and increase revenue</b><br>Boost revenue by modernising your checkout. Drive conversion with Link, a one-click checkout experience your customers can complete in just 6 seconds—that’s 9x faster than non-Link customers. Continuously optimise checkout with built-in conversion logic that reduces customer friction and adjusts across devices.&nbsp;</p><p><b><br></b></p><p><b>Expand internationally with popular payment methods</b><br>Satisfy customer preferences and increase conversion globally with local payment methods like SEPA Direct Debit, iDEAL, Bancontact, P24, EPS, Giropay, FPX, popular wallets such as Apple Pay and Google Pay, and buy now, pay later methods. Simply turn on over 40 payment methods with no additional development required and dynamically display the most relevant payment methods based on your customers’ location and device.</p><p><b><br></b></p><p><b>Built on a platform trusted by millions</b><br>The Stripe Payments for Shopware 6 App&nbsp;is built on a platform trusted by millions of ecommerce businesses around the world. It’s a reliable and secure platform that protects your customers from data breaches, fraud, and security threats. Stay compliant with PSD2 SCA requirements in Europe—no additional development required.&nbsp;</p><p><b><br></b></p><p><b>Fully transparent pricing</b><br>There are no setup, monthly, or hidden fees. You only pay for successful card charges. View our <a href=\"https://stripe.com/pricing\">pricing</a>. Custom pricing is available for companies with large payment volumes or unique business models. <a href=\"https://stripe.com/contact/sales\">Contact our sales team</a> to learn how Stripe can help you.</p>","installationManual":"<p></p><p>Getting started with Stripe is an easy, three-step process:</p><ol><li><p>Register for a Stripe <a href=\"https://dashboard.stripe.com/register\">account</a>.</p></li><li><p>Activate your Stripe <a href=\"https://dashboard.stripe.com/account/details\">account</a>.&nbsp;&nbsp;</p></li><li><p>Install the Stripe Connector for Shopware 6 via the Plugin manager and enter your Stripe account details.<br><br></p></li></ol><p>Refer to&nbsp;<a href=\"https://stripe.com/docs/plugins/shopware6\" target=\"_blank\" rel=\"noreferrer\">Stripe documentation</a>&nbsp;for additional information on installing and activating payment methods.</p><p><br>For users upgrading from a previous version of the Stripe connector already on Shopware 6, please follow these steps:</p><ol><li><p>Go to My extensions on the Shopware backoffice: Extensions &gt; My extensions &gt; by default you will land on the Apps section.</p></li><li><p>The Update option will appear next to the current version if a new update is available.</p></li><li><p>Click on Update to initialise the updating process. You’ll receive a confirmation message once finished.<br><br></p></li></ol><p>Users who would like to upgrade their previous version of the Stripe Connector for Shopware 5 to new Stripe Connector for Shopware 6 will need to replatform from Shopware 5 to Shopware 6 first. You will then be able to install the new Stripe Connector for Shopware 6. For more information on how to move from Shopware 5 to Shopware 6, please <a href=\"https://www.shopware.com/en/migration/shopware-5-to-shopware-6/\">see these instructions</a>&nbsp;or speak to a Shopware representative.</p>","shortDescription":"[Recommended for new users] \nUse Stripe to accept payments fast, grow revenue, and accelerate new business opportunities.","highlights":"Recommended for new users\nOne-click checkout with Link in just 6 seconds\nTransparent pricing structure—only pay for what you use\nStay compliant with PSD2 SCA requirements + integrated fraud protection with Stripe Radar +PCI-DSS level 1 certified\nCustomer-friendly dashboard with up-to-date payment details, real-time accounting, and easy refunds. Create manual payments and process refunds from your Shopware backend","features":"Built-in conversion logic: Increase conversion by reducing user friction and errors with address auto-complete, real-time card validation, descriptive error messages, third-party auto-fill, and more.\nGlobal payment conversion: Dynamically display the right language, currency, and payment methods most likely to improve conversion. Stripe supports over 25 languages, 135 currencies, and 40 payment methods, including popular wallets such as Apple Pay and Google Pay.\nAuthorise payments and capture later: Stripe supports separate card authorisation and capture, which let you collect card information to ensure that there are enough funds and then capture the total amount after shipping.\nOptimised for any device: Provide a seamless experience across mobile, tablet, and desktop with a responsive checkout.\nIntuitive dashboard: Payment information is available directly in your orders with quick links to your Stripe Dashboard. Access our statistical tools and export your data to .csv files. It’s also available via our iOS App.\nTransparent pricing structure: Pay only for what you use. There are no setup, monthly, or hidden fees.\nOne contract for all payment methods: There’s no need to set up each payment method separately.\nReduce fraud: Our machine learning fraud system, Radar, automatically evaluates charges in real-time to help you distinguish fraudsters from customers. Radar dynamically applies 3D Secure to high-risk payments."}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":167444,"bookingKey":"strip68410137126","bookingText":"Stripe","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWrhRTd","preview":true,"priority":1,"id":111767},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpS55la1","preview":false,"priority":0,"id":111770},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvywiCS","preview":false,"priority":0,"id":112660}],"comments":[{"authorName":"Dario","text":"Auch wir mussten wegen dem Wechsel auf Shopware 6.5 auf das neue Stripe Plugin umstellen.\nBei der Konfiguration gibt es zwei Varianten:\n\nIntegriertes Zahlungsformular: Kreditkartendaten können auf der Seite des Bestellabschlusses eingegeben werden.\n\nZu Stripe weiterleiten: Man schliesst die Bestellung ab (Button \"Bestellung abschliessen\"). Erst danach - nach Bestellabschluss - wird man an eine stripe Seite zur Eingabe der Kreditkartendaten weitergeleitet.\n\nEs ist wohl klar, dass zweitere Variante aus Sicht User Experience schlecht ist.\nDaher war für uns klar, dass wir die Variante Integriertes Zahlungsformular brauchen - gleich wie es bei dem alten Plugin war.\n\nNun ist es aber so, dass die Zahlung bei dieser aktivierten Option immer fehlschlägt. Das Kreditkartenfeld wird gar nicht angezeigt. (Stand: 05.07.2023)\n\nWirklich schade. Wir haben nun notgedrungen \"Zu Stripe umleiten\" eingestellt. Mal schauen, ob stripe das Plugin noch verbessert. Wenn nicht, suchen wir uns einen anderen Zahlungsdienstleister.","headline":"Fehlerhaft - Rückschritt zum alten Plugin","creationDate":{"date":"2023-07-05 17:58:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Holger","text":"Wir sind ebenfalls schockiert von der neuen Integration von Stripe.\nDie bisherige ist nicht für Shopware 6.5 freigegeben, daher wird man gezwungen auf die neue Integration umzustellen.\n\nUnd was bekommt man?\nKeine einzelen Zahlungsarten mehr, die man dem Kunden schön anbieten kann (So wie es zum Beispiel der Mitbewerber mit dem P mach *wink mit dem Zaunpfahl*).\nNein, nun gibt es nur noch \"Zahlung mit Stripe\" und erst danach kann sich der Kunde für verschiedene Zahlungsarten die konfiguriert sind entscheiden.\n\nAuf den Punkt gebracht, der Kunde muß auf \"Zahlungspflichtig bestellen\" klicken, um DANACH eine Auswahl der möglichen Zahlungsarten präsentiert zu bekommen.\nEin K.O. Kriterium im Kaufprozess.\n\nIch sehe es wie beim Menüeintrag von Windows11, dort muß auch ein zusätzlich Klick gemacht werden um an das eigentlich Menü zu kommen.\nNicht alles was neu ist, ist gut, und dieses \"klick auf mich, dann verrate ich Dir wie Du zahlen darfst\" ist eine unnötige Hürde im Verkaufsprozess. Die Entscheidung kann bereits eine Ebene früher getroffen werden (so wie es im bisherigen Plugin gelöst war).\n\nBewertung bleibt auf 1 Punkt, solange es keine Möglichkeit gibt die Zahlungsarten dem Kunden einzeln anzubieten.","headline":"Nur noch Zahlungsart \"Stripe\", keine einzelnen Zahlungsarten mehr","creationDate":{"date":"2023-06-02 09:54:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Louisa Moore","text":"Mein Eindruck ist, Stripe möchte mit der neuen Integration mit der Brechstange die Marke Stripe im Markt etablieren. Wie PayPal. Der Nutzer soll auf Krampf lernen, was Stripe ist und kann.\nStatt wie bisher die einzelnen Zahlungsarten mit dem Zusatz (via Stripe) für den Nutzer auf den ersten Blick klar, verständlich und transparent im Shop anzubieten, sieht der Nutzer nur noch eine Option von Stripe: \"Zahlen via Stripe\" mit einem schönen S als Logo. \n\n \"Hey Nutzer, look at us! Wir haben Stripe! Kennst Du schon stripe? Nein? Dann klick mal drauf. Da kannst drüber zahlen. Ja, auch mit ganz vielen tollen Wegen die wir Dir freigeschaltet haben. Ja, Du musst erst lernen, dass das mit Stripe geht. Weil Stripe ist toll. Stripe ist wie PayPal. Wusstest Du nicht? Ja, deswegen musst Du jetzt draufklicken. Damit Du das lernst. Ach - und wir zahlen Stripe auch dafür dass Du es benutzen darfst und eigentlich soll es Dir komplett egal sein WIE wir das abwickeln. Weil dafür zahlen wir ja. Aber egal. Lerne jetzt was Stripe ist Du Nutzer!\" \n\nERST wenn der Nutzer darauf klickt, erhält er die Möglichkeit eine der angebotenen Zahlungswege auszuwählen.\nIch hoffe die bisherige nutzerfreundliche Integration bleibt noch möglichst lange erhalten. Sonst muss der Anbieter weichen.","headline":"Was soll das?","creationDate":{"date":"2023-05-16 11:07:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2}],"ratingAverage":2,"label":"Stripe Integration","description":"<p>Der Stripe Connector für Shopware 6 bietet eine globale, skalierbare Integration für Zahlungen. Integrieren Sie den Connector in Ihren Online-Shop von Shopware, erstellen Sie ein Stripe-Konto bzw. verknüpfen Sie Ihr bestehendes Konto und beginnen Sie sofort mit der Zahlungsannahme. </p><br /><p><b>Optimieren Sie Konversionen und steigern Sie Ihren Umsatz</b><br />Erhöhen Sie den Umsatz, indem Sie Ihren Bezahlvorgang modernisieren. Verbessern Sie Ihre Konversionsrate mit Link, eine Ein-Klick-Lösung, die den Bezahlvorgang Ihrer Kundinnen und Kunden auf nur sechs Sekunden verkürzt – neunmal schneller als ohne Link. Optimieren Sie den Bezahlvorgang fortlaufend mit der integrierten Konversionslogik, die für ein besseres Kundenerlebnis sorgt und sich an das jeweilige Gerät anpasst. </p><p><b><br /></b></p><p><b>Expandieren Sie international mit beliebten Zahlungsmethoden</b><br />Erfüllen Sie Kundenwünsche und steigern Sie die Konversionsraten global mit lokalen Zahlungsmethoden wie SEPA-Lastschrift, iDEAL, Bancontact, P24, EPS, GiroPay, FPX, beliebten Wallets wie Apple Pay und Google Pay sowie „Jetzt kaufen, später bezahlen“-Zahlungsmethoden. Aktivieren Sie auf einfache Weise mehr als 40 Zahlungsmethoden ohne zusätzlichen technischen Aufwand und präsentieren Sie dynamisch die relevantesten Zahlungsmethoden je nach Standort und Gerät Ihrer Kundschaft.</p><p><b><br /></b></p><p><b>Geschaffen für eine Plattform, der Millionen vertrauen</b><br />Der Stripe Connector für Shopware 6 wurde geschaffen für eine Plattform, der Millionen von E-Commerce-Unternehmen auf der ganzen Welt vertrauen. Es handelt sich dabei um eine zuverlässige und sichere Plattform, die Ihre Kundinnen und Kunden vor Datenlecks, Betrug und Sicherheitsrisiken schützt. Stellen Sie die Einhaltung der SCA-Anforderungen der zweiten Zahlungsdiensterichtlinie (PSD2) in Europa sicher, und das ganz ohne zusätzlichen technischen Aufwand. </p><p><b><br /></b></p><p><b>Vollkommen transparente Preisgestaltung</b><br />Es gibt weder Einrichtungs- und Monatsgebühren noch versteckte Kosten. Sie bezahlen nur für erfolgreiche Belastungen von Karten. Informieren Sie sich über unsere <a href=\"https://stripe.com/de/pricing\" target=\"_blank\" rel=\"noreferrer noopener\">Preise</a>. Wir bieten maßgeschneiderte Preisstrategien für Unternehmen mit hohen Zahlungsvolumen und besonderen Geschäftsmodellen. <a href=\"https://stripe.com/de/contact/sales\" target=\"_blank\" rel=\"noreferrer noopener\">Kontaktieren Sie unser Sales-Team</a>, um zu erfahren, wie Stripe Sie unterstützen kann.</p>","installationManual":"<p>Der Einstieg bei Stripe ist kinderleicht und umfasst drei Schritte:</p><ol><li><p>Eröffnen Sie ein Stripe-<a href=\"https://dashboard.stripe.com/register\">Konto</a>.</p></li><li><p>Aktivieren Sie Ihr Stripe-<a href=\"https://dashboard.stripe.com/account/details\">Konto</a>.</p></li><li><p>Installieren Sie den Stripe Connector für Shopware 6 über den Plugin-Manager und geben Sie Ihre Stripe-Kontodaten ein.</p></li></ol><p><br /></p><p>Weitere Informationen zur Integration und Aktivierung von Zahlungsmethoden entnehmen Sie der <a href=\"https://stripe.com/docs/plugins/shopware6\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin-Dokumentation</a>.</p><p><br /></p><p>Nutzer/innen, die noch eine frühere Version des Stripe-Connectors nutzen, aber schon auf Shopware 6 umgestiegen sind, können die Software wie folgt aktualisieren:</p><ol><li><p>Begeben Sie sich zu Meine Erweiterungen im Shopware-Backoffice: Erweiterungen &gt; Meine Erweiterungen &gt; standardmäßig gelangen Sie zum Bereich Apps.</p></li><li><p>Falls ein neues Update verfügbar ist, erscheint neben der aktuellen Version die Option Aktualisieren.</p></li><li><p>Klicken Sie auf Aktualisieren, um den Vorgang zu starten. Nach Abschluss des Vorgangs erhalten Sie eine Bestätigungsnachricht.</p></li></ol><p><br /></p><p>Nutzer/innen, die ein Upgrade ihrer vorherigen Version des Stripe Connectors für Shopware 5 auf den Stripe Connector für Shopware 6 durchführen möchten, müssen zunächst von Shopware 5 auf Shopware 6 umsteigen. Danach kann der Stripe Connector für Shopware 6 installiert werden. Weitere Informationen zum Umstieg von Shopware 5 auf Shopware 6 <a href=\"https://www.shopware.com/de/migration/shopware-5-zu-shopware-6/\">entnehmen Sie dieser Anleitung</a>.</p>","version":"1.2.1","changelog":[{"version":"1.2.1","text":"<p></p><ul><li>ADDED - Shopware 6.5 compatibility</li></ul>","creationDate":{"date":"2023-07-12 16:03:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>ADDED - Multiple account configuration</li><li>ADDED - Order reference in payment intent description</li><li>ADDED - Payment context on SW order and order_transaction</li><li>ADDED - Default values for payment element form</li><li>FIXED - P24 payment method</li><li>FIXED - Payment element not working because of cache</li></ul>","creationDate":{"date":"2023-07-12 15:50:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>ADDED - Separate auth and capture functionality.</li><li>ADDED - Stripe webhook synchronization.</li><li>ADDED - Shopware webhook synchronization.</li><li>ADDED - Translations for DE, ES, FR and IT.</li><li>FIXED - Translations for checkout flow.</li><li>FIXED - Admin configuration bug.</li></ul>","creationDate":{"date":"2023-05-17 16:40:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p><br /></p><br /> FIXED - Payment error when you change from payment element to checkout flow mid payment FIXED - Scroll to terms and conditions and show error when it's not checkedFIXED - Shop-url error when the shop-url changes ADDED - Redundancy notifications for configuration page when testing in dev environment FIXED_ - Duplicate payments","creationDate":{"date":"2023-05-10 15:53:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p></p><ul><li>Erste Version unserer Shopware-App, kompatibel mit cloudbasierten Anwendungen</li><li>Mit den Integrationen von Stripe Payment Element und Stripe Checkout bieten wir eine Vielzahl neuer Zahlungsmöglichkeiten</li><li>Ein-Klick-Kauf mit Link von Stripe</li></ul>","creationDate":{"date":"2023-04-04 10:32:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=strip68410137126","redirectToStore":false,"lowestPriceValue":0}