{"id":15437,"name":"AcrisFaqCS","code":"acris58695610080","lastChange":{"date":"2023-07-18 19:11:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVJIV5n","examplePageUrl":"","moduleKey":"AcrisFaqCS","creationDate":{"date":"2022-06-22 11:23:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-07-27 07:26:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-07-13 17:15:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":26903,"name":"FAQ Pro - FAQs dynamisch Produkte zuordnen + SEO optimiert + Erlebniswelten","description":"<h2><b>Nutzung / Zweck des ACRIS FAQ Plugins:</b></h2><p><br></p><p><b>Zuweisung von FAQs flexibel mit dynamischen Produktgruppen<br></b></p><p>Hauptunterschied zu allen anderen FAQ Plugins im Shopware Store ist die Möglichkeit FAQs in FAQ Gruppen zusammenzufassen und diese <b>mittels dynamischer Produktgruppen </b>direkt bei Produkten als FAQ Tab oder im Beschreibungs-TAB anzuzeigen. Dies ermöglicht eine flexible Zuordnung von FAQs (wie zum Beispiel Lieferhinweise bei Sperrgutartikel, Aufbauanleitungen bei bestimmten Produktgruppen oder Hinweise für ganze Kategorien).</p><p><br></p><p><b>FAQ mit Dokumente, Videos und Bildern<br></b></p><b></b><p></p><p>Es können auf einfache Weise nicht nur HTML Texte hinzugefügt werden, sinder Dokumente, Videos und Bilder - die FAQs können durch Priorisierungen gereiht werden.</p><p><br></p><p><b>Umfangreiche SEO Optimierung<br></b></p><p>Die einzelnen FAQs können mit direktem Link aufgerufen werden (dieser wird automatisch erstellt, kann aber auch flexibel festgelegt werden)<br>Die FAQ Gruppen wurden mittels Rich Snippets integriert, sodass die Suchmaschienen dies perfekt auslesen können.<br>Zusätzlich können ein Meta Titel, Meta Description festgelegt werden.<br>Die Videos wurden ebenfalls Suchmaschinen optimiert (mit Rich Snippet) implementiert. <br></p><p><br></p><p><b>FAQs auf Erlebniswelten integrieren<br></b></p>Es wird ein FAQ Gruppen Block mitgeliefert und zusätzlich stehen 2 FAQ Elemente zur Verwendung zur Verfügung.<br><p></p><p><br></p><h3>1. Vorbereitung zur Nutzung der FAQ Gruppen zur Anzeige auf der Produktdetailseite (mit dynamischen Produktgruppen)<br></h3><p>Die einzelnen FAQs können FAQ Gruppen zusammengefasst werden. <br></p><p>Diese FAQ Gruppen können dann mittels der <b>dynamische Produktgruppen</b>&nbsp; zugeordnet werden.</p><p>Daher ist der erste Schritt die Anlage von dynamischen Produktgruppen (Shopware Standard Feature: Kataloge &gt; Dynamische Produktgruppen)</p><p><br></p><h3>2. FAQ Gruppen:&nbsp; Anlage und Zuordnung zu Produkten mit Dynamischen Produktgruppen<br></h3><p>Einstellungen &gt; Erweiterungen &gt; FAQ &gt; FAQ Gruppen (Hinzufügen oder bestehende Bearbeiten)<br></p><p><br></p><h4>Einstellungen<br></h4><ul><li><b>Anzeigename:</b> Dies wird nur in den Erlebniswelten Element angezeigt, bei der Produktdetailseite kommt dieser nicht zur Anwendung.\n            </li><li><b>Beschreibung: </b>Die Beschreibung ist für die Übersicht im Admin Bereich vorgesehen und wird im Frontend nicht verwendet.</li><li><b>Priorität</b>: Je höher die Zahl, desto höher die Priorität. Dies wird zur Sortierung verwendet, wenn mehrere FAQ Gruppen gleichzeitig angezeigt werden.</li><li><b>&nbsp;Aktiv:</b> wenn aktiv, dann wird die Gruppe angezeigt.</li></ul><h4><br></h4><h4>Produktzuweisung <br></h4><ul><li><b>Dynamische Produktgruppen:</b> Dies ist Voraussetzung für die Anzeige bei der Produktdetailseite, wenn keine Produktgruppe zugeordnet wurde, dann erfolgt keine Anzeige bei den Produkten jedoch kann die FAQ Gruppe in den Erlebniswelten verwendet werden.<br></li></ul><p></p><p><br></p><h3>3. FAQ:&nbsp; Anlage von Fragen und Antworten<br></h3><p>Einstellungen &gt; Erweiterungen &gt; FAQ &gt; FAQ (Hinzufügen oder bestehende Bearbeiten)<br></p><p><br></p><h4>Einstellungen<br></h4><ul><li><b>Interner Name:</b> dient zur Übersicht im Admin Bereich</li><li><b>Fragestellung</b>: Frage, welche dann im nächsten Feld beantwortet wird.</li><li><b>Antwort:</b> Beantwortung der Frage - kann HTML beinhalten.</li><li><b>Priorität für Anzeige</b>: Je höher die Zahl, desto höher die Priorität. Dient zur Sortierung von mehreren Fragen innerhalb einer FAQ Gruppe.</li><li><b>FAQ Gruppen</b>: Zuweisung zu einer oder mehreren FAQ Gruppen.<br></li></ul><h4><br></h4><h4>Bild<br></h4><ul><li><b>Bildposition:</b> Falls ein Bild (weiter unten) zugeordnet ist, wird das Bild in der \"FAQ Antwort\" in der gewünschten Position angezeigt.</li><li><b>Bildgröße:</b> vordefinierte Bildgrößen (groß, mittel, klein)</li><li><b>URL / Link (bei Klick auf das Bild) :</b> Wenn ein Link eingefügt wird (absoluter Link mit https://www.xxx.xx), dann wird das Bild verlinkt.</li><li><b>URL / Link öffnen als</b>: Auswahl, ob der Link in einem neuen Tab oder im gleichen Fenster geöffnet werden soll</li><li><b>Bildauswahl</b>: Hier erfolgt die Bildauswahl&nbsp; - es kann nur ein Bild hinzugefügt werden.<br></li></ul><p></p><p><br></p><h4>Video<br></h4><ul><li><b>Videoposition:</b> Falls ein Video zugeordnet ist (weiter unten) dann kann hier die Position ausgewählt werden. Die Größe ist vordefiniert und erwartet wird, dass auch eine Text Beschreibung hinzugefügt wurde. (es sind 2 Spalten vorgesehen)</li><li><b>Videotyp</b>: Youtube oder andere Videotyp. Sollte spezielle Videoplayer integriert werden müssen, dann bitte um eine Supportanfrage an uns.</li><li><b>URL einbetten</b>: Bitte fügen Sie nur den Videolink ein. <br>Beispiele für Youtube können Sie \nden normalen Watch-Link oder den Embed-Link oder einfach die Youtube-ID:\n \"https://www.youtube.com/watch?v=DYDY4NW1L_TEST\" oder \n\"https://www.youtube.com/embed/DYDY4NW1L_TEST\" oder die Youtube-ID: \n\"DYDY4NW1L_TEST\" verwenden. <br>Für die anderen Videotypen verwenden Sie \nbitte den Einbettungslink (Beispiel: \n\"https://player.myvideo.com/video/123456\").</li><li><b>Erweiterter Datenschutz Modus </b>(Videos ohne Cookies einbinden)&nbsp; (erscheint nur bei Videotyp Youtube) :<br>Wenn Sie den erweiterten Datenschutz aktivieren, speichert Youtube keine Informationen über Besucher auf Ihrer Website.</li><li><b>Steuerleiste anzeigen</b> (erscheint nur bei Videotyp Youtube): Anzeigen der Bedienelemente des Youtube-Players im Video.</li></ul><p><br></p><h4>Dokumente<br></h4><ul><li><b>Dokument hochladen:</b> Mit dem Medienselektor die gewünschten Dokumente hochladen. <br>Da Shopware die Dateitypen beim Upload begrenzt, kann bei uns ein kostenloses Plugin zur Erweiterung der Dateitypen über eine Supportanfrage angefragt werden.</li><li><b>Dokument bearbeiten</b>: Bei Klick auf ein Dokument, kann dies bearbeitet werden:<br>&nbsp;&nbsp; <b>Titel:</b> Wird dieser angegeben, dann erscheint dieser Name anstelle des Dokumenten Filenamen im Frontend<br>&nbsp;&nbsp; <b>Bechreibung</b>: Wird dieser angegeben, dann erscheint dieser neben dem Namen im Frontend<br>&nbsp;&nbsp; <b>Position</b>: Die Position wird über das verschieben im Admin Bereich durchgeführt und kann hier nicht verändert werden.<br>&nbsp;&nbsp; <b>Dokument in folgenden Sprachen verfügbar</b>: Damit die Dokumente in verschiedenen Sprachen unterschiedlich angezeigt werden kann, ist hier eine Zuordung möglich.</li></ul><p><br></p><h4>SEO<br></h4><ul><li><b>SEO url:</b> Wenn hier ein TEXT eingegeben wird, dann ist diese Frage im Frontend damit aufrufbar.&nbsp; (SEO URL Generierung vorausgesetzt)<br>Für die SEO-Url können Sie nur einen String/Wort eingeben und Sie können\n \"/\" in der Url verwenden (nicht am Anfang der Url).\n <br>Die eingegebene SEO-URL wird generiert und zusammen mit dem \nShopware-Pfad verwendet. <br>Beispiel: \"custom/faq\". Die SEO-Pfadvorlage \nkann unter Einstellungen&gt;Shop&gt;SEO geändert werden</li><li><b>Meta Titel</b>: Es kann für die FAQ ein Meta Title für die Suchmaschinen hinterlegt werden</li><li><b>Meta Beschreibung</b>: Es kann für die FAQ eine Meta Beschreibung für die Suchmaschinen hinterlegt werden<br></li></ul><p><br></p><p></p><p></p><p><br></p><h3>4. FAQ Nutzung auf Erlebniswelten<br></h3>Inhalte&gt; Erlebniswelten&gt; Layout anlegen<br><p></p><p><br></p><p>Das ACRIS FAQ Plugin hat bei den Erlebniswelten &gt; BLÖCKE &gt; BLOCK KATEGORIE einen neue Kategorie <b>ACRIS FAQ</b> hinzugefügt.</p><p>Dort ist ein vorgefertigter FAQ-Gruppen Block sofort verwendbar - mit diesen können Landingpages erstellt und einer Kategorie zugeordnet werden.</p><p>Zusätzlich habe wir 2 Elemente zur freien Verwendung hinzugefügt:<br></p><ul><li>FAQ-Gruppen: Hiermit werden alle FAQs einer FAQ Gruppen angezeit (es können auch mehrere FAQ Gruppen zugeordnet werden) <br></li><li>Einzelne FAQ-Einträge: Hiermit können einzelne FAQs aufgesucht und auf einer Landingpage plaziert werden.<br></li></ul><p><br></p><p></p><p></p><h2>Plugin Konfigurationen</h2><p>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS FAQ &gt; Konfiguration</p><h4><br></h4><h4>Allgemeines</h4><ul><li>Positionierung des FAQ-Tabs auf Produktseiten - Optionen: Vor Beschreibungstab | Zwischen Beschreibungstab und Bewertungstab | Nach Beschreibungstab | Unter Beschreibung</li></ul><h4><br></h4><h4>Formatierung / Aussehen</h4><ul><li>Symbol-Typ: FAQ Frage wird eingeklappt angezeigt, zun Ausklappen gibt es folgende Optionen: Pfeil oben und unten | +<br></li></ul><ul><li>Symbolposition: FAQ Frage wird eingeklappt angezeigt, zun Ausklappen gibt es folgende obiges Symbol und hier die Optionen:&nbsp; Links vom Text | Rechts vom Text<br></li></ul><ul><li>Standard Hintergrundfarbe der Frage: Entweder eine der Vorgaben auswählen oder \"benutzerdefinierte\" auswählen um nächste Option zu aktivieren:<br></li></ul><ul><li>Benutzerdefinierte Hintergrundfarbe der Frage (Bitte oben auf \"Benutzerdefinierte\" umstellen, damit die Einstellung greift)\n            </li></ul><ul><li>Benutzerdefinierte Textfarbe der Frage\n            </li></ul><ul><li>Hintergrundfarbe des Antwortbereichs\n            </li></ul><p><br></p><h3>Bekannte Einschränkungen / Hinweise:</h3><ul><li>FAQs können durch die Plugineinstellungen einmal als TAB und in der BESCHREIBUNG zugeordnet werden.<br>Dadurch erkennt Google die Rich Snippets doppelt und erkennt dadurch das Feld FAQPages doppelt.<br>Um das zu verhindern, bitte in der Plugin Kofniguration entweder als FAQ TAB oder oder im BESCHREIBUNGSTAB anzeigen lassen.<br></li></ul>","installationManual":"<ul><li>Plugin wie in Shopware üblich installieren und aktivieren.</li></ul><ul><li>Nach der Installation des Plugins stehen einige Konfigurationen zur Verfügung:<br>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS FAQ &gt; Konfiguration</li><li>Zusätzlich wird zur Erstellung der FAQ Gruppen und der FAQs entsprechende Menüpunkte hinzugefügt<br>Einstellungen &gt; Erweiterungen &gt; FAQ &gt; FAQ bzw. FAQ Gruppen<br></li></ul>","shortDescription":"FAQs erstellen, gruppieren und mittels dynamischer Produktgruppen den gewünschten Produkten zuordnen. Zusätzlich können FAQ Seiten mittels Erlebniswelten erstellt werden. SEO optimiert.","highlights":"FAQs zu Produkte mit dynamischen Produktgruppen zuordnen\nFAQs in Erlebniswelten integrieren (FAQ Gruppen oder einzelne FAQs)\nAntworten als Text, Bild und Text, Text und Video, Dokumente mit Text möglich\nSEO Optimierung (jede FAQ mit eigener SEO URL, FAQ werden als Rich Snippet erkannt)\nOptische Anpassungen (Anzeige Position, Farben, Symbole) einfach möglich","features":"FAQs mittels \"dynamischer Produktgruppen\" auf der Produktdetailseite (als TAB oder unterhalb der BESCHREIBUNG) anzeigen.\nFAQ Guppen erstellen und mit dynamischen Produktgruppen den Produkten zuordnen (mit Priorisierungen die Reihenfolge festlegen)\nFAQs erstellen und FAQ Gruppen zuordnen.  (mit Priorisierungen die Reihenfolge festlegen)\nFAQs mit Fragen und TEXT Antworten erstellen\nFAQs mit TEXT und BILD ( Bildgröße, Bildposition, Verlinkung, Link Target, Bildauswahl möglich)\nFAQs mit TEXT und VIDEOS (Videoposition, Videotyp (Youtube oder andere), Video URL, erweiterter Datenschutz sowie Steuerleiste (nur bei Youtube))\nFAQs mit TEXT und DOKUMENTEN (Dokumenten Titel statt Dokumentname möglich + Beschreibung)\nSEO Optimierung: SEO URL (damit kann eine FAQ direkt aufgerufen werden)\nSEO Optimierung: Meta Title, Meta Description\nSEO Optimierung: Rich Snippet Integration (FAQs werden als Rich Snippet erkannt) \nFAQs auf Erlebniswelten anzeigen lassen (es können ganze Gruppen oder einzelne FAQs angezeigt werden)\nFAQ Konfiguration: Positionierung des FAQ-Tabs auf Produktseiten (vor / nach Bewertungstab bzw. unterhalb der Beschreibung)\nFAQ Konfigurationen: Symol-Typen (Pfeile oben/unten oder Plus), Symbol-Position\nFAQ Konfigurationen: Hintergrundfarben (der Fragen und Antworten) einstellbar\nFAQ Konfigurationen: Textfarbe einstellbar"},{"id":26990,"name":"FAQ Pro - FAQ dynamic product assignment + SEO optimized + shopping experiences","description":"<h2>Usage / Purpose of ACRIS FAQ Plugin:</h2><p><br></p><h3>Assignment of FAQs flexible with dynamic product groups</h3><p>The main difference to all other FAQ plugins in the Shopware Store is the possibility to group FAQs into FAQ groups and display them directly with products as FAQ tab or in the description TAB using dynamic product groups. This allows for flexible assignment of FAQs (such as delivery notes for bulky items, assembly instructions for certain product groups or notes for entire categories).<br><br></p><h3>FAQ with documents, videos and images</h3><ul><li>You can easily add not only HTML texts, but also documents, videos and images - the FAQs can be ranked by prioritization.</li></ul><p><br></p><h3>Extensive SEO optimization</h3><ul><li>The individual FAQs can be accessed with a direct link (this is created automatically, but can also be set flexibly)</li><li>The FAQ groups were integrated by means of Rich Snippets, so that the search engines can read this perfectly.</li><li>In addition, a meta title, meta description can be set.</li><li>The videos were also implemented search engine optimized (with Rich Snippet).</li></ul><p><br></p><h3>Integrate FAQs on experience worlds</h3><ul><li>A FAQ group block is included and additionally 2 FAQ elements are available for use.</li></ul><p><br></p><h3>1. preparation to use the FAQ groups for display on the product detail page (with dynamic product groups).</h3><ul><li>The individual FAQs can be grouped into FAQ groups.</li><li>These FAQ groups can then be assigned using the dynamic product groups.</li><li>Therefore, the first step is to create dynamic product groups (Shopware Standard Feature: Catalogs &gt; Dynamic Product Groups).</li></ul><p><br></p><h3>2nd FAQ groups:&nbsp; Creation and assignment to products with Dynamic Product Groups.</h3><p>Settings &gt; Extensions &gt; FAQ &gt; FAQ Groups (Add or edit existing)<br><br></p><h4>Settings</h4><ul><li>&nbsp;&nbsp;&nbsp; Display Name: This is only displayed in the Experience Worlds element, it is not used in the Product Details page.</li><li>&nbsp;&nbsp;&nbsp; Description: The description is intended for the overview in the admin area and is not used in the frontend.</li><li>&nbsp;&nbsp;&nbsp; Priority: The higher the number, the higher the priority. This is used for sorting when multiple FAQ groups are displayed at the same time.</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Active: if active, the group will be displayed.</li></ul><p><br></p><h4>Product Assignment</h4><ul><li>&nbsp;&nbsp;&nbsp; Dynamic product groups: This is required for display at product detail page, if no product group is assigned then no display will be done at products however FAQ group can be used at experience pages.</li></ul><p><br></p><h3>3RD FAQ:&nbsp; Creation of questions and answers</h3><p>Settings &gt; Extensions &gt; FAQ &gt; FAQ (Add or edit existing)<br><br></p><h4>Settings</h4><ul><li>&nbsp;&nbsp;&nbsp; Internal name: serves for the overview in the admin area</li><li>&nbsp;&nbsp;&nbsp; Question: Question, which will be answered in the next field.</li><li>&nbsp;&nbsp;&nbsp; Answer: Answer to the question - can contain HTML.</li><li>&nbsp;&nbsp;&nbsp; Priority for display: the higher the number, the higher the priority. Used to sort multiple questions within a FAQ group.</li><li>&nbsp;&nbsp;&nbsp; FAQ Groups: Assignment to one or more FAQ groups.</li></ul><p><br></p><h4>Image</h4><ul><li>&nbsp;&nbsp;&nbsp; Image position: if an image (further down) is assigned, the image will be displayed in the desired position in the \"FAQ answer\".</li><li>&nbsp;&nbsp;&nbsp; Image size: predefined image sizes (large, medium, small).</li><li>&nbsp;&nbsp;&nbsp; URL / Link (if image is clicked) : If a link is inserted (absolute link with https://www.xxx.xx), then the image will be linked.</li><li>&nbsp;&nbsp;&nbsp; URL / Open Link As: Selection whether the link should be opened in a new tab or in the same window.</li><li>&nbsp;&nbsp;&nbsp; Image selection: Image selection is done here - only one image can be added.</li></ul><p><br></p><h4>Video</h4><ul><li>&nbsp;&nbsp;&nbsp; Video position: If a video is assigned (below) then the position can be selected here. The size is predefined and it is expected that a text description is also added. (2 columns are provided)</li><li>&nbsp;&nbsp;&nbsp; Video type: Youtube or other video type. If special video player needs to be integrated, then please send us a support request.</li><li>&nbsp;&nbsp;&nbsp; Embed URL: Please insert only the video link.</li><li>&nbsp;&nbsp;&nbsp; Examples for Youtube you can use the normal watch link or the embed link or just the Youtube ID: \"https://www.youtube.com/watch?v=DYDY4NW1L_TEST\" or \"https://www.youtube.com/embed/DYDY4NW1L_TEST\" or the Youtube ID: \"DYDY4NW1L_TEST\".</li><li>&nbsp;&nbsp;&nbsp; For the other video types, please use the embed link (example: \"https://player.myvideo.com/video/123456\").</li><li>&nbsp;&nbsp;&nbsp; Extended privacy mode (embed videos without cookies) (appears only for Youtube video type) :</li><li>&nbsp;&nbsp;&nbsp; If you enable enhanced privacy, Youtube will not store any information about visitors to your website.</li><li>&nbsp;&nbsp;&nbsp; Show control bar (appears only for Youtube video type): Display the controls of the Youtube player in the video.</li></ul><p><br></p><h4>Documents</h4><ul><li>&nbsp;&nbsp;&nbsp; Upload document: Upload the desired documents using the media selector.</li><li>&nbsp;&nbsp;&nbsp; Since Shopware limits the file types when uploading, a free plugin to extend the file types can be requested from us via a support request.</li><li>&nbsp;&nbsp;&nbsp; Edit document: By clicking on a document, this can be edited:</li></ul><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Title: If this is specified, then this name appears instead of the document filename in the frontend.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Description: If this is specified, it will appear next to the name in the frontend.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Position: the position is done by moving it in the admin area and cannot be changed here.<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Document available in the following languages: So that the documents can be displayed differently in different languages, an assignment is possible here.<br><br></p><h4>SEO</h4><ul><li>&nbsp;&nbsp;&nbsp; SEO url: If a TEXT is entered here, then this question is callable in the frontend with it.&nbsp; (SEO URL generation provided).</li><li>&nbsp;&nbsp;&nbsp; For the SEO url you can only enter a string/word and you can use \"/\" in the url (not at the beginning of the url).</li><li>&nbsp;&nbsp;&nbsp; The entered SEO URL will be generated and used together with the Shopware path.</li><li>&nbsp;&nbsp;&nbsp; Example: \"custom/faq\". The SEO path template can be changed under Settings&gt;Shop&gt;SEO.</li><li>&nbsp;&nbsp;&nbsp; Meta Title: A Meta Title for the FAQ can be stored for the search engines.</li><li>&nbsp;&nbsp;&nbsp; Meta Description: A meta description for the FAQ can be stored for the search engines.</li></ul><p><br></p><h3>4. FAQ usage on worlds of experience</h3><p>Content&gt; Worlds of Experience&gt; Create Layout<br><br>The ACRIS FAQ Plugin has added a new category ACRIS FAQ to the Worlds of Experience &gt; BLOCKS &gt; BLOCK CATEGORY.<br>There, a ready-made FAQ group block is immediately usable - with these, landing pages can be created and assigned to a category.<br>In addition, we have added 2 elements for free use:<br></p><ul><li>&nbsp;&nbsp;&nbsp; FAQ Groups: This is used to time all FAQs in a FAQ group (you can also assign multiple FAQ groups).</li><li>&nbsp;&nbsp;&nbsp; Individual FAQ entries: This can be used to visit individual FAQs and place them on a landing page.</li></ul><p><br></p><h3>Configurations</h3><p>Extensions &gt; My extensions &gt; ACRIS FAQ &gt; Configuration<br></p><h4><br></h4><h4>General</h4><ul><li>&nbsp;&nbsp;&nbsp; Positioning of FAQ tab on product pages - options: Before description tab | Between description tab and rating tab | After description tab | Under description tab</li></ul><h4>Formatting / Appearance</h4><ul><li>Icon type: FAQ question is displayed collapsed, to expand there are the following options: Arrow up and down | +</li></ul><ul><li>Icon position: FAQ question is displayed collapsed, to expand there are the following icon above and here the options:&nbsp; Left of text | Right of text</li></ul><ul><li>Default background color of question: Either select one of the defaults or select \"custom\" to activate next option</li></ul><ul><li>Custom background color of the question (please change above to \"Custom\" to make the setting take effect) </li></ul><ul><li>Custom text color of the question </li><li>Background color of the answer area <br></li></ul>","installationManual":"<ul><li>Install and activate plugin as usual in Shopware.</li><li>After installing the plugin, some configurations are available:<br>Extensions &gt; My Extensions &gt; ACRIS FAQ &gt; Configuration.&nbsp;&nbsp;&nbsp; <br></li><li>In addition, for the creation of the FAQ groups and the FAQs corresponding menu items are added<br>Settings &gt; Extensions &gt; FAQ &gt; FAQ or FAQ Groups</li></ul>","shortDescription":"Create FAQs, group them and assign them to the desired products using dynamic product groups. In addition, FAQ pages can be created using shopping experience worlds. SEO optimized.","highlights":"Assign FAQs to products with dynamic product groups\nIntegrate FAQs into experience worlds (FAQ groups or individual FAQs)\nAnswers as text, image and text, text and video, documents with text possible\nSEO optimization (each FAQ with its own SEO URL, FAQ are recognized as Rich Snippet)\nVisual adjustments (display position, colors, icons) easily possible","features":"Display FAQs using \"dynamic product groups\" on the product detail page (as TAB or below the DESCRIPTION).\nCreate FAQ groups and assign them to products using dynamic product groups (use prioritizations to define the order).\nCreate FAQs and assign them to FAQ groups.  (set the order with prioritizations)\nCreate FAQs with questions and TEXT answers\nCreate FAQs with TEXT and IMAGE ( image size, image position, linking, link target, image selection possible)\nFAQs with TEXT and VIDEOS (video position, video type (Youtube or other), video URL, extended privacy and control bar (only for Youtube))\nFAQs with TEXT and DOCUMENTS (document title instead of document name possible + description)\nSEO Optimization: SEO URL (so that a FAQ can be called directly)\nSEO Optimization: Meta Title, Meta Description\nSEO Optimization: Rich Snippet Integration (FAQs are recognized as Rich Snippet) \nDisplay FAQs on experience worlds (whole groups or single FAQs can be displayed)\nFAQ configuration: positioning of FAQ tab on product pages (before / after rating tab or below description)\nFAQ configurations: Symol types (arrows up/down or plus), icon position.\nFAQ configurations: Background colors (of questions and answers) adjustable\nFAQ configurations: Text color adjustable"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165953,"bookingKey":"acris58695610080","bookingText":"FAQ - Assignment to dynamic product groups + SEO optimized + shopping experience worlds","price":99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":165952,"bookingKey":"acris58695610080_M","bookingText":"FAQ - Assignment to dynamic product groups + SEO optimized + shopping experience worlds","price":19.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2DgdTx","preview":true,"priority":0,"id":93365},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJELTFa","preview":false,"priority":0,"id":93386},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0zLmBm","preview":false,"priority":0,"id":93387},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaAB2zH","preview":false,"priority":0,"id":93388},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQmZN3F","preview":false,"priority":0,"id":93389},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHi8suP","preview":false,"priority":0,"id":93390},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXEoHLN","preview":false,"priority":0,"id":93391},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpU1XWBV","preview":false,"priority":0,"id":93392},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprLIYMV","preview":false,"priority":0,"id":93393},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe4iiuA","preview":false,"priority":0,"id":93394},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpc14MzP","preview":false,"priority":0,"id":93395},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWnwcqK","preview":false,"priority":0,"id":93396},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmeuBzV","preview":false,"priority":0,"id":93397},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJwaZ9h","preview":false,"priority":0,"id":93398},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOfDxcu","preview":false,"priority":0,"id":93399},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8QREmo","preview":false,"priority":0,"id":93400},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjTh5VT","preview":false,"priority":0,"id":93401},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgnInpz","preview":false,"priority":0,"id":93402},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1GIBRu","preview":false,"priority":0,"id":93403},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfy2AfP","preview":false,"priority":0,"id":93404},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplkvuaO","preview":false,"priority":0,"id":93405},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8ZMTvU","preview":false,"priority":0,"id":93406}],"comments":[],"ratingAverage":0,"label":"FAQ Pro - FAQs dynamisch Produkte zuordnen + SEO optimiert + Erlebniswelten","description":"<h2><b>Nutzung / Zweck des ACRIS FAQ Plugins:</b></h2><p><br /></p><p><b>Zuweisung von FAQs flexibel mit dynamischen Produktgruppen<br /></b></p><p>Hauptunterschied zu allen anderen FAQ Plugins im Shopware Store ist die Möglichkeit FAQs in FAQ Gruppen zusammenzufassen und diese <b>mittels dynamischer Produktgruppen </b>direkt bei Produkten als FAQ Tab oder im Beschreibungs-TAB anzuzeigen. Dies ermöglicht eine flexible Zuordnung von FAQs (wie zum Beispiel Lieferhinweise bei Sperrgutartikel, Aufbauanleitungen bei bestimmten Produktgruppen oder Hinweise für ganze Kategorien).</p><p><br /></p><p><b>FAQ mit Dokumente, Videos und Bildern<br /></b></p><b></b><p></p><p>Es können auf einfache Weise nicht nur HTML Texte hinzugefügt werden, sinder Dokumente, Videos und Bilder - die FAQs können durch Priorisierungen gereiht werden.</p><p><br /></p><p><b>Umfangreiche SEO Optimierung<br /></b></p><p>Die einzelnen FAQs können mit direktem Link aufgerufen werden (dieser wird automatisch erstellt, kann aber auch flexibel festgelegt werden)<br />Die FAQ Gruppen wurden mittels Rich Snippets integriert, sodass die Suchmaschienen dies perfekt auslesen können.<br />Zusätzlich können ein Meta Titel, Meta Description festgelegt werden.<br />Die Videos wurden ebenfalls Suchmaschinen optimiert (mit Rich Snippet) implementiert. <br /></p><p><br /></p><p><b>FAQs auf Erlebniswelten integrieren<br /></b></p>Es wird ein FAQ Gruppen Block mitgeliefert und zusätzlich stehen 2 FAQ Elemente zur Verwendung zur Verfügung.<br /><p></p><p><br /></p><h3>1. Vorbereitung zur Nutzung der FAQ Gruppen zur Anzeige auf der Produktdetailseite (mit dynamischen Produktgruppen)<br /></h3><p>Die einzelnen FAQs können FAQ Gruppen zusammengefasst werden. <br /></p><p>Diese FAQ Gruppen können dann mittels der <b>dynamische Produktgruppen</b>  zugeordnet werden.</p><p>Daher ist der erste Schritt die Anlage von dynamischen Produktgruppen (Shopware Standard Feature: Kataloge &gt; Dynamische Produktgruppen)</p><p><br /></p><h3>2. FAQ Gruppen:  Anlage und Zuordnung zu Produkten mit Dynamischen Produktgruppen<br /></h3><p>Einstellungen &gt; Erweiterungen &gt; FAQ &gt; FAQ Gruppen (Hinzufügen oder bestehende Bearbeiten)<br /></p><p><br /></p><h4>Einstellungen<br /></h4><ul><li><b>Anzeigename:</b> Dies wird nur in den Erlebniswelten Element angezeigt, bei der Produktdetailseite kommt dieser nicht zur Anwendung.\n            </li><li><b>Beschreibung: </b>Die Beschreibung ist für die Übersicht im Admin Bereich vorgesehen und wird im Frontend nicht verwendet.</li><li><b>Priorität</b>: Je höher die Zahl, desto höher die Priorität. Dies wird zur Sortierung verwendet, wenn mehrere FAQ Gruppen gleichzeitig angezeigt werden.</li><li><b> Aktiv:</b> wenn aktiv, dann wird die Gruppe angezeigt.</li></ul><h4><br /></h4><h4>Produktzuweisung <br /></h4><ul><li><b>Dynamische Produktgruppen:</b> Dies ist Voraussetzung für die Anzeige bei der Produktdetailseite, wenn keine Produktgruppe zugeordnet wurde, dann erfolgt keine Anzeige bei den Produkten jedoch kann die FAQ Gruppe in den Erlebniswelten verwendet werden.<br /></li></ul><p></p><p><br /></p><h3>3. FAQ:  Anlage von Fragen und Antworten<br /></h3><p>Einstellungen &gt; Erweiterungen &gt; FAQ &gt; FAQ (Hinzufügen oder bestehende Bearbeiten)<br /></p><p><br /></p><h4>Einstellungen<br /></h4><ul><li><b>Interner Name:</b> dient zur Übersicht im Admin Bereich</li><li><b>Fragestellung</b>: Frage, welche dann im nächsten Feld beantwortet wird.</li><li><b>Antwort:</b> Beantwortung der Frage - kann HTML beinhalten.</li><li><b>Priorität für Anzeige</b>: Je höher die Zahl, desto höher die Priorität. Dient zur Sortierung von mehreren Fragen innerhalb einer FAQ Gruppe.</li><li><b>FAQ Gruppen</b>: Zuweisung zu einer oder mehreren FAQ Gruppen.<br /></li></ul><h4><br /></h4><h4>Bild<br /></h4><ul><li><b>Bildposition:</b> Falls ein Bild (weiter unten) zugeordnet ist, wird das Bild in der \"FAQ Antwort\" in der gewünschten Position angezeigt.</li><li><b>Bildgröße:</b> vordefinierte Bildgrößen (groß, mittel, klein)</li><li><b>URL / Link (bei Klick auf das Bild) :</b> Wenn ein Link eingefügt wird (absoluter Link mit https://www.xxx.xx), dann wird das Bild verlinkt.</li><li><b>URL / Link öffnen als</b>: Auswahl, ob der Link in einem neuen Tab oder im gleichen Fenster geöffnet werden soll</li><li><b>Bildauswahl</b>: Hier erfolgt die Bildauswahl  - es kann nur ein Bild hinzugefügt werden.<br /></li></ul><p></p><p><br /></p><h4>Video<br /></h4><ul><li><b>Videoposition:</b> Falls ein Video zugeordnet ist (weiter unten) dann kann hier die Position ausgewählt werden. Die Größe ist vordefiniert und erwartet wird, dass auch eine Text Beschreibung hinzugefügt wurde. (es sind 2 Spalten vorgesehen)</li><li><b>Videotyp</b>: Youtube oder andere Videotyp. Sollte spezielle Videoplayer integriert werden müssen, dann bitte um eine Supportanfrage an uns.</li><li><b>URL einbetten</b>: Bitte fügen Sie nur den Videolink ein. <br />Beispiele für Youtube können Sie \nden normalen Watch-Link oder den Embed-Link oder einfach die Youtube-ID:\n \"https://www.youtube.com/watch?v=DYDY4NW1L_TEST\" oder \n\"https://www.youtube.com/embed/DYDY4NW1L_TEST\" oder die Youtube-ID: \n\"DYDY4NW1L_TEST\" verwenden. <br />Für die anderen Videotypen verwenden Sie \nbitte den Einbettungslink (Beispiel: \n\"https://player.myvideo.com/video/123456\").</li><li><b>Erweiterter Datenschutz Modus </b>(Videos ohne Cookies einbinden)  (erscheint nur bei Videotyp Youtube) :<br />Wenn Sie den erweiterten Datenschutz aktivieren, speichert Youtube keine Informationen über Besucher auf Ihrer Website.</li><li><b>Steuerleiste anzeigen</b> (erscheint nur bei Videotyp Youtube): Anzeigen der Bedienelemente des Youtube-Players im Video.</li></ul><p><br /></p><h4>Dokumente<br /></h4><ul><li><b>Dokument hochladen:</b> Mit dem Medienselektor die gewünschten Dokumente hochladen. <br />Da Shopware die Dateitypen beim Upload begrenzt, kann bei uns ein kostenloses Plugin zur Erweiterung der Dateitypen über eine Supportanfrage angefragt werden.</li><li><b>Dokument bearbeiten</b>: Bei Klick auf ein Dokument, kann dies bearbeitet werden:<br />   <b>Titel:</b> Wird dieser angegeben, dann erscheint dieser Name anstelle des Dokumenten Filenamen im Frontend<br />   <b>Bechreibung</b>: Wird dieser angegeben, dann erscheint dieser neben dem Namen im Frontend<br />   <b>Position</b>: Die Position wird über das verschieben im Admin Bereich durchgeführt und kann hier nicht verändert werden.<br />   <b>Dokument in folgenden Sprachen verfügbar</b>: Damit die Dokumente in verschiedenen Sprachen unterschiedlich angezeigt werden kann, ist hier eine Zuordung möglich.</li></ul><p><br /></p><h4>SEO<br /></h4><ul><li><b>SEO url:</b> Wenn hier ein TEXT eingegeben wird, dann ist diese Frage im Frontend damit aufrufbar.  (SEO URL Generierung vorausgesetzt)<br />Für die SEO-Url können Sie nur einen String/Wort eingeben und Sie können\n \"/\" in der Url verwenden (nicht am Anfang der Url).\n <br />Die eingegebene SEO-URL wird generiert und zusammen mit dem \nShopware-Pfad verwendet. <br />Beispiel: \"custom/faq\". Die SEO-Pfadvorlage \nkann unter Einstellungen&gt;Shop&gt;SEO geändert werden</li><li><b>Meta Titel</b>: Es kann für die FAQ ein Meta Title für die Suchmaschinen hinterlegt werden</li><li><b>Meta Beschreibung</b>: Es kann für die FAQ eine Meta Beschreibung für die Suchmaschinen hinterlegt werden<br /></li></ul><p><br /></p><p></p><p></p><p><br /></p><h3>4. FAQ Nutzung auf Erlebniswelten<br /></h3>Inhalte&gt; Erlebniswelten&gt; Layout anlegen<br /><p></p><p><br /></p><p>Das ACRIS FAQ Plugin hat bei den Erlebniswelten &gt; BLÖCKE &gt; BLOCK KATEGORIE einen neue Kategorie <b>ACRIS FAQ</b> hinzugefügt.</p><p>Dort ist ein vorgefertigter FAQ-Gruppen Block sofort verwendbar - mit diesen können Landingpages erstellt und einer Kategorie zugeordnet werden.</p><p>Zusätzlich habe wir 2 Elemente zur freien Verwendung hinzugefügt:<br /></p><ul><li>FAQ-Gruppen: Hiermit werden alle FAQs einer FAQ Gruppen angezeit (es können auch mehrere FAQ Gruppen zugeordnet werden) <br /></li><li>Einzelne FAQ-Einträge: Hiermit können einzelne FAQs aufgesucht und auf einer Landingpage plaziert werden.<br /></li></ul><p><br /></p><p></p><p></p><h2>Plugin Konfigurationen</h2><p>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS FAQ &gt; Konfiguration</p><h4><br /></h4><h4>Allgemeines</h4><ul><li>Positionierung des FAQ-Tabs auf Produktseiten - Optionen: Vor Beschreibungstab | Zwischen Beschreibungstab und Bewertungstab | Nach Beschreibungstab | Unter Beschreibung</li></ul><h4><br /></h4><h4>Formatierung / Aussehen</h4><ul><li>Symbol-Typ: FAQ Frage wird eingeklappt angezeigt, zun Ausklappen gibt es folgende Optionen: Pfeil oben und unten | +<br /></li></ul><ul><li>Symbolposition: FAQ Frage wird eingeklappt angezeigt, zun Ausklappen gibt es folgende obiges Symbol und hier die Optionen:  Links vom Text | Rechts vom Text<br /></li></ul><ul><li>Standard Hintergrundfarbe der Frage: Entweder eine der Vorgaben auswählen oder \"benutzerdefinierte\" auswählen um nächste Option zu aktivieren:<br /></li></ul><ul><li>Benutzerdefinierte Hintergrundfarbe der Frage (Bitte oben auf \"Benutzerdefinierte\" umstellen, damit die Einstellung greift)\n            </li></ul><ul><li>Benutzerdefinierte Textfarbe der Frage\n            </li></ul><ul><li>Hintergrundfarbe des Antwortbereichs\n            </li></ul><p><br /></p><h3>Bekannte Einschränkungen / Hinweise:</h3><ul><li>FAQs können durch die Plugineinstellungen einmal als TAB und in der BESCHREIBUNG zugeordnet werden.<br />Dadurch erkennt Google die Rich Snippets doppelt und erkennt dadurch das Feld FAQPages doppelt.<br />Um das zu verhindern, bitte in der Plugin Kofniguration entweder als FAQ TAB oder oder im BESCHREIBUNGSTAB anzeigen lassen.<br /></li></ul>","installationManual":"<ul><li>Plugin wie in Shopware üblich installieren und aktivieren.</li></ul><ul><li>Nach der Installation des Plugins stehen einige Konfigurationen zur Verfügung:<br />Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS FAQ &gt; Konfiguration</li><li>Zusätzlich wird zur Erstellung der FAQ Gruppen und der FAQs entsprechende Menüpunkte hinzugefügt<br />Einstellungen &gt; Erweiterungen &gt; FAQ &gt; FAQ bzw. FAQ Gruppen<br /></li></ul>","version":"4.3.2","changelog":[{"version":"4.3.2","text":"<p>Fixes a problem on loading faq modules in the Administration.</p>","creationDate":{"date":"2023-07-05 10:15:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.1","text":"<ul><li>Fixes a problem on loading faq cms elements</li></ul>","creationDate":{"date":"2023-06-21 15:59:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.3.0","text":"<ul><li>Added new setting for assigning categories for FAQ groups</li><li>Added new setting for displaying the FAQ group in the shopping experience element</li></ul>","creationDate":{"date":"2023-06-21 09:28:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.1","text":"<ul><li>Improved storefront compatibility with other plugins.</li></ul>","creationDate":{"date":"2023-06-19 07:28:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.2.0","text":"<p>Improved compatibility of the search preview with other plugins.</p>","creationDate":{"date":"2023-06-13 16:00:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.0","text":"<ul><li>Added new FAQ styling settings</li></ul>","creationDate":{"date":"2023-06-09 07:36:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.3","text":"<ul><li>Optimizes the layout and loading of the shopping experiences at the FAQ detail page<br /></li></ul>","creationDate":{"date":"2023-06-05 07:37:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"<ul><li>Optimizes the display of experience worlds on the FAQ detail page<br /></li></ul>","creationDate":{"date":"2023-05-04 11:36:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"- Improved compatibility with ACRIS Search Pro.<br />- Fixes a problem where inactive FAQs were found and their detail page was accessible.<br />- Fixes a problem when FAQ entries were not found.<br />- Removes the colour values entered in the standard in the plug-in settings.<br />- Adds a default FAQ group with the plugin installation.<br /><p>- Admin optimizations.</p>","creationDate":{"date":"2023-05-03 09:23:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>Compatibility established with SW 6.5</p>","creationDate":{"date":"2023-04-28 08:10:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.7.1","text":"<ul><li>Fixes a problem on loading faq cms elements</li></ul>","creationDate":{"date":"2023-06-21 15:58:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.7.0","text":"<ul><li>Added new setting for assigning categories for FAQ groups</li><li>Added new setting for displaying the FAQ group in the shopping experience element</li></ul>","creationDate":{"date":"2023-06-21 09:29:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.6.0","text":"<p>Improved compatibility of the search preview with other plugins.</p>","creationDate":{"date":"2023-06-13 15:59:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"<ul><li>Added new FAQ styling settings</li></ul>","creationDate":{"date":"2023-06-09 07:11:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.8","text":"<ul><li>Optimizes the layout and loading of the shopping experiences at the FAQ detail page<br /></li></ul>","creationDate":{"date":"2023-06-05 07:36:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.7","text":"<ul><li>Optimizes the display of experience worlds on the FAQ detail page<br /></li></ul>","creationDate":{"date":"2023-05-04 11:35:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.6","text":"- Improved compatibility with ACRIS Search Pro.<br />- Fixes a problem where inactive FAQs were found and their detail page was accessible.<br />- Fixes a problem when FAQ entries were not found.<br />- Removes the colour values entered in the standard in the plug-in settings.<br />- Adds a default FAQ group with the plugin installation.<br /><p>- Admin optimizations.</p>","creationDate":{"date":"2023-05-03 09:22:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.5","text":"<p>Optimized responsive view of youtube videos in combination with text.</p>","creationDate":{"date":"2023-04-24 10:46:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.4","text":"<p>Optimized display if there are no search results.</p>","creationDate":{"date":"2023-04-13 14:32:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.3","text":"<p>Optimized view of the search results</p>","creationDate":{"date":"2023-02-24 12:49:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.2","text":"<ul><li>Added the Dutch language for the administration.</li><li>Change of the plugin name and the manufacturer links.</li><li>Optimized compatibility with other plugins.<br /></li></ul>","creationDate":{"date":"2023-02-20 11:58:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.1","text":"<ul><li>Performance optimisation</li></ul>","creationDate":{"date":"2022-12-19 10:15:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"<ul><li>Added option to integrate faqs to search</li><li>Increased compatibility with other plugins</li><li>Added option to use a Shopping experience layout for FAQ inside configuration<br /></li></ul>","creationDate":{"date":"2022-10-25 13:09:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<ul><li>\n                                                                                                    <p>Optimizes Sorting of faqs and faq groups</p></li><li>Adds new settings for faqs and faq groups\n                                                                                            </li></ul>","creationDate":{"date":"2022-10-12 11:05:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"<ul><li>Optimizes the display when the video is played in full width<br /></li></ul>","creationDate":{"date":"2022-09-29 09:41:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"<ul><li>Optimization of full width video display<br /></li></ul>","creationDate":{"date":"2022-09-29 08:20:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p>Optimizes assigning of the meta data to the embedded video after starting it on the page.</p>","creationDate":{"date":"2022-09-28 20:24:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<ul><li>If there is no link in the FAQ image, then it is not clickable.</li><li> If there is no FAQ answer, then the image/video fills the whole width of the page<br /></li></ul>","creationDate":{"date":"2022-09-28 11:15:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<ul><li> Optimizes default FAQ colors in the Storefront.</li></ul>\n                                                                                                            <ul><li> Optimizes loading of the FAQs in the Storefront.</li></ul>\n                                                                                                            <ul><li> Adds validation on loading of the Youtube meta data.</li></ul>\n                                                                                                            <ul><li> Adds preview image for the Youtube video if cookie is not accepted.</li></ul>\n                                                                                                            <ul><li> Updates Youtube meta data of FAQs videos with scheduled task.</li></ul>\n                                                                                                            <ul><li> Improves plugin compatibility.</li></ul>\n                                                                                                            <ul><li> Performance optimisation.</li></ul>","creationDate":{"date":"2022-08-12 10:17:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.3","text":"<p>Optimizes loading of the Youtube after iframe background image.</p>","creationDate":{"date":"2022-07-21 14:32:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.2","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-14 11:57:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.1","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-13 21:21:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"<ul><li>Veröffentlichung, Store Release</li></ul>","creationDate":{"date":"2022-07-13 13:38:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<ul><li>Store Release, Veröffentlichung</li></ul>","creationDate":{"date":"2022-07-06 15:14:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<ul><li>Store Release, Veröffentlichung</li></ul>","creationDate":{"date":"2022-07-04 14:56:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris58695610080","redirectToStore":false,"lowestPriceValue":19.99}