{"id":15485,"name":"AcrisAccountCartCheckoutAppCS","code":"acris24295756611","lastChange":{"date":"2023-07-19 07:32:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpktZKpo","examplePageUrl":"","moduleKey":"AcrisAccountCartCheckoutAppCS","creationDate":{"date":"2022-07-04 08:47:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-07-13 07:17:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-07-04 08:50:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":26984,"name":"Kundenkonto / Warenkorb / Checkout Anpassungen APP","description":"<p>Mit dieser Shopware 6 APP können auf einfache Weise folgende Bereiche angepasst werden:</p><p><br></p><h3>Kundenkonto Einstellungen\n</h3><br><ul><li><b>Header Link Benutzer</b>&nbsp; <br>Wenn der Benutzer nicht angemeldet ist, kann hier die <b>Verlinkung des Benutzer Icons</b>\ngeändert werden.<br>Optionen: Menü anzeigen (Shopware Standard) oder Direkt zur Anmeldeseite<br></li><li><b>\"Meine Vorteile\" anzeigen\n</b><br>Aktiviert (Shopware Standard) oder <b>deaktiviert</b> die Anzeige der Vorteile auf der Anmeldeseite.</li><li><b>Newsletter anzeigen</b><br>Aktiviert (Shopware Standard) oder <b>deaktiviert</b> die Anzeige des Newsletters beim Benutzerkonto.</li><li><b>Kundennummer anzeigen</b><br><b>Aktiviert</b> oder deaktiviert (Shopware Standard) die Anzeige der Kundennummer in der Übersicht beim Kundenkonto.</li><li><b>Die (Kundenkonto) Übersicht soll nicht angezeigt werden für</b><br>(Im Shopware Standard wird die Übersicht angezeigt)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) für diese Regel wird dann die Kundenkonto \"Übersicht\" in der Navigation\nausgeblendet.</li><li><b>Die persönliche Daten können nicht geändert werden von</b>: <br>(Im Shopware Standard können die persönlichen Daten nach der Registrierung (nachträglich) geändert werden)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) für diese Regel wird dann die Bearbeitung der Persönlichen Daten\nverhindert. Diese werden in der Navigation nicht mehr angezeigt.</li><li><b>Firmenname in den persönlichen Daten kann nicht geändert werden von:</b><br>(Im Shopware Standard kann der Firmenname nach der Registrierung (nachträglich) geändert werden)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen)&nbsp; und die Bearbeitung des\nFirmennamens in den persönlichen Daten\nverhindert werden. Wurde noch kein Firmenname angegeben,\nkann dieser eingegeben, aber nicht mehr verändert werden.</li><li><b>Die Ust.-ID kann in den persönlichen Daten nicht geändert werden von:<br></b>(Im Shopware Standard kann der Firmenname nach der Registrierung (nachträglich) geändert werden)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen)&nbsp; und die Bearbeitung der Ust.-ID\nverhindert werden. <br>Wurde noch keine Ust.-ID angegeben, kann diese angegeben, aber nicht mehr verändert werden.</li><li><b>Die Zahlungsart kann nicht geändert werden von:<br></b>(Im Shopware Standard kann der Zahlungsart im Kundenkonto geändert werden)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Bearbeitung der Zahlungsart verhindert\nwerden. Diese wird in der Navigation nicht mehr angezeigt.</li><li><b>Auswahl der Zahlungsart im Accountbereich verstecken für:<br></b>(Im Shopware Standard wird die Zahlungsart im Kundenkonto angezeigt)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Anzeige Navigation \"Zahlungsart\" im Kundenkonto verhindert werden.</li><li><b>Die Rechnungsadresse kann nicht geändert werden von:</b><br>(Im Shopware Standard kann der Rechnungsadresse im Kundenkonto geändert werden)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Bearbeitung der Rechnungsadresse\nverhindert werden.</li><li><b>Die Lieferadresse kann nicht geändert werden von:</b><br>(Im Shopware Standard kann der Lieferadresse im Kundenkonto geändert werden)<br>Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Bearbeitung der Lieferadressen verhindert werden.</li><li><b>Den Bereich \"Alle Adressen\" soll nicht angezeigt werden für:</b><br>(Im Shopware Standard können \"Alle Adressen\" im Kundenkonto angezeigt werden)<br>Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) und die Anzeige \"alle Adressen\" verhindert werden.</li></ul><p><br></p><h3>Kundenkonto Bestellhistorie\n</h3><p><br></p><ul><li><b>Zahlungsstatus von Bestellungen nicht anzeigen für:<br></b>(Im Shopware Standard wird der Zahlungsstatus im Kundenkonto angezeigt)<br>Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) und die Anzeige des Zahlungsstatus bei der Bestellung im Kundenkonto verhindert werden.\n</li></ul><p><br></p><h3>Firmenkunden Einstellungen\n</h3><p><br></p><ul><li><b>Abteilung für Firmenkunden ausblenden</b><br><b>Aktiviert </b>oder deaktiviert (Shopware Standard) die Anzeige der Abteilung in der Storefront<br></li><li><b>Auswahl Gewerblich/Privat für angemeldete Kunden sperren</b><br><b>Aktiviert </b>oder deaktiviert (Shopware Standard) die Anzeige der Abteilung in der Storefront<br>Das kommerzielle/private Auswahlfeld wird für bestehende Kunden nicht angezeigt.\n</li></ul><p><br></p><h3>Warenkorb Einstellungen<br></h3><p><br></p><ul><li><b>Anzeige der Warenkorb Spalten auf der Bestellabschlussseite</b><br>Optionen: Menge - MwSt - Summe (Shopware Standard) oder <b>Menge - Einzelpreis - Summe (analog Warenkorb Übersicht)</b><br></li><li><b>Artikelsuche anzeigen</b><br>Wenn aktiv (Shopware Standard), wird die Produktsuche unter dem Warenkorb angezeigt - kann mit dieser Option ausgeschalten werden.\n</li><li><b>Versandkostenberechung anzeigen\n</b><br>Wenn aktiv (Shopware Standard), wird der Link \"Versandkosten\" unter dem Warenkorb angezeigt- kann mit dieser Option ausgeschalten werden.</li><li><b>Gutschein anzeigen\n</b><br>Wenn aktiv (Shopware Standard), wird die Gutscheineingabe unter dem Feld \"Zusammenfassung\" rechts im\nWarenkorb und im offcanvas Warenkorb angezeigt kann mit dieser Option ausgeschalten werden.</li><li><b>Anzeige der Summe im Off-Canvas Warenkorb</b><br>Die Anzeige der Warenkorbsumme im Off-Canvas Warenkorb kann wie folgt beeinflusst werden:<br>Optionen: Nicht anzeigen (Shopware Standard) | Nicht anzeigen (Shopware Standard) | Nicht anzeigen (Shopware Standard)</li></ul><p><br></p><h3>Checkout Einstellungen <br></h3><p><br></p><ul><li><b>Anzeige der Telefonnummer in der Adresse</b><br>Die Positionierung der Telefonnummer in der Rechnungs- und Lieferadresse kann hier geändert werden.<br>Optionen: Shopware Standard Anzeige | Am Ende der Adresse | keine Anzeige</li><li><b>Button \"Adresse ändern\" bei der Lieferadresse verstecken, wenn dies der Rechnungsadressen entspricht.\n            <br></b>Wenn AKTIV, dann wird der Button \"Adresse ändern\" wird im Bestellprozess nicht mehr angezeigt,\n wenn die Lieferadresse der Rechnungsadresse entspricht und der Kunde \ndie Lieferadresse ändern möchte.</li><li><b>Button \"Versandart ändern\" anzeigen\n            <br></b>Wenn nur eine Versandart möglich ist, kann hier die Anzeige des Buttons eingestellt\n                werden.</li><li><b>Anzeige der zusätzlichen Felder<br></b>Die Positionierung der zusätzlichen Felder im Checkout kann hier geändert werden.<br>Optionen: Shopware Standard Anzeige | Unter Zahlungsart und Versandart anzeigen</li><li><b>Zusätzliches benutzerdefiniertes Feld anzeigen\n            <br></b>Unter dem Text-Feld \"Zusätzliche Infomationen\" wird ein weiteres Text-Feld\n                angezeigt.<br>Gehen Sie zu Einstellungen &gt; Textbausteine &gt; wählen Sie die gewünschte Sprache\n                        aus &gt; suchen Sie nach \"acris\". \"AcrisAccountCartCheckoutApp.furtherInformationTitle\" wird für den\n                        Titel und \"AcrisAccountCartCheckoutApp.furtherInformationText\" für den Text verwendet.\n                    \n                    </li><li><b>Widerrufsbelehrung für folgende Gruppen nicht anzeigen:</b><br>(Im Shopware Standard wird die Widerrufsbelehung angezeigt)<br>Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) und die Anzeige des Widerrufsbelehrung im Checkout verhindert.\n</li></ul><p><br></p><h3>Zusammenfassung im Warenkorb und im Checkout <br></h3><p><br></p><ul><li><b>Anzeige der Zusammenfassungs Spalten<br></b>Die Anzeige der Zusammenfassungs Spalten kann hier geändert werden.<br>Option 1: Zwischensumme - Versandkosten - Gesamtsumme - Gesamtnettosumme- MwSt (Shopware Standard) <br>Option 2: Gesamtnettosumme - MwSt - Gesamtsumme - Versandkosten<br></li><li><b>Die Anzeige der Zusammungsfassungs Spalten für folgende Gruppen anzeigen:<br></b>Wenn Regeln zugwiesen werden, gilt die oben ausgewählte Ansicht <b>nur für \ndie ausgewählten Regeln</b>. Ansonsten ist die Ansicht für den ganzen Shop \ngültig.<br>Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen)&nbsp;\n</li></ul><p><br></p><h3>Zeichenbeschränkungen <br></h3>Mit diesen Einstellungen können die Anzahl der Zeichen in der (Registrierung) in der Storefront eingestellt werden <br><ul><li>Vorname: 35 Zeichen voreingestellt.</li><li>Nachname: 35 Zeichen voreingestellt.</li><li>Firma: 35 Zeichen voreingestellt.</li><li>Abteilung: 35 Zeichen voreingestellt.</li><li>Strasse: 35 Zeichen voreingestellt.</li><li>Postleitzahl: 40 Zeichen voreingestellt.</li><li>Ort: 40 Zeichen voreingestellt.</li><li>Telefonnummer: 30 Zeichen voreingestellt.</li><li>Adresszusatz 1: 35 Zeichen voreingestellt.</li><li>Adresszusatz 2: 35 Zeichen voreingestellt.<br><br></li></ul><p><br></p><p></p>","installationManual":"<p>Das Plugin, wie in Shopware üblich, installieren. Danach stehen im Shopware Admin unter:<br>Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS App Kundenkonto / Warenkorb / Checkout &gt; Konfiguration <br>zahlreiche Einstellungsmöglichkeiten zur Verfügung.<br></p>","shortDescription":"Über 30 verschiedenen Einstellungsmöglichkeiten für die Bereiche Kundenkonto, Kundenkonto Bestellhistorie, Firmenkunden, Warenkorb, Off-Canvas und für den Checkout in einem Plugin.","highlights":"Kundenkonto Einstellungen (z.B. Datenänderungen oder Anzeigen regelgesteuert möglich)\nFirmenkunden Einstellungen (z.B. Datenänderungen oder Anzeigen regelgesteuert möglich)\nWarenkorb Einstellungen (z.B. Anzeige der Menge - Einzelpreis - Summe, Versandberechnung)\nCheckout Einstellungen (z.B. Anzeige von zusätzlichen Feldern, Widerrufbelehrung regelgesteuert, Zeichenbeschränkungen)\nZusammenfassung im Warenkorb und im Checkout  (z.B. Anzeige der Gesamtnettosumme - MwSt - Gesamtsumme - Versandkosten)","features":"Über 30 wichtige Einstellungsmöglichkeiten für die Bereiche...\n... Registrierung\n... Kundenkonto\n... Kundenkonto Bestell Historie\n... Firmenkunden\n... Warenkorb\n... Off-Canvas Warenkorb\n... Checkout\n... Zusammenfassung im Warenkorb und im Checkout"},{"id":26985,"name":"Customer account / Shopping cart / Checkout adjustments APP","description":"With this Shopware 6 APP you can easily customize the following areas:<br><p><br></p><h3>Customer account settings</h3><br><ul><li><p><b>Header Link User</b><br></p><p>If the user is not logged in, the link of the user icon can be changed here.<br></p><p>Options: Show menu (Shopware default) or Direct to login page.</p></li><li><p><b>\"Show \"My benefits<br></b></p><p>Enables (Shopware Standard) or disables the display of benefits on the login page.</p></li><li><p><b>Show newsletter<br></b></p><p>Enables (Shopware Standard) or disables the display of the newsletter at the user account.</p></li><li><p><b>Show customer number<br></b></p><p>Enables or disables (Shopware Standard) the display of the customer number in the overview at the customer account.</p></li><li><p><b>The (customer account) overview should not be displayed for<br></b></p><p><b></b>(In Shopware Standard the overview is displayed).<br></p><p>Here Shopware Rule Builder rules can be entered, (e.g. customer groups) for this rule then the customer account \"overview\" in the navigation is hidden.</p></li><li><p><b>The personal data can not be changed by:<br></b></p><p>(In Shopware Standard the personal data can be changed after registration (afterwards)).<br></p><p>Shopware Rule Builder rules can be entered here, (e.g. customer groups) for this rule the editing of the Personal Data will then be prevented. These will no longer be displayed in the navigation.</p></li><li><p><b>Company name in the personal data can not be changed from:<br></b></p><p>(In Shopware Standard the company name can be changed after registration (afterwards)).<br></p><p>Here Shopware Rule Builder rules can be entered, (e.g. customer groups) and the editing of the company name in the personal data can be prevented. If no company name has been entered yet, it can be entered but not changed.</p></li><li><p><b>The VAT ID cannot be changed in the personal data from:<br></b></p><p>(In Shopware Standard the company name can be changed after registration (afterwards)).<br></p><p>Shopware Rule Builder rules can be entered here, (e.g. customer groups) and editing of the VAT ID can be prevented.<br></p><p>If no VAT ID has been entered yet, it can be entered but not changed.</p></li><li><p><b>The payment type cannot be changed from:<br></b></p><p>(In Shopware Standard, the payment type can be changed in the customer account).<br></p><p>Shopware Rule Builder rules can be entered here, (e.g. customer groups) and editing of the payment type can be prevented. This is no longer displayed in the navigation.</p></li><li><p><b>Hide payment type selection in account area for:<br></b></p><p>(In Shopware Standard, the payment type is displayed in the customer account).<br></p><p>Here Shopware Rule Builder rules can be entered, (e.g. customer groups) and the display navigation \"payment type\" in the customer account can be prevented.</p></li><li><p><b>The billing address cannot be changed from:<br></b></p><p>(In Shopware Standard the billing address can be changed in the customer account).<br></p><p>Here Shopware Rule Builder rules can be entered, (e.g. customer groups) and the editing of the billing address can be prevented.</p></li><li><p><b>The shipping address cannot be changed from:<br></b></p><p>(In Shopware Standard the shipping address can be changed in the customer account).<br></p><p>Shopware Rule Builder rules can be entered here, (e.g. customer groups) and editing of the delivery addresses can be prevented.</p></li><li><p><b>The area \"All addresses\" should not be displayed for:<br></b></p><p>(In Shopware Standard \"All Addresses\" can be displayed in the customer account).<br></p><p>Here Shopware Rule Builder rules can be entered, (e.g. customer groups) and the display of \"all addresses\" can be prevented.</p></li></ul><p><br></p><h3>Customer account order history</h3><p><br></p><ul><li><p><b>Do not show payment status of orders for:<br></b></p><p>(In Shopware Standard, the payment status is displayed in the customer account).<br></p><p>Shopware Rule Builder rules can be entered here, (e.g. customer groups) and prevent the payment status from being displayed on the order in the customer account. </p></li></ul><p><br></p><h3>Corporate customer settings</h3><p><br></p><ul><li><p><b>Hide department for corporate customers<br></b></p><p>Enables or disables (Shopware default) the display of the department in the storefront.</p></li><li><p><b>Block commercial/private selection for logged in customers<br></b></p><p>Enables or disables (Shopware default) the display of the department in the storefront.<br></p><p>The commercial/private selection field is not displayed for existing customers. </p></li></ul><p><br></p><h3>Shopping cart settings</h3><p><br></p><ul><li><p><b>Display the shopping cart columns on the order completion page.<br></b></p><p>Options: Quantity - VAT - Total (Shopware Standard) or Quantity - Unit Price - Total (same as Shopping Cart Overview).</p></li></ul><ul><li><p><b>Show item search<br></b></p><p>If active (Shopware Standard), the product search is displayed below the shopping cart - can be turned off with this option.</p></li></ul><ul><li><p><b>Show shipping costs<br></b></p><p>If active (Shopware Standard), the link \"shipping costs\" will be displayed under the shopping cart - can be turned off with this option.</p></li></ul><ul><li><p><b>Show coupon<br></b></p><p>If active (Shopware Standard), the voucher entry is displayed under the \"Summary\" field on the right side of the shopping cart and in the offcanvas shopping cart can be turned off with this option.</p></li><li><p><b>Display of the total in the off-canvas shopping cart<br></b></p><p>The display of the cart total in the off-canvas shopping cart can be influenced as follows:<br></p><p>Options: Don't show (Shopware Standard) | Don't show (Shopware Standard) | Don't show (Shopware Standard).</p></li></ul><p><br></p><h3>Checkout settings</h3><p><br></p><ul><li><p><b>Display of the phone number in the address<br></b></p><p>The positioning of the phone number in the billing and shipping address can be changed here.<br></p><p>Options: Shopware default display | At the end of the address | No display.</p></li><li><p><b>Hide button \"Change address\" in the delivery address, if this corresponds to the billing address.<br></b></p><p>If ACTIVE, then the button \"Change address\" will no longer be displayed in the ordering process if the shipping address corresponds to the billing address and the customer wants to change the shipping address.</p></li><li><p><b>Show \"Change shipping method\" button<br></b></p><p>If only one shipping method is possible, the display of the button can be set here.</p></li><li><p><b>Display of the additional fields<br></b></p><p>The positioning of the additional fields in the checkout can be changed here.<br></p><p>Options: Shopware Standard Display | Shopware Standard Display</p></li><li><p><b>Display additional custom field<br></b></p><p>An additional text field is displayed below the \"Additional Info\" text field.<br></p><p>Go to Settings &gt; Text Modules &gt; select the desired language &gt; search for \"acris\". \"AcrisAccountCartCheckoutApp.furtherInformationTitle\" will be used for the title and \"AcrisAccountCartCheckoutApp.furtherInformationText\" for the text.</p></li><li><p><b>Do not show revocation information for the following groups:<br></b></p><p>(In Shopware Standard, the cancellation policy is displayed).<br></p><p>Shopware Rule Builder rules can be entered here, (e.g. customer groups) and prevents the display of the cancellation policy in the checkout. </p></li></ul><p><br></p><h3>Summary in shopping cart and checkout</h3><p><br></p><ul><li><p><b>Display of the summary columns<br></b></p><p>The display of the summary columns can be changed here.<br></p><p>Option 1: Subtotal - Shipping costs - Grand total - Grand total - VAT (Shopware Standard)<br></p><p>Option 2: Grand total - VAT - Grand total - Shipping costs</p></li><li><p><b>Show summary columns for the following groups:<br></b></p><p>When rules are assigned, the view selected above applies only to the selected rules. Otherwise the view is valid for the whole store.<br></p><p>Here Shopware Rule Builder rules can be entered, (e.g. customer groups) &nbsp;</p></li></ul><p><br></p><h3>Character limits</h3><p></p><p><br></p><p>With these settings you can set the number of characters in the (registration) in the storefront</p><p><br></p><ul><li>&nbsp;&nbsp;&nbsp; First name: 35 characters by default.</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Last name: 35 characters by default.</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Company: 35 characters by default.</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Department: 35 characters by default.</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Street: 35 characters by default.</li></ul><ul><li>&nbsp;&nbsp;&nbsp; Postal code: 40 characters by default.</li></ul><ul><li>&nbsp;&nbsp;&nbsp; City: 40 characters by default.</li></ul><ul><li><p>&nbsp;&nbsp;&nbsp; Phone number: 30 characters by default.</p></li><li><p>&nbsp;&nbsp;&nbsp; Address suffix 1: 35 characters by default.</p></li><li><p>&nbsp;&nbsp;&nbsp; Address suffix 2: 35 characters by default.</p></li></ul>","installationManual":"Install the plugin, as usual in Shopware. After that are available in the Shopware Admin under:<br>Extensions &gt; My Extensions &gt; ACRIS App Customer Account / Shopping Cart / Checkout &gt; Configuration<br><p>numerous setting options are available.</p>","shortDescription":"Over 30 different settings options for the areas of customer account, customer account order history, corporate customers, shopping cart, off-canvas and for the checkout in one plugin.","highlights":"Customer account settings (e.g. data changes or displays rule-controlled possible)\nCorporate customer settings (e.g. data changes or display rule-controlled possible)\nShopping cart settings (e.g. display of quantity - unit price - total, shipping calculation)\nCheckout settings (e.g. display of additional fields, revocation instruction rule-controlled, character restrictions)\nSummary in shopping cart and checkout (e.g. display of total net amount - VAT - total amount - shipping costs)","features":"Over 30 important setting options for the areas...\n... Registration\n... Customer account\n... Customer account order history\n... Corporate customers\n... Shopping cart\n... Off-Canvas Shopping Cart\n... Checkout\n... Summary in shopping cart and checkout"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":165901,"bookingKey":"acris24295756611_M","bookingText":"","price":9.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSZPMDo","preview":true,"priority":0,"id":92809},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvVu0i9","preview":false,"priority":0,"id":92826},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1tsoEJ","preview":false,"priority":0,"id":92827},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRXFSOq","preview":false,"priority":0,"id":92828},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUOTpba","preview":false,"priority":0,"id":92829},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYDvYqn","preview":false,"priority":0,"id":92830},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKs47JW","preview":false,"priority":0,"id":92831},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwU9rbJ","preview":false,"priority":0,"id":92832},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcU78m4","preview":false,"priority":0,"id":92833},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8ZPIGt","preview":false,"priority":0,"id":92834},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJDXzIK","preview":false,"priority":0,"id":92835},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVPQSho","preview":false,"priority":0,"id":92836},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGY9Pfe","preview":false,"priority":0,"id":92837},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4OewFx","preview":false,"priority":0,"id":92838},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiNUjuI","preview":false,"priority":0,"id":92839},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplE9WB7","preview":false,"priority":0,"id":92840},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpojJO2w","preview":false,"priority":0,"id":92841},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcqEovy","preview":false,"priority":0,"id":92842},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFuPlEq","preview":false,"priority":0,"id":92843},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8EgMSD","preview":false,"priority":0,"id":92844},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNey7Ir","preview":false,"priority":0,"id":92845},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1poNo7","preview":false,"priority":0,"id":92846},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdqoHcN","preview":false,"priority":0,"id":92847}],"comments":[],"ratingAverage":0,"label":"Kundenkonto / Warenkorb / Checkout Anpassungen APP","description":"<p>Mit dieser Shopware 6 APP können auf einfache Weise folgende Bereiche angepasst werden:</p><p><br /></p><h3>Kundenkonto Einstellungen\n</h3><br /><ul><li><b>Header Link Benutzer</b>  <br />Wenn der Benutzer nicht angemeldet ist, kann hier die <b>Verlinkung des Benutzer Icons</b>\ngeändert werden.<br />Optionen: Menü anzeigen (Shopware Standard) oder Direkt zur Anmeldeseite<br /></li><li><b>\"Meine Vorteile\" anzeigen\n</b><br />Aktiviert (Shopware Standard) oder <b>deaktiviert</b> die Anzeige der Vorteile auf der Anmeldeseite.</li><li><b>Newsletter anzeigen</b><br />Aktiviert (Shopware Standard) oder <b>deaktiviert</b> die Anzeige des Newsletters beim Benutzerkonto.</li><li><b>Kundennummer anzeigen</b><br /><b>Aktiviert</b> oder deaktiviert (Shopware Standard) die Anzeige der Kundennummer in der Übersicht beim Kundenkonto.</li><li><b>Die (Kundenkonto) Übersicht soll nicht angezeigt werden für</b><br />(Im Shopware Standard wird die Übersicht angezeigt)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) für diese Regel wird dann die Kundenkonto \"Übersicht\" in der Navigation\nausgeblendet.</li><li><b>Die persönliche Daten können nicht geändert werden von</b>: <br />(Im Shopware Standard können die persönlichen Daten nach der Registrierung (nachträglich) geändert werden)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) für diese Regel wird dann die Bearbeitung der Persönlichen Daten\nverhindert. Diese werden in der Navigation nicht mehr angezeigt.</li><li><b>Firmenname in den persönlichen Daten kann nicht geändert werden von:</b><br />(Im Shopware Standard kann der Firmenname nach der Registrierung (nachträglich) geändert werden)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen)  und die Bearbeitung des\nFirmennamens in den persönlichen Daten\nverhindert werden. Wurde noch kein Firmenname angegeben,\nkann dieser eingegeben, aber nicht mehr verändert werden.</li><li><b>Die Ust.-ID kann in den persönlichen Daten nicht geändert werden von:<br /></b>(Im Shopware Standard kann der Firmenname nach der Registrierung (nachträglich) geändert werden)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen)  und die Bearbeitung der Ust.-ID\nverhindert werden. <br />Wurde noch keine Ust.-ID angegeben, kann diese angegeben, aber nicht mehr verändert werden.</li><li><b>Die Zahlungsart kann nicht geändert werden von:<br /></b>(Im Shopware Standard kann der Zahlungsart im Kundenkonto geändert werden)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Bearbeitung der Zahlungsart verhindert\nwerden. Diese wird in der Navigation nicht mehr angezeigt.</li><li><b>Auswahl der Zahlungsart im Accountbereich verstecken für:<br /></b>(Im Shopware Standard wird die Zahlungsart im Kundenkonto angezeigt)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Anzeige Navigation \"Zahlungsart\" im Kundenkonto verhindert werden.</li><li><b>Die Rechnungsadresse kann nicht geändert werden von:</b><br />(Im Shopware Standard kann der Rechnungsadresse im Kundenkonto geändert werden)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Bearbeitung der Rechnungsadresse\nverhindert werden.</li><li><b>Die Lieferadresse kann nicht geändert werden von:</b><br />(Im Shopware Standard kann der Lieferadresse im Kundenkonto geändert werden)<br />Hier können Shopware Rule Builder Regeln eingetragen werden, (z.B. Kundengruppen) und die Bearbeitung der Lieferadressen verhindert werden.</li><li><b>Den Bereich \"Alle Adressen\" soll nicht angezeigt werden für:</b><br />(Im Shopware Standard können \"Alle Adressen\" im Kundenkonto angezeigt werden)<br />Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) und die Anzeige \"alle Adressen\" verhindert werden.</li></ul><p><br /></p><h3>Kundenkonto Bestellhistorie\n</h3><p><br /></p><ul><li><b>Zahlungsstatus von Bestellungen nicht anzeigen für:<br /></b>(Im Shopware Standard wird der Zahlungsstatus im Kundenkonto angezeigt)<br />Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) und die Anzeige des Zahlungsstatus bei der Bestellung im Kundenkonto verhindert werden.\n</li></ul><p><br /></p><h3>Firmenkunden Einstellungen\n</h3><p><br /></p><ul><li><b>Abteilung für Firmenkunden ausblenden</b><br /><b>Aktiviert </b>oder deaktiviert (Shopware Standard) die Anzeige der Abteilung in der Storefront<br /></li><li><b>Auswahl Gewerblich/Privat für angemeldete Kunden sperren</b><br /><b>Aktiviert </b>oder deaktiviert (Shopware Standard) die Anzeige der Abteilung in der Storefront<br />Das kommerzielle/private Auswahlfeld wird für bestehende Kunden nicht angezeigt.\n</li></ul><p><br /></p><h3>Warenkorb Einstellungen<br /></h3><p><br /></p><ul><li><b>Anzeige der Warenkorb Spalten auf der Bestellabschlussseite</b><br />Optionen: Menge - MwSt - Summe (Shopware Standard) oder <b>Menge - Einzelpreis - Summe (analog Warenkorb Übersicht)</b><br /></li><li><b>Artikelsuche anzeigen</b><br />Wenn aktiv (Shopware Standard), wird die Produktsuche unter dem Warenkorb angezeigt - kann mit dieser Option ausgeschalten werden.\n</li><li><b>Versandkostenberechung anzeigen\n</b><br />Wenn aktiv (Shopware Standard), wird der Link \"Versandkosten\" unter dem Warenkorb angezeigt- kann mit dieser Option ausgeschalten werden.</li><li><b>Gutschein anzeigen\n</b><br />Wenn aktiv (Shopware Standard), wird die Gutscheineingabe unter dem Feld \"Zusammenfassung\" rechts im\nWarenkorb und im offcanvas Warenkorb angezeigt kann mit dieser Option ausgeschalten werden.</li><li><b>Anzeige der Summe im Off-Canvas Warenkorb</b><br />Die Anzeige der Warenkorbsumme im Off-Canvas Warenkorb kann wie folgt beeinflusst werden:<br />Optionen: Nicht anzeigen (Shopware Standard) | Nicht anzeigen (Shopware Standard) | Nicht anzeigen (Shopware Standard)</li></ul><p><br /></p><h3>Checkout Einstellungen <br /></h3><p><br /></p><ul><li><b>Anzeige der Telefonnummer in der Adresse</b><br />Die Positionierung der Telefonnummer in der Rechnungs- und Lieferadresse kann hier geändert werden.<br />Optionen: Shopware Standard Anzeige | Am Ende der Adresse | keine Anzeige</li><li><b>Button \"Adresse ändern\" bei der Lieferadresse verstecken, wenn dies der Rechnungsadressen entspricht.\n            <br /></b>Wenn AKTIV, dann wird der Button \"Adresse ändern\" wird im Bestellprozess nicht mehr angezeigt,\n wenn die Lieferadresse der Rechnungsadresse entspricht und der Kunde \ndie Lieferadresse ändern möchte.</li><li><b>Button \"Versandart ändern\" anzeigen\n            <br /></b>Wenn nur eine Versandart möglich ist, kann hier die Anzeige des Buttons eingestellt\n                werden.</li><li><b>Anzeige der zusätzlichen Felder<br /></b>Die Positionierung der zusätzlichen Felder im Checkout kann hier geändert werden.<br />Optionen: Shopware Standard Anzeige | Unter Zahlungsart und Versandart anzeigen</li><li><b>Zusätzliches benutzerdefiniertes Feld anzeigen\n            <br /></b>Unter dem Text-Feld \"Zusätzliche Infomationen\" wird ein weiteres Text-Feld\n                angezeigt.<br />Gehen Sie zu Einstellungen &gt; Textbausteine &gt; wählen Sie die gewünschte Sprache\n                        aus &gt; suchen Sie nach \"acris\". \"AcrisAccountCartCheckoutApp.furtherInformationTitle\" wird für den\n                        Titel und \"AcrisAccountCartCheckoutApp.furtherInformationText\" für den Text verwendet.\n                    \n                    </li><li><b>Widerrufsbelehrung für folgende Gruppen nicht anzeigen:</b><br />(Im Shopware Standard wird die Widerrufsbelehung angezeigt)<br />Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) und die Anzeige des Widerrufsbelehrung im Checkout verhindert.\n</li></ul><p><br /></p><h3>Zusammenfassung im Warenkorb und im Checkout <br /></h3><p><br /></p><ul><li><b>Anzeige der Zusammenfassungs Spalten<br /></b>Die Anzeige der Zusammenfassungs Spalten kann hier geändert werden.<br />Option 1: Zwischensumme - Versandkosten - Gesamtsumme - Gesamtnettosumme- MwSt (Shopware Standard) <br />Option 2: Gesamtnettosumme - MwSt - Gesamtsumme - Versandkosten<br /></li><li><b>Die Anzeige der Zusammungsfassungs Spalten für folgende Gruppen anzeigen:<br /></b>Wenn Regeln zugwiesen werden, gilt die oben ausgewählte Ansicht <b>nur für \ndie ausgewählten Regeln</b>. Ansonsten ist die Ansicht für den ganzen Shop \ngültig.<br />Hier\nkönnen Shopware Rule Builder Regeln eingetragen werden, (z.B.\nKundengruppen) \n</li></ul><p><br /></p><h3>Zeichenbeschränkungen <br /></h3>Mit diesen Einstellungen können die Anzahl der Zeichen in der (Registrierung) in der Storefront eingestellt werden <br /><ul><li>Vorname: 35 Zeichen voreingestellt.</li><li>Nachname: 35 Zeichen voreingestellt.</li><li>Firma: 35 Zeichen voreingestellt.</li><li>Abteilung: 35 Zeichen voreingestellt.</li><li>Strasse: 35 Zeichen voreingestellt.</li><li>Postleitzahl: 40 Zeichen voreingestellt.</li><li>Ort: 40 Zeichen voreingestellt.</li><li>Telefonnummer: 30 Zeichen voreingestellt.</li><li>Adresszusatz 1: 35 Zeichen voreingestellt.</li><li>Adresszusatz 2: 35 Zeichen voreingestellt.<br /><br /></li></ul><p><br /></p><p></p>","installationManual":"<p>Das Plugin, wie in Shopware üblich, installieren. Danach stehen im Shopware Admin unter:<br />Erweiterungen &gt; Meine Erweiterungen &gt; ACRIS App Kundenkonto / Warenkorb / Checkout &gt; Konfiguration <br />zahlreiche Einstellungsmöglichkeiten zur Verfügung.<br /></p>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<p>Compatibility established with Shopware 6.5</p>","creationDate":{"date":"2023-03-19 08:41:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Adds email address and password lock in the personal data.</p>","creationDate":{"date":"2022-09-29 14:35:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Fixes a problem when the overview page of the account is displayed after login, although it has been locked.</p>","creationDate":{"date":"2022-07-08 07:15:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<ul><li>Store Release, Veröffentlichung</li></ul>","creationDate":{"date":"2022-07-04 08:52:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris24295756611","redirectToStore":false,"lowestPriceValue":9.9}