{"id":15524,"name":"SwkwebProductSet","code":"swkwe92693868713","lastChange":{"date":"2023-07-24 06:00:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzrn8sP","examplePageUrl":"","moduleKey":"SwkwebProductSet","creationDate":{"date":"2022-07-10 20:08:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-09-09 00:31:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-07-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-29 16:58:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":418,"prefix":"swkwe","name":"swkweb","website":"//swk-web.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpDXy4qp"},"infos":[{"id":27050,"name":"Set Konfigurator","description":"<p>Mit unserem Produkt Konfigurator Plugin können Sie Sets (auch unter Bundle, Gebinde oder Stücklisten bekannt), bestehend aus einzelnen Produkten, konfigurieren. Diese können entweder so eingestellt sein, dass der Kunde im Storefront nichts konfigurieren kann, oder aber der Kunde hat im Storefront die Auswahl und kann diese Sets in unterschiedlichen Konfigurationen seinem Warenkorb hinzufügen.</p>\n<p>Die Struktur der Sets läuft über sogenannte &quot;Slots&quot;, welchen Sie die gewünschten Produkte als Optionen zuordnen können. Zum Beispiel wäre ein Winterausrüstung Komplettset denkbar, mit den Slots &quot;Mütze&quot;, &quot;Jacke&quot;, &quot;Hose&quot; und &quot;Schuhe&quot;. Diesen werden dann die passenden Produkte als Optionen zugeordnet. Der Kunde kann anschließend im Storefront verschiedene Bestandteile wählen, wobei die entsprechenden Größen als Varianten der Produkte abbildbar sind. Sofern ein Set in einer anderen Konfiguration in den Warenkorb gelegt wird, wird dieses als neue Warenkorb Position hinzugefügt.</p>\n<p>Über die Preisberechnung kann gesteuert werden, mit welchem Preis die Optionen berechnet werden sollen. Dabei ist es möglich auf den Produktpreis oder andere Zusatzfelder, per Variable zuzugreifen. Bei dem Produktpreis wird der entsprechende Staffelpreis berücksichtigt.</p>\n<p>Egal ob für die passende Winterausrüstung, die perfekte Mode-Kombination oder einen Lebensmittelkorb - fügen Sie die passenden Produkte zu einem Set zusammen und bieten Sie Ihren Kunden Vorteile. Überzeugen Sie Ihre Kunden mit passenden Angeboten und profitieren Sie von größeren Warenkörben.</p>\n<p>Eine einfache Verwaltung, maximale Flexibilität für den Shopbetreiber und eine komfortable, intuitive Nutzung für den Kunden im Storefront, haben für uns bei der Entwicklung und Weiterentwicklung die höchste Priorität. Sofern Sie hier konkrete Vorschläge zur Verbesserung haben, schreiben Sie uns gerne an.</p>\n<h2>Beispiele für unseren Produkt Konfigurator</h2>\n<h3>.. für Mode</h3>\n<p>Sie können Ihre Kunden die schönsten Outfits zusammenstellen lassen. Egal ob für die Hochzeit, einen Ski-Urlaub oder jedes andere Thema.</p>\n<h3>.. für Technik Themen</h3>\n<p>Zum Beispiel können Sie einen PC Konfigurator erstellen, um Kunden die Zusammenstellung von Ihrem Wunsch Computer zu vereinfachen.</p>\n<h3>.. für die Lebensmittelbranche</h3>\n<p>Gerade in der Lebensmittelbranche können Sie das Bundle optimal verwenden. So können Sie z.B. ganze Kochrezepte als Pakete schnüren oder ein Käse-Feinkost-Paket konfigurieren lassen. Hier wird der Fantasie keine Grenze gesetzt.</p>\n<h3>.. für die Freizeitbranche</h3>\n<p>Egal ob Spielzeug für Kinder, Freizeitartikel für Mann und Frau, mit guten Angeboten generieren Sie sicherlich größere Warenkörbe und haben eine höhere Conversion-Rate.</p>\n<h3>.. für viele weitere Themen</h3>\n<p>Es gibt so viele verschiedene Onlineshops mit vielen Bedürfnissen. Wir sind sicher das auch Ihr Onlineshop die passenden Angebote mit dem Produkt Konfigurator anbieten kann. Und falls nicht, schreiben Sie uns! Wir hören uns gerne Ihr Anliegen an.</p>\n<p>Wir nehmen gerne Aufträge für die Umsetzung neuer Features an.</p>\n<p>Schreiben Sie uns einfach wenn Sie Fragen, Anregungen oder konkrete Wünsche haben. Wir freuen uns auf Ihre Nachricht!</p>\n<h2>Fragen? Kontaktieren Sie uns</h2>\n<p>E-Mail:  support@swk-web.com\nTelefon: +49 176 7040 4000</p>\n","installationManual":"<h2>tl;dr</h2><ul><li>Navigiere in der Administration zu \"Katalog -&gt; Produkt Sets -&gt; Set hinzufügen\"</li><li>Geben Sie dem Set einen Namen und erstellen nach dem initialen Speichern die gewünschten Slots in dem Tab \"Slots\"</li><li>Weißen Sie Slots die gewünschten Produkte zu und stellen alle relevanten Optionen wie gewünscht ein</li><li>Wenn Sie Erlebniswelten nutzen möchten, benötigen Sie ein eigenes Layout welches angepasst werden kann. Hier können Sie entweder den Set Konfigurator in der Buy-Box anzeigen oder alternativ als eigenes Element, aus der Kategorie \"Commerce\", hinzufügen. Sofern kein Layout zum Einsatz kommt, wird der Konfigurator in der Buy-Box angezeigt</li><li>Weisen Sie das Set einem Produkt zu und schauen Sie sich diese im Storefront an</li></ul><h2>Set anlegen</h2><ol><li>Navigieren Sie in der Administration zu \"Kataloge -&gt; Produkt Sets\"</li><li>Erstellen Sie ein neues Set Produkt über den blauen Button oben rechts \"Set hinzufügen\"</li><li>Im Tab \"Allgemeine Einstellungen\" können Sie dem Set einen Namen geben und entscheiden ob der Preis des Set-Produkts (Mantelprodukt / Hauptprodukt) mit in den Gesamtpreis der Set Konfiguration einberechnet werden soll. Speichern Sie anschließend. Nun können Sie im Reiter \"Slots\" die gewünschten Slots anlegen. Im Reiter \"Zuweisungen\" können Sie Produkte die das konfigurierte Set ausgewählt haben einsehen</li></ol><h2>Slots</h2><ol><li>Über den Button \"Slot hinzufügen\" können Sie eine beliebige Anzahl von Slots erstellen</li><li>Slot Name vergeben</li><li>Slot Einstellungen (siehe \"Erweiterte Einstellungen anzeigen\", um alle Einstellungen des Slots anzeigen zu lassen)\n<ul><li>Slot Template: Wähle ein Template, dass für das Aussehen des Slots verantworlich ist. Hierbei ist nicht jedes Slot Template für jede Konfiguration sinnvoll. Probieren Sie einfach aus, was für Ihren Anwendungsfall am besten passt</li><li>Produktbeschreibung anzeigen: Diese Einstellung ist nur bei sinnvollen Slot Templates zu sehen (auf 100 Zeichen beschränkt)</li><li>Modal: Hier können Sie auswählen ob bei den Produkten ein kleines Info-Icon angezeigt wird, über welches sich ein Modal-Fenster (Popup) öffnet. Dabei kann man einstellen ob die Produktinformationen als Inhalt Inhalt geladen werden sollen. Alternativ kann man eine individuelle URL hinterlegen, die als Inhalt geladen wird</li><li>Akkordeon: Stellen Sie ein ob Sie eine Akkordeon Funktionalität für diesen Slot nutzen wollen. Dabei können Sie das Akkordeon nach dem laden der Seite direkt geöffnet angezeigt lassen oder geschlossen</li><li>Minimale Auswahl: Hier können Sie einstellen, wie viele Produkte in diesem Slot ausgewählt werden müssen. Wenn Sie die minimale Auswahl auf \"0\" stellen, wird der Slot als optional gekennzeichnet</li><li>Maximale Auswahl: Stellen Sie ein wie viele Produkte in diesem Slot maximal ausgewählt werden können</li><li>Sofern die Minimale Auswahl der Maximalen Auswahl entspricht und nur entsprechend viele Produkte zugewiesen sind, kann der Kunde keine Auswahl treffen</li><li>Optionen Mengenauswahl in Auswahl Limit mit einbeziehen: Sofern aktiviert werden die Anzahlen der ausgewählten Optionen bei der Mindest- oder Maximalen Auswahl eingerechnet. Zusätzlich wird auch die Minimale- und Maximale Auswahl der Optionen angepasst, sodass diese kleiner gleich der maximal gewählten Optionen sind</li><li>Preisberechnung: Hier können Sie eine Preisberechnung für den Slot einstellen welcher für die zugewiesenen Optionen als Grundlage verwendet wird</li><li>Button \"Option (Produkt) hinzufügen\" siehe nächster Punkt</li></ul></li></ol><h3>Optionen (Produkte) hinzufügen</h3><ol><li>Innerhalb eines Slots können Sie ganz unten auf den blauen Button \"Option (Produkt) hinzufügen\" klicken</li><li>Dabei öffnet sich ein Modal Fenster in dem Sie folgende Einstellungen vornehmen können\n<ul><li>Name: Angezeigter Name des Produkts innerhalb des Slots. Dies kann optional befüllt werden. Ansonsten wird der normale Produktname verwendet</li><li>Produkt: Wählen Sie ein Produkt aus Ihrem Sortiment über das Dropdown</li><li>Preisberechnung: Wenn Sie wünschen, können Sie jedem hinzugefügten Produkt über ein Dropdown eine eigene Preisberechnung zuweisen oder auch eine neue Preisberechnung erstellen. Siehe Überschrift \"Preisberechnung\" weiter unten für genauere Informationen</li><li>Minimale Auswahl: Wählen Sie aus, wie oft das Produkt minimal ausgewählt werden muss.</li><li>Maximale Auswahl: Wählen Sie aus wie oft das Produkt maximal ausgewählt werden kann</li><li>Auswahl Schritt Größe: Stellen Sie in welchen Schritten das Produkt ausgewählt werden kann. Wenn Sie zum Beispiel \"3\" wählen, kann man im Dropdown 3, 6, 9, usw. Produkte auswählen</li><li>Sofern die Minimale Auswahl der Maximalen Auswahl entspricht kann der Kunde keine Anzahl wählen, stattdessen wird das Produkt mit der gewählten Anzahl in die Konfiguration aufgenommen</li></ul></li></ol><h2>Preisberechnung</h2><p>Mit der Preisberechnung ist es möglich zu steuern, mit welchem Preis die Option bzw. das Produkt in den Gesamtpreis des Sets eingeht. In der Formel wird der netto Preis für die jeweilige Option berechnet. Auf diesen Preis werden dann, je nach derzeitiger Shop Konfiguration, die Steuern und andere Shopware Aufschläge gerechnet. Sofern eine Option im Storefront gewählt wird, wird zu dem Gesamtpreis des Sets der hierbei berechnete Wert addiert. Dieser Wert kann am Ende positiv oder negativ sein.\nAchtung: Bei der Konfiguration sollte beachtet werden, dass im Endergebnis bei Set Produkten keine negativen Preise herauskommen können.</p><p>Unter \"Einstellungen -&gt; Erweiterungen -&gt; Produkt Set Preisberechnung\" ist es möglich weitere Preisberechnungen festzulegen. Die angelegten Formeln, können in jedem Slot oder auch individuell pro Option verwendet werden. Wenn nichts ausgewählt ist, wird automatisch die Formel product.unitPrice als Fallback verwendet.</p><p>In den Formeln der Preisberechnung, können Zahlen sowie vordefinierte Variablen verwendet werden. Die Variablen werden je nach gewählter Option, bzw. dem dahinterliegenden Produkt berechnet. Desweiteren können folgende arithmetische Operatoren verwendet werden: +, -, *, /, ^. Diese werden in der Standard Rangfolge ausgeführt. Um die Berechnungsreihenfolge zu ändern können runde Klammern verwendet werden. Für weitere Informationen siehe hier: https://de.wikipedia.org/wiki/Operatorrangfolge</p><h3>Folgende Aliasse können verwendet werden:</h3><ul><li>\nproduct.unitPrice ist der netto Preis des jeweiligen Optionen-Produktes, wobei die Staffelpreise berücksichtigt werden</li><li>\nproduct.customFields.* Alle Zusatzfelder des Produkts, die einen numerischen Wert enthalten, sind unter ihrem technischen Namen verfügbar. Es wird empfohlen, dass Sie bei der Verwendung von Zusatzfeldern immer die FALLBACK()-Funktion nutzen, um einen Standardwert festzulegen. Beispiel: FALLBACK(product.customFields.product_set_relative_discount, 1)\n</li></ul><h3>Folgende Funktionen können verwendet werden:</h3><ul><li>\nPRICE(grossPrice) Ermöglicht es einen Bruttopreis in der Standard-Währung über einen statischen Wert anzugeben. Die Funktion stellt sicher, dass der Währungsfaktor und der Steuersatz des Produktes richtig angewendet werden. Beispiel: product.unitPrice - PRICE(9.99)\n</li><li>\nFALLBACK(value1, value2, ...) Gibt den ersten Wert zurück, der nicht leer ist. Diese Funktion kann insbesondere dazu genutzt werden, um für Aliasse, die nicht immer gesetzt sind, einen Standardwert zu definieren. Beispiel: product.unitPrice*FALLBACK(product.customFields.product_set_discount, product.customFields.product_set_discount_2, 1)\n</li><li>\nMIN(value1, value2, ...) Gibt den kleinsten Wert zurück.</li><li>\nMAX(value1, value2, ...) Gibt den größten Wert zurück.</li><li>\nFLOOR(value) Rundet den Wert ab.</li><li>\n\n\nCEIL(value) Rundet den Wert auf.</li><li>\"FLOOR(value * 100) / 100\" Rundet den Wert auf zwei Dezimalstellen auf.<br></li></ul><h2>Dokumente, E-Mail Templates (Bestellungs-Export)</h2><p>Eine detailierte Anleitung dazu finden Sie hier: https://md.swk-web.com/s/Y4SF46Svt#<a href=\"https://markdownpastebin.com/?id=0d944f22dac9402eb2ae8c806fa7d0fe\" target=\"_blank\" rel=\"noreferrer\"><br></a><br>Für die Rechnung (PDF Dokument), muss die Einstellung \"Bestellpositions-Filter (Dokumente)\" angepasst werden.<br>Dabei kann entschieden werden, welche Positionen (lineItems) von dem Set Produkt auf der Rechnung geladen werden. Dies ist auch für folgende Bereiche möglich: HTML E-Mails, Plain Text E-Mails, API<br><br></p><h3>Erklärung der einzelnen Filter</h3><p><b>Set Position</b>: Name von dem konfigurierten Set<br><b>Set-Produkt Position</b>: Name von dem Hauptprodukt, welchem das Set Produkt zugewiesen ist<br><b>Slot Position</b>:&nbsp; Name des Slot<br><b>Option Position</b>: Name der Option<br><b>Optionen-Produkt Position</b>: Name des Produkts, welches für diese Option hinterlegt ist<br><br></p>\n\n","shortDescription":"Komfortable Verwaltung von dynamischen Produkt Sets bzw. Bundles oder festen Stücklisten, mit Shopware Varianten Support. Die Preisgestaltung der Bestandteile ist über Formeln möglich.","highlights":"Ihre Kunden können selbst konfigurierte Set Produkte in den Warenkorb legen\nDynamische Preisberechnung: Die Preise der Set Optionen können mit eigenen Formeln berechnet werden\nFlexible Rabatte: Durch die Preisberechnung können Sie sehr leicht allgemeine Rabatte wie z.B. 10% auf den Produkt Preis definieren\nModernes ansprechendes Design. Für jeden Slot eigene Templates einstellbar. Für Frontend Entwickler einfach zu erweitern.\nEinfache Verwaltung der Sets über die Administration","features":"Automatische Berechnung des Gesamtpreises von einem Set Produkt im Storefront\nDefinition abweichender Preise pro Slot oder Option basierend auf dem gewählten Produkt\nAktualisierung des Bildes innerhalb eines Slots, je nach Auswahl des Produkts\nZu jedem Slot kann eine Modal-URL angegeben werden, womit man beliebige Seiten einbinden kann oder Details zu dem jeweiligen Produkt laden lassen kann\nSlots können als optional markiert werden (Minimale Auswahl auf 0)\nDynamische oder feste Stückzahl Auswahl pro Option\nSortierung von Slots in der Administration und können unterschiedlich gestaltet werden"},{"id":27051,"name":"Set configurator","description":"<p>With our product configurator plugin you can configure sets (also known as bundles or parts lists) consisting of individual products. These can either be set such that the customer can configure nothing in the storefront, or the customer has the choice what should be included in which quantity. Additionally these sets can be added in different configurations to the same shopping cart.</p>\n<p>The structure of the sets is based on so-called &quot;slots&quot;, to which you can assign the desired products as options. For example, a complete set of winter equipment would be possible with the slots &quot;hat&quot;, &quot;jacket&quot;, &quot;trousers&quot; and &quot;shoes&quot;. The matching products are then assigned to these as options. The customer can then select different components in the storefront, with the corresponding sizes mapped as variants of the products. If a set is added to the shopping cart in a different configuration, it will be added as a new shopping cart item.</p>\n<p>The price calculation can be used to control the price with which the options are to be calculated.It is possible to access the product price or other additional fields via variables. The corresponding graduated price is taken into account in the product price.</p>\n<p>Whether for the right winter equipment, the perfect fashion combination or a food basket - combine the right products into a set and offer your customers advantages. Convince your customers with suitable offers and benefit from larger shopping baskets.</p>\n<p>Easy administration, maximum flexibility for the shop operator and a comfortable, intuitive use for the customer in the storefront, have the highest priority for us in the development and further development. If you have any specific suggestions for improvement, please feel free to contact us.</p>\n<h2>Examples for our product configurator</h2>\n<h3>... for fashion</h3>\n<p>You can let your customers put together the most beautiful outfits. Whether it's for a wedding, a ski vacation or any other theme.</p>\n<h3>... for technology topics</h3>\n<p>For example, you can create a PC configurator to make it easy for customers to put together the computer they want.</p>\n<h3>.. for the food industry</h3>\n<p>Especially in the food industry you can use the bundle optimally. For example, you can create entire cooking recipes as bundles or have a cheese and delicatessen package configured. There is no limit to your imagination here.</p>\n<h3>... for the leisure industry</h3>\n<p>Whether toys for children, leisure articles for men and women, with good offers you are sure to generate larger shopping baskets and have a higher conversion rate.</p>\n<h3>... for many other topics</h3>\n<p>There are so many different online stores with many needs. We are sure that your online store can also offer the right deals with the product configurator. And if not, write us! We will be happy to listen to your request.</p>\n<p>We are happy to accept orders for the implementation of new features.</p>\n<p>Just write us if you have any questions, suggestions or specific requests. We are looking forward to your message!</p>\n<h2>Questions? Contact us</h2>\n<p>e-mail: support@swk-web.com\nPhone: +49 176 7040 4000</p>\n","installationManual":"<h2>tl;dr</h2><ul><li>Navigate in the administration to \"Catalogues -&gt; Product Sets -&gt; Add Set\"</li><li>Give the set a name. Create the desired slots in the \"Slots\" tab</li><li>Assign products as options to the slots and configure the relevant options if needed</li><li>If your product uses a shopping experiences layout, you need a custom layout. If you do not have one already duplicate the default product layout, and either configure the buy-box to display the set configurator or add the set configurator as separate element from the commerce category. For products with no assigned layout the configurator will be displayed in the buy-box</li><li>Assign the set configurator to a product and check out the product in the storefront</li></ul><h2>Create a set</h2><ol><li>Navigate in the administration to \"Catalogues -&gt; Product Sets\"</li><li>Create a new set product using the blue button \"Add Set\" in the upper right corner</li><li>In the tab \"General settings\" you can give the set a name and decide if the price of the set product (cover product / main product) should be included in the total price of the set configuration. Then save your settings. Now you can create the desired slots in the \"Slots\" tab. In the \"Assignments\" tab you can view the products that have selected the configured set.</li></ol><h2>Slots</h2><ol><li>Via the button \"Add slot\" you can create an arbitrary amount of slots</li><li>Assign slot name</li><li>Slot settings (Click \"Show advanced settings\" to show all settings of the slot)\n<ul><li>Slot Template: Choose a template that is responsible for the appearance of the slot. Not every slot template is useful for every configuration. Just try out what fits best for your use case</li><li>Show product description: This setting is only visible for slot templates where it is reasonable (limited to 100 characters).</li><li>Modal: Here you can select whether a small info icon is displayed for the products, which opens a modal window (popup). Here you can set whether the product information should be loaded as content. Alternatively, you can define an individual URL, which is loaded as content.</li><li>Accordion: Set if you want to use an accordion functionality for this slot. Thereby you can have the accordion displayed directly open after loading the page or collapsed.</li><li>Minimum selection: Here you can set how many products must be selected in this slot. If you set the minimum selection to \"0\", the slot will be marked as optional</li><li>Maximum selection: Set the maximum number of products that can be selected in this slot</li><li>If the minimum and maximum selection have been configured to the same amount and only that number of options are assigned the customer cannot select or deselect options, only quantities of options can be configured</li><li>Include options quantity selection in selection limit: If enabled, the numbers of the selected options will be included in the minimum or maximum selection. In addition, the minimum and maximum selection of options will also be adjusted so that they are less than or equal to the maximum selected options.</li><li>Price calculation: Choose a price calculation valid for the slot if not specified different for the options</li><li>Add option (product) button see the next point</li></ul></li></ol><h3>Add options (products)</h3><ol><li>Within a slot you can click the blue button \"Add option (product)\" at the very bottom of the slot</li><li>This will open a modal window where you can make the following settings\n<ul><li>Name: Displayed name of the product within the slot. This can be filled optionally. Otherwise the normal product name is used instead</li><li>Product: Choose a product from your assortment using the dropdown</li><li>Price calculation: If you wish, you can assign a custom price calculation to each added product via dropdown, or create a new price calculation. See the heading \"Price calculation\" below for more detailed information</li><li>Minimum selection: Select how many times the product must be selected</li><li>Maximum selection: Select how many times the product can be selected maximum</li><li>Selection Step Size: Set in which steps the product can be selected. For example, if you select \"3\", in the dropdown you can select 3, 6, 9, etc. products</li><li>If the minimum selection equals the maximum selection the customer cannot choose the quantity but rather the configured quantity is used</li></ul></li></ol><h2>Price calculation</h2><p>With the price calculation it is possible to control with which price the product of an assigned option is included in the total price of the set. The formula calculates the net price for each option. On this price, depending on the current store configuration, taxes and other Shopware surcharges are calculated. If this option is selected in the storefront, the calculated value is added to the total price of the set. This value can be positive or negative in the end.\nCaution: When configuring, it should be noted that the end result for set products cannot be negative prices.</p><p>In \"Settings -&gt; Extensions -&gt; Product set price calculation\" it is possible to define the further price calculations. The created formulas, can be selected in each slot or individually for each option. If nothing is selected directly, the default price calculation with the formula 'product.unitPrice' is used as fallback.</p><p>Numbers and predefined variables can be used in the price calculation formulas The variables which are calculated depending on the selected option or the underlying product. Furthermore, the following arithmetic operators can be used: +, -, *, /, ^. These are executed in the default ranking order. Round brackets can be used to change the calculation order. For more information see here: https://en.wikipedia.org/wiki/Order_of_operations</p><h3>The following aliases can be used:</h3><ul><li>\nproduct.unitPrice is the net price of the given option product, taking into account the scale prices.</li><li>\nproduct.customFields.* All additional fields of the product that contain a numeric value are available under their technical name. It is recommended that you always use the FALLBACK() function to set a default value when using additional fields. Example: product.customFields.product_set_discount\n</li></ul><h3>The following functions can be used:</h3><ul><li>\nPRICE(grossPrice) Allows to specify a gross price in the default currency using a static value. The function ensures that the currency factor and the tax rate of the product are applied correctly. Example: PRICE(9.99)\n</li><li>\nFALLBACK(value1, value2, ...) Returns the first value that is not empty. This function can be used especially to define a default value for aliases which are not always set. Example: FALLBACK(product.customFields.product_set_discount, product.customFields.product_set_discount_2, 0)\n</li><li>\nMIN(value1, value2, ...) Returns the smallest value.</li><li>\nMAX(value1, value2, ...) Returns the largest value.</li><li>\nFLOOR(value) Round off the value.</li><li>\nCEIL(value) Round up the value.</li></ul><p><br></p><h2>Documents, e-mail templates (order export)</h2><p><br>You can find detailed instructions here: https://md.swk-web.com/s/Y4SF46Svt#<br><br>For the invoice (PDF document), the setting \"Order item filter (documents)\" must be adjusted.<br>Here you can decide which items (lineItems) are loaded from the set product on the invoice. This is also possible for: HTML e-mails, Plain Text e-mails, API<br><br></p><h3>Explanation of each filter</h3><p><b>Set Position:</b> name of the configured set<br><b>Set Product Position</b>: name of the main product to which the set product is assigned<br><b>Slot Position</b>: name of the slot<br><b>Option Position</b>: name of the option<br><b>Option Product Position</b>: name of the product which is assigned to this option<br></p>\n","shortDescription":"Comfortable management of dynamic product sets, i.e. bundles or fixed parts lists with Shopware variant support. The pricing of the set components can be managed via formulas.","highlights":"Your customers can put self-configured set products in the shopping cart\nDynamic price calculation: The prices of the set options can be calculated with your own formulas.\nFlexible discounts: With the price calculation you can easily define general discounts such as 10% on the product price\nModern attractive design. Individual templates can be set for each slot. Easy to extend for frontend developers.\nEasy management of the sets via the administration","features":"Automatic calculation of the total price of set products in the storefront\nDefinition of deviating prices for each slot or option based on the assigned product\nUpdate of the image within a slot, depending on the selection of the product\nA modal URL can be specified for each slot, with which any page can be integrated or details about the respective product can be displayed\nSlots can be marked as optional (minimum selection set to 0)\nVariable or fixed quantity selection for each set option (products)\nSlots can be sorted in the administration and have different style options"}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166054,"bookingKey":"swkwe92693868713","bookingText":"Product set and parts list configurator","price":399,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":166053,"bookingKey":"swkwe92693868713_M","bookingText":"Product set and parts list configurator","price":49,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169459,"bookingKey":"swkwe92693868713_M12","bookingText":"Set configurator","price":499,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php188tyk","preview":true,"priority":150,"id":93189},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpw6XVHZ","preview":false,"priority":150,"id":94450},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php67tgm9","preview":false,"priority":140,"id":94448},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIHqM23","preview":false,"priority":130,"id":94449},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7peGaA","preview":false,"priority":120,"id":94446},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYm5gaU","preview":false,"priority":110,"id":94445},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPMJYou","preview":false,"priority":100,"id":94447},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphtCUsL","preview":false,"priority":90,"id":94444},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphrY7tG","preview":false,"priority":80,"id":94443},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLHcR0t","preview":false,"priority":70,"id":94441},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXan4lE","preview":false,"priority":60,"id":94440},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYPImO1","preview":false,"priority":50,"id":94442},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpv9kVe0","preview":false,"priority":0,"id":97020}],"comments":[{"authorName":"Manuel","text":"Wir haben das Plugin schon in früheren Shopware 5 Installationen genutzt. Nun setzen wir es auch in Shopware 6 ein. Sehr gut funktionierendes Plugin mit einem Support der einfach nur perfekt ist. Fragen zum Plugin werden schnell, ausführlich und absolut verständlich  beantowrtet.","headline":"Tolles Plugin &amp; super Support","creationDate":{"date":"2023-07-24 06:00:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Benutzer","text":"","headline":"Sehr guter Konfigurator","creationDate":{"date":"2023-06-23 09:07:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Lucas","text":"Wir verwenden das Plugin zur Darstellung von Set-Artikeln in gesonderter Form. Der Support reagiert sehr schnell auf Anfragen, ist unfassbar hilfsbereit &amp; lösungsorientiert. Weiter so! Tolles Plugin!","headline":"Top Plugin, toller Support!","creationDate":{"date":"2023-05-10 14:44:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Mark A.","text":"sehr gutes Plugin ! Sehr guter Support!","headline":"top","creationDate":{"date":"2023-05-01 16:29:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Roy Andre Tollefsen","text":"Very flexible feature set, especially the pricing engine. Easy to customize. We've tried most such plugins, and can recommend this to everyone needing flexible bundle / package / product set functionality.","headline":"Best package / product set plugin out there","creationDate":{"date":"2022-12-26 22:35:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Elmar Gasser","text":"Das Plugin hat genau unseren Anforderungen entsprochen. Die shopspezifischen Anpassungen konnten einwandfrei angepasst werden. Fragen wurden schnell beantwort. Wir können das Plugin weiterempfehlen.","headline":"Unser Kunde und wir als Agentur waren sehr zufrieden","creationDate":{"date":"2022-11-16 17:02:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Daniel Quartier","text":"Wir setzen das Plugin bereits seit Shopware 5 erfolgreich ein. Nun auch unter Shopware 6. Es funktioniert fehlerfrei wie erwartet. Wenn es mal irgendwo hakt gibt es schnellen und guten Support. Weiter so!","headline":"Funktion und Support super!","creationDate":{"date":"2022-10-13 11:21:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Stephan Franck","text":"Das Plugin ermöglicht es uns, individuelle Sets von Artikeln für einen individuellen Preis anzubieten. Hierbei sind die Konfigurationsmöglichkeiten sehr durchdacht und können auch sehr komplex eingestellt werden. All unsere Anforderungen für ein Set Produkt können damit abgedeckt werden. Die Möglichkeit, auf den Kunden zugeschnittene Set-Produkte zu bestellen, wird von unseren Kunden gern und häufig genutzt. Eine Anbindung an unser ERP welches die Einzelprodukte pro Set dem Picker anzeigt, war ohne Probleme möglich. Nicht verfügbare Optionen werden live nach Lagerbestand angezeigt und können nach Verfügbarkeit gewählt werden, was einen absoluten Vorteil zu fertig zusammengestellten Sets im Lager bietet. Der Support vom Hersteller ist wie immer tadellos und Änderungswünsche wurden schnell und unkompliziert umgesetzt.","headline":"Sehr gute Erweiterung für Produkte","creationDate":{"date":"2022-09-12 10:53:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Set Konfigurator","description":"<p>Mit unserem Produkt Konfigurator Plugin können Sie Sets (auch unter Bundle, Gebinde oder Stücklisten bekannt), bestehend aus einzelnen Produkten, konfigurieren. Diese können entweder so eingestellt sein, dass der Kunde im Storefront nichts konfigurieren kann, oder aber der Kunde hat im Storefront die Auswahl und kann diese Sets in unterschiedlichen Konfigurationen seinem Warenkorb hinzufügen.</p>\n<p>Die Struktur der Sets läuft über sogenannte \"Slots\", welchen Sie die gewünschten Produkte als Optionen zuordnen können. Zum Beispiel wäre ein Winterausrüstung Komplettset denkbar, mit den Slots \"Mütze\", \"Jacke\", \"Hose\" und \"Schuhe\". Diesen werden dann die passenden Produkte als Optionen zugeordnet. Der Kunde kann anschließend im Storefront verschiedene Bestandteile wählen, wobei die entsprechenden Größen als Varianten der Produkte abbildbar sind. Sofern ein Set in einer anderen Konfiguration in den Warenkorb gelegt wird, wird dieses als neue Warenkorb Position hinzugefügt.</p>\n<p>Über die Preisberechnung kann gesteuert werden, mit welchem Preis die Optionen berechnet werden sollen. Dabei ist es möglich auf den Produktpreis oder andere Zusatzfelder, per Variable zuzugreifen. Bei dem Produktpreis wird der entsprechende Staffelpreis berücksichtigt.</p>\n<p>Egal ob für die passende Winterausrüstung, die perfekte Mode-Kombination oder einen Lebensmittelkorb - fügen Sie die passenden Produkte zu einem Set zusammen und bieten Sie Ihren Kunden Vorteile. Überzeugen Sie Ihre Kunden mit passenden Angeboten und profitieren Sie von größeren Warenkörben.</p>\n<p>Eine einfache Verwaltung, maximale Flexibilität für den Shopbetreiber und eine komfortable, intuitive Nutzung für den Kunden im Storefront, haben für uns bei der Entwicklung und Weiterentwicklung die höchste Priorität. Sofern Sie hier konkrete Vorschläge zur Verbesserung haben, schreiben Sie uns gerne an.</p>\n<h2>Beispiele für unseren Produkt Konfigurator</h2>\n<h3>.. für Mode</h3>\n<p>Sie können Ihre Kunden die schönsten Outfits zusammenstellen lassen. Egal ob für die Hochzeit, einen Ski-Urlaub oder jedes andere Thema.</p>\n<h3>.. für Technik Themen</h3>\n<p>Zum Beispiel können Sie einen PC Konfigurator erstellen, um Kunden die Zusammenstellung von Ihrem Wunsch Computer zu vereinfachen.</p>\n<h3>.. für die Lebensmittelbranche</h3>\n<p>Gerade in der Lebensmittelbranche können Sie das Bundle optimal verwenden. So können Sie z.B. ganze Kochrezepte als Pakete schnüren oder ein Käse-Feinkost-Paket konfigurieren lassen. Hier wird der Fantasie keine Grenze gesetzt.</p>\n<h3>.. für die Freizeitbranche</h3>\n<p>Egal ob Spielzeug für Kinder, Freizeitartikel für Mann und Frau, mit guten Angeboten generieren Sie sicherlich größere Warenkörbe und haben eine höhere Conversion-Rate.</p>\n<h3>.. für viele weitere Themen</h3>\n<p>Es gibt so viele verschiedene Onlineshops mit vielen Bedürfnissen. Wir sind sicher das auch Ihr Onlineshop die passenden Angebote mit dem Produkt Konfigurator anbieten kann. Und falls nicht, schreiben Sie uns! Wir hören uns gerne Ihr Anliegen an.</p>\n<p>Wir nehmen gerne Aufträge für die Umsetzung neuer Features an.</p>\n<p>Schreiben Sie uns einfach wenn Sie Fragen, Anregungen oder konkrete Wünsche haben. Wir freuen uns auf Ihre Nachricht!</p>\n<h2>Fragen? Kontaktieren Sie uns</h2>\n<p>E-Mail:  support@swk-web.com\nTelefon: +49 176 7040 4000</p>","installationManual":"<h2>tl;dr</h2><ul><li>Navigiere in der Administration zu \"Katalog -&gt; Produkt Sets -&gt; Set hinzufügen\"</li><li>Geben Sie dem Set einen Namen und erstellen nach dem initialen Speichern die gewünschten Slots in dem Tab \"Slots\"</li><li>Weißen Sie Slots die gewünschten Produkte zu und stellen alle relevanten Optionen wie gewünscht ein</li><li>Wenn Sie Erlebniswelten nutzen möchten, benötigen Sie ein eigenes Layout welches angepasst werden kann. Hier können Sie entweder den Set Konfigurator in der Buy-Box anzeigen oder alternativ als eigenes Element, aus der Kategorie \"Commerce\", hinzufügen. Sofern kein Layout zum Einsatz kommt, wird der Konfigurator in der Buy-Box angezeigt</li><li>Weisen Sie das Set einem Produkt zu und schauen Sie sich diese im Storefront an</li></ul><h2>Set anlegen</h2><ol><li>Navigieren Sie in der Administration zu \"Kataloge -&gt; Produkt Sets\"</li><li>Erstellen Sie ein neues Set Produkt über den blauen Button oben rechts \"Set hinzufügen\"</li><li>Im Tab \"Allgemeine Einstellungen\" können Sie dem Set einen Namen geben und entscheiden ob der Preis des Set-Produkts (Mantelprodukt / Hauptprodukt) mit in den Gesamtpreis der Set Konfiguration einberechnet werden soll. Speichern Sie anschließend. Nun können Sie im Reiter \"Slots\" die gewünschten Slots anlegen. Im Reiter \"Zuweisungen\" können Sie Produkte die das konfigurierte Set ausgewählt haben einsehen</li></ol><h2>Slots</h2><ol><li>Über den Button \"Slot hinzufügen\" können Sie eine beliebige Anzahl von Slots erstellen</li><li>Slot Name vergeben</li><li>Slot Einstellungen (siehe \"Erweiterte Einstellungen anzeigen\", um alle Einstellungen des Slots anzeigen zu lassen)\n<ul><li>Slot Template: Wähle ein Template, dass für das Aussehen des Slots verantworlich ist. Hierbei ist nicht jedes Slot Template für jede Konfiguration sinnvoll. Probieren Sie einfach aus, was für Ihren Anwendungsfall am besten passt</li><li>Produktbeschreibung anzeigen: Diese Einstellung ist nur bei sinnvollen Slot Templates zu sehen (auf 100 Zeichen beschränkt)</li><li>Modal: Hier können Sie auswählen ob bei den Produkten ein kleines Info-Icon angezeigt wird, über welches sich ein Modal-Fenster (Popup) öffnet. Dabei kann man einstellen ob die Produktinformationen als Inhalt Inhalt geladen werden sollen. Alternativ kann man eine individuelle URL hinterlegen, die als Inhalt geladen wird</li><li>Akkordeon: Stellen Sie ein ob Sie eine Akkordeon Funktionalität für diesen Slot nutzen wollen. Dabei können Sie das Akkordeon nach dem laden der Seite direkt geöffnet angezeigt lassen oder geschlossen</li><li>Minimale Auswahl: Hier können Sie einstellen, wie viele Produkte in diesem Slot ausgewählt werden müssen. Wenn Sie die minimale Auswahl auf \"0\" stellen, wird der Slot als optional gekennzeichnet</li><li>Maximale Auswahl: Stellen Sie ein wie viele Produkte in diesem Slot maximal ausgewählt werden können</li><li>Sofern die Minimale Auswahl der Maximalen Auswahl entspricht und nur entsprechend viele Produkte zugewiesen sind, kann der Kunde keine Auswahl treffen</li><li>Optionen Mengenauswahl in Auswahl Limit mit einbeziehen: Sofern aktiviert werden die Anzahlen der ausgewählten Optionen bei der Mindest- oder Maximalen Auswahl eingerechnet. Zusätzlich wird auch die Minimale- und Maximale Auswahl der Optionen angepasst, sodass diese kleiner gleich der maximal gewählten Optionen sind</li><li>Preisberechnung: Hier können Sie eine Preisberechnung für den Slot einstellen welcher für die zugewiesenen Optionen als Grundlage verwendet wird</li><li>Button \"Option (Produkt) hinzufügen\" siehe nächster Punkt</li></ul></li></ol><h3>Optionen (Produkte) hinzufügen</h3><ol><li>Innerhalb eines Slots können Sie ganz unten auf den blauen Button \"Option (Produkt) hinzufügen\" klicken</li><li>Dabei öffnet sich ein Modal Fenster in dem Sie folgende Einstellungen vornehmen können\n<ul><li>Name: Angezeigter Name des Produkts innerhalb des Slots. Dies kann optional befüllt werden. Ansonsten wird der normale Produktname verwendet</li><li>Produkt: Wählen Sie ein Produkt aus Ihrem Sortiment über das Dropdown</li><li>Preisberechnung: Wenn Sie wünschen, können Sie jedem hinzugefügten Produkt über ein Dropdown eine eigene Preisberechnung zuweisen oder auch eine neue Preisberechnung erstellen. Siehe Überschrift \"Preisberechnung\" weiter unten für genauere Informationen</li><li>Minimale Auswahl: Wählen Sie aus, wie oft das Produkt minimal ausgewählt werden muss.</li><li>Maximale Auswahl: Wählen Sie aus wie oft das Produkt maximal ausgewählt werden kann</li><li>Auswahl Schritt Größe: Stellen Sie in welchen Schritten das Produkt ausgewählt werden kann. Wenn Sie zum Beispiel \"3\" wählen, kann man im Dropdown 3, 6, 9, usw. Produkte auswählen</li><li>Sofern die Minimale Auswahl der Maximalen Auswahl entspricht kann der Kunde keine Anzahl wählen, stattdessen wird das Produkt mit der gewählten Anzahl in die Konfiguration aufgenommen</li></ul></li></ol><h2>Preisberechnung</h2><p>Mit der Preisberechnung ist es möglich zu steuern, mit welchem Preis die Option bzw. das Produkt in den Gesamtpreis des Sets eingeht. In der Formel wird der netto Preis für die jeweilige Option berechnet. Auf diesen Preis werden dann, je nach derzeitiger Shop Konfiguration, die Steuern und andere Shopware Aufschläge gerechnet. Sofern eine Option im Storefront gewählt wird, wird zu dem Gesamtpreis des Sets der hierbei berechnete Wert addiert. Dieser Wert kann am Ende positiv oder negativ sein.\nAchtung: Bei der Konfiguration sollte beachtet werden, dass im Endergebnis bei Set Produkten keine negativen Preise herauskommen können.</p><p>Unter \"Einstellungen -&gt; Erweiterungen -&gt; Produkt Set Preisberechnung\" ist es möglich weitere Preisberechnungen festzulegen. Die angelegten Formeln, können in jedem Slot oder auch individuell pro Option verwendet werden. Wenn nichts ausgewählt ist, wird automatisch die Formel product.unitPrice als Fallback verwendet.</p><p>In den Formeln der Preisberechnung, können Zahlen sowie vordefinierte Variablen verwendet werden. Die Variablen werden je nach gewählter Option, bzw. dem dahinterliegenden Produkt berechnet. Desweiteren können folgende arithmetische Operatoren verwendet werden: +, -, *, /, ^. Diese werden in der Standard Rangfolge ausgeführt. Um die Berechnungsreihenfolge zu ändern können runde Klammern verwendet werden. Für weitere Informationen siehe hier: https://de.wikipedia.org/wiki/Operatorrangfolge</p><h3>Folgende Aliasse können verwendet werden:</h3><ul><li>\nproduct.unitPrice ist der netto Preis des jeweiligen Optionen-Produktes, wobei die Staffelpreise berücksichtigt werden</li><li>\nproduct.customFields.* Alle Zusatzfelder des Produkts, die einen numerischen Wert enthalten, sind unter ihrem technischen Namen verfügbar. Es wird empfohlen, dass Sie bei der Verwendung von Zusatzfeldern immer die FALLBACK()-Funktion nutzen, um einen Standardwert festzulegen. Beispiel: FALLBACK(product.customFields.product_set_relative_discount, 1)\n</li></ul><h3>Folgende Funktionen können verwendet werden:</h3><ul><li>\nPRICE(grossPrice) Ermöglicht es einen Bruttopreis in der Standard-Währung über einen statischen Wert anzugeben. Die Funktion stellt sicher, dass der Währungsfaktor und der Steuersatz des Produktes richtig angewendet werden. Beispiel: product.unitPrice - PRICE(9.99)\n</li><li>\nFALLBACK(value1, value2, ...) Gibt den ersten Wert zurück, der nicht leer ist. Diese Funktion kann insbesondere dazu genutzt werden, um für Aliasse, die nicht immer gesetzt sind, einen Standardwert zu definieren. Beispiel: product.unitPrice*FALLBACK(product.customFields.product_set_discount, product.customFields.product_set_discount_2, 1)\n</li><li>\nMIN(value1, value2, ...) Gibt den kleinsten Wert zurück.</li><li>\nMAX(value1, value2, ...) Gibt den größten Wert zurück.</li><li>\nFLOOR(value) Rundet den Wert ab.</li><li>\n\n\nCEIL(value) Rundet den Wert auf.</li><li>\"FLOOR(value * 100) / 100\" Rundet den Wert auf zwei Dezimalstellen auf.<br /></li></ul><h2>Dokumente, E-Mail Templates (Bestellungs-Export)</h2><p>Eine detailierte Anleitung dazu finden Sie hier: https://md.swk-web.com/s/Y4SF46Svt#<a href=\"https://markdownpastebin.com/?id=0d944f22dac9402eb2ae8c806fa7d0fe\" target=\"_blank\" rel=\"noreferrer noopener\"><br /></a><br />Für die Rechnung (PDF Dokument), muss die Einstellung \"Bestellpositions-Filter (Dokumente)\" angepasst werden.<br />Dabei kann entschieden werden, welche Positionen (lineItems) von dem Set Produkt auf der Rechnung geladen werden. Dies ist auch für folgende Bereiche möglich: HTML E-Mails, Plain Text E-Mails, API<br /><br /></p><h3>Erklärung der einzelnen Filter</h3><p><b>Set Position</b>: Name von dem konfigurierten Set<br /><b>Set-Produkt Position</b>: Name von dem Hauptprodukt, welchem das Set Produkt zugewiesen ist<br /><b>Slot Position</b>:  Name des Slot<br /><b>Option Position</b>: Name der Option<br /><b>Optionen-Produkt Position</b>: Name des Produkts, welches für diese Option hinterlegt ist<br /><br /></p>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"<p>- Compatibility: Shopware 6.5.3 - Set versions ids in foreign key constraints for option products</p><p>- Compatibility: Shopware 6.5.3 - New set configuration URL format to improve support of IDs in UUIDv7 format (old URLs will still work)</p><p>- Bugfix: Correct link to the set configurations from the cart</p><p>- Bugfix: Load correct configuration in dropdown slots</p><p>- Bugfix: Image gallery modal with sticky product image</p><p>- Bugfix: Fix duplicate data entries on slot creation and cleanup orphaned entries, when destructive migrations are applied</p>","creationDate":{"date":"2023-07-23 21:50:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>- Compatibility: Shopware 6.5</p><p>- Refactor: Remove deprecations and improve code for Shopware 6.5</p>","creationDate":{"date":"2023-06-04 16:11:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- Feature: Add custom fields for sets, slots and options</p><p>- Feature: Add slot presets</p><p>- Feature: Add invisible slot template</p><p>- Feature: Add set slider template</p><p>- Feature: Add store API endpoint to retrieve set configurations `/store-api/swkweb-product-set/{productId}`</p><p>- Feature: Add store API aware flags to defined entities and entity extensions</p><p>- Feature: Add some storefront JavaScript events</p><p>- Refactor: Show option hover outline only on desktop breakpoint</p><p>- Refactor: Add unified JavaScript plugin for sticky elements</p><p>- Bugfix: Only filter order in documents if existent</p><p>- Bugfix: Add missing snippet for \"optional\" slots</p><p>- Bugfix: Use only a single priceCurrency structured data element</p><p>- Bugfix: Always show the delivery information of the main product of sets</p><p>- Bugfix: Align summary items to the left</p>","creationDate":{"date":"2023-06-02 14:59:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>- Bugfix: Use correct sales channel configuration for API filtering</p><p>- Bugfix: Workaround for Vuex bug https://github.com/vuejs/vuex/pull/1438 for compatibility with Pickware</p>","creationDate":{"date":"2023-02-26 15:17:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>- Bugfix: Template error in account if main item is shown as first item in checkout</p>","creationDate":{"date":"2022-12-01 00:26:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>- Bugfix: Fix template variables in checkout, if the main set item is not shown separately</p>","creationDate":{"date":"2022-11-03 15:28:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- Bugfix: Packaging which caused a faulty Storefront JavaScript</p>","creationDate":{"date":"2022-11-02 09:26:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Feature: Add the possibility in the administration to add sets to products which are assigned to that product</p><p>- Feature: Add new slot-template \"Radio (List view)\"</p><p>- Feature: Add two new functions for the calculation of gross and net prices in the pricing engine</p><p>- Feature: Add `product.listPrice` as new alias to the pricing engine</p><p>- Feature: Add possibility to show set summary below the product image</p><p>- Feature: Sticky product image, which scrolls along the configurator in the detail page</p><p>- Feature: Add possibility to show the main product item in checkout as separate item</p><p>- Feature: Add new shopping experience element \"Sticky bar - Product set configurator\"</p><p>- Refactor: Improve loading of product sets on detail pages with assigned shopping experience layout</p><p>- Refactor: Improve templates for showing the set in the checkout (`set-item.html.twig` and `set-items.html.twig`)</p><p>- Fix: Display of negative single option prices</p><p>- Fix: Sort set main items to the first positions in documents etc.</p><p>- Fix: Show correct units and reference prices for set options</p><p>- Fix: Correct for-attribute of variant group selection labels</p><p>- Fix: Always show the price of the main set product in the checkout/cart</p>","creationDate":{"date":"2022-11-01 18:52:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First Shopware 6 release</p>","creationDate":{"date":"2022-07-29 14:07:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=swkwe92693868713","redirectToStore":true,"lowestPriceValue":49}