{"id":15586,"name":"DIScoGA4","code":"DISco37349247878","lastChange":{"date":"2023-07-19 14:24:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTYQIQa","examplePageUrl":"","moduleKey":"DIScoGA4","creationDate":{"date":"2022-07-21 11:59:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-12-01 13:10:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-02-23 14:11:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3855,"prefix":"DISco","name":"D-I-S commerce engineering","website":"//www.d-i-s.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3855_plugin.png"},"infos":[{"id":27158,"name":"Google Analytics 4 - GA4 für Shopware 6","description":"<p>Dieses Plugin ermöglicht eine einfache Anbindung von Google Analytics 4.\nEin Wechsel auf GA4 wird spätestens ab 1. Juli 2023 zwingend notwendig, da der Vorgänger „Universal Analytics“ am 1. Juli 2023 abgeschaltet wird.\nDoch ein Umstieg lohnt sich bereits jetzt, denn mit der Abschaltung von Universal Analytics verlierst du deine alten, bisher gesammelten Daten und startest deine Datensammlung komplett neu im Google Analytics 4-Datentopf.\n</p><h2>Features für GA4</h2><p></p><ul><li>Einfache Integration von Google Analytics 4 durch Implementierung über den Google Tag-Manager</li><li>Feuern aller wichtigen Events mit dem neuen DataLayer von GA4 (add_payment_info, add_to_cart, add_to_wishlist, add_to_compare, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list</li><li>Datenschutz-Implementierung in das Standard Shopware-Datenschutz-Plugin</li><li>Kontaktformular-Tracking<br>- Hersteller/Marken - ermöglicht die Analyse der Umsätze nach Marken<br>- Kategorien (bis max. 5) – ermöglicht Analyse der Umsätze nach Kategorien<br>- Suchfunktion - ermöglicht die Analyse, welche Artikel gerade häufig gesucht werden<br>- Payment Info - ermöglicht die Analyse, welche Zahlungsmethode am häufigsten verwendet wird und welche Umsätze darüber generiert werden<br>- Produkt Add-to-Cart - ermöglicht eine Auswertung darüber, welche Produkte häufig angesehen wurden, ohne gekauft zu werden</li></ul><p></p><h2>Vielfältige Individualisierungsmöglichkeiten</h2><p></p><ul><li>Option für User ID-Tracking</li><li>Option zur Verfolgung der Anzahl der Produktklicks auf Kategorie-Seiten, der Suchseite und Cross-Selling-CMS-Elementen</li></ul><p></p><h2>Features für Google Ads</h2><p></p><ul><li>DataLayer für Google Ads dynamisches Remarketing</li><li>Google Ads dynamisches Conversion-Tracking</li><li>Google Ads erweitertes Conversion-Tracking</li><li>Google Ads User ID-Tracking</li></ul><h2>Unterstütze Consent Manager:</h2><p><ul><li>Standard Shopware Cookie Banner</li><li>Cookiebot</li><li>Usercentrics<br></li></ul></p>","installationManual":"<p>Installieren Sie dieses Plugin über den Shopware Store.&nbsp;<br>Aktivieren Sie dieses Plugin im Shopware Backend.</p><p>Sie finden eine detaillierte Installationsanleitung und Dokumentation&nbsp;<a href=\"https://plugins.d-i-s.de/schnelle-einrichtung\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">hier</a></p><p><br></p><p>Die Installationsanleitung ohne Bilder folgt hier:</p><p><br></p><h2><b>Backend-Einstellungen</b></h2><h3><b>Plugin-Einstellung</b></h3><p>Navigieren Sie zu dem Plugin im Backend Ihres Shopware Shops und klicken Sie auf Konfiguration. Im ersten Menü haben Sie die Möglichkeit, den Verkaufskanal einzustellen.</p><p><br></p><h4><b>Konfigurieren Sie Ihre gewünschten Verkaufskanäle</b></h4><p>Sie haben als erstes die Option, das Plugin zu aktivieren und zu deaktivieren. Dies ist wichtig, wenn Sie verschiedene Verkaufskanäle haben. Wenn Sie das Standard Cookie Consent Tool von Shopware verwenden, können Sie die Option \"Use the standard Cookie Consent Tool from Shopware\" aktiviert lassen. Wenn Sie jedoch ein anderes Cookie Consent Tool verwenden, können Sie die Option deaktivieren. Sie können die Option auch deaktivieren, wenn Sie nicht in der EU verkaufen, zum Beispiel in der Schweiz.</p><p>ACHTUNG: Wenn Sie eine andere Cookie-Einwilligungslösung verwenden, müssen Sie die Auslöser im Tag Manager anpassen.</p><p><br></p><p>Wenn Sie das Standard Consent Banner von Shopware verwenden, können Sie diese Einstellung verwenden</p><p><br></p><h4><b>Tag Manager-Einstellungen</b></h4><p>Im Backend Ihres Shopware-Shops navigieren Sie zum Plugin und klicken auf Konfiguration. Im ersten Menü haben Sie die Möglichkeit, den Verkaufskanal einzustellen. Im Feld \"Google Tag Manager - Container ID\" geben Sie Ihre Tag Manger Container ID ein, die das folgende Format hat: \"GTM-XXXXXXX\" und lassen Sie den Tag Manager aktiviert, damit er auch ausgeführt wird.</p><p><br></p><p>Geben Sie Ihre Container ID ein und markieren Sie die Option \"Google Tag Manager aktivieren\".</p><p><br></p><h4><b>Google Analytics Einstellungen</b></h4><p><br></p><p><b>Google Analytics 4 E-Commerce dataLayer aktivieren</b></p><p>Dadurch wird der DataLayer mit allen E-Commerce Eigenschaften für Google Analytics 4 aktiviert, wie z.B.: \"add_payment_info, add_shipping_info, add_to_cart, add_to_wishlist, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list\"</p><p>Die DataLayers haben das neue GA4 DataLayer-Format. </p><p><br></p><h4><b>Google Ads Einstellungen</b></h4><p><br></p><p>Aktivieren Sie die gewünschten Optionen für Google Ads</p><p><b>Aktivieren Sie Google Ads Dynamic Conversion Tracking (Purchase Event). </b></p><p>Diese Option aktiviert das klassische Kauf-Ereignis für Google Ads mit dem entsprechenden DataLayer.&nbsp;</p><p><br></p><p><b>Goolge Ads Dynamisches Remarketing aktivieren</b></p><p>Das Aktivieren des dynamischen Remarketings wird den DataLayer für die folgenden Ereignisse auslösen: \"view_item\", \"add_to_cart \", \"view_item_list\", \"view_search_results\" und \"purchase\".&nbsp;</p><p><br></p><p><b>Erweiterte Conversion von Google Ads aktivieren</b></p><p>Wenn Sie diese Optionen aktivieren, wird das erweiterte Conversion-Tracking aktiviert. Dadurch wird die Zuordnung der Conversion verbessert. Weitere Informationen finden Sie hier. Bitte beachten Sie, dass Sie dafür Ihre Datenschutzeinstellungen anpassen sollten.</p><p><br></p><p><b>Feed: Code für Land &amp; Feed: Code für Sprache</b></p><p>Die beiden Optionen beziehen sich auf den Merchant Center Feed zur Ermittlung Ihres Gewinns in Google Ads. Unter dem Link erfahren Sie mehr.</p><p><br></p><h3>Nutzer-ID-Tracking</h3><h4>Nutzer-ID-Tracking bei Bedarf aktivieren</h4><p>Indem Sie das Nutzer-ID-Tracking aktivieren, werden Ihre Daten sowohl in Google Analytics als auch in Google Ads genauer sein. Insbesondere der Customer Live Time Value eines Nutzers wird viel genauer und ermöglicht eine geräteübergreifende Verfolgung, sobald sich ein Nutzer anmeldet. Bitte beachten Sie, dass Sie Einstellungen in Google Analytics und Google Ads vornehmen müssen, um dies zu aktivieren.</p><p><br></p><p>Weitere Informationen zum User ID Tracking erhalten Sie&nbsp;<a href=\"https://support.google.com/analytics/answer/9213390? hl=de\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">hier</a>.</p><p><br></p><h2>Download der Container-Einstellung für Tag Manager</h2><p>Um eine schnelle Implementierung des Plugins zu ermöglichen, können Sie den Tag Manager-Container mit allen Konfigurationen herunterladen und in Ihren Tag Manager importieren. Wie das funktioniert, erfahren Sie im nächsten Abschnitt.</p><p><br></p><p>Klicken Sie auf die Schaltfläche und laden Sie die Container-Datei herunter. In dieser Container-Datei sind alle Tags, Variablen und Trigger bereits angelegt.&nbsp;</p><p><br></p><p>ACHTUNG: Sie müssen Ihre ID für Google Analytics und Google Ads ändern.</p><p><br></p><p>Download Tag Manger Container</p><p>Version 1.0</p><p><br></p><h2>Importieren Sie den Tag Manager Container</h2><p>Klicken Sie auf die Schaltfläche und laden Sie die Container-Datei herunter. In dieser Containerdatei sind alle Tags, Variablen und Trigger bereits angelegt. Wenn Sie noch keinen Tag Manger erstellt haben, finden Sie hier eine Anleitung.</p><p><br></p><p>ACHTUNG: Sie müssen Ihre ID für Google Analytics und Google Ads ändern.</p><p><br></p><p>Gehen Sie zu Ihrem Tag Manager und navigieren Sie zur Startseite. Klicken Sie auf den Menüpunkt \"Verwaltung\".</p><p><br></p><p>Klicken Sie auf \"Verwaltung\". </p><p>Im Verwaltungsmenü müssen Sie in die Spalte \"Container\" gehen und auf den Menüpunkt \"Container importieren\" klicken. Überprüfen Sie, ob Sie sich im richtigen Container befinden.</p><p><br></p><p>Klicken Sie auf die Schaltfläche \"Container importieren\"</p><p>Klicken Sie auf \"Containerdatei auswählen\" und wählen Sie die zuvor heruntergeladene Datei aus.</p><p><br></p><p>Wählen Sie die Containerdatei aus</p><p>Klicken Sie auf die Schaltfläche \"Vorhanden\" bei \"Arbeitsbereich auswählen\". Dadurch können Sie den Container in den aktuellen Arbeitsbereich importieren.</p><p><br></p><p>Wählen Sie die Containerdatei</p><p>Ein Einblendmenü öffnet sich. Klicken Sie hier auf den \"Standardarbeitsbereich\" Es kann sein, dass bei Ihnen der Arbeitsbereich anders benannt wurde. Sie müssten ihn dann auswählen.</p><p><br></p><p>Wählen Sie Ihren Arbeitsbereich.</p><p>Klicken Sie bei den Optionsfeldern von \"Importoption auswählen\" auf \"Zusammenführen\", damit Ihre bereits vorhandenen Tags nicht gelöscht werden. Bei der zweiten Auswahl von unter \"Zusammenführen\" klicken Sie auf \"Konflikte zwischen Tags, Triggern und Variablen umbenennen\". Jetzt können Sie Ihre Auswahl bestätigen. Jetzt sind alle Tags, Variablen und Auslöser importiert.</p><p><br></p><p>Klicken Sie auf \"Zusammenführen\" und \"Widersprüchliche Tags, Auslöser und Variablen umbenennen\".</p><p>Ändern Sie die IDs im Tag Manager</p><p>Damit Ihre Tags funktionieren, müssen Sie die IDs ändern. Klicken Sie dazu auf das Tag \"01-01-GA4 Pageview\".</p><p><br></p><p>Klicken Sie auf das Tag \"01-01-GA4 Pageview\".</p><p>Ändern Sie die Messungs-ID mit Ihrer Google Analytics Stream ID und speichern Sie dann Ihre Einstellung.</p><p><br></p><p>Fügen Sie Ihre Messungs-ID ein und speichern Sie das Tag</p><p>Öffnen Sie das Tag \"02-02-Google Ads Conversion Tracking\". </p><p><br></p><p>Öffnen Sie den Tag \"02-02-Google Ads Conversion Tracking\".</p><p>Tauschen Sie die \"Conversion ID\" und das \"Conversion Label\" mit Ihren IDs aus und klicken Sie auf \"Speichern\".</p><p><br></p><p>Tauschen Sie die IDs aus und klicken Sie auf \"Speichern\". </p><p>Öffnen Sie den Tag \"02-03-Google Ads dynamisches Remarketing\".</p><p><br></p><p>Öffnen Sie den Tag \"02-03-Google Ads dynamisches Remarketing\".</p><p>Tauschen Sie die Conversion ID mit der Conversion ID aus Ihrem Google Ads Konto aus und \"Speichern\" Sie den Tag. </p><p><br></p><p><br></p><h2>GA4 - User ID Tracking</h2><p>Erstellen Sie das User ID Tracking in Google Analytics 4</p><p>Öffnen Sie Google Analytics und klicken Sie auf das Zahnrad unten links, um zu den Einstellungen zu gelangen.</p><p><br></p><p>Klicken Sie auf das Zahnrad unten links</p><p>Navigieren Sie zur Spalte \"Eigenschaft\". Klicken Sie dann auf \"Dateneinstellungen\" und dann auf \"Datenerfassung\". Danach müssen Sie die \"Bestätigung für die Erfassung von Benutzerdaten\" bestätigen. Ab diesem Zeitpunkt werden die Nutzer-IDs in Google Analytics verarbeitet.</p><p><br></p><p>Klicken Sie auf \"Dateneinstellungen\" und dann auf \"Datenerfassung\" und bestätigen Sie die Nutzerdatenerfassung.</p><p><br></p><h2>Google Ads Setup</h2><p>Ertragsverfolgung im Google Ads-Konto erstellen</p><p>Um ein Converion-Ereignis in Google Ads zu erstellen, klicken Sie auf \"Tools und Einstellungen\" und dann in der Spalte Messung auf Conversion. </p><p><br></p><p>Klicken Sie auf \"Tools und Einstellungen\" und dann auf \"Conversion\".</p><p>Klicken Sie auf die Schaltfläche \"Website\". </p><p><br></p><p>Klicken Sie auf \"Website</p><p>Scrollen Sie nach unten zum Abschnitt \"Konvertierungsaktionen mit Code erstellen\" und klicken Sie dann auf den Text \"+Konvertierungsaktion manuell hinzufügen\"</p><p><br></p><p>Klicken Sie auf \"+Konvertierungsaktion manuell hinzufügen\".</p><p>Beim Punkt \"Zielaktionen und Aktionen optimieren\" wählen Sie die Option \"Kauf\". Den \"Conversion-Namen\" können Sie benennen, wie Sie wollen, wir empfehlen \"Kauf\" zu nehmen. Im Abschnitt \"Wert\" müssen Sie die Option \"Unterschiedliche Werte für jede Conversion verwenden\" auswählen, da Sie sonst keine dynamischen Verkäufe übertragen können.</p><p><br></p><p>Wählen Sie \"Kauf\" als Ziel und die Option \"Unterschiedliche Werte für jede Conversion verwenden\".</p><p>Die Option \"Standardwert\" können Sie so belassen, da es keinen Kauf ohne Conversion geben kann. Bei der Zählmethode ist es wichtig, dass \"Alle\" ausgewählt ist, da sonst Verkäufe von Benutzern, die mehrmals im Webshop kaufen, nicht erfasst werden. Die anderen Einstellungen können Sie so belassen, wie sie sind. Klicken Sie dann auf \"Fertig\".</p><p><br></p><p>Nehmen Sie die Einstellungen vor und klicken Sie auf \"Fertig\".</p><p>Nachdem Sie die Einstellungen vorgenommen haben, scrollen Sie nach unten und klicken Sie auf \"Speichern und fortfahren\".</p><p><br></p><p>Klicken Sie auf die Schaltfläche \"Speichern und fortfahren\".</p><p>Klicken Sie auf \"Google Tag Manager verwenden\" im Navigationsreiter. Kopieren Sie die \"Conversion ID\" und das \"Conversion Label\" und klicken Sie dann auf die Schaltfläche \"Fertig\". Jetzt müssen Sie nur noch das Tracking für das Sales Tracking im Google Tag Manager einrichten.</p><p><br></p><p>Kopieren Sie die Variablen und klicken Sie auf \"Fertig\".</p><p>Erstellen Sie das User ID Tracking in Ihrem Google Ads-Konto</p><p>Gehen Sie zu Ihrem Google Ads-Konto und klicken Sie auf \"Tools und Einstellungen\" und in der Spalte \"Gemeinsame Bibliothek\" auf \"Audience Management\".</p><p><br></p><p>Klicken Sie auf \"Speichern</p><p>Gehen Sie zum Menüpunkt \"Meine Datenquelle\". Klicken Sie auf \"Details\" für die Datenquelle \"Google\" Ads.</p><p><br></p><p>Klicken Sie auf \"Speichern</p><p>Klicken Sie bei der Datenquelle Google Ads auf das erweiterte Menü in der oberen rechten Ecke.</p><p><br></p><p>Klicken Sie auf das Menü</p><p>Scrollen Sie in den Einstellungen nach unten und klicken Sie auf \"Erweiterte Einstellungen\". </p><p><br></p><p>Klicken Sie auf \"Erweiterte Einstellungen</p><p>Kreuzen Sie das Kästchen \"Parameter \"User ID\" in den Google Ads-Tag aufnehmen\" an und klicken Sie auf \"Speichern und fortfahren\".</p><p><br></p><p>Kreuzen Sie das Kästchen an und klicken Sie auf \"Speichern und fortfahren\".</p><p>Dynamisches Remarketing im Google Ads-Konto einrichten</p><p>Um dynamisches Remarketing in Google Ads zu aktivieren, müssen Sie die folgenden Schritte durchführen. Melden Sie sich im Google Ads-Konto an und klicken Sie auf \"Tools und Einstellungen\" und dann in der Spalte \"Gemeinsame Bibliothek\" auf den Text \"Zielgruppenverwaltung\".</p><p><br></p><p>Klicken Sie auf \"Tools und Einstellungen\" und dann auf \"Zielgruppenverwaltung\". </p><p>Klicken Sie im linken Bereich auf \"Meine Datenquellen\" und dann im Abschnitt \"Google Ads Tag einrichten\" auf \"Tag einrichten\".</p><p><br></p><p>Klicken Sie auf \"Meine Datenquellen\" und dann auf \"Tag einrichten\".</p><p>Wählen Sie die zweite Option im Abschnitt \"Remarketing\" \"Sie können Daten über bestimmte Aktivitäten sammeln, die Nutzer auf Ihrer Website durchgeführt haben, um personalisierte Anzeigen zu schalten.\" Im zweiten Abschnitt Unternehmenstyp müssen Sie \"Einzelhandel\" auswählen. Klicken Sie anschließend auf die Schaltfläche \"Speichern und weiter\".</p><p><br></p><p>Wählen Sie beide Optionen aus und klicken Sie auf die Schaltfläche \"Speichern und weiter\".</p><p>Klicken Sie auf die Registerkarte \"Google Tag Manager verwenden\" und notieren Sie sich die \"Conversion ID\". Jetzt können Sie auf die Schaltfläche \"Weiter\" klicken. Die Konfiguration in Google Ads ist nun abgeschlossen. Bitte beachten Sie, dass Sie sie noch in Google Tag Manger einrichten müssen!</p><p><br></p><p>Notieren Sie sich die Conversion ID und klicken Sie auf \"Weiter\".</p><p><br></p>","shortDescription":"Dieses Plugin ermöglicht eine einfache Anbindung von Google Analytics 4 über den Google Tag Manager. Ein Wechsel auf GA4 wird spätestens ab 1. Juli 2023 zwingend notwendig.","highlights":"Erweiterter E-Commerce-GA4-DataLayer mit verbesserter Datenqualität\nWeitere Events wie Suche, Payment, Kategorien, Account anlegen, Login, Kontaktformular\nDie Implementierung erfolgt über den Google Tag Manager\nUserId-Tracking\nGoogle Ads-Tracking","features":"Einfache Integration von Google Analytics 4 durch Implementierung über den Google Tag Manager\nFeuern aller wichtigen Events mit dem neuen DataLayer von GA4 (add_payment_info, add_to_cart, add_to_wishlist, add_to_compare, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list, form_submit)\nDatenschutz-Implementierung in das Standard Shopware Datenschutz-Plugin \nKontaktformular-Tracking\nVerbesserte Datenqualität über die kompletten Shop-Interaktionen (Product-Data ist bei anderen Plugins unvollständig)\nOption für UserID-Tracking\nOption zur Verfolgung der Anzahl der Produktklicks auf Kategorieseiten, der Suchseite und Cross-Selling-CMS-Elementen\nUnterstütze Consent Manager: Standard Shopware  Cookie Banner, Cookiebot, Usercentrics"},{"id":27159,"name":"Google Analytics 4 for Shopware 6","description":"<h3>Description:</h3>\n\nThis plugin enables an easy connection of Google Analytics 4.\n\nA switch to GA4 will be mandatory from July 1, 2023 at the latest, because the predecessor \"Universal Analytics\" will be switched off on July 1, 2023.\n\nBut a switch is already worthwhile now, because with the shutdown of Universal Analytics you lose your old, previously collected data and start your data collection completely new in the Google Analytics 4 data pot.\n\n<br><h3>Features</h3><p>- easy integration of Google Analytics 4. implementation via Tag Manager.</p><p>- Integration of Google Tag Manager JS and non-JS code.</p><p>- Firing all important events with GA4's new DataLayer (add_payment_info, add_to_cart, add_to_wishlist, add_to_compare, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list, form_submit).</p><p>- Privacy implementation in the standard Shopware privacy plugin</p><p>- contact form tracking</p><p>- improved data quality over the complete store interactions (product data is not complete in other plugins)</p><p>- Manufacturer/Brands - allows to analyze sales by brands</p><p>- Categories (up to max. 5) - enables analysis of sales by categories</p><p>- Search function - allows you to analyze which items are searched for frequently</p><p>- Payment Info - allows to analyze which payment method is used most often and which sales are generated by it</p><p>- Product Add-to-Cart - enables analysis to see which products have been frequently viewed but not purchased.</p><h3>Various customization options<p></h3>- Option for UserID tracking</p><p>- Option to track the number of product clicks on category pages, the search page and cross-selling CMS elements.</p>","installationManual":"<p>Install this plugin via the Shopware Store.&nbsp;</p><p><br></p><p>Activate this plugin in Shopware Backend.</p><p><br></p><p>You can find the installation guide&nbsp;with images&nbsp;<a href=\"https://plugins.d-i-s.de/en/fast-implementation\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">here</a></p><p><br></p><p>The installation instructions without images follows here:</p><p><br></p><h2><b>Backend settings</b></h2><h3><b>Plugin setting</b></h3><p>Navigate to the plugin in the backend of your Shopware store and click on configuration. In the first menu you have the option to set the sales channel.&nbsp;</p><p><br></p><h4><b>Configure your desired sales channels</b></h4><p>You have as first option to activate and deactivate the plugin. This is important if you have different sales channels. If you use the standard Cookie Consent Tool from Shopware you can leave the option \"Use the standard Cookie Consent Tool from Shopware\" enabled. However, if you use a different cookie consent tool, you can disable the option. You can also deactivate the option if you are not selling in the EU, for example in Switzerland.</p><p>ATTENTION: If you use another cookie consent solution you have to adjust the triggers in the Tag Manager.</p><p><br></p><p>If you are using the standard Consent Banner from Shopware you can use this setting</p><p><br></p><h4><b>Tag Manager settings</b></h4><p>In the backend of your Shopware store, navigate to the plugin and click Configuration. In the first menu you have the option to set the sales channel. In the field \"Google Tag Manager - Container ID\" enter your Tag Manger Container ID this has the following format: \"GTM-XXXXXXX\" and leave the Tag Manager activated so that it is also executed.</p><p><br></p><p>Enter your container ID and check the option \"Enable Google Tag Manager\".</p><p><br></p><h4><b>Google Analytics settings</b></h4><p><br></p><p><b>Enable Google Analytics 4 E-Commerce dataLayer</b></p><p>This will enable the DataLayer with all the e-commerce properties for Google Analytics 4 such as: \"add_payment_info, add_shipping_info, add_to_cart, add_to_wishlist, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list\"</p><p>The DataLayers have the new GA4 DataLayer format.</p><p><br></p><h4><b>Google Ads settings</b></h4><p><br></p><p>Activate the desired options for Google Ads</p><p><b>Enable Google Ads Dynamic Conversion Tracking (Purchase Event).</b></p><p>This option activates the classic purchase event for Google Ads with the corresponding DataLayer.&nbsp;</p><p><br></p><p><b>Enable Goolge Ads Dynamic Remarketing</b></p><p>Enabling dynamic remarketing will fire the DataLayer for the following events: \"view_item\", \"add_to_cart \", \"view_item_list\", \"view_search_results\" and \"purchase\".&nbsp;</p><p><br></p><p><b>Enable Google Ads advanced conversion</b></p><p>Enabling these options will activate the advanced conversion tracking. This improves the attribution of the conversion more information can be found here. Please note that you should adjust your privacy setting for this.</p><p><br></p><p><b>Feed: Code for country &amp; Feed: Code for languag</b>e</p><p>The two options relate to the Merchant Center feed to determine your profit in Google Ads. See the link to learn more.</p><p><br></p><h3>User ID Tracking</h3><p><br></p><h4>Enable User ID Tracking if needed</h4><p>By enabling User Id Tracking, your data will be more accurate in Google Analytics as well as in Google Ads. Especially the Customer Live Time Value of a user becomes much more accurate and enables cross-device tracking as soon as a user logs in. Please note that you need to make settings in Google Analytics and Google Ads to enable this.</p><p><br></p><p>You can get more information about User ID Tracking&nbsp;<a href=\"https://support.google.com/analytics/answer/9213390?hl=de\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">here</a></p><p><br></p><h2>Download the container setting for Tag Manager</h2><p>To enable a quick implementation of the plugin you can download the Tag Manager container with all configurations and import it into your Tag Manager. You will learn how this works in the next section.&nbsp;</p><p><br></p><p>Click on the button and download the container file. In this container file all tags, variables and triggers are already created.&nbsp;</p><p><br></p><p>ATTENTION: You have to change your ID for Google Analytics and Google Ads.</p><p><br></p><p>Download Tag Manger Container</p><p>Version 1.0</p><p><br></p><h2>Import the Tag Manager Container</h2><p>Click on the button and download the container file. In this container file all tags, variables and triggers are already created. If you have not yet created a Tag Manger, you can find instructions here.</p><p><br></p><p>ATTENTION: You have to change your ID for Google Analytics and Google Ads.</p><p><br></p><p>Go to your Tag Manager and navigate to the home page. Click on the \"Administration\" menu item.</p><p><br></p><p><br></p><p>Click on \"Administration.\"</p><p>In the administration menu, you need to go to the \"Container\" column and click on the \"Import Container\" menu item. Check if you are in the correct container.</p><p><br></p><p>Click the \"Import container\" button</p><p>Click on \"Select container file\" and select the previously downloaded file.</p><p><br></p><p>Select the container file</p><p>Click the \"Existing\" button at \"Select workspace\". This will allow you to import the container into the Current Workspace.&nbsp;</p><p><br></p><p>Select the container file</p><p>A slide-in menu opens. Click here on the \"Default Workspace\" it can be that with you the workspace was named differently. You would then have to select it.</p><p><br></p><p>Select your workspace.</p><p>Click on \"Merge\" at the radio buttons of \"Select import option\" so that your already existing tags are not deleted. At the second selection of under \"Merge\" click on \"Rename conflicting tags, triggers and variables\". Now you can confirm your selection. Now all tags, variables and triggers have been imported.</p><p><br></p><p>Click on \"Merge\" and \"Rename conflicting tags, triggers and variables\".</p><p>Change ID's in the Tag Manager</p><p>In order for your tags to work, it is necessary to change the ID's. To do this, click on the tag \"01-01-GA4 Pageview\".&nbsp;</p><p><br></p><p>Click on the tag \"01-01-GA4 Pageview\".</p><p>Change the measurement ID with your Google Analytics Stream ID and then save your setting.</p><p><br></p><p>Paste your measurement ID and save the tag</p><p>Open the tag \"02-02-Google Ads Conversion Tracking\".</p><p><br></p><p>Open the tag \"02-02-Google Ads Conversion Tracking\".</p><p>Swap the \"Conversion ID\" and the \"Conversion Label\" with your ID's and click \"Save\".</p><p><br></p><p>Exchange the ID's and click on \"Save\".</p><p>Open the tag \"02-03-Google Ads dynamic remarketing\".</p><p><br></p><p>Open the tag \"02-03-Google Ads dynamic remarketing\".</p><p>Swap the conversion ID with the conversion ID from your Google Ads account and \"Save\" the tag.</p><p><br></p><p><br></p><h2>GA4 - User ID Tracking</h2><p>Create User ID Tracking in Google Analytics 4</p><p>Open Google Analytics and click on the gear on the bottom left to get into the settings.</p><p><br></p><p>Click on the gear at the bottom left</p><p>Navigate to the \"Property\" column. Then click on \"Data Settings\" and then on \"Data Collection\" after that you need to confirm the \"Confirmation for User Data Collection\". From this point on, the user IDs will be processed in Google Analytics.</p><p><br></p><p>Click on \"Data settings\" and then on \"Data collection\" and confirm the user data collection.</p><p><br></p><h2>Google Ads Setup</h2><p>Create revenue tracking in Google Ads account</p><p>To create a Converion event in Google Ads click on \"Tools and Settings\" and then in the Measurement column click on Conversion.</p><p><br></p><p>Click on \"Tools and Settings and then click on \"Conversion\".</p><p>Click on the \"Website\" button.</p><p><br></p><p>Click on \"Website</p><p>Scroll down to the bottom to the \"Create conversion actions using code\" section and then click on the text \"+Add conversion action manually\"</p><p><br></p><p>Click on \"+Add conversion action manually\".</p><p>At the \"Optimize target actions and actions\" item, select the \"Purchase\" option. The \"Conversion name\" you can name as you want we recommend to take \"Purchase\". In the Value section, you must select the \"Use different values for each conversion\" option, otherwise you will not be able to transfer dynamic sales.</p><p><br></p><p>Select \"Purchase\" as the target and the option \"Use different values for each conversion\".</p><p>The Default value option can be left as it is, as there cannot be a purchase without a conversion. For the counting method, it is important that \"All\" is selected, otherwise sales from users who buy several times in the web store will not be recorded. The other settings can be left as they are. Then click on \"Done\".</p><p><br></p><p>Make the settings and click \"Done\".</p><p>After the settings are made, scroll down and click on \"Save and continue\".</p><p><br></p><p>Click on the \"Save and continue\" button.</p><p>Click on \"Use Google Tag Manager\" in the navigation tab. Copy the \"Conversion ID\" and the \"Conversion Label\" and then click on the \"Done\" button. Now you only have to set up the tracking for the sales tracking in the Google Tag Manager.</p><p><br></p><p>Copy the variables and click on \"Done\".</p><p>Create User ID Tracking in Google Ads Account</p><p>Go to your Google Ads account and click on \"Tools and Setting\" and in the column \"Shared Library\" click on \"Audience Management\".</p><p><br></p><p>Click on \"Save</p><p>Go to the \"My data source\" menu item. Click on \"Details\" for the \"Google\" Ads data source.</p><p><br></p><p>Click on \"Save</p><p>At the Google Ads data source, click on the advanced menu in the upper right corner.</p><p><br></p><p>Click on the menu</p><p>Scroll down in the settings and click on \"Advanced settings\".</p><p><br></p><p>Click on \"Advanced settings</p><p>Check the box \"Include \"User ID\" parameter in the Google Ads tag\" and click \"Save and continue\".</p><p><br></p><p>Check the box and click \"Save and continue\".</p><p>Create dynamic remarketing in Google Ads account</p><p>To enable dynamic remarketing in Google Ads, the following steps would need to be taken. Log in to the Google Ads account and click on \"Tools and Setting\" and then in the \"Shared Library\" column, click on the text \"Audience Management\".&nbsp;</p><p><br></p><p>Click on \"Tools and Setting\" and then click on \"Audience Management\".</p><p>In the left pane, click \"My Data Sources\" and then click \"Tag Setup\" in the \"Google Ads Tag\" section.</p><p><br></p><p>Click on \"My data sources\" and then on \"Set up tag\".</p><p>Select the second option in the Remarketing section \"You can collect data about specific activities users have performed on your website to serve personalized ads.\" In the second section Company type you need to select \"Retail\". Following that, click on the \"Save and continue\" button.</p><p><br></p><p>Select both options and click on \"Save and continue\" button.</p><p>Click on the \"Use Google Tag Manager\" tab and make a note of the \"Conversion ID\". Now you can click on the \"Continue\" button. The configuration is now complete in Google Ads. Please note that you still need to set it up in Google Tag Manger!</p><p><br></p><p>Make a note of the conversion ID and click on \"Next\".</p><p><br></p>","shortDescription":"This plugin enables an easy connection of Google Analytics 4, via Google Tag Manager. A change to GA4 will be mandatory from July 1, 2023 at the latest.","highlights":"Erweiterter E-Commerce GA4 DataLayer mit verbesserter Datenqualität\nWeitere Events wie Suche, Payment, Kategorien, Account anlegen, Login, Kontaktformular\nDie Implementierung erfolgt über den Tag Manager\nUserId Tracking\nGenaue Anleitung für die Implementierung für den Tag Manager","features":"easy integration of Google Analytics 4. implementation via Tag Manager.\nIntegration of Google Tag Manager JS and non-JS code.\nFiring all important events with GA4's new DataLayer (add_payment_info, add_to_cart, add_to_wishlist, add_to_compare, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list, form_submit).\nPrivacy implementation in the standard Shopware privacy plugin \nContact form tracking\nimproved data quality over the complete store interactions (product data is not complete with other plugins)\noption for UserID tracking\nOption to track number of product clicks on category pages, search page and cross-selling CMS elements."}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166005,"bookingKey":"DISco37349247878","bookingText":"Google Analytics 4 for Shopware 6","price":219.99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":166706,"bookingKey":"DISco37349247878_M","bookingText":"Google Analytics 4 for Shopware 6","price":19.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiFg54g","preview":true,"priority":0,"id":94389},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpduOjkM","preview":false,"priority":0,"id":94391}],"comments":[{"authorName":"Lumenum GmbH","text":"Anfängliche Stolpersteine wurden gemeinsam mit dem Plugin-Hersteller erfolgreich gelöst. Sehr professionell, schnell und gewissenhaft konnte uns weitergeholfen werden. Wir sind wirklich zufrieden und freuen uns eine 5 Sterne Bewertung abgeben zu dürfen.","headline":"Einfaches Plugin + herausragender Support","creationDate":{"date":"2023-07-04 11:11:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Andreas","text":"Wir hatten ein Problem bei der Einrichtung, und der Support hat es sich direkt und unkompliziert zusammen mit uns angesehen und sofort eine Lösung gefunden. Jetzt läuft alles wie es soll. \n\nWir können das Plugin nur jedem empfehlen, der GA4 nutzen möchte.","headline":"Gutes Plugin und klasse Support","creationDate":{"date":"2023-06-27 08:27:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Konstantin von just-bnw.com","text":"Der Support war während der gesamten Implementierung des Plugins äußerst hilfreich und hat bei allen erforderlichen Konfigurationen in Analytics und dem Tag Manager unterstützt.\n\nBesonders beeindruckend war, wie engagiert der Support war, als das Conversion Tracking zunächst nicht funktioniert hat. Sie haben die Ursache des Problems identifiziert, nämlich ein Konflikt mit dem Plugin des Payment Providers, und sofort einen Workaround entwickelt. Dadurch konnten wir das Conversion Tracking erfolgreich zum Laufen bringen.\n\nEs ist selten, dass ich einen derart engagierten Support erlebe. Die Hilfe bei der Konfiguration und die schnelle Lösung von Problemen haben den Implementierungsprozess reibungslos und effizient gemacht. Ich bin sehr zufrieden mit dem Service von D-I-S und dem Funktionsumfang des Plugin.\n\nDie Expertise und das Engagement des Teams haben dazu beigetragen, dass ich volles Vertrauen in das Plugin und den Anbieter habe. Ich kann Google Analytics 4 jedem empfehlen, der nach einem zuverlässigen und kundenorientierten Plugin sucht.\n\nVielen Dank","headline":"Vielen Dank an das Team von D-I-S!","creationDate":{"date":"2023-06-22 07:17:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Martin Lerf","text":"","headline":"Funktioniert sehr gut","creationDate":{"date":"2023-04-26 14:37:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Mert","text":"Das einzige Plugin was ich finden konnte, was die neue GA4 wirklich durchdacht und vollständig implementiert. Alles funktioniert einwandfrei. Individuelle Anfragne wurden direkt beantwortet und gefixt!\n\nFür jeden der von UA umstellen muss bzw. GA4 einrichten möchte eigentlich ein must-have.","headline":"Perfekt implementiert und toller Support","creationDate":{"date":"2023-04-26 12:00:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"newsenses GmbH","text":"Plugin als Probemonat gekauft. Fehler mit der Verbindung zum Tag Manager.\nDer Support hat innerhalb von 30 Minuten geantwortet und und den Fehler gezeigt. Hat sofort funktioniert. Einfach klasse und nur zu Empfehlen!","headline":"Richtig gutes Plugin für GA4!! Und Super Support!","creationDate":{"date":"2023-03-27 17:29:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Adrian Gübeli","text":"Erfüllt alles was wir brauchen. Ein Konflikt mit einem anderen Plugin wurde umgehend gelöst und wir erhielten ein persönliches Update.","headline":"Tolles Plugin","creationDate":{"date":"2023-02-24 11:46:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Lars Pillmann","text":"Wenn Alle so arbeiten wie die Jungs von Mission OM und D-I-S, dann wäre die Welt ein wundervoller Ort. So stellen wir uns Zusammenarbeit vor: Unkompliziert, freundlich und extrem hilfsbereit bei kleinen Problemen. Vielen Dank","headline":"Super Plugin, super Service","creationDate":{"date":"2023-02-07 12:49:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Kacper Gugala","text":"Works well and has a detailed instruction (step-by-step) on how to set it up!","headline":"Works!","creationDate":{"date":"2022-12-19 11:06:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Markus Saladin","text":"Sind sehr glücklich mit dem Plugin. Einfache Anleitung und vorgefertigte Vorlagen für DataStudio Report und Tag-Container stehen zur Verfügung.","headline":"Super - funktioniert einwandfrei","creationDate":{"date":"2022-12-08 15:28:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Claudio Gagliardi","text":"Wurde nach einer Anfrage in die Test-Phase eingeladen und professionell durch die gesamte Einrichtung geführt. Plugin funktioniert super !!\nEine Anforderung für die Schweiz wurde in kürzester Zeit auf Kundenwunsch umgesetzt.","headline":"Endlich GA4 für SW6","creationDate":{"date":"2022-12-08 14:56:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Google Analytics 4 - GA4 für Shopware 6","description":"<p>Dieses Plugin ermöglicht eine einfache Anbindung von Google Analytics 4.\nEin Wechsel auf GA4 wird spätestens ab 1. Juli 2023 zwingend notwendig, da der Vorgänger „Universal Analytics“ am 1. Juli 2023 abgeschaltet wird.\nDoch ein Umstieg lohnt sich bereits jetzt, denn mit der Abschaltung von Universal Analytics verlierst du deine alten, bisher gesammelten Daten und startest deine Datensammlung komplett neu im Google Analytics 4-Datentopf.\n</p><h2>Features für GA4</h2><p></p><ul><li>Einfache Integration von Google Analytics 4 durch Implementierung über den Google Tag-Manager</li><li>Feuern aller wichtigen Events mit dem neuen DataLayer von GA4 (add_payment_info, add_to_cart, add_to_wishlist, add_to_compare, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list</li><li>Datenschutz-Implementierung in das Standard Shopware-Datenschutz-Plugin</li><li>Kontaktformular-Tracking<br />- Hersteller/Marken - ermöglicht die Analyse der Umsätze nach Marken<br />- Kategorien (bis max. 5) – ermöglicht Analyse der Umsätze nach Kategorien<br />- Suchfunktion - ermöglicht die Analyse, welche Artikel gerade häufig gesucht werden<br />- Payment Info - ermöglicht die Analyse, welche Zahlungsmethode am häufigsten verwendet wird und welche Umsätze darüber generiert werden<br />- Produkt Add-to-Cart - ermöglicht eine Auswertung darüber, welche Produkte häufig angesehen wurden, ohne gekauft zu werden</li></ul><p></p><h2>Vielfältige Individualisierungsmöglichkeiten</h2><p></p><ul><li>Option für User ID-Tracking</li><li>Option zur Verfolgung der Anzahl der Produktklicks auf Kategorie-Seiten, der Suchseite und Cross-Selling-CMS-Elementen</li></ul><p></p><h2>Features für Google Ads</h2><p></p><ul><li>DataLayer für Google Ads dynamisches Remarketing</li><li>Google Ads dynamisches Conversion-Tracking</li><li>Google Ads erweitertes Conversion-Tracking</li><li>Google Ads User ID-Tracking</li></ul><h2>Unterstütze Consent Manager:</h2><p></p><ul><li>Standard Shopware Cookie Banner</li><li>Cookiebot</li><li>Usercentrics<br /></li></ul>","installationManual":"<p>Installieren Sie dieses Plugin über den Shopware Store. <br />Aktivieren Sie dieses Plugin im Shopware Backend.</p><p>Sie finden eine detaillierte Installationsanleitung und Dokumentation <a href=\"https://plugins.d-i-s.de/schnelle-einrichtung\" target=\"_blank\" rel=\"noreferrer noopener\">hier</a></p><p><br /></p><p>Die Installationsanleitung ohne Bilder folgt hier:</p><p><br /></p><h2><b>Backend-Einstellungen</b></h2><h3><b>Plugin-Einstellung</b></h3><p>Navigieren Sie zu dem Plugin im Backend Ihres Shopware Shops und klicken Sie auf Konfiguration. Im ersten Menü haben Sie die Möglichkeit, den Verkaufskanal einzustellen.</p><p><br /></p><h4><b>Konfigurieren Sie Ihre gewünschten Verkaufskanäle</b></h4><p>Sie haben als erstes die Option, das Plugin zu aktivieren und zu deaktivieren. Dies ist wichtig, wenn Sie verschiedene Verkaufskanäle haben. Wenn Sie das Standard Cookie Consent Tool von Shopware verwenden, können Sie die Option \"Use the standard Cookie Consent Tool from Shopware\" aktiviert lassen. Wenn Sie jedoch ein anderes Cookie Consent Tool verwenden, können Sie die Option deaktivieren. Sie können die Option auch deaktivieren, wenn Sie nicht in der EU verkaufen, zum Beispiel in der Schweiz.</p><p>ACHTUNG: Wenn Sie eine andere Cookie-Einwilligungslösung verwenden, müssen Sie die Auslöser im Tag Manager anpassen.</p><p><br /></p><p>Wenn Sie das Standard Consent Banner von Shopware verwenden, können Sie diese Einstellung verwenden</p><p><br /></p><h4><b>Tag Manager-Einstellungen</b></h4><p>Im Backend Ihres Shopware-Shops navigieren Sie zum Plugin und klicken auf Konfiguration. Im ersten Menü haben Sie die Möglichkeit, den Verkaufskanal einzustellen. Im Feld \"Google Tag Manager - Container ID\" geben Sie Ihre Tag Manger Container ID ein, die das folgende Format hat: \"GTM-XXXXXXX\" und lassen Sie den Tag Manager aktiviert, damit er auch ausgeführt wird.</p><p><br /></p><p>Geben Sie Ihre Container ID ein und markieren Sie die Option \"Google Tag Manager aktivieren\".</p><p><br /></p><h4><b>Google Analytics Einstellungen</b></h4><p><br /></p><p><b>Google Analytics 4 E-Commerce dataLayer aktivieren</b></p><p>Dadurch wird der DataLayer mit allen E-Commerce Eigenschaften für Google Analytics 4 aktiviert, wie z.B.: \"add_payment_info, add_shipping_info, add_to_cart, add_to_wishlist, begin_checkout, purchase, remove_from_cart, select_item, view_cart, view_item, view_item_list\"</p><p>Die DataLayers haben das neue GA4 DataLayer-Format. </p><p><br /></p><h4><b>Google Ads Einstellungen</b></h4><p><br /></p><p>Aktivieren Sie die gewünschten Optionen für Google Ads</p><p><b>Aktivieren Sie Google Ads Dynamic Conversion Tracking (Purchase Event). </b></p><p>Diese Option aktiviert das klassische Kauf-Ereignis für Google Ads mit dem entsprechenden DataLayer. </p><p><br /></p><p><b>Goolge Ads Dynamisches Remarketing aktivieren</b></p><p>Das Aktivieren des dynamischen Remarketings wird den DataLayer für die folgenden Ereignisse auslösen: \"view_item\", \"add_to_cart \", \"view_item_list\", \"view_search_results\" und \"purchase\". </p><p><br /></p><p><b>Erweiterte Conversion von Google Ads aktivieren</b></p><p>Wenn Sie diese Optionen aktivieren, wird das erweiterte Conversion-Tracking aktiviert. Dadurch wird die Zuordnung der Conversion verbessert. Weitere Informationen finden Sie hier. Bitte beachten Sie, dass Sie dafür Ihre Datenschutzeinstellungen anpassen sollten.</p><p><br /></p><p><b>Feed: Code für Land &amp; Feed: Code für Sprache</b></p><p>Die beiden Optionen beziehen sich auf den Merchant Center Feed zur Ermittlung Ihres Gewinns in Google Ads. Unter dem Link erfahren Sie mehr.</p><p><br /></p><h3>Nutzer-ID-Tracking</h3><h4>Nutzer-ID-Tracking bei Bedarf aktivieren</h4><p>Indem Sie das Nutzer-ID-Tracking aktivieren, werden Ihre Daten sowohl in Google Analytics als auch in Google Ads genauer sein. Insbesondere der Customer Live Time Value eines Nutzers wird viel genauer und ermöglicht eine geräteübergreifende Verfolgung, sobald sich ein Nutzer anmeldet. Bitte beachten Sie, dass Sie Einstellungen in Google Analytics und Google Ads vornehmen müssen, um dies zu aktivieren.</p><p><br /></p><p>Weitere Informationen zum User ID Tracking erhalten Sie <a href=\"https://support.google.com/analytics/answer/9213390?%20hl=de\" target=\"_blank\" rel=\"noreferrer noopener\">hier</a>.</p><p><br /></p><h2>Download der Container-Einstellung für Tag Manager</h2><p>Um eine schnelle Implementierung des Plugins zu ermöglichen, können Sie den Tag Manager-Container mit allen Konfigurationen herunterladen und in Ihren Tag Manager importieren. Wie das funktioniert, erfahren Sie im nächsten Abschnitt.</p><p><br /></p><p>Klicken Sie auf die Schaltfläche und laden Sie die Container-Datei herunter. In dieser Container-Datei sind alle Tags, Variablen und Trigger bereits angelegt. </p><p><br /></p><p>ACHTUNG: Sie müssen Ihre ID für Google Analytics und Google Ads ändern.</p><p><br /></p><p>Download Tag Manger Container</p><p>Version 1.0</p><p><br /></p><h2>Importieren Sie den Tag Manager Container</h2><p>Klicken Sie auf die Schaltfläche und laden Sie die Container-Datei herunter. In dieser Containerdatei sind alle Tags, Variablen und Trigger bereits angelegt. Wenn Sie noch keinen Tag Manger erstellt haben, finden Sie hier eine Anleitung.</p><p><br /></p><p>ACHTUNG: Sie müssen Ihre ID für Google Analytics und Google Ads ändern.</p><p><br /></p><p>Gehen Sie zu Ihrem Tag Manager und navigieren Sie zur Startseite. Klicken Sie auf den Menüpunkt \"Verwaltung\".</p><p><br /></p><p>Klicken Sie auf \"Verwaltung\". </p><p>Im Verwaltungsmenü müssen Sie in die Spalte \"Container\" gehen und auf den Menüpunkt \"Container importieren\" klicken. Überprüfen Sie, ob Sie sich im richtigen Container befinden.</p><p><br /></p><p>Klicken Sie auf die Schaltfläche \"Container importieren\"</p><p>Klicken Sie auf \"Containerdatei auswählen\" und wählen Sie die zuvor heruntergeladene Datei aus.</p><p><br /></p><p>Wählen Sie die Containerdatei aus</p><p>Klicken Sie auf die Schaltfläche \"Vorhanden\" bei \"Arbeitsbereich auswählen\". Dadurch können Sie den Container in den aktuellen Arbeitsbereich importieren.</p><p><br /></p><p>Wählen Sie die Containerdatei</p><p>Ein Einblendmenü öffnet sich. Klicken Sie hier auf den \"Standardarbeitsbereich\" Es kann sein, dass bei Ihnen der Arbeitsbereich anders benannt wurde. Sie müssten ihn dann auswählen.</p><p><br /></p><p>Wählen Sie Ihren Arbeitsbereich.</p><p>Klicken Sie bei den Optionsfeldern von \"Importoption auswählen\" auf \"Zusammenführen\", damit Ihre bereits vorhandenen Tags nicht gelöscht werden. Bei der zweiten Auswahl von unter \"Zusammenführen\" klicken Sie auf \"Konflikte zwischen Tags, Triggern und Variablen umbenennen\". Jetzt können Sie Ihre Auswahl bestätigen. Jetzt sind alle Tags, Variablen und Auslöser importiert.</p><p><br /></p><p>Klicken Sie auf \"Zusammenführen\" und \"Widersprüchliche Tags, Auslöser und Variablen umbenennen\".</p><p>Ändern Sie die IDs im Tag Manager</p><p>Damit Ihre Tags funktionieren, müssen Sie die IDs ändern. Klicken Sie dazu auf das Tag \"01-01-GA4 Pageview\".</p><p><br /></p><p>Klicken Sie auf das Tag \"01-01-GA4 Pageview\".</p><p>Ändern Sie die Messungs-ID mit Ihrer Google Analytics Stream ID und speichern Sie dann Ihre Einstellung.</p><p><br /></p><p>Fügen Sie Ihre Messungs-ID ein und speichern Sie das Tag</p><p>Öffnen Sie das Tag \"02-02-Google Ads Conversion Tracking\". </p><p><br /></p><p>Öffnen Sie den Tag \"02-02-Google Ads Conversion Tracking\".</p><p>Tauschen Sie die \"Conversion ID\" und das \"Conversion Label\" mit Ihren IDs aus und klicken Sie auf \"Speichern\".</p><p><br /></p><p>Tauschen Sie die IDs aus und klicken Sie auf \"Speichern\". </p><p>Öffnen Sie den Tag \"02-03-Google Ads dynamisches Remarketing\".</p><p><br /></p><p>Öffnen Sie den Tag \"02-03-Google Ads dynamisches Remarketing\".</p><p>Tauschen Sie die Conversion ID mit der Conversion ID aus Ihrem Google Ads Konto aus und \"Speichern\" Sie den Tag. </p><p><br /></p><p><br /></p><h2>GA4 - User ID Tracking</h2><p>Erstellen Sie das User ID Tracking in Google Analytics 4</p><p>Öffnen Sie Google Analytics und klicken Sie auf das Zahnrad unten links, um zu den Einstellungen zu gelangen.</p><p><br /></p><p>Klicken Sie auf das Zahnrad unten links</p><p>Navigieren Sie zur Spalte \"Eigenschaft\". Klicken Sie dann auf \"Dateneinstellungen\" und dann auf \"Datenerfassung\". Danach müssen Sie die \"Bestätigung für die Erfassung von Benutzerdaten\" bestätigen. Ab diesem Zeitpunkt werden die Nutzer-IDs in Google Analytics verarbeitet.</p><p><br /></p><p>Klicken Sie auf \"Dateneinstellungen\" und dann auf \"Datenerfassung\" und bestätigen Sie die Nutzerdatenerfassung.</p><p><br /></p><h2>Google Ads Setup</h2><p>Ertragsverfolgung im Google Ads-Konto erstellen</p><p>Um ein Converion-Ereignis in Google Ads zu erstellen, klicken Sie auf \"Tools und Einstellungen\" und dann in der Spalte Messung auf Conversion. </p><p><br /></p><p>Klicken Sie auf \"Tools und Einstellungen\" und dann auf \"Conversion\".</p><p>Klicken Sie auf die Schaltfläche \"Website\". </p><p><br /></p><p>Klicken Sie auf \"Website</p><p>Scrollen Sie nach unten zum Abschnitt \"Konvertierungsaktionen mit Code erstellen\" und klicken Sie dann auf den Text \"+Konvertierungsaktion manuell hinzufügen\"</p><p><br /></p><p>Klicken Sie auf \"+Konvertierungsaktion manuell hinzufügen\".</p><p>Beim Punkt \"Zielaktionen und Aktionen optimieren\" wählen Sie die Option \"Kauf\". Den \"Conversion-Namen\" können Sie benennen, wie Sie wollen, wir empfehlen \"Kauf\" zu nehmen. Im Abschnitt \"Wert\" müssen Sie die Option \"Unterschiedliche Werte für jede Conversion verwenden\" auswählen, da Sie sonst keine dynamischen Verkäufe übertragen können.</p><p><br /></p><p>Wählen Sie \"Kauf\" als Ziel und die Option \"Unterschiedliche Werte für jede Conversion verwenden\".</p><p>Die Option \"Standardwert\" können Sie so belassen, da es keinen Kauf ohne Conversion geben kann. Bei der Zählmethode ist es wichtig, dass \"Alle\" ausgewählt ist, da sonst Verkäufe von Benutzern, die mehrmals im Webshop kaufen, nicht erfasst werden. Die anderen Einstellungen können Sie so belassen, wie sie sind. Klicken Sie dann auf \"Fertig\".</p><p><br /></p><p>Nehmen Sie die Einstellungen vor und klicken Sie auf \"Fertig\".</p><p>Nachdem Sie die Einstellungen vorgenommen haben, scrollen Sie nach unten und klicken Sie auf \"Speichern und fortfahren\".</p><p><br /></p><p>Klicken Sie auf die Schaltfläche \"Speichern und fortfahren\".</p><p>Klicken Sie auf \"Google Tag Manager verwenden\" im Navigationsreiter. Kopieren Sie die \"Conversion ID\" und das \"Conversion Label\" und klicken Sie dann auf die Schaltfläche \"Fertig\". Jetzt müssen Sie nur noch das Tracking für das Sales Tracking im Google Tag Manager einrichten.</p><p><br /></p><p>Kopieren Sie die Variablen und klicken Sie auf \"Fertig\".</p><p>Erstellen Sie das User ID Tracking in Ihrem Google Ads-Konto</p><p>Gehen Sie zu Ihrem Google Ads-Konto und klicken Sie auf \"Tools und Einstellungen\" und in der Spalte \"Gemeinsame Bibliothek\" auf \"Audience Management\".</p><p><br /></p><p>Klicken Sie auf \"Speichern</p><p>Gehen Sie zum Menüpunkt \"Meine Datenquelle\". Klicken Sie auf \"Details\" für die Datenquelle \"Google\" Ads.</p><p><br /></p><p>Klicken Sie auf \"Speichern</p><p>Klicken Sie bei der Datenquelle Google Ads auf das erweiterte Menü in der oberen rechten Ecke.</p><p><br /></p><p>Klicken Sie auf das Menü</p><p>Scrollen Sie in den Einstellungen nach unten und klicken Sie auf \"Erweiterte Einstellungen\". </p><p><br /></p><p>Klicken Sie auf \"Erweiterte Einstellungen</p><p>Kreuzen Sie das Kästchen \"Parameter \"User ID\" in den Google Ads-Tag aufnehmen\" an und klicken Sie auf \"Speichern und fortfahren\".</p><p><br /></p><p>Kreuzen Sie das Kästchen an und klicken Sie auf \"Speichern und fortfahren\".</p><p>Dynamisches Remarketing im Google Ads-Konto einrichten</p><p>Um dynamisches Remarketing in Google Ads zu aktivieren, müssen Sie die folgenden Schritte durchführen. Melden Sie sich im Google Ads-Konto an und klicken Sie auf \"Tools und Einstellungen\" und dann in der Spalte \"Gemeinsame Bibliothek\" auf den Text \"Zielgruppenverwaltung\".</p><p><br /></p><p>Klicken Sie auf \"Tools und Einstellungen\" und dann auf \"Zielgruppenverwaltung\". </p><p>Klicken Sie im linken Bereich auf \"Meine Datenquellen\" und dann im Abschnitt \"Google Ads Tag einrichten\" auf \"Tag einrichten\".</p><p><br /></p><p>Klicken Sie auf \"Meine Datenquellen\" und dann auf \"Tag einrichten\".</p><p>Wählen Sie die zweite Option im Abschnitt \"Remarketing\" \"Sie können Daten über bestimmte Aktivitäten sammeln, die Nutzer auf Ihrer Website durchgeführt haben, um personalisierte Anzeigen zu schalten.\" Im zweiten Abschnitt Unternehmenstyp müssen Sie \"Einzelhandel\" auswählen. Klicken Sie anschließend auf die Schaltfläche \"Speichern und weiter\".</p><p><br /></p><p>Wählen Sie beide Optionen aus und klicken Sie auf die Schaltfläche \"Speichern und weiter\".</p><p>Klicken Sie auf die Registerkarte \"Google Tag Manager verwenden\" und notieren Sie sich die \"Conversion ID\". Jetzt können Sie auf die Schaltfläche \"Weiter\" klicken. Die Konfiguration in Google Ads ist nun abgeschlossen. Bitte beachten Sie, dass Sie sie noch in Google Tag Manger einrichten müssen!</p><p><br /></p><p>Notieren Sie sich die Conversion ID und klicken Sie auf \"Weiter\".</p><p><br /></p>","version":"1.2.1","changelog":[{"version":"1.2.1","text":"<ul><li>same version as 1.2.0 but for shopware 6.5</li></ul>","creationDate":{"date":"2023-07-19 14:24:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p></p><ul><li>correction: cookie names corrected User Centrics</li><li>correction: multiple orders were not transmitted correctly</li><li>correction: items are now complete</li><li>improvement: add_shipping_info is sent now on thank you page (higher compatibility with checkout plugins)</li><li>improvement: add_payment_info is sent now on thank you page (higher compatibility with checkout plugins)</li><li>improvement: for the transactionId you can choose to transmit the true OrderId or a hashed OrderId</li><li>improvement: added in all datalayers the saleschannels'id and thesaleschannels'name for better control of multichannel sales in Tag Manager</li><li>improvement: cross-selling and cms elements are now better tracked in all pages</li><li>perfomance: we optimised some internal functions which </li><li>correction: renamed coupon streichpreis to list price because of internalisation best practice</li><li>correction: discount per item was integrating quantity which is wrong</li><li>correction: login was not fired after a logout </li><li>correction: item_list_id, item_list_name and index are now consiste</li></ul>","creationDate":{"date":"2023-07-19 14:03:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.9","text":"<p>same functionalities as 1.1.8 but for shopware 6.5</p>","creationDate":{"date":"2023-05-19 09:54:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<p>* add UserCentrics compatibility (shop owner might need to add manually 3 services : Google Tag Manager, Google Analytics, Google Ads)</p><p><br /></p><p>* fallback function to avoid problem with ill-defined cms elements</p><p><br /></p><p>* added a nonce missing on a script </p><p></p>","creationDate":{"date":"2023-05-19 09:43:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<p>This functionalities of this version are the same of version 1.1.6 but for is compatible only with Shopware 6.5</p>","creationDate":{"date":"2023-05-11 13:30:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>* cookieBot compatibility is increased - please add manually the nessary cookies if CookieBot does not detect your cookies.</p><p>* cookie configuration is simplified</p><p>* userId is now triggered before all other events</p><p>* fixed compatibility problem with Best Practice Checkout Plugin https://store.shopware.com/zeobv58372766564/best-practice-checkout.html</p><p>* fixed missing coupon information for \"add_shipping_info\", \"add_shipping_info\", and \"purchase\"</p><p>* fixed total price formatting in \"remove_from_cart\"</p><p>* added type and nonce to inline scripts</p><p>* encoding email for purchase event, using SHA-256 </p>","creationDate":{"date":"2023-05-11 10:57:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>* Compatibility for Shopware 6.5</p>","creationDate":{"date":"2023-04-11 10:47:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>* fixed compatibility Problem with Pickware</p>","creationDate":{"date":"2023-04-11 10:41:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<ul><li>fixed error - Unknown \"float\" test.</li></ul>","creationDate":{"date":"2023-04-06 11:20:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>increased compatibility with Customized Products <br /></li></ul>","creationDate":{"date":"2023-04-06 10:00:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>fixed an error happening when using the plugin Shopware Customized Products and Shopware 6.4.x*</li></ul>","creationDate":{"date":"2023-04-03 16:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"* MAJOR CHANGE: adding higher compabatility to custom templates (most of needed information is now in the header, 1 twig block used instead of 12)<br />* adding view_item_list to trigger in wish list page<br />* fixed select_item event on sidebar cart<br />* fixed product sku discrepancy<br />* preparing deprecation of custom function for shopware 6.5<br />* changed the cookie configuration to avoid having duplicate of cookie groups<br />* increase compabatibility to third cookie managers (added a custom cookie listener)<br />* improved coupons logic<br />* added configuration option to count graduated prices and uvp price as coupon<br />* added choice for brutto/netto price of google ads events<br />* corrected add_to_cart remove_to_cart in checkout/confirm<br />* added login event after successfull registration<br />* corrected search event in cases no products were found<br />* purchase event is now triggered on thank you page. To make sure third party payment is complete before triggering the purchase (for example for Paypal or Amazon payments).","creationDate":{"date":"2023-03-29 16:07:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"* added missing elements in event 'view_item_list'    * dataLayer.ecommerce.item_list_id    * dataLayer.ecommerce.item_list_name<br />* added missing elements in event 'select_item'    * dataLayer.ecommerce.item_list_id    * dataLayer.ecommerce.item_list_name<br />* added missing elements in event 'view_item'    * dataLayer.ecommerce.currency    * dataLayer.ecommerce.value    * dataLayer.ecommerce.items.index    * dataLayer.ecommerce.items.item_list_id    * dataLayer.ecommerce.items.item_list_name<br />* added missing elements in event 'add_to_cart'    * dataLayer.ecommerce.currency    * dataLayer.ecommerce.value missing<br />* added missing elements in event 'remove_from_cart'    * dataLayer.ecommerce.currency    * dataLayer.ecommerce.value<br />* added missing elements in event 'add_to_wishlist'    * dataLayer.ecommerce.currency    * dataLayer.ecommerce.value<br />* added missing elements in event 'begin_checkout'    * dataLayer.ecommerce.value    * dataLayer.ecommerce.currency    * dataLayer.ecommerce.coupon<br />* fixed dataLayer.items and dataLayer.value being sent even when Remarketing not active for some events<br />* enabled event 'view_search_results' to be triggered also when Remarketing was disabled (Enhanced event measurement - https://support.google.com/analytics/answer/9216061)<br />* extended the dataLayer for event 'view_search_results' to include 'search_result' and 'search_term'<br />* fixed search_result being 0 if using customised themes<br />* fixed some configuration logic. Some buttons for activation/deactivation was not having the proper effect.<br />* fixed dataLayer.ecommerce.items[...].index format. in few events it was sent as a string instead of integer<br />* modified dataLayer.ecommerce.items[...].item_variant to have comma (,) as separator instead of dash (-)<br />* fixed Event 'remove_from_cart' not being triggered by lowering quantity on cart page<br />* fixed dataLayer.value for events 'remove_from_cart' and 'add_to_cart'<br />* fixed item_brand empty for events \"view_item_list\" and \"select_item\" <br />* removed useless currency from dataLayer.ecommerce.items[...]<br />* added a field to configure the value addigned to leads (generate_lead event) <br />* added compatibility to purchase event. (in some customised templates, the purchase event was not triggered)<br />","creationDate":{"date":"2023-01-30 16:02:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>bug fixes:</p><p>we corrected the e-commerce array format for the following events:</p><p>add_to_cart</p><p>view_item_list</p><p>view_item</p>","creationDate":{"date":"2023-01-12 10:04:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>Bug Fixes:</p><p></p><ul><li>Script error on Listing page when buy button was deactivated.</li><li>Script name error during frontend-rebuild.</li></ul>","creationDate":{"date":"2023-01-09 11:24:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>First release</p><p><br /></p><p>Shopware compatibility &gt;= 6.4.0</p>","creationDate":{"date":"2022-11-30 11:04:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>First Release</p><p>Compatibility with Shopware 6.1 till 6.3</p>","creationDate":{"date":"2022-12-01 15:16:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.0","text":"<p>Version  0.0.0 not yet started. We are only submitting the Features of our plugin to get approval and start development</p>","creationDate":{"date":"2022-07-21 13:59:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=DISco37349247878","redirectToStore":false,"lowestPriceValue":19.99}