{"id":15590,"name":"ApplifactionVisualDocumentEditor","code":"Appli81810362453","lastChange":{"date":"2023-07-25 16:14:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyQBVtL","examplePageUrl":"","moduleKey":"ApplifactionVisualDocumentEditor","creationDate":{"date":"2022-07-22 15:09:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-10-11 17:50:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-11-14 11:23:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3740,"prefix":"Appli","name":"Applifaction","website":"//applifaction.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3740_Logo+Bildmarke+mit+Kreis+f%C3%BCr+Shopware+Store+128x128.png"},"infos":[{"id":27166,"name":"Dokumenten Editor für Shopware 6 - Rechnungen, Lieferscheine, Gutschriften, Stornos designen","description":"<p><b>Mit dieser Shopware 6 App gestalten Sie Ihre Dokumente schneller, einfacher und günstiger als je zuvor!</b><br></p><p>Der Dokumenten Editor ist ein kosten- und, zeitsparender, sowie intuitiv bedienbarer Rechnungs-, Lieferschein-, Gutschrifts- und Stornodesigner für Shopware 6. Durch die Live-Vorschau sehen Sie sofort, wie Ihr Dokument aussehen wird. Nutzen Sie die Vorlagen für ganze Dokumente und einzelne Elemente, um Ihre Dokumente noch schneller zu erstellen. Diese Vorlagen sind ideal für den Aufbau Ihres Onlineshops, da Sie durch die einfache Anpassung an Ihr Unternehmensdesign Zeit und Kosten sparen. Dadurch können sowohl Shopbetreiber, die ihren Onlineshop selbst umsetzen möchten, und professionelle Agenturen deutlich günstiger als herkömmlich die Dokumente von Onlineshops anpassen.</p><p><br><b>So schaffst du perfekte Dokumente - selbst ohne die Vorlage anzupassen!</b><br>Mit dem Dokumenten Editor können Sie auch ohne Vorkenntnisse ansprechende Designs für Rechnungen, Lieferscheine, Gutschriften und Stornos erstellen. Alle rechtlich verpflichtenden Elemente sind bereits in den Vorlagen enthalten, so dass Sie sich voll und ganz auf das Design Ihrer Dokumente konzentrieren können.&nbsp;Alle Dokumentenvorlagen entsprechen der Norm DIN 5008, damit die Adresse auch gut sichtbar in das Sichtfenster eines Kuverts passt.&nbsp;Das ansprechende Design der Dokumentenvorlagen sorgt dafür, dass die Dokumente in Ihrem Shop auch ohne Anpassungen überzeugend wirken.</p><p><br><b>Sehen Sie sofort, wie Ihre PDFs aussehen werden - mit der Vorschau-Funktion!</b><br>Die Vorschau-Funktion im Editor gibt Ihnen die Möglichkeit, bereits vorab zu sehen, wie die PDFs später aussehen werden. Durch Angabe einer Bestellnummer können Sie Vorschau-PDFs speziell für bestimmte Bestellungen testen. So stellen Sie sicher, dass die Dokumente für alle Ihre Anwendungsfälle optimal aussehen.</p><p><br><b>Platzieren Sie Elemente per Drag &amp; Drop auf ihrem Dokument</b><br>Sie können ganz einfach neue Elemente per Drag &amp; Drop auf der Seite platzieren. So können Sie zum Beispiel Texte und Bilder einfügen. Wenn Sie ein Element, das bereits im Dokument vorhanden ist, erneut verwenden möchten, können Sie es einfach duplizieren und dann das Duplikat mit der Maus verschieben und anpassen.</p><p><br><b>Mit einem Klick Google Fonts einbinden!</b><br>Suchen Sie sich einfach auf Google Fonts (https://fonts.google.com/) eine schöne Schriftart aus und konfigurieren Sie diese für Ihr Dokument. <br><br><b>So passen Sie Ihre Styles einfach an: Spalten, Zeilen, Bilder und Texte richtig formatieren!</b><br>Sie können entweder die Styles der Elemente, wie z.B. Spalten, Zeilen, Bilder und Texte direkt im Element anpassen oder global definieren. Global definierte Styles werden auf alle Elemente angewendet. Dadurch sparen Sie viel Zeit und vermeiden Fehler, wenn Sie sich z.B. dafür entscheiden die Schriftgröße doch etwas kleiner zu machen. <br><br>Folgende Styles können Sie konfigurieren:</p><ul><li>Hintergrundfarbe<br></li><li>Schriftart</li><li>Schriftfarbe</li><li>Schriftgröße</li><li>Schriftgewicht (z.B. Fett, Normal)</li><li>Schriftstil (z.B. Kursiv)</li><li>Zeilenhöhe</li><li>Buchstabenabstand</li><li>Abstände zu allen Seiten</li><li>Ausrichtung (Linksbündig, Zentriert, Rechtsbündig)</li><li>Rahmen inkl. Farbe, Stil, abgerundeten Ecken etc.</li></ul><br><b>Mehrseitige Dokumente</b><br>Hat ihre Bestellung so viele Bestellpositionen, dass ihr Dokument mehrere Seiten erfordert, ist das kein Problem. Sie können für jedes Element einstellen, ob diese nur auf der ersten, letzten oder auf allen Seiten dargestellt werden sollen. So kann z.B. die Adresse des Kunden nur auf der ersten Seite erscheinen und die Gesamtsumme aller Positionen nur auf der letzten Seite ausgegeben werden. Dies ist im Shopware Standard nicht möglich. <br><br><b>Variablen</b><br>Geben Sie einfach die Daten der Bestellung in ihrem Dokument aus, indem Sie variablen einfach per Klick zu Text-Elementen hinzufügen. So können Sie z.B. die Bestellnummer, Rechnungsnummer, Kunden USt-ID etc. an beliebigen Stellen des Dokuments darstellen. <br><br>Sie können aus einem Pool von Variablen bezüglich folgender Datensätze wählen: <ul><li>Bestellung (Bestellnummer, Bestellpositionen, Versand etc.)</li><li>Dokument (Rechnungsnummer, Lieferscheinnummer, Lieferdatum, Storno Nr., Gutschriftnummer etc.)</li><li>Dokumententyp Konfiguration (Eigener Firmenname, Eigene Firmenadresse, Bankverbindung etc.)</li><li>Zahlungsadresse</li><li>Versandadresse</li></ul><br><b>Wiederholte Elemente und Bedingungen</b><br>Für alle Elemente, die eine Logik (Schleifen oder Bedingungen) erfordern, wie z.B. für das wiederholte Ausgeben von Zeilen für die Bestellpositionen, gibt es vordefinierte \"Erweiterte Elemente\". Diese können Sie einfach per Drag &amp; Drop auf dem Dokument platzieren. Da die Dokumenten-Vorlagen schon alle \"Erweiterten Elemente\" beinhalten, ist dies im Normalfall nicht nötig.<br>Möchten Sie ihre eigenen Schleifen oder Bedingungen umsetzen, können Sie dies mit Hilfe von Twig-Syntax pro Element festlegen.<br><br>Vorlagen für Erweiterte Elemente sind vorhanden für:&nbsp;<ul><li>Bestellpositionen&nbsp;</li><li>Lieferpositionen&nbsp;</li><li>Adresszeile&nbsp;</li><li>Bestellsummen (Zwischensumme, Steuern, Gesamtsumme)&nbsp;</li><li>Fußzeile</li></ul><p><br></p><p><b>Möchten Sie Ihr Rechnungsdesign auf Ihre Stornorechnungen übertragen? So einfach geht das!</b></p><p>Mit der Import- / Export-Funktion können Sie Ihr Dokumentendesign als Datei herunterladen und in einem anderen Dokument oder Onlineshop importieren. So können Sie z.B. einfach Ihr Design von einem Dokumententyp (z.B. Rechnung) auf einen Anderen (z.B. Stornorechnung) übertragen.&nbsp;</p><p><br></p><p><b>Sind Sie eine professionelle Agentur und möchten ihr Basis-Dokumentendesign als Vorlage für Ihre Kunden verwenden?</b></p><p>Exportieren Sie einfach Ihr Dokumentendesign in eine Datei und importieren Sie diese in Ihr neues Onlineshop-Projekt. So können Sie Ihr Basis-Design wiederverwenden und diese im Anschluss an das Corporate Design der Marke des Kunden anpassen. So können Sie Ihren Shop-Kunden eine kostengünstige und hochwertige Möglichkeit bieten schöne Dokumentenvorlagen im Onlineshop zu verwenden.&nbsp;</p><br><b>Styling mit CSS</b><br>Im Normalfall reichen die vorhandenen Styling-Einstellungen aus, um alle Designs umzusetzen. Sollte der seltene Fall dennoch eintreten, dass Sie dennoch eine andere Styling-Einstellung setzen müssen, können Sie dies, indem Sie CSS Code zu den gewünschten Elementen hinzufügen. <br><br><b>Benötigen Sie Hilfe mit ihrem Design?</b><br>Ich helfe Ihnen ihr Design umzusetzen. Kontaktieren Sie mich einfach über das Support-Formular des Shopware Stores.&nbsp;<p></p>","installationManual":"<h2>Installation via ZIP-File über die Shopware Administrationsoberfläche:</h2><p></p><ol><li>Laden Sie die Plugin ZIP Datei aus dem Shopware Store herunter.</li><li>Navigieren Sie in der Administrationsoberfläche von Shopware zu \"Erweiterungen\" &gt; \"Meine Erweiterungen\".</li><li>Laden Sie das Plugin ZIP File, indem Sie oben rechts auf den \"Erweiterung hochladen\" Button klicken.</li><li>Nun taucht ein neues Plugin in der Liste namens \"Dokumenten Editor\" auf. Klicken Sie bitte hier auf \"App installieren\".</li><li>Sobald die Installation abgeschlossen ist, aktivieren Sie das Plugin, indem Sie den Schalter auf der linken Seite aktivieren.&nbsp;</li><li>Nun können Sie den Editor für jeden Dokumententyp unter unter \"Einstellungen\" &gt; \"Dokumente\" aktivieren.</li></ol>","shortDescription":"Gestalten Sie Ihre Dokumente (Rechnungen, Lieferscheine, Gutschriften, Stornos) ohne die Hilfe eines Entwicklers. Einfach per Drag & Drop z.B. Texte & Bilder platzieren und anpassen.","highlights":"Keine Entwicklerkenntnisse notwendig\nSehr intuitive Bedienung dank Drag & Drop von Elementen und Live-Vorschau\nPDF-Vorschau im Editor für bestimmte Bestellung für zielgenaues Testing\nNormbrief DIN 5008 Konforme Dokumenten-Vorlagen\nElement Vorlagen für alle üblichen Elemente der Shopware Dokumente","features":"WYISWYG Editor für Rechungen, Lieferscheine, Gutschriften und Stornorechnungen\nTexte und Bilder per Drag & Drop auf Dokumenten plazieren\nViele Stylingmöglichkeiten (Schrift, Hintergründe, Rahmen, Abstände)\nProduction-Ready Vorlagen\nJeder Google Fonts ist einfach anwendbar\nVariablen (z.B. Bestellnummer, Kunden USt-ID etc.) per Klick einfügen\nImport- / Export- Funktion: Lade dein Design als Datei herunter und importiere es einfach in ein anderes Dokument oder Onlineshop.\nVideoanleitung: https://www.youtube.com/watch?v=8G20GQSI1Yw"},{"id":27167,"name":"Document Editor for Shopware 6 - Design Invoices, Delivery notes, Credit notes, Storno bills","description":"<b>With this Shopware 6 app you can design your documents faster, easier and cheaper than ever before!</b><br><p>This Document Editor is a cost- and time-saving, as well as intuitive invoice, delivery bill, credit bill and cancellation designer for Shopware 6. Through the live preview you can immediately see how your document will look like. Use the templates for entire documents and individual elements to create your documents even faster. These templates are ideal for building your online store, as you will save time and money by easily adapting them to your business design. This allows both store owners who want to implement their online store themselves and professional agencies to customize online store documents much more cheaply than traditionally.<br></p><p><br></p><b>This is how you create perfect documents - even without customizing the template!</b><br>Mit dem Dokumenten Editor können Sie auch ohne Vorkenntnisse ansprechende Designs für Rechnungen, Lieferscheine, Gutschriften und Stornos erstellen. Alle rechtlich verpflichtenden Elemente sind bereits in den Vorlagen enthalten, so dass Sie sich voll und ganz auf das Design Ihrer Dokumente konzentrieren können.&nbsp;Alle Dokumentenvorlagen entsprechen der Norm DIN 5008, damit die Adresse auch gut sichtbar in das Sichtfenster eines Kuverts passt.&nbsp;Das ansprechende Design der Dokumentenvorlagen sorgt dafür, dass die Dokumente in Ihrem Shop auch ohne Anpassungen überzeugend wirken.<p><br><b>Instantly see how your PDFs will look with the preview feature!</b><br>The preview function in the editor gives you the opportunity to see in advance how the PDFs will look later. By specifying an order number, you can test preview PDFs specifically for certain orders. This ensures that the documents look optimal for all your use cases.</p><p><br><b>Place elements on your document via drag &amp; drop</b><br>You can easily place new elements on the page using drag and drop. For example, you can insert texts and images. If you want to reuse an element that already exists in the document, you can simply duplicate it and then move and adjust the duplicate with the mouse.</p><p><br><b>Embed Google Fonts with one click!</b><br>Just find a nice font on Google Fonts (https://fonts.google.com/) and embed it in your document by simply selecting it from a dropdown.<br><br><b>It's so easy to customize your styles: Format columns, rows, images and texts.</b><br>You can either customize the styles of the elements, such as columns, rows, images and texts directly in the element or define them globally. Globally defined styles are applied to all elements. This saves you a lot of time and avoids mistakes, e.g. if you decide to make the font size a little smaller.</p><p><br>You can configure the following styles: </p><ul><li>Background color</li><li>Font family</li><li>Font color</li><li>Font size</li><li>Font weight (e.g. Bold, Normal)</li><li>Font style (e.g. Italic)</li><li>Line height</li><li>Letter spacing</li><li>Spacing to all sides</li><li>Alignment (left-aligned, centered, right-aligned)</li><li>Borders including color, style, rounded corners, etc.</li></ul><br><b>Multipage documents</b><br>If your order has so many order items that your document requires several pages, this is not a problem. You can set for each item whether they should be displayed only on the first, last or all pages. For example, the customer's address can appear only on the first page and the total amount of all items can be displayed only on the last page. This is not possible in Shopware Standard. <br><br><b>Variables</b><br>Simply output the order data in your document by adding variables to text elements with a single click. For example, you can display the order number, invoice number, customer VAT ID, etc. anywhere in the document.<p></p><p><br>You can choose from a pool of variables related to the following records: </p><ul><li>Order (order number, order items, delivery etc.)</li><li>Document (invoice number, delivery note number, delivery date, storno no., credit note number etc.)</li><li>Document type configuration (own company name, own company address, bank details etc.)</li><li>Payment address</li><li>Shipping address</li></ul><p><br></p><p><b>Are you a professional agency and want to use your basic document design as a template for your clients?</b></p><p>Simply export your document design to a file and import it into your new online store project. This way you can reuse your basic design and adapt it to the corporate design of the customer's brand afterwards. This way you can offer your customers a cost-effective and high-quality way to use beautiful document templates in their online store.</p><br><b>Repeated elements and conditions</b><br><p></p><p>For all elements that require logic (loops or conditions), such as for the repeated output of lines for the order items, there are predefined \"Advanced elements\". You can simply drag and drop these onto the document. Since the document templates already contain all \"Extended Elements\", this is normally not necessary.</p><p>If you want to implement your own loops or conditions, you can do this using Twig syntax per element.</p><p><br></p><p>Extended elements templates are available for: </p><ul><li>Order items</li><li>Delivery items</li><li>Address line</li><li>Order totals (subtotal, taxes, grand total)</li><li>Footer line</li></ul><br><b>Styling with CSS</b><br>Normally, the given styling settings are sufficient to implement all designs. However, in the rare case that you still need to set a different styling setting, you can do so by adding CSS code to the desired elements. <br><br><b>Need help with your design?</b><br>I can help you implement your design. Just contact me via the Shopware Store!<br><p></p>","installationManual":"<h2>Installation via ZIP file through the Shopware administration interface:</h2><p></p><ol><li>Download the plugin ZIP file from the Shopware Store.</li><li>Navigate to \"Extensions\" &gt; \"My Extensions\" in the Shopware admin interface.</li><li>Download the plugin ZIP file by clicking on the \"Upload extension\" button in the top right corner.</li><li>Now a new plugin will appear in the list called \"Document Editor\". Please click on \"Install App\" here.</li><li>Once the installation is complete, enable the plugin by activating the switch on the left side.&nbsp;</li><li>Now you can activate the editor for each document type under \"Settings\" &gt; \"Documents\".</li></ol>","shortDescription":"Design your documents, like invoices, delivery notes, credit notes, storno bills without the help of a developer. Simply drag & drop e.g. texts & images to place and customize.","highlights":"No developer knowledge necessary\nVery intuitive operation thanks to drag & drop of elements and live preview\nPDF preview in the editor for specific order for targeted testing\nStandard letter DIN 5008 compliant document templates\nElement templates for all common elements of Shopware documents","features":"WYISWYG editor for invoices, delivery notes, credit notes and storno bills\nPlace texts and images on documents by drag & drop\nMany styling options (fonts, backgrounds, frames, spacing)\nProduction-ready templates\nUse any Google Font easily \nInsert variables (e.g. order number, customer VAT ID, etc.) with a single click\nImport / Export function: Download your design as a file and easily import it into another document or online store.\nVideo tutorial: https://www.youtube.com/watch?v=8G20GQSI1Yw"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166015,"bookingKey":"Appli81810362453","bookingText":"Drag & Drop Document Editor with Templates","price":399,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":166014,"bookingKey":"Appli81810362453_M","bookingText":"Drag & Drop Document Editor with Templates","price":34.5,"duration":1,"trialPhaseIncluded":true,"discount":43,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php468aEI","preview":true,"priority":100,"id":101360},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprAi1w4","preview":false,"priority":95,"id":101370},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe4my3f","preview":false,"priority":93,"id":101371},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDXFAsN","preview":false,"priority":90,"id":101366},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7tTfmF","preview":false,"priority":80,"id":101364},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php176ARx","preview":false,"priority":70,"id":101362},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZovlWs","preview":false,"priority":60,"id":101365}],"comments":[{"authorName":"Select Mode online","text":"Dieses Plugin gibt einem wirkich die Möglichkeit alles im technisch machbaren Rahmen von SW grafisch ansprechend auf seine Dokumente zu bekommen. Mit ein bisschen reinfuchsen auch für Menschen ohne Programmierkenntnisse umsetzbar. Es ist sehr angenehm für uns, dass wir nicht für jede Änderung und Anpassung unesen IT-Partner fragen müssen. Dazu bekommt man den herrausragensten Support, den wir je erleben durften. Oliver hat uns alles gezeigt, erklärt und sogar Wunschfeatures umgehend in das Plugin aufgenommen. Wir können das Plugin und Application sehr empfehlen.","headline":"Gutes Plugin, überragender Support!","creationDate":{"date":"2023-07-17 10:44:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Oliver Thom","text":"Vor dem Plugin, hatten wir ein Problem mit der Dokumentenerstellung in Shopware 6.\nAls wir das Plugin „Dokument Editor für Shopware 6 \" empfohlen bekamen und installiert hatten, merkten wir schnell das es das fehlende Puzzle für unsere Dokumenten Gestaltung war\nJe doch hatte etwas nicht funktioniert, weshalb wir dem Support schrieben.\nVia Video Meeting haben wir zusammen mit dem Entwickler das Problem gesucht und am Ende des Meetings auch gefunden.\nDaraufhin wurde ein passgenauer Bug Fix für uns geschrieben, sodass uns noch am selben Tag ein Update zur Verfügung stand, welches das Problem endgültig gelöst hat.\nWir sind sehr dankbar für die ausgezeichnete und zuvorkommende Arbeit von Oliver.\nDanke nochmals!","headline":"CPS Pharma","creationDate":{"date":"2023-07-14 13:07:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Jürgen Klein","text":"Die Erstellung von Dokumenten wird durch diese Erweiterung unglaublich vereinfacht. Per Drag&amp;Drop werden die gewünschten Vorlagen und Texte erzeugt. Was nicht geht, wird auf Wunsch einfach und schnell erweitert oder korrigiert. Auf diese Art und Weise konnte auch unser Shop, der wirklich sehr viele Modifikationen enthält, in vollem Umfang von diesem Modul profitieren. Besonders gut: Dokumente lassen sich jetzt ganz einfach übersetzen und das Plugin meldet sogar, welche Texte noch nicht übersetzt wurden. So sieht also Benutzerfreundlichkeit aus. Ich kann sowohl das Plugin als auch den Entwickler nur empfehlen. Aus diesem Grund haben wir Applifaction als freien Entwickler in unser Team integriert. Perfekter Service und Kundenwünsche werden immer in den Mittelpunkt gestellt. Am liebsten würde ich 10 Sterne vergeben!","headline":"Schneller Support, extrem hilfreiches Plugin","creationDate":{"date":"2023-06-22 13:39:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Alexander Schiek","text":"Oliver reagiert unglaublich schnell auf Anfragen und hat uns noch innerhalb der Testphase bei der Erstellung unserer Dokumente unterstützt. Wenn man bei Anpassungen nicht weiter kommt übernimmt er das und erklärt es dann ausführlich wie die Änderungen umgesetzt wurden. Vielen Dank für deine Hilfe und die super durchdachte Erweiterung.","headline":"Sensationeller Support + toller Editor für die Dokumente = 5 Sterne","creationDate":{"date":"2023-04-12 18:08:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Daniel","text":"Applifaction hat es geschafft, die sehr komplexe Dokumenten-Anpassung sehr zu vereinfachen. Egal ob Design, neue Variablen, neue Texte oder auch Bedingungen in Dokumente sind einfach zu handeln. Zusätzlich ist der Support bei Anpassungen super schnell - so etwas habe ich bisher noch nicht erlebt. Gerade da wir im B2B-Markt besondere Anforderungen wie billie als Zahlungsart oder ein extra Angebotsplugin haben , war es klasse, dass uns hier immer super schnell geholfen wurde. Ganz grossen DANK !!!","headline":"Sehr gutes umfangreiches Plugin und noch besserer Support","creationDate":{"date":"2023-04-04 14:11:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Stefan Müller","text":"Und Hilfsangebot erhalten. Gute Zusammenarbeit. Danke. Stefan","headline":"Habe Rückmeldung erhalten / Sehr guter Support","creationDate":{"date":"2023-03-20 17:57:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Thorsten von THE PET WORLD","text":"Da unser Auftreten gegenüber unserer Kunden perfekt sein soll. Gerade was die Dokumente betrifft. Haben wir uns für diesen Editor entschieden und nicht bereut. Da man hier eigentlich alles so ändern kann wie man gerne hätte.\nWir hatten trotz dem umfangreichen Plugin, noch die ein oder anderen Wünsche. Diese wurden schnell und ohne wenn und aber umgesetzt.\nDeshalb ist dieses Plugin sein Geld wirklich wert.","headline":"Super Dokumenten Editor und erstklassiger Support","creationDate":{"date":"2023-02-07 09:28:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Louis Hellwig | Daimler Truck AG","text":"Der Support reagiert sehr schnell und setzt Kundenwünsche gezielt so um, dass sie auch für Nicht-Entwickler sehr gut verständlich sind. Oft werden die Anpassungen sogar mit Video-Anleitung erklärt, was die Umsetzung nochmal deutlich vereinfacht.","headline":"Einfach zu bedienen &amp; unfassbar schneller und guter Support","creationDate":{"date":"2023-01-27 12:41:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Rene F.","text":"Die Standard-Dokumente über Shopware 6 entsprachen nicht unseren Vorstellungen.\nDeswegen haben wir uns den WYSIWYG Dokumenten Editor geholt.\n\nKurz zusammengefasst: \nWir sind begeistert! Die Dokumentenvorlagen sind spitze, und wenn es mal fragen oder Änderungswünsche gibt, meldet sich der Kundenservice innerhalb kürzester Zeit mit einer präzisen maßgeschneiderten Anleitung, die auch für jeden Laien verständlich ist.","headline":"Sehr guter Dokumenteneditor, erstklassiger Kundenserice!","creationDate":{"date":"2023-01-26 09:46:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Florian Wöll","text":"Die Erweiterung macht, was sie soll!\nAnfänglich waren zwar noch einige unverzeihliche Fehler vorhanden. diese wurden aber mit äußert großer Aufmerksamkeit und prompt anhand der Kundenmeldungen behoben. Nach jetzigem Stand scheint die Erweiterung fehlerfrei zu funktionieren. Aber selbst wenn nicht, hätte ich keine Sorge, denn der Support ist spitze.\nDie Vielfalt der Formatierungen und Möglichkeiten der Einstellungen der LayOut-beeinflussenden Parameter ist enorm und man muss sich etwas einfuchsen; wer aber viel will muss ja schließlich auch viel einstellen können.\nBesonders sympathisch war der Support, als nicht nur das Problem gelöst wurde, sondern gleich noch einige Tipps zu Perfektionierung meiner individuellen Rechnung per individuellem Anleitungsvideo mit persönlicher Ansprache geliefert wurden.   Noch näher am Kunden geht nicht! \n\nAuch nach einem Jahr prompte Hilfestellung; weit über die Erweiterung hinaus. Die Antwort ist schon da, bevor die Frage gestellt wurde ;-)","headline":"tolle Erweiterung mit vielen Möglichkeiten","creationDate":{"date":"2023-01-01 10:33:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Günter Winkler","text":"Eine tolle Erweiterung, sehr Hilfreich...\nSupport 1A","headline":"Alles Prima !","creationDate":{"date":"2022-12-12 11:22:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Matthias","text":"Diese Erweiterung ist fast schon ein Muss, wenn man die Shopware-Dokumente (Rechnung, Lieferschein, Gutschrift etc.) individuell anpassen möchte. Der Editor arbeitet im WYSIWYG-Modus, so dass man hier sieht, was man macht.\n\nDer Entwickler bietet tollen und schnellen Support (auch per Videocall) und lässt auch Verbesserungsvorschläge der Nutzer in die Entwicklung der Erweiterung einfließen.\nRundum eine gelungene Sache.","headline":"Sehr hilfreiche Erweiterung, um Dokumente einfach selbst anzupassen","creationDate":{"date":"2022-11-14 11:56:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9}],"ratingAverage":10,"label":"Dokumenten Editor für Shopware 6 - Rechnungen, Lieferscheine, Gutschriften, Stornos designen","description":"<p><b>Mit dieser Shopware 6 App gestalten Sie Ihre Dokumente schneller, einfacher und günstiger als je zuvor!</b><br /></p><p>Der Dokumenten Editor ist ein kosten- und, zeitsparender, sowie intuitiv bedienbarer Rechnungs-, Lieferschein-, Gutschrifts- und Stornodesigner für Shopware 6. Durch die Live-Vorschau sehen Sie sofort, wie Ihr Dokument aussehen wird. Nutzen Sie die Vorlagen für ganze Dokumente und einzelne Elemente, um Ihre Dokumente noch schneller zu erstellen. Diese Vorlagen sind ideal für den Aufbau Ihres Onlineshops, da Sie durch die einfache Anpassung an Ihr Unternehmensdesign Zeit und Kosten sparen. Dadurch können sowohl Shopbetreiber, die ihren Onlineshop selbst umsetzen möchten, und professionelle Agenturen deutlich günstiger als herkömmlich die Dokumente von Onlineshops anpassen.</p><p><br /><b>So schaffst du perfekte Dokumente - selbst ohne die Vorlage anzupassen!</b><br />Mit dem Dokumenten Editor können Sie auch ohne Vorkenntnisse ansprechende Designs für Rechnungen, Lieferscheine, Gutschriften und Stornos erstellen. Alle rechtlich verpflichtenden Elemente sind bereits in den Vorlagen enthalten, so dass Sie sich voll und ganz auf das Design Ihrer Dokumente konzentrieren können. Alle Dokumentenvorlagen entsprechen der Norm DIN 5008, damit die Adresse auch gut sichtbar in das Sichtfenster eines Kuverts passt. Das ansprechende Design der Dokumentenvorlagen sorgt dafür, dass die Dokumente in Ihrem Shop auch ohne Anpassungen überzeugend wirken.</p><p><br /><b>Sehen Sie sofort, wie Ihre PDFs aussehen werden - mit der Vorschau-Funktion!</b><br />Die Vorschau-Funktion im Editor gibt Ihnen die Möglichkeit, bereits vorab zu sehen, wie die PDFs später aussehen werden. Durch Angabe einer Bestellnummer können Sie Vorschau-PDFs speziell für bestimmte Bestellungen testen. So stellen Sie sicher, dass die Dokumente für alle Ihre Anwendungsfälle optimal aussehen.</p><p><br /><b>Platzieren Sie Elemente per Drag &amp; Drop auf ihrem Dokument</b><br />Sie können ganz einfach neue Elemente per Drag &amp; Drop auf der Seite platzieren. So können Sie zum Beispiel Texte und Bilder einfügen. Wenn Sie ein Element, das bereits im Dokument vorhanden ist, erneut verwenden möchten, können Sie es einfach duplizieren und dann das Duplikat mit der Maus verschieben und anpassen.</p><p><br /><b>Mit einem Klick Google Fonts einbinden!</b><br />Suchen Sie sich einfach auf Google Fonts (https://fonts.google.com/) eine schöne Schriftart aus und konfigurieren Sie diese für Ihr Dokument. <br /><br /><b>So passen Sie Ihre Styles einfach an: Spalten, Zeilen, Bilder und Texte richtig formatieren!</b><br />Sie können entweder die Styles der Elemente, wie z.B. Spalten, Zeilen, Bilder und Texte direkt im Element anpassen oder global definieren. Global definierte Styles werden auf alle Elemente angewendet. Dadurch sparen Sie viel Zeit und vermeiden Fehler, wenn Sie sich z.B. dafür entscheiden die Schriftgröße doch etwas kleiner zu machen. <br /><br />Folgende Styles können Sie konfigurieren:</p><ul><li>Hintergrundfarbe<br /></li><li>Schriftart</li><li>Schriftfarbe</li><li>Schriftgröße</li><li>Schriftgewicht (z.B. Fett, Normal)</li><li>Schriftstil (z.B. Kursiv)</li><li>Zeilenhöhe</li><li>Buchstabenabstand</li><li>Abstände zu allen Seiten</li><li>Ausrichtung (Linksbündig, Zentriert, Rechtsbündig)</li><li>Rahmen inkl. Farbe, Stil, abgerundeten Ecken etc.</li></ul><br /><b>Mehrseitige Dokumente</b><br />Hat ihre Bestellung so viele Bestellpositionen, dass ihr Dokument mehrere Seiten erfordert, ist das kein Problem. Sie können für jedes Element einstellen, ob diese nur auf der ersten, letzten oder auf allen Seiten dargestellt werden sollen. So kann z.B. die Adresse des Kunden nur auf der ersten Seite erscheinen und die Gesamtsumme aller Positionen nur auf der letzten Seite ausgegeben werden. Dies ist im Shopware Standard nicht möglich. <br /><br /><b>Variablen</b><br />Geben Sie einfach die Daten der Bestellung in ihrem Dokument aus, indem Sie variablen einfach per Klick zu Text-Elementen hinzufügen. So können Sie z.B. die Bestellnummer, Rechnungsnummer, Kunden USt-ID etc. an beliebigen Stellen des Dokuments darstellen. <br /><br />Sie können aus einem Pool von Variablen bezüglich folgender Datensätze wählen: <ul><li>Bestellung (Bestellnummer, Bestellpositionen, Versand etc.)</li><li>Dokument (Rechnungsnummer, Lieferscheinnummer, Lieferdatum, Storno Nr., Gutschriftnummer etc.)</li><li>Dokumententyp Konfiguration (Eigener Firmenname, Eigene Firmenadresse, Bankverbindung etc.)</li><li>Zahlungsadresse</li><li>Versandadresse</li></ul><br /><b>Wiederholte Elemente und Bedingungen</b><br />Für alle Elemente, die eine Logik (Schleifen oder Bedingungen) erfordern, wie z.B. für das wiederholte Ausgeben von Zeilen für die Bestellpositionen, gibt es vordefinierte \"Erweiterte Elemente\". Diese können Sie einfach per Drag &amp; Drop auf dem Dokument platzieren. Da die Dokumenten-Vorlagen schon alle \"Erweiterten Elemente\" beinhalten, ist dies im Normalfall nicht nötig.<br />Möchten Sie ihre eigenen Schleifen oder Bedingungen umsetzen, können Sie dies mit Hilfe von Twig-Syntax pro Element festlegen.<br /><br />Vorlagen für Erweiterte Elemente sind vorhanden für: <ul><li>Bestellpositionen </li><li>Lieferpositionen </li><li>Adresszeile </li><li>Bestellsummen (Zwischensumme, Steuern, Gesamtsumme) </li><li>Fußzeile</li></ul><p><br /></p><p><b>Möchten Sie Ihr Rechnungsdesign auf Ihre Stornorechnungen übertragen? So einfach geht das!</b></p><p>Mit der Import- / Export-Funktion können Sie Ihr Dokumentendesign als Datei herunterladen und in einem anderen Dokument oder Onlineshop importieren. So können Sie z.B. einfach Ihr Design von einem Dokumententyp (z.B. Rechnung) auf einen Anderen (z.B. Stornorechnung) übertragen. </p><p><br /></p><p><b>Sind Sie eine professionelle Agentur und möchten ihr Basis-Dokumentendesign als Vorlage für Ihre Kunden verwenden?</b></p><p>Exportieren Sie einfach Ihr Dokumentendesign in eine Datei und importieren Sie diese in Ihr neues Onlineshop-Projekt. So können Sie Ihr Basis-Design wiederverwenden und diese im Anschluss an das Corporate Design der Marke des Kunden anpassen. So können Sie Ihren Shop-Kunden eine kostengünstige und hochwertige Möglichkeit bieten schöne Dokumentenvorlagen im Onlineshop zu verwenden. </p><br /><b>Styling mit CSS</b><br />Im Normalfall reichen die vorhandenen Styling-Einstellungen aus, um alle Designs umzusetzen. Sollte der seltene Fall dennoch eintreten, dass Sie dennoch eine andere Styling-Einstellung setzen müssen, können Sie dies, indem Sie CSS Code zu den gewünschten Elementen hinzufügen. <br /><br /><b>Benötigen Sie Hilfe mit ihrem Design?</b><br />Ich helfe Ihnen ihr Design umzusetzen. Kontaktieren Sie mich einfach über das Support-Formular des Shopware Stores. <p></p>","installationManual":"<h2>Installation via ZIP-File über die Shopware Administrationsoberfläche:</h2><p></p><ol><li>Laden Sie die Plugin ZIP Datei aus dem Shopware Store herunter.</li><li>Navigieren Sie in der Administrationsoberfläche von Shopware zu \"Erweiterungen\" &gt; \"Meine Erweiterungen\".</li><li>Laden Sie das Plugin ZIP File, indem Sie oben rechts auf den \"Erweiterung hochladen\" Button klicken.</li><li>Nun taucht ein neues Plugin in der Liste namens \"Dokumenten Editor\" auf. Klicken Sie bitte hier auf \"App installieren\".</li><li>Sobald die Installation abgeschlossen ist, aktivieren Sie das Plugin, indem Sie den Schalter auf der linken Seite aktivieren. </li><li>Nun können Sie den Editor für jeden Dokumententyp unter unter \"Einstellungen\" &gt; \"Dokumente\" aktivieren.</li></ol>","version":"1.1.9","changelog":[{"version":"1.1.9","text":"<p>- Templates for delivery bills improved</p><p>- Bugfix: Line spacing is now correct in case that in Shopware 6.5 the document was generated with a flow</p>","creationDate":{"date":"2023-07-25 15:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<p>Small bugfix for an error when opening the editor for credit notes if there was no credit note document in the last order.</p>","creationDate":{"date":"2023-07-10 17:32:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<p>- Manufacturer data is now also inherited from the parent article to variants</p><p>- Calculation of credit total amount improved</p><p>- The indicator when selecting Twig/CSS code in code editors in Shopware 6.4 did not have the correct position and length</p><p>- Document entity selection when generating PDF preview in the editor improved</p>","creationDate":{"date":"2023-07-10 16:12:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>Data selection for credit note PDFs improved.</p>","creationDate":{"date":"2023-07-09 16:44:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>Fixed an error that occurred when specific third-party document types were used.</p>","creationDate":{"date":"2023-07-06 14:46:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>Product manufacturer data can now be output with variables in the document.</p>","creationDate":{"date":"2023-07-04 13:09:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>- Compatibility with NetInventor's \"Show the weight of the order - BasketWeight\" plugin established.<br />- The \"Items per page\" core setting for documents is now initialized if it is empty and the editor is opened. </p>","creationDate":{"date":"2023-07-03 18:23:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>Performance and stability improvements</p>","creationDate":{"date":"2023-06-25 16:55:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Fixed icons for e.g. bold, italic and right-align toolbar when editing text in Shopware 6.5</p>","creationDate":{"date":"2023-06-22 12:28:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Added compatibility with Shopware 6.5</p><p>- Bugfixes</p>","creationDate":{"date":"2023-06-13 18:53:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.34","text":"<p>Fixed an error that caused the wrong base document configuration to be used in the PDF preview when the document type had multiple configurations for different sales channels. <br /></p>","creationDate":{"date":"2023-05-29 08:01:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.33","text":"<p>- Faster saving of themes especially for stores with many languages</p><p>- New themes for all document types</p><p>- New selection interface for choosing themes with more accurate preview</p><p>- Compatibility with Shopware 6.4.0 established (compatibility with 6.5.x will follow in the next update)</p><p>- Added new HTML preview of documents as optional alternative to PDF preview</p><p>- Design visible in the editor now corresponds more accurately to the PDFs generated later on</p><p>- New keyboard shortcut CTRL+S for saving</p><p>- Many general usability &amp; performance improvements</p><p>- Bugfixes</p>","creationDate":{"date":"2023-05-22 09:20:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.32","text":"<p>- Languages beyond the default limit of 25 languages per API request are now loaded. </p><p>- Improved performance of template saving process for many languages.</p><p>- Made the menu of text elements for switching languages more user-friendly</p><p>- Added reference to the language management admin interface in the translation tab.</p><p>- In Shopware versions lower than 6.4.12 the editor activation panel is now also displayed on top</p><p>- package.json file for local build of the plugin included</p>","creationDate":{"date":"2023-04-26 13:28:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.31","text":"<p>- Sorting and display of Customized Products adapted</p><p>- New document template \"Arya\" for invoices</p><p>- Existing invoice templates customized</p><p>- Image size adjustment enabled</p><p>- Usability improved</p><p>- Old \"non-Meteor\" icons integrated</p><p>- New plugin icon</p><p>- Plugin renamed from \"WYSIWYG Document Editor\" to \"Document Editor</p>","creationDate":{"date":"2023-04-22 13:28:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.30","text":"<p>- Documents can now be easily translated into all languages in the editor</p><p>- The number of items per page can now be edited in the editor while previewing the PDF so that this Shopware Core setting can be tested directly and quickly. </p><p>- Self-saved element templates can now be easily imported and exported</p><p>- New Functional Elements: Deviating shipping address, payment method dependent element.</p><p>- New document templates for invoices, cancellation invoices, credit bills, delivery bills, pick lists (Pickware), supplier orders (Pickware), individual offers (PremSoft)</p>","creationDate":{"date":"2023-04-17 14:10:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.29","text":"<p>- Fixed Error when generating multiple document during the execution of a flow</p><p>- Sorting of order items adjusted</p>","creationDate":{"date":"2023-03-31 09:13:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.28","text":"<p>- When double-clicking on a text field to edit the text, it is prevented that an action button of the appearing context menu is pressed by mistake with the second click</p><p>- Fixed an error that occurs when the visibility tab is opened.</p>","creationDate":{"date":"2023-03-26 09:10:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.27","text":"<p>- Order data is now loaded when generating PDFs in exactly the same way as when generating the PDF preview.</p><p>- Fixed rendering error that could occur when using background images for rows.</p>","creationDate":{"date":"2023-03-26 07:25:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.26","text":"<p>- Added support for Croatian special characters</p>","creationDate":{"date":"2023-03-25 15:34:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.25","text":"<p>- The editor can now also process orders that have no deliveries. This is the case if the order contains only digital products. </p><p>- Sales channel currencies are now available as variables. This makes it possible to display prices &amp; totals in different currencies on one document. </p><p>- \"Compact\" PDF templates adapted so that there is more space for order items. This allows more items to fit on each page.</p>","creationDate":{"date":"2023-03-24 10:07:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.24","text":"<p>- Significant performance optimizations when loading the editor</p><p>- \"&amp;&amp;\" Twig operators won't cause a rendering error any more</p>","creationDate":{"date":"2023-03-18 14:35:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.23","text":"<p>- Fixed an bug, which occurred, when editor was disabled</p>","creationDate":{"date":"2023-03-17 08:15:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.22","text":"<p>- Performance improvements when loading the editor</p><p>- Fixed a JS bug related to slow server responses</p><p>- Compatibility with PHP 8.1.16 established</p>","creationDate":{"date":"2023-03-15 12:11:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.21","text":"<p>Bugfix: The editor is now only opened when all variable data has been loaded from the server. This prevents a Javascript error.</p>","creationDate":{"date":"2023-03-13 09:58:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.20","text":"<p>Added setting to treat shipping costs like an order item when it comes to automatic page break placement.</p>","creationDate":{"date":"2023-03-13 08:40:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.19","text":"<p>Compatibility with PremSoft's \"Individual offer\" plugin established. </p><p><br /></p><p>Just load one of the ready-made individual offer design templates and design your quote PDFs for your customers according to your wishes!</p>","creationDate":{"date":"2023-03-13 06:46:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.18","text":"<p>Country States can be displayed now too.</p>","creationDate":{"date":"2023-02-20 07:42:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.17","text":"<p>Product data from the parent products of variant products can now also be displayed.</p>","creationDate":{"date":"2023-02-09 06:23:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.16","text":"<p>- The units of measurement of products can now also be output in documents.</p>","creationDate":{"date":"2023-02-07 03:30:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.15","text":"<p>- The product data record is now added to the order item. This makes it possible, for example, to also display product data such as packaging units on invoices and delivery bills. </p><p>- The Twig variable name can now be displayed in the variable tree and in the variable search. This makes it easier to find the right variable name if you want to write your own Twig code.</p>","creationDate":{"date":"2023-02-06 05:45:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.14","text":"<p>- Fixed rare error when rendering the PDF preview</p>","creationDate":{"date":"2023-01-25 14:22:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.13","text":"<p></p><ul><li>Added compatibility with Payone payment app. </li><li>Added request for rating in Shopware Store to document preview.  </li></ul>","creationDate":{"date":"2023-01-20 04:53:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.12","text":"<p>- Compatibility with the \"Pickware ERP Starter\" app has been established.  Now picklists and supplier orders can be designed with the document editor via drag &amp; drop. </p><p>- Added one German and one English document template each for picklists and supplier orders.</p><p>- Compatibility with the app \"Pickware WMS\" established.</p>","creationDate":{"date":"2022-12-21 10:47:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p>- An empty document template without default settings has been added, which you can now use as a starting point to implement your desired design.</p><p>- The default templates have been adjusted so that if an order has multiple transactions, the payment method is now only displayed once.</p><p>- An error had prevented the \"Visibility\" tab from being opened.</p>","creationDate":{"date":"2022-12-08 10:29:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<p>- Document generation with Shopware's mass update feature now uses the templates from the WYSIWYG document editor. </p><p>- You can now set a background image for your document.</p><p>- You can now display product images in the list of your order items.</p><p>- You can now easily set the page margin of your document.</p><p>- Document templates are now easier to edit, because some text formatting, e.g. bold, is no longer set by HTML tags, but uniformly by style settings.</p>","creationDate":{"date":"2022-12-07 11:57:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>For the following style settings of elements you can now select the option \"Use global style\". This way you can force the use of the configuration from the \"Global styles\".</p><p>- Font weight</p><p>- Font style</p><p>- Horizontal alignment</p><p>- Text decoration</p>","creationDate":{"date":"2022-12-05 10:08:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>- You now have the possibility to store a global CSS stylesheet. This way you can really style everything. </p><p>- You can now give each element its own CSS class, which you can then use in your global CSS stylesheet. </p><p>- If you change the background color of the document body, the color of the page border will be changed as well.  </p>","creationDate":{"date":"2022-11-26 15:53:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- Search function for variables added</p><p>- The font \"Roboto\" is now only included globally in the document templates instead of on the element level. This makes it much easier to change them. </p>","creationDate":{"date":"2022-11-11 16:28:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>\"Import / Export\" function added. You can now download document templates as a file and import them into any document. For example, you can transfer your design to another document type or other online store.</p>","creationDate":{"date":"2022-11-09 14:53:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- Added more compact versions of the document templates in addition to the default templates. </p><p>- All German and English document templates are now selectable regardless of the store installation language.</p><p>- New button: \"Save &amp; continue\".</p><p>- Variables can now also be easily deleted by clicking on an X symbol directly next to the variable. Previously, this was only possible when editing texts by pressing the Backspace or Del key. </p><p>- When changing styling settings (e.g. spacing), the document no longer scrolls up. The selected element remains in the visible area. </p><p>- The document now fans out right after you start dragging a new element into the document with the mouse. This increases usability and makes it easier to place the new element accurately.</p><p>- A new row now contains only one column by default instead of two.</p>","creationDate":{"date":"2022-11-08 21:31:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Fixed javascript build error</p>","creationDate":{"date":"2022-11-01 21:36:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Fixed an error which occurred when the PDF preview was generated</p>","creationDate":{"date":"2022-11-01 18:38:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- Fixed Rendering Error in case PHP 8 is used and a unexpected product feature is present</p><p>- Fixed error, when PHP 8 is used and doc has multiple pages</p><p>- Removed \"Letter Name\" variable from address block<br /></p><p>- Moved Footer further down and adjusted footer column width to prevent unneccessary line breaks</p><p>- Updated wording to make the editor more user friendly</p><p>- Added new basic element \"Column\"</p><p>- Added new icons for basic elements</p>","creationDate":{"date":"2022-10-26 20:03:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Improved compatibility with PHP 8.1</p>","creationDate":{"date":"2022-10-17 11:31:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"First version of the WYSIWYG document editor for Shopware 6. With the editor you can design documents such as invoices, delivery notes, credit notes and stornos in the store simply by drag &amp; drop. Thanks to standard letter DIN 5008 compliant templates, you have a perfect starting point for your design for every document in the store, which even creates perfect PDFs for your customers without adjustments.","creationDate":{"date":"2022-09-29 11:01:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Appli81810362453","redirectToStore":false,"lowestPriceValue":34.5}