{"id":15805,"name":"AllegShopwareAllegro","code":"Alleg65938251567","lastChange":{"date":"2023-07-18 11:16:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgxJODK","examplePageUrl":"","moduleKey":"AllegShopwareAllegro","creationDate":{"date":"2022-09-02 12:55:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-10-21 10:00:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-09-05 09:36:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3891,"prefix":"Alleg","name":"Allegro.pl sp. z o.o.","website":"//allegro.pl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3891_allegro.png"},"infos":[{"id":27557,"name":"Shopware - Allegro","description":"<h2>Shopware - Allegro</h2><br>Die Anwendung shopware-allegro stellt eine Verbindung zwischen Allegro und Shopware her. Es ermöglicht die Verwaltung von Allegro-Angeboten und wickelt Bestellungen ab. Du kannst damit Angebote erstellen und diese produktbezogen in Shopware bearbeiten. Importiert Bestellungen von Allegro nach Shopware.<br><br><b>Funktionalitäten:</b><br><br>Auftragsabwicklung:<br><ul><li>Importiere Bestellungen von Allegro nach Shopware.</li></ul><ul><li>Statusänderung in Ausführung (Versandstatus).</li><li>Sendungsnummern in Shopware auflisten und an Allegro senden.<br></li></ul><br><br><b>Angebote verwalten:</b><br><br><ul><li>Erstellen eines Angebots basierend auf einem Produkt in Shopware.</li><li>Bearbeitung des Angebots aus der Shopware-Ebene.</li><li>Angebotsstatusverwaltung.</li></ul><p><br></p><p><b>Dokumentation</b></p><p>Informationen zur Verwendung dieser Erweiterung finden Sie unter<b>&nbsp;</b><a target=\"_blank\" href=\"https://github.com/shopware-allegro/app\" rel=\"noopener nofollow\" style=\"background-color: transparent; font-family: var(--sw-font-family);\">GitHub</a><br></p><p><br></p><p><b>Kontakt:</b></p><p>Wenn Sie mit uns Kontakt aufnehmen möchten, senden Sie am besten eine E-Mail mit Ihren Fragen an <i>shopware-allegro@macopedia.com</i>. Wir garantieren, dass wir so schnell wie möglich antworten!<br></p>","installationManual":"<p>Shopware - Allegro</p><p>Die Allegro-App wurde entwickelt, um Ihnen beim Ausbau Ihres E-Commerce-Geschäftes in Polen und der CEE-Region zu helfen. Um dies zu erreichen, sollten Sie zunächst ein kostenloses Geschäftskonto bei Allegro erstellen. Nicht nur das Erstellen eines Kontos ist kostenlos, sondern auch das Herunterladen und die Nutzung der Allegro-App für Shopware. Sie ermöglicht es Ihnen, Angebote aufzulisten, Verkäufe und Bestellungen zu verwalten und Ihre Lagerbestände zu aktualisieren - die wichtigsten Faktoren für Ihr grenzüberschreitendes Geschäft. Die App wurde entwickelt, um Ihnen den Einstieg in den Verkauf auf Allegro schnell, einfach und problemlos zu ermöglichen. Durch die Verwendung von GTIN (EAN)-Nummern können Sie in der App nach Ihren Produkten suchen, um Angebote zu erstellen. Wenn sie sich nicht in der Allegro Produktdatenbank befinden, ist das kein Problem, Sie können ein neues Produkt erstellen.</p><br /><p>Die wichtigsten Funktionen der Allegro-App:</p><ul><li><p>Der Download ist kostenlos</p></li><li><p>Erleichtert die Verwaltung Ihrer Verkäufe/Bestellungen und Angebote auf Allegro</p></li><li><p>Zugang zu über 21 Millionen neuen Käufern</p></li><li><p>Zugang zum polnischen Markt</p></li><li><p>Keine obligatorischen Abonnementgebühren</p></li></ul><br /><p>Über uns:</p><p>Allegro ist die beliebteste Shopping-Plattform in Polen und die größte E-Commerce-Plattform europäischer Herkunft. Wir betreiben ein Marktplatzmodell, was bedeutet, dass Kunden alles, was sie brauchen, von über 135.000 Händlern kaufen können, die eine unbegrenzte Anzahl von Angeboten auf unserer Plattform auflisten können.</p><p>Wir bieten Produkte in allen wichtigen Kategorien an, darunter Automobil, Mode, Haus und Garten, Elektronik, Bücher und Sammlerstücke, Kinder oder Gesundheit und Schönheit. Jeden Monat besuchen 22 Millionen Kunden unsere Plattform, was fast 80 % aller Internetnutzer in Polen entspricht. Sie können aus über 250 Mio. Angeboten zu den attraktivsten Preisen und mit maximalem Komfort wählen, einschließlich schneller und kostenloser Lieferungen im Rahmen des Allegro Smart!-Programms, moderner Finanzdienstleistungen (Allegro Pay) sowie Polens größtem Netz von 50.000 Abholstellen.</p><p><br /></p><p>Im April 2022 schlossen wir die Übernahme der Mall Group und von WE|DO ab, um auf den besten Eigenschaften der beiden Unternehmen aufzubauen und die internationale Expansion der erweiterten Gruppe voranzutreiben. Der bahnbrechende Zusammenschluss von einzigartigem Ausmaß ermöglicht es internationalen Händlern aus dem gesamten geografischen Raum und darüber hinaus, von der Möglichkeit zu profitieren, einmal aufzulisten und überall zu verkaufen, während gleichzeitig Millionen von EU-Konsumenten bequemer Zugang zu einer verbesserten Auswahl, den besten Preisen und einem besseren Liefererlebnis gewährt wird.</p><p><br /></p><p>Über die App</p><p>Die Shopware-Allegro Anwendung stellt eine Verbindung zwischen Allegro und Shopware her. Sie ermöglicht die Verwaltung Ihrer Allegro-Angebote und wickelt Bestellungen ab.</p><p>Sie können damit Angebote erstellen und diese auf Basis des Produkts in Shopware bearbeiten. Importiert Bestellungen von Allegro nach Shopware.</p><p>Allegro ist Polens beliebtester Marktplatz. Nachdem Sie Ihr kostenloses Geschäftskonto bei Allegro erstellt haben, können Sie die Shopware Alegro App nutzen, die Ihnen hilft, Ihre Verkäufe und Angebote auf Allegro zu automatisieren und zu verwalten.</p><br /><p>Nützliche Ressourcen für Ihren Einstieg</p><p>Allegro Academy ist eine Schulungsplattform, die von Allegro-Spezialisten und unabhängigen Experten entwickelt wurde. Sie wurde eingerichtet, weil wir unser Wissen teilen und Unternehmen, die auf Allegro verkaufen, bei der Entwicklung ihres Geschäfts unterstützen möchten. Wir arbeiten ständig daran, Ihnen noch mehr wertvolle Inhalte zu bieten, also schauen Sie regelmäßig vorbei und verfolgen Sie unsere Neuigkeiten. Schauen Sie sich jetzt an, was wir für Sie vorbereitet haben! Wir hoffen, dass Ihre Lernerfahrung mit uns sowohl angenehm als auch fruchtbar ist! </p><br /><p>Allegro-Akademie</p><br /><p>Lesen Sie den Allegro Sales Guide, um mehr über das Verkaufen und den Erfolg bei Allegro zu erfahren.</p><p>Zusätzlich zur Allegro Akademie und dem Verkaufsleitfaden haben wir den New Sellers Blog erstellt, der Einblicke und Artikel bietet, die Sie auf Ihrer Reise mit Allegro unterstützen.</p><br /><p>Funktionalitäten:</p><p>Auftragsabwicklung:</p><ul><li><p>Import von Bestellungen von Allegro nach Shopware.</p></li><li><p>Statusänderung in der Ausführung (Versandstatus).</p></li><li><p>Auflistung der Sendungsnummern in Shopware und Übermittlung an Allegro.</p></li></ul><p><br /></p><p>Angebote verwalten:</p><ul><li><p>Erstellen eines Angebots basierend auf einem Produkt in Shopware.</p></li><li><p>Bearbeitung des Angebots auf der Shopware-Ebene.</p></li><li><p>Verwaltung des Angebotsstatus.</p></li></ul><br /><br /><p>Häufig gestellte Fragen:</p><ul><li><p>Wo kann ich mehr über das Erstellen und Einrichten eines Kontos auf Allegro erfahren?</p><ul><li><p>Im Verkaufsleitfaden finden Sie alle notwendigen Informationen, um mit dem Verkauf auf Allegro zu beginnen: https://assets.allegrostatic.com/popart-attachments/att-947ae9c9-c777-4872-8593-1fbd8f347987 </p></li></ul></li><li><p>Wie viel kostet es, ein Konto zu erstellen?</p><ul><li><p>Die Erstellung eines Kontos ist kostenlos. Bei Allegro zahlen Sie in der Regel nur Provisionen für getätigte Verkäufe und andere Werbeaktivitäten, die Sie nutzen möchten.</p></li></ul></li><li><p>Gibt es irgendwelche Vorteile für neue Händler bei Allegro?</p><ul><li><p>Bei Allegro gibt es ein spezielles Willkommenspaket für alle neuen Händler auf der Plattform. Um mehr darüber zu erfahren, besuchen Sie: https://allegro.pl/kampania/sell-on-allegro-en/welcome-pack</p></li></ul></li></ul>","shortDescription":"Die Anwendung shopware-allegro stellt eine Verbindung zwischen Allegro und Shopware her. Damit können Sie Allegro-Angebote auf der Shopware-Seite verwalten und Allegro-Bestellungen heru","highlights":"Steigern Sie den grenzüberschreitenden Umsatz - nutzen Sie die App, um Ihre grenzüberschreitenden E-Commerce-Verkäufe zu steigern\nVerwalten Sie Ihre Verkäufe - verwalten Sie Ihre Verkäufe auf Allegro über die App\nErreichen Sie über 20 Millionen neue Käufer in Polen\nInternationale Expansion - mit Allegro werden Sie Ihre Verkäufe in Polen und darüber hinaus in CEE und der EU steigern\nKostenlos - die App ist kostenlos zu benutzen","features":"Erstellung von Angeboten auf Allegro - erstellen Sie Ihre Verkaufsangebote, um sie in Allegro zu veröffentlichen.\nAngebotsmanagement auf Allegro - verwalten Sie Ihre Preise, Bestände und andere Aspekte Ihrer Angebote\nAuftragsverwaltung\nVerkaufsverwaltung\nKontoverwaltung"},{"id":27569,"name":"Shopware - Allegro","description":"<h2>Shopware - Allegro</h2><p><br></p><p>The Allegro app, is designed to help you grow your ecommerce business in Poland and the CEE region. In order to be able to do that the first thing that you would need to do is create a business account on Allegro, which is free of charge, not only is creating an account free, but the Allegro app for Shopware is also free to download and use. It enables you to list offers, manage sales and orders, and update your stock levels as the key drivers for your cross border business. The app was built to make you entry into selling on Allegro quick, easy and hassle free. By using GTIN (EAN) numbers you can search for your products through the app to start listing offers. If they are not in the Allegro product database, it is not a problem, you can create a new product.</p><p><b><br></b></p><p>Key features of using the Allegro app:</p><p></p><ul><li><p>Its free to download</p></li><li><p>Makes managing you sales/order and offers on Allegro easier</p></li><li><p>Access to over 21 million new buyers</p></li><li><p>Access to the Polish market</p></li><li><p>No mandatory subscription fees</p></li></ul><p><br></p><h3>About Us:</h3><p>Allegro is the most popular shopping platform in Poland and the largest e-commerce platform of European origin. We operate a marketplace model which means that customers can buy whatever they need from over 135,000 merchants, who can list an unlimited number of offers on our platform.</p><p>We offer products in all key categories including Automotive, Fashion, Home&amp;Garden, Electronics, Books and Collectibles, Kids or Health and Beauty. Each month, 22 million customers visit our platform, which is equivalent to almost 80% of all Internet users in Poland. They can choose from over 250m offers at the most attractive prices with maximum convenience including fast and free deliveries under the Allegro Smart! programme, modern financial services (Allegro Pay), as well as Poland’s widest 50k pickup points network.</p><p>In April 2022 we finalized the deal to acquire the Mall Group and WE|DO to build on the best of the joining companies and boost the enlarged group’s international expansion. The game-changing merger of a unique scale allows international merchants from across the wider geographical footprint and beyond to benefit from listing once and selling everywhere, while granting tens of millions of EU consumers convenient access to improved selection, best prices and delivery experience.</p><h2><br></h2><h3>About the App</h3><p>The shopware-allegro \napplication creates a connection between Allegro and Shopware. It \nenables the management of your allegro offers and handles orders.</p><p>You can use it to create offers and edit them based on the product in Shopware. Imports orders from Allegro to Shopware.</p><p><br></p><p>Allegro is Poland's most loved marketplace, after creating your free business account on Allegro, you can take full advantage of the Shopware Alegro app to help you automate and manage your sales and offers on Allegro.</p><p><br></p><h3>Useful Resources to Get You Started</h3><p><a href=\"https://allegro.pl/academy\" target=\"_blank\" rel=\"noreferrer noopener\">Allegro Academy</a><b>:&nbsp;</b>is a training platform created by Allegro’s specialists as well as independent experts. It was set up because we want to share our knowledge and help companies selling on Allegro develop their business. We are always working hard to provide you with even more valuable content, so check back regularly and follow our news updates. Now go ahead and take a look at what we’ve prepared for you! We hope your learning experience with us is both enjoyable and fruitful!&nbsp;</p><p>Allegro Academy</p><p><br></p><p>Have a read through the&nbsp;<a href=\"https://assets.allegrostatic.com/popart-attachments/att-947ae9c9-c777-4872-8593-1fbd8f347987\" target=\"_blank\" rel=\"noreferrer noopener\">Allegro Sales Guide</a>&nbsp;to find out more about selling and being successful on Allegro.</p><p><br></p><p>In addition to Allegro Academy and the Sales guide, we have created the&nbsp;<a href=\"https://allegro.pl/articles/international-sellers\" target=\"_blank\" rel=\"noreferrer noopener\">New Sellers Blog</a>, that provides insights and articles to help you on your journey with Allegro.</p><p><b><br></b></p><h3><b>Functionalities</b>:</h3><h4>Order processing: </h4><ul><li>Import orders from Allegro to Shopware. <br></li></ul><ul><li>Change of statuses in execution (shipping status). <br></li></ul><ul><li>Listing shipment numbers in Shopware and sending to Allegro.</li></ul><h4>Managing offers: </h4><ul><li>Creating an offer based on a product in Shopware.<br></li></ul><ul><li>Editing of the offer from the Shopware level. <br></li></ul><ul><li>Offer status management.</li></ul><p><br></p><p><b>Documentation&nbsp;</b></p><p><p></p></p><p style=\"box-sizing: border-box; padding: 0px; margin: 0px; font-size: 14px; line-height: 24px;\">Information about how to use this extension is available in&nbsp;<a target=\"_blank\" href=\"https://github.com/shopware-allegro/app\" rel=\"noopener nofollow\" style=\"box-sizing: border-box; padding: 0px; margin: 0px; color: var(--sw-vivid-500); text-decoration: none; font-weight: 500; cursor: pointer; background-color: transparent;\">GitHub</a>.</p><p><br></p><p><b>Contact:</b></p><p>If you want to contact us, the best way is send e-mail to <i>shopware-allegro@macopedia.com</i> with your question(s). We guarantee that we answer as soon as we can!<br></p>","installationManual":"","shortDescription":"The shopware-allegro application creates a connection between Allegro and Shopware. It allows you to manage Allegro offers on the Shopware side and download Allegro orders.","highlights":"Increase cross border sales - use the app to increase your cross border e-commerce sales\nManage sales - manage your sales on Allegro via the app\nReach over 20 million new buyers in Poland\nInternational expansion - with Allegro you will grow your sales in Poland and beyond in CEE as well as the EU\nFree - the app is free to use","features":"Creation of offers on Allegro - create your sales offers to push to Allegro\nOffer management on Allegro - manage your pricing, stocks and other aspects of your offers\nOrder management\nSales management \nAccount management"}],"addons":["emotionPreset"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":166274,"bookingKey":"Alleg65938251567","bookingText":"Shopware - Allegro","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptbVChq","preview":true,"priority":0,"id":96284},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptCXTla","preview":false,"priority":0,"id":96285},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNiy70j","preview":false,"priority":0,"id":96286},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUQlIQC","preview":false,"priority":0,"id":98723},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTARo3F","preview":false,"priority":0,"id":115717}],"comments":[{"authorName":"Maciej","text":"","headline":"Integration works very good, easy to implement","creationDate":{"date":"2023-06-23 13:20:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"B.M.","text":"Bad Plugin\nBad Development Team","headline":"Dont work, no answer from support","creationDate":{"date":"2023-03-02 20:14:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2}],"ratingAverage":6,"label":"Shopware - Allegro","description":"<h2>Shopware - Allegro</h2><br />Die Anwendung shopware-allegro stellt eine Verbindung zwischen Allegro und Shopware her. Es ermöglicht die Verwaltung von Allegro-Angeboten und wickelt Bestellungen ab. Du kannst damit Angebote erstellen und diese produktbezogen in Shopware bearbeiten. Importiert Bestellungen von Allegro nach Shopware.<br /><br /><b>Funktionalitäten:</b><br /><br />Auftragsabwicklung:<br /><ul><li>Importiere Bestellungen von Allegro nach Shopware.</li></ul><ul><li>Statusänderung in Ausführung (Versandstatus).</li><li>Sendungsnummern in Shopware auflisten und an Allegro senden.<br /></li></ul><br /><br /><b>Angebote verwalten:</b><br /><br /><ul><li>Erstellen eines Angebots basierend auf einem Produkt in Shopware.</li><li>Bearbeitung des Angebots aus der Shopware-Ebene.</li><li>Angebotsstatusverwaltung.</li></ul><p><br /></p><p><b>Dokumentation</b></p><p>Informationen zur Verwendung dieser Erweiterung finden Sie unter<b> </b><a target=\"_blank\" href=\"https://github.com/shopware-allegro/app\" rel=\"noreferrer noopener\">GitHub</a><br /></p><p><br /></p><p><b>Kontakt:</b></p><p>Wenn Sie mit uns Kontakt aufnehmen möchten, senden Sie am besten eine E-Mail mit Ihren Fragen an <i>shopware-allegro@macopedia.com</i>. Wir garantieren, dass wir so schnell wie möglich antworten!<br /></p>","installationManual":"<p>Shopware - Allegro</p><p>Die Allegro-App wurde entwickelt, um Ihnen beim Ausbau Ihres E-Commerce-Geschäftes in Polen und der CEE-Region zu helfen. Um dies zu erreichen, sollten Sie zunächst ein kostenloses Geschäftskonto bei Allegro erstellen. Nicht nur das Erstellen eines Kontos ist kostenlos, sondern auch das Herunterladen und die Nutzung der Allegro-App für Shopware. Sie ermöglicht es Ihnen, Angebote aufzulisten, Verkäufe und Bestellungen zu verwalten und Ihre Lagerbestände zu aktualisieren - die wichtigsten Faktoren für Ihr grenzüberschreitendes Geschäft. Die App wurde entwickelt, um Ihnen den Einstieg in den Verkauf auf Allegro schnell, einfach und problemlos zu ermöglichen. Durch die Verwendung von GTIN (EAN)-Nummern können Sie in der App nach Ihren Produkten suchen, um Angebote zu erstellen. Wenn sie sich nicht in der Allegro Produktdatenbank befinden, ist das kein Problem, Sie können ein neues Produkt erstellen.</p><br /><p>Die wichtigsten Funktionen der Allegro-App:</p><ul><li><p>Der Download ist kostenlos</p></li><li><p>Erleichtert die Verwaltung Ihrer Verkäufe/Bestellungen und Angebote auf Allegro</p></li><li><p>Zugang zu über 21 Millionen neuen Käufern</p></li><li><p>Zugang zum polnischen Markt</p></li><li><p>Keine obligatorischen Abonnementgebühren</p></li></ul><br /><p>Über uns:</p><p>Allegro ist die beliebteste Shopping-Plattform in Polen und die größte E-Commerce-Plattform europäischer Herkunft. Wir betreiben ein Marktplatzmodell, was bedeutet, dass Kunden alles, was sie brauchen, von über 135.000 Händlern kaufen können, die eine unbegrenzte Anzahl von Angeboten auf unserer Plattform auflisten können.</p><p>Wir bieten Produkte in allen wichtigen Kategorien an, darunter Automobil, Mode, Haus und Garten, Elektronik, Bücher und Sammlerstücke, Kinder oder Gesundheit und Schönheit. Jeden Monat besuchen 22 Millionen Kunden unsere Plattform, was fast 80 % aller Internetnutzer in Polen entspricht. Sie können aus über 250 Mio. Angeboten zu den attraktivsten Preisen und mit maximalem Komfort wählen, einschließlich schneller und kostenloser Lieferungen im Rahmen des Allegro Smart!-Programms, moderner Finanzdienstleistungen (Allegro Pay) sowie Polens größtem Netz von 50.000 Abholstellen.</p><p><br /></p><p>Im April 2022 schlossen wir die Übernahme der Mall Group und von WE|DO ab, um auf den besten Eigenschaften der beiden Unternehmen aufzubauen und die internationale Expansion der erweiterten Gruppe voranzutreiben. Der bahnbrechende Zusammenschluss von einzigartigem Ausmaß ermöglicht es internationalen Händlern aus dem gesamten geografischen Raum und darüber hinaus, von der Möglichkeit zu profitieren, einmal aufzulisten und überall zu verkaufen, während gleichzeitig Millionen von EU-Konsumenten bequemer Zugang zu einer verbesserten Auswahl, den besten Preisen und einem besseren Liefererlebnis gewährt wird.</p><p><br /></p><p>Über die App</p><p>Die Shopware-Allegro Anwendung stellt eine Verbindung zwischen Allegro und Shopware her. Sie ermöglicht die Verwaltung Ihrer Allegro-Angebote und wickelt Bestellungen ab.</p><p>Sie können damit Angebote erstellen und diese auf Basis des Produkts in Shopware bearbeiten. Importiert Bestellungen von Allegro nach Shopware.</p><p>Allegro ist Polens beliebtester Marktplatz. Nachdem Sie Ihr kostenloses Geschäftskonto bei Allegro erstellt haben, können Sie die Shopware Alegro App nutzen, die Ihnen hilft, Ihre Verkäufe und Angebote auf Allegro zu automatisieren und zu verwalten.</p><br /><p>Nützliche Ressourcen für Ihren Einstieg</p><p>Allegro Academy ist eine Schulungsplattform, die von Allegro-Spezialisten und unabhängigen Experten entwickelt wurde. Sie wurde eingerichtet, weil wir unser Wissen teilen und Unternehmen, die auf Allegro verkaufen, bei der Entwicklung ihres Geschäfts unterstützen möchten. Wir arbeiten ständig daran, Ihnen noch mehr wertvolle Inhalte zu bieten, also schauen Sie regelmäßig vorbei und verfolgen Sie unsere Neuigkeiten. Schauen Sie sich jetzt an, was wir für Sie vorbereitet haben! Wir hoffen, dass Ihre Lernerfahrung mit uns sowohl angenehm als auch fruchtbar ist! </p><br /><p>Allegro-Akademie</p><br /><p>Lesen Sie den Allegro Sales Guide, um mehr über das Verkaufen und den Erfolg bei Allegro zu erfahren.</p><p>Zusätzlich zur Allegro Akademie und dem Verkaufsleitfaden haben wir den New Sellers Blog erstellt, der Einblicke und Artikel bietet, die Sie auf Ihrer Reise mit Allegro unterstützen.</p><br /><p>Funktionalitäten:</p><p>Auftragsabwicklung:</p><ul><li><p>Import von Bestellungen von Allegro nach Shopware.</p></li><li><p>Statusänderung in der Ausführung (Versandstatus).</p></li><li><p>Auflistung der Sendungsnummern in Shopware und Übermittlung an Allegro.</p></li></ul><p><br /></p><p>Angebote verwalten:</p><ul><li><p>Erstellen eines Angebots basierend auf einem Produkt in Shopware.</p></li><li><p>Bearbeitung des Angebots auf der Shopware-Ebene.</p></li><li><p>Verwaltung des Angebotsstatus.</p></li></ul><br /><br /><p>Häufig gestellte Fragen:</p><ul><li><p>Wo kann ich mehr über das Erstellen und Einrichten eines Kontos auf Allegro erfahren?</p><ul><li><p>Im Verkaufsleitfaden finden Sie alle notwendigen Informationen, um mit dem Verkauf auf Allegro zu beginnen: https://assets.allegrostatic.com/popart-attachments/att-947ae9c9-c777-4872-8593-1fbd8f347987 </p></li></ul></li><li><p>Wie viel kostet es, ein Konto zu erstellen?</p><ul><li><p>Die Erstellung eines Kontos ist kostenlos. Bei Allegro zahlen Sie in der Regel nur Provisionen für getätigte Verkäufe und andere Werbeaktivitäten, die Sie nutzen möchten.</p></li></ul></li><li><p>Gibt es irgendwelche Vorteile für neue Händler bei Allegro?</p><ul><li><p>Bei Allegro gibt es ein spezielles Willkommenspaket für alle neuen Händler auf der Plattform. Um mehr darüber zu erfahren, besuchen Sie: https://allegro.pl/kampania/sell-on-allegro-en/welcome-pack</p></li></ul></li></ul>","version":"1.1.0","changelog":[{"version":"1.1.0","text":"<p>Shopware 6.5 compatibility</p>","creationDate":{"date":"2023-05-26 13:52:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial release including these features:</p><ul><li>manage allegro offer<br /></li><li>import orders from allegro<br /></li></ul>","creationDate":{"date":"2022-09-05 09:22:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Alleg65938251567","redirectToStore":false,"lowestPriceValue":0}