{"id":15878,"name":"KilbShopwareProductDesignerApp","code":"Kilb782888457578","lastChange":{"date":"2023-07-19 00:30:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZuQ2k7","examplePageUrl":"","moduleKey":"KilbShopwareProductDesignerApp","creationDate":{"date":"2022-09-12 16:18:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-09-27 17:05:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-09-12 17:01:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":834,"prefix":"Kilb","name":"KILB Software Development","website":"//www.cilb.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod834_kilb_icon_shopware.png"},"infos":[{"id":27686,"name":"KILB Product Designer - Artikeldesigner für T-Shirts, Tassen, Poster, Karten, Banner [App Version]","description":"<p>Der&nbsp;<i>KILB Product Designer&nbsp;</i>ermöglicht es Deinen Kunden, Produkte (T-Shirts, Poster, Banner, Tassen, Kronkorken usw.) vor dem Kauf mit einem eigenen Design zu versehen. Es ist egal, welches Produkt Du verkaufen möchtest - der Product Designer lässt sich mit Sicherheit passend konfigurieren.<br><br></p><p>Bevor das gewünschte Produkt in den Warenkorb gelegt wird, kann der Kunde das Design völlig frei bestimmen. Hierfür hat er die Möglichkeit,&nbsp;<b>eigene Bilder hochzuladen</b>, <b>Texte in diversen Schriftarten&nbsp;</b>hinzuzufügen,&nbsp;<b>QR-Codes&nbsp;zu generieren</b>&nbsp;oder zwischen beliebig vielen&nbsp;<b>vorausgewählten&nbsp;Motiven</b>&nbsp;auszuwählen.</p><p>Das fertige Design wird darauf als&nbsp;<b>Vorschaubild im Warenkorb</b>&nbsp;angezeigt und nach Abschluss der Bestellung im Shopware Backend gespeichert.</p><p><br></p><p><br></p><h2>⏯ In unserem Youtube-Tutorial-Video erfährst Du innerhalb von 10 Minuten, wie Du den Product Designer installierst &amp; konfigurierst:</h2><a href=\"https://www.youtube.com/watch?v=tCOVbdzzxcI\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.youtube.com/watch?v=tCOVbdzzxcI</a><br><p></p><p><br></p><h2>❓Für weiterführende Informationen, schaue gerne in die Dokumentation der App:<br><a href=\"https://docs.product-designer.io/\" target=\"_blank\" rel=\"noreferrer\">https://docs.product-designer.io</a></h2>","installationManual":"<h2>⏯ In unserem Youtube-Tutorial-Video erfährst Du innerhalb von 10 Minuten, wie Du den Product Designer installierst &amp; konfigurierst:</h2><a href=\"https://www.youtube.com/watch?v=tCOVbdzzxcI\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.youtube.com/watch?v=tCOVbdzzxcI</a><p><br></p><h2>Schritt 1: App installieren</h2><p><br></p><p>Sobald Du die App über den Shopware Store erworben hast, kannst Du sie im Administrationsbereich unter&nbsp;<i>Erweiterungen</i>&nbsp;&gt;Meine Erweiterungen&nbsp;installieren.&nbsp; Bitte stelle sicher, dass die App sowohl&nbsp;<i><b>installiert</b></i>&nbsp;als auch&nbsp;<i><b>aktiviert</b></i>&nbsp;ist.</p><p><br></p><h2>Schritt 2: Konfiguration zuweisen</h2><p><br></p><p>Nach Installation und Aktivierung der App findest Du in Deinem Shopware Backend im Menü einen neuen Navigationseintrag \"KILB Product Designer\" als Unterpunkt unter \"Katalog\".</p><p>Wenn Du darauf klickst, wird der Administrationsbereich des Designers geladen. Da bisher noch keine Bestellung mit einem Product Design durchgeführt wurde, ist die Tabelle leer.</p><p><br></p><p>Klicke nun im oberen Menü auf den Tab \"Konfigurationen\". Um Dir den Einstieg in die App zu erleichtern, legt die Installation des Product Designers automatisch initial eine Beispiel-Konfiguration an. Öffne die Einstellungen dieser Konfiguration, indem Du auf das Icon mit den drei Punkten klickst.&nbsp;</p><p>Wähle nun einen beliebigen Artikel in Deinem Online-Shop, den Du in Zukunft von Deinen Kunden designen lassen möchtest. Kopiere dessen Artikelnummer (nicht die Produkt-ID!) und füge sie der Konfiguration hinzu. Klicke darauf auf \"Konfiguration speichern\".</p><p><br></p><p>Durch die Zuweisung der Konfiguration zu dem Artikel wird auf der Produktdetailseite des Artikels der Button \"In den Warenkorb\" nun automatisch deaktiviert und ein neuer Button \"Design gestalten\" erscheint. Der Kunde muss damit zuerst ein Design gestalten, wodurch der Button zum Hinzufügen des Warenkorbs erst aktiviert wird.</p><p><br></p><p>Du solltest nun eine erste Test-Bestellung mit diesem Artikel und einem beliebigen Design durchführen. Sobald die Bestellung abgeschlossen ist, kannst Du in den nächsten Schritt übergehen.</p><p><br></p><h2>Schritt 3: Druckbild generieren</h2><p>Während des Bestellprozesses werden lediglich Metadaten zum konfigurierten Design gespeichert. Zudem wird ein kleines Vorschaubild für den Warenkob generiert. Das eigentliche, hochauflösende Bild, was Du für den Druck auf den Artikel verwenden kannst, muss allerdings erst noch generiert werden. Da die Generierung der Grafik je nach Auflösung und Größe resourcenaufwändig sein kann, erfolgt weder im Browser des Kunden, noch auf Deinem Server. Stattdessen findet Sie in Deinem Browser statt.</p><p><br></p><p>Logge Dich zunächst wieder im Shopware Administrationsbereich auf und öffne die Seite des Product Designers. Du findest Du nun unter \"Bestellte Designs\" einen ersten Eintrag. Mit Klick auf das Icon mit den drei Punkten erhältst Du weitere Informationen zu dem Design. Du hast zudem die Möglichkeit, direkt ein vektorbasiertes SVG des Designs sowie ein serialisiertes JSON-Objekt herunterzuladen. Um eine hochauflösende WebP-Grafik zu generieren, klicke auf \"Generieren\". Das Generieren kann einige Sekunden dauern. Du kannst nach Abschluss eine Vorschau des Bildes sehen. Klickst Du auf diese Vorschau, wird das Bild heruntergeladen.</p><p><br></p><p>⚠️ Solltest Du&nbsp; Probleme beim Generieren der Grafik haben, nutze bitte&nbsp;<i>Google Chrome</i>.</p><p><br></p><h2>Schritt 4: Motive &amp; Hintergrundbilder hinzufügen</h2><p><br></p><p>Der Kunde hat im Product Designer die Möglichkeit, eigene Bilder hochzuladen. Zusätzlich kannst Du ihm die Option anbieten, aus einem vordefinierten Set zwischen verschiedenen Motivenund Hintergrundbildern zu wählen.&nbsp;</p><p>Logge Dich hierfür in das Shopware Backend ein und klicke im Menü auf&nbsp;<i>Inhalte</i>&nbsp;&gt;&nbsp;<i>Medien</i>.</p><p>Der Product Designer hat hier automatisch vier Verzeichnisse angelegt:</p><p>-&nbsp;<i>Product Designer - Uploads</i>: Hier landen Grafiken, die Benutzer des Product Designers hochgeladen haben. Die Grafiken werden erneut benötigt, wenn ein Benutzer im Nachhinein sein Design abändern möchte oder du die Rendering Applikation ausführst. Lösche deshalb keine Grafiken von Hand in diesem Verzeichnis.</p><p>-&nbsp;<i>Product Designer - Basket Images:&nbsp;</i>Hier werden die Vorschaugrafiken für den Warenkorb gespeichert. Auch hier solltest Du von Hand keine Grafiken entfernen.</p><p>-&nbsp;<i>Product Designer - Images</i>: Lade in dieses Verzeichnis die gewünschten Motive, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Motive in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Motiv einen&nbsp;<i>Titel</i>&nbsp; festlegen, der im Frontend erscheinen wird.<br>-&nbsp;<i>Product Designer</i>&nbsp;-&nbsp;<i>Background Images:</i><i>&nbsp;</i>Lade in dieses Verzeichnis die gewünschten Hintergrundbilder, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Hintergrundbilder in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Hintergrundbild einen&nbsp;<i style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Titel</i>&nbsp;festlegen, der im Frontend erscheinen wird.</p><p><br></p><p><br></p><h2>Schritt 5: Dokumentation lesen</h2><p><br>Nimm Dir ausreichend Zeit, um die einzelnen Konfigurationsoptionen im Designer-Backend durchzugehen. Jedes Eingabefeld besitzt eine ausführliche Beschreibung, die dessen Funktion erklärt.<br><br></p><p>Für weiterführende Informationen und häufig gestellte Fragen kannst Du einen Blick in unsere Dokumentation werfen:&nbsp;<br><a href=\"http://docs.product-designer.io/\" target=\"_blank\" rel=\"noreferrer\">http://docs.product-designer.io</a></p>","shortDescription":"Der KILB Product Designer ermöglicht es Deinen Kunden, Produkte beliebiger Art (Poster, CD, T-Shirts, Flyer etc.) vor dem Kauf mit einem eigenem Design zu versehen.","highlights":"Umfangreiche Konfigurierbarkeit ||| Nahezu alles (Auflösung, Bildgröße, Druckgröße, Schriftgröße usw. usf.) lässt sich konfigurieren. Es lassen sich beliebig viele Konfigurationen für beliebig viele Artikel festlegen. Sogar ein einzelner Artikel kann mehrere Konfigurationen aufweisen, die sich beliebig unterscheiden können. Der bedruckbare Artikel hat eine Vorder- und Rückseite - die Rückseite hat aber eine kleinere Fläche - kein Problem!\nHohe Performance ||| Der Product Designer basiert auf dem performanten JavaScript-Framework Vue.JS in Verbindung mit dem bewährten Canvas-Framework fabric.JS. Das aufwändige Rendering, das heißt der Umwandlung des vom Kunden festgelegten Designs in eine Bildgrafik, findet im Browser des Shopbesitzers statt. Weder das Gerät des Kunden, noch der Shop-Server, werden hierfür beansprucht..\nDSGVO-konform ||| Der KILB Product Designer bindet keine externen Ressourcen bzw. Tracking Scripts ein, sodass die Privatsphäre Deiner Shopkunden nicht beeinträchtigt wird. Wenn Du Schriftarten aus anderen Quellen - zum Beispiel Google Fonts - installieren möchtest, so kopierst Du diese einfach in das entsprechende Verzeichnis auf Deinem Server.\nResponsive Design ||| Egal, ob der Product Designer über das Smartphone, das Tablet oder den Desktop verwendet wird: Er funktioniert immer auf die gleiche Weise und passt sich der verfügbaren Größe automatisch an.","features":"Alle Konfigurationsoptionen sind direkt im Designer ausführlich dokumentiert\nAusführliche Dokumentation inkl. FAQ für Shopbetreiber & Developer\nUmfangreiche Erweiterbarkeit mit Hilfe von Monkey Patching\nAusgezeichneter, lösungsorientierter Support"},{"id":27687,"name":"KILB Product Designer - Product designer for shirts, cups, posters, cards... [App Version]","description":"<p>Our Product Designer gives your customers the opportunity, to create their own design for prodcuts like shirts, posters, banners, cups etc.</p><p><br></p><p>Before the product is added to cart, the customer can create a unique design. He is able to upload own images, create texts with several fonts, add QR codes or choose between a set of images you have predefined.</p><p><br></p><p>After the customer has added the product into the cart he already can see a preview image of the final product.&nbsp;</p><p><br></p><p>When we developed this plugin we had focus on:</p><p><br></p><h2><b>Customizability</b></h2><p>Nearly everything (image solution, image size, print size, font size and much much more) can be configured by you. You can create as much configurations as you like - even&nbsp; a single article can have several configurations if you like. Your product has a front and back side - but the back side has a smaller area and the maximum font size should not exceed 30? No problem! If you or your team has programming skills you can adjust the designer even further by <i>monkey patching</i>.</p><p><br></p><p>Feel free to read our documentation to find out more:&nbsp;<a href=\"https://docs.product-designer.io/customizations/monkey-patching.html\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.product-designer.io/customizations/monkey-patching.html</a></p><p><br></p><h2><b>Compatibility</b></h2><p>The plugin is integrated into Shopware as much as needed. But it touches not a single line more of Shopware code than necessary. This will dramatically decrease conflicts with other plugins.&nbsp;</p><p><br></p><h2><b>Responsive design</b></h2><p>No matter if you use the plugin on your phone, tablet or desktop. It will work always the same way. It's completely responsive.</p><p><b><br></b></p><h2><b>GDPR compliant</b></h2><p>The designer doesn't embed external resourced like Google Fonts nor any tracking scripts. You customer's privacy will be kept.</p><p><br></p><p><b>More features</b>:</p><p><br></p><p><br></p><h2><br>❓For further information please have a look into the documentation:</h2><h2><a href=\"https://docs.product-designer.io\" target=\"_blank\" rel=\"noreferrer\">https://docs.product-designer.io</a><br></h2><p><br></p>","installationManual":"<h2>Step 1: Install app</h2><br>Right after you've purchased the app in Shopware Store you can install it in your Shopware administration panel &gt; <i>Extensions</i>&nbsp;&gt; <i>My extensions</i>. Please make sure the app is both <i>installed</i> and <i>activated</i>.<br><br><br><h2>Step 2: Assign configuration</h2>After you've <i>installed</i> and <i>activated</i> the extension you will find a new navigation entry <i>Catalogues</i> &gt; <i>KILB Product Designer</i>.<br>If you click on it the administration panel of the product designer will be loaded. Because for now no order with a product design has been placed the table will be empty.<br>Now click on <i>Configurations</i> on the top. To give you an idea the designer already create an initial example configuration for you. Now click on the <i>eye icon</i> to open that configuration.<br>Now choose any product from your Shopware shop which you want to enable the product designer functionality for. Copy the product number of that product into configuration field <i>Article numbers</i> and click on <i>Save</i>.<br>Now that you assigned the product reload the product detail page of the product. You will see that the designer added  a new button to customize a design. By default the add to cart button will be disabled until the customer did so.<br>Feel free to create a first test order with that product and a product design now.<br><br><h2>Step 3: Create printable file</h2><p><br></p><p>To not slow down the process, the moment a customer of your shop creates a design or places the order only meta data and a small preview image of the design will be saved.The full resolution file that you can use for printing has to be generated in the administration panel.<br>Log in to the Shopware administration panel and open the product designer. You'll now see that the table of ordered designs contains a first row.Click on the <i>eye icon</i> to open that entry. You can now create an image, SVG or PDF: <br><br>⚠️ If you have issues here and a design can not properly generated please try _Google Chrome_.<br><br><h2>Step 4: Add images &amp; background images</h2>Your customers are able to upload their own images to place them on the design.Additionally you can provide them a list of predefined images and background images to choose from.<br>Log in to your Shopware administration panel and go to <i>Content</i> &gt; <i>Media</i>.You will find several folders automatically created by the designer:<br>- <i>Product Designer - Uploads</i>: This folder will contain images uploaded by your customers. You should not touch nor delete any images in here because it could break the designs of your customers.<br>- <i>Product Designer - Basket Images</i>: This folder will contain generated basket preview images. You should not touch nor delete images in here because it will break the preview thumbnails in the cart of your customers.<br>-<i> Product Designer - Image</i>s: You can upload images here that you like to provide to your customers. If you want to place yur images in multiple categories you can create sub folders here. The designer will recognize that an image is placed in a sub folder and assign it to a category with the same name like the sub folders name.<br><br>- <i>Product Designer - Background Images</i>: This works exactly the same like for images with the difference that uploaded images will be provided as background images.<br>Step 5: Read the documentation<br>Go back to <i>Catalogues</i> &gt; <i>KILB Product Designer</i> &gt; <i>Configurations</i>. If you open the first configuration again you will see that each configuration option has a description text that will explain to you what it's purpose is. Take yur time and read the descriptions. Play around, change the options and see what difference it will make in the Frontend.<br>If you have further questions please have a look into our documentation especially the FAQ:</p><p><a href=\"http://docs.product-designer.io\" target=\"_blank\" rel=\"noreferrer\">http://docs.product-designer.io</a><br></p>","shortDescription":"Our app KILB product designer enables your customers to create personal, unique designs for the products you sell, e.g. posters, flyers, T-Shirts, CDs.","highlights":"Product designs for each article and variant possible\nSVG support for image uploads and design exports\nPredefined product designs possible\nSuper high performance, super low file size of CSS and JavaScript files\nSimple and clear backend part","features":"Inline documentation: Every configuration options is documented directly below the input field\nGreat documentation for shop operators and developers\nHighly customizable\nFast, efficient support\nGDPR compliant: Every asset, every uploaded image, all the user data are only stored on your shop server."}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166320,"bookingKey":"Kilb782888457578_M","bookingText":"","price":49.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEvyvx8","preview":true,"priority":0,"id":98248},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeLmwzp","preview":false,"priority":0,"id":98247},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpV7sh5W","preview":false,"priority":0,"id":98596},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplIbLUX","preview":false,"priority":0,"id":98599}],"comments":[],"ratingAverage":0,"label":"KILB Product Designer - Artikeldesigner für T-Shirts, Tassen, Poster, Karten, Banner [App Version]","description":"<p>Der <i>KILB Product Designer </i>ermöglicht es Deinen Kunden, Produkte (T-Shirts, Poster, Banner, Tassen, Kronkorken usw.) vor dem Kauf mit einem eigenen Design zu versehen. Es ist egal, welches Produkt Du verkaufen möchtest - der Product Designer lässt sich mit Sicherheit passend konfigurieren.<br /><br /></p><p>Bevor das gewünschte Produkt in den Warenkorb gelegt wird, kann der Kunde das Design völlig frei bestimmen. Hierfür hat er die Möglichkeit, <b>eigene Bilder hochzuladen</b>, <b>Texte in diversen Schriftarten </b>hinzuzufügen, <b>QR-Codes zu generieren</b> oder zwischen beliebig vielen <b>vorausgewählten Motiven</b> auszuwählen.</p><p>Das fertige Design wird darauf als <b>Vorschaubild im Warenkorb</b> angezeigt und nach Abschluss der Bestellung im Shopware Backend gespeichert.</p><p><br /></p><p><br /></p><h2>⏯ In unserem Youtube-Tutorial-Video erfährst Du innerhalb von 10 Minuten, wie Du den Product Designer installierst &amp; konfigurierst:</h2><a href=\"https://www.youtube.com/watch?v=tCOVbdzzxcI\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.youtube.com/watch?v=tCOVbdzzxcI</a><br /><p></p><p><br /></p><h2>❓Für weiterführende Informationen, schaue gerne in die Dokumentation der App:<br /><a href=\"https://docs.product-designer.io/\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.product-designer.io</a></h2>","installationManual":"<h2>⏯ In unserem Youtube-Tutorial-Video erfährst Du innerhalb von 10 Minuten, wie Du den Product Designer installierst &amp; konfigurierst:</h2><a href=\"https://www.youtube.com/watch?v=tCOVbdzzxcI\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.youtube.com/watch?v=tCOVbdzzxcI</a><p><br /></p><h2>Schritt 1: App installieren</h2><p><br /></p><p>Sobald Du die App über den Shopware Store erworben hast, kannst Du sie im Administrationsbereich unter <i>Erweiterungen</i> &gt;Meine Erweiterungen installieren.  Bitte stelle sicher, dass die App sowohl <i><b>installiert</b></i> als auch <i><b>aktiviert</b></i> ist.</p><p><br /></p><h2>Schritt 2: Konfiguration zuweisen</h2><p><br /></p><p>Nach Installation und Aktivierung der App findest Du in Deinem Shopware Backend im Menü einen neuen Navigationseintrag \"KILB Product Designer\" als Unterpunkt unter \"Katalog\".</p><p>Wenn Du darauf klickst, wird der Administrationsbereich des Designers geladen. Da bisher noch keine Bestellung mit einem Product Design durchgeführt wurde, ist die Tabelle leer.</p><p><br /></p><p>Klicke nun im oberen Menü auf den Tab \"Konfigurationen\". Um Dir den Einstieg in die App zu erleichtern, legt die Installation des Product Designers automatisch initial eine Beispiel-Konfiguration an. Öffne die Einstellungen dieser Konfiguration, indem Du auf das Icon mit den drei Punkten klickst. </p><p>Wähle nun einen beliebigen Artikel in Deinem Online-Shop, den Du in Zukunft von Deinen Kunden designen lassen möchtest. Kopiere dessen Artikelnummer (nicht die Produkt-ID!) und füge sie der Konfiguration hinzu. Klicke darauf auf \"Konfiguration speichern\".</p><p><br /></p><p>Durch die Zuweisung der Konfiguration zu dem Artikel wird auf der Produktdetailseite des Artikels der Button \"In den Warenkorb\" nun automatisch deaktiviert und ein neuer Button \"Design gestalten\" erscheint. Der Kunde muss damit zuerst ein Design gestalten, wodurch der Button zum Hinzufügen des Warenkorbs erst aktiviert wird.</p><p><br /></p><p>Du solltest nun eine erste Test-Bestellung mit diesem Artikel und einem beliebigen Design durchführen. Sobald die Bestellung abgeschlossen ist, kannst Du in den nächsten Schritt übergehen.</p><p><br /></p><h2>Schritt 3: Druckbild generieren</h2><p>Während des Bestellprozesses werden lediglich Metadaten zum konfigurierten Design gespeichert. Zudem wird ein kleines Vorschaubild für den Warenkob generiert. Das eigentliche, hochauflösende Bild, was Du für den Druck auf den Artikel verwenden kannst, muss allerdings erst noch generiert werden. Da die Generierung der Grafik je nach Auflösung und Größe resourcenaufwändig sein kann, erfolgt weder im Browser des Kunden, noch auf Deinem Server. Stattdessen findet Sie in Deinem Browser statt.</p><p><br /></p><p>Logge Dich zunächst wieder im Shopware Administrationsbereich auf und öffne die Seite des Product Designers. Du findest Du nun unter \"Bestellte Designs\" einen ersten Eintrag. Mit Klick auf das Icon mit den drei Punkten erhältst Du weitere Informationen zu dem Design. Du hast zudem die Möglichkeit, direkt ein vektorbasiertes SVG des Designs sowie ein serialisiertes JSON-Objekt herunterzuladen. Um eine hochauflösende WebP-Grafik zu generieren, klicke auf \"Generieren\". Das Generieren kann einige Sekunden dauern. Du kannst nach Abschluss eine Vorschau des Bildes sehen. Klickst Du auf diese Vorschau, wird das Bild heruntergeladen.</p><p><br /></p><p>⚠️ Solltest Du  Probleme beim Generieren der Grafik haben, nutze bitte <i>Google Chrome</i>.</p><p><br /></p><h2>Schritt 4: Motive &amp; Hintergrundbilder hinzufügen</h2><p><br /></p><p>Der Kunde hat im Product Designer die Möglichkeit, eigene Bilder hochzuladen. Zusätzlich kannst Du ihm die Option anbieten, aus einem vordefinierten Set zwischen verschiedenen Motivenund Hintergrundbildern zu wählen. </p><p>Logge Dich hierfür in das Shopware Backend ein und klicke im Menü auf <i>Inhalte</i> &gt; <i>Medien</i>.</p><p>Der Product Designer hat hier automatisch vier Verzeichnisse angelegt:</p><p>- <i>Product Designer - Uploads</i>: Hier landen Grafiken, die Benutzer des Product Designers hochgeladen haben. Die Grafiken werden erneut benötigt, wenn ein Benutzer im Nachhinein sein Design abändern möchte oder du die Rendering Applikation ausführst. Lösche deshalb keine Grafiken von Hand in diesem Verzeichnis.</p><p>- <i>Product Designer - Basket Images: </i>Hier werden die Vorschaugrafiken für den Warenkorb gespeichert. Auch hier solltest Du von Hand keine Grafiken entfernen.</p><p>- <i>Product Designer - Images</i>: Lade in dieses Verzeichnis die gewünschten Motive, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Motive in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Motiv einen <i>Titel</i>  festlegen, der im Frontend erscheinen wird.<br />- <i>Product Designer</i> - <i>Background Images:</i><i> </i>Lade in dieses Verzeichnis die gewünschten Hintergrundbilder, die Du Deinen Kunden anbieten möchtest. Wenn Du mehrere Hintergrundbilder in unterschiedliche Kategorien gruppieren möchtest, kannst Du entsprechende Unterordner anlegen. Du kannst zudem für jedes Hintergrundbild einen <i>Titel</i> festlegen, der im Frontend erscheinen wird.</p><p><br /></p><p><br /></p><h2>Schritt 5: Dokumentation lesen</h2><p><br />Nimm Dir ausreichend Zeit, um die einzelnen Konfigurationsoptionen im Designer-Backend durchzugehen. Jedes Eingabefeld besitzt eine ausführliche Beschreibung, die dessen Funktion erklärt.<br /><br /></p><p>Für weiterführende Informationen und häufig gestellte Fragen kannst Du einen Blick in unsere Dokumentation werfen: <br /><a href=\"http://docs.product-designer.io/\" target=\"_blank\" rel=\"noreferrer noopener\">http://docs.product-designer.io</a></p>","version":"1.1.1","changelog":[{"version":"1.1.1","text":"<p>- Pixabay integration</p>","creationDate":{"date":"2023-02-24 15:29:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>The first release of the product designer app.</p>","creationDate":{"date":"2022-09-13 23:09:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Kilb782888457578","redirectToStore":false,"lowestPriceValue":49.99}