{"id":15898,"name":"ZeobvAbandonedCartApp","code":"zeobv73779656144","lastChange":{"date":"2023-07-19 14:15:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGBklTx","examplePageUrl":"","moduleKey":"ZeobvAbandonedCartApp","creationDate":{"date":"2022-09-17 06:40:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-10-04 14:49:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-09-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-09-17 06:53:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":27719,"name":"Verlassene Warenkorb (Cloud)","description":"<h4>Verlieren Sie keine Konversionen durch Kunden, die vergessen haben, ihren Kauf abzuschließen!</h4><p>Erhalten Sie Konvertierungen zurück, die Sie sonst mit diesem voll ausgestatteten, verlassene Warenkorb Plugin verloren hätten. Noch nie war es so einfach, Erinnerungen an Ihre Kunden zu senden, um ihre Kasse abzuschließen. Untersuchungen haben gezeigt, dass das Versenden von Erinnerungen an verlassene Warenkorb&nbsp;69% mehr Umsatz einbrachte als eine einzige E-Mail.</p><p><br></p><p>Dieses Plugin verwandelt Warenkorb, die von Ihren Besuchern zurückgelassen wurden, in sogenannte verlassene Warenkorb. Dies geschieht, sobald die E-Mail eines Besuchers im Checkout-Prozess bekannt ist oder wenn ein Besucher eingeloggt ist. Jetzt beginnt der Timer zu ticken. Nachdem die konfigurierte Zeit für einen verlassenen Warenkorb verstrichen ist, wird eine Erinnerungs-E-Mail an den Besitzer jedes Warenkorbs gesendet. Diese Erinnerung wird mit einer E-Mail-Vorlage erstellt und enthält einen einfachen Link, mit dem der Kunde seinen Warenkorb wiederbeleben und den Bestellvorgang in Ihrem Shop abschließen kann.</p><p><br></p><p>Wir bieten auch eine Übersicht in der Administration, in der Sie den Status jedes verlassenen Warenkorbs und den Shop, in dem er verlassen wurde, einsehen können.</p><p><br></p><p>Fügen Sie unbedingt eine Zeile in Ihre Datenschutzerklärung ein, dass Sie aufgegebene Warenkörbe verwenden.&nbsp;<br></p>","installationManual":"<ul><li>Entpacken Sie die Zip-Datei in den Ordner custom/plugins oder verwenden Sie den Shopware-Plugin-Manager, installieren und aktivieren Sie das Plugin über die Kommandozeile oder über den Erweiterungsmanager in der Administration.&nbsp;</li><li>Nach der Installation und korrekten Aktivierung greifen Sie über die drei Punkte hinter dem Plugin-Namen in der Administration auf die Plugin-Konfiguration zu.</li><li>Wir stellen Ihnen eine Standard-E-Mail-Vorlage zur Verfügung, die als Basis für Ihre Abbruchmails dient. Diese finden Sie zwischen den anderen Mailvorlagen im Shopware Mailvorlagenmanager unter dem Namen \"Enter abandoned cart state: Reminded\". Sie können diese Vorlage nach Belieben bearbeiten, aber achten Sie darauf, dass Sie kein fehlerhaftes HTML erzeugen oder unzulässige Variablen verwenden. Die Abbruchmail verwendet die folgenden Template-Variablen: zeoAbandonedCart, salesChannel, customer. Beachten Sie, dass die Variable customer nicht garantiert mit Kundendaten gefüllt ist, da wir die E-Mail des Kunden so schnell wie möglich erhalten wollen. Dinge wie customer.firstName zu verwenden, ohne zu prüfen, ob der Kunde tatsächlich definiert ist, kann riskant sein und dazu führen, dass die Mail nicht gesendet wird.</li><li>Erstellen Sie zusätzliche Mail-Vorlagen mit dem Typ \"Enter abandoned cart state: Reminded\" für die Verwendung im Zeitplan für die Abbruchmails.</li><li>Konfigurieren Sie den Zeitplan anhand der Anleitung in der Plugin-Konfiguration.&nbsp;</li><li>Navigieren Sie zu Marketing &gt; Abgebrochene Warenkörbe, um einen Einblick in die Warenkorbkonversionen in Ihrem Shop zu erhalten und die ausgelösten Erinnerungen zu verfolgen.</li></ul>","shortDescription":"Holen Sie sich Conversions zurück, die Sie sonst mit diesem vollständig aufgegebenen Cart-Plugin verloren hätten. Es war noch nie so einfach, Erinnerungen an Ihre Kunden zu senden, um d","highlights":"Automatisch geplante Erinnerungs-E-Mails an abgebrochene Warenkörbe.\nEinblicke in die abgebrochenen Warenkörbe eines Webshops über eine Übersicht in der Administration.\nSteigern Sie Ihre Konversionen mit nur wenigen Klicks.\nBringen Sie Kunden zurück in Ihren Shop, um einen Kauf abzuschließen.\nWissen Sie, welche Artikel abgebrochen werden - mit Einblicken in die Warenkorbdetails.","features":"Automatische Erinnerungs-E-Mails an abgebrochene Warenkörbe.\nEinblicke in verlassene Warenkörbe über die Administration.\nVollständig anpassbare und konfigurierbare E-Mail-Vorlage.\nVollständige Kontrolle über den Zeitpunkt, ab dem ein Warenkorb als verlassen gilt und Benachrichtigungen geplant werden.\nKonfigurieren Sie eine Abklingzeit, um verlorene, verlassene Warenkörbe automatisch zu bereinigen.\nEinsicht in die Artikel eines jeden verlassenen Warenkorbs.\nKonversionsstatistiken direkt auf Ihrem Dashboard, basierend auf den gesendeten Mails und den Bestellungen aus abgebrochenen Warenkörben\nUnterstützung für mehrere Erinnerungen mit unserer einfachen, aber leistungsstarken Benachrichtigungsplanung."},{"id":27720,"name":"Abandoned Carts (Cloud)","description":"<h3>Don't lose out on conversions from customers forgetting to complete their purchase!</h3><p>Get back conversions that you would otherwise have lost with this complete abandoned cart plugin. Sending reminders to your customers to finish their checkout has never been easier. Research has shown that sending abandoned cart reminders brought in 69% more revenue than a single email.</p><p>This app turns carts that have been left behind by your visitors into so-called Abandoned Carts. This happens as soon as a visitor's email is known in the checkout process or if a visitor is logged in. Now the timer starts ticking. After the configured time has passed for an Abandoned Cart a reminder email will be sent out to the owner of each cart. This reminder is created using an email template and contains a simple link the customer can use to revive its cart and finish the checkout process in your shop.</p><p>We also feature an overview in the Administration where you can view the status of each Abandoned Cart and in which shop it was abandoned.</p>","installationManual":"<ul><li>Extract the zip file in the custom/apps folder or use the Shopware extension manager, install and activate the plugin using the command line or via the extension manager in the administration.&nbsp;</li><li>Once installed and activated correctly access the app configuration via the three dots behind the app name in the administration.</li><li>We provide a default email template functioning as a basis for your abandoned cart mail communication. This can be found between the other mail templates in the Shopware mail template manager under the name \"Enter abandoned cart state: Reminded\". Feel free to edit this template as you like, but be wary for creating corrupt HTML or using illegal variables. The abandoned cart mail makes use of the following template variables: zeobvAbandonedCart, salesChannel, customer. Note that the customer variable is not guaranteed to be filled with customer data since we aim to get the customer's email as quickly as possible. Using things like customer.firstName without checking if the customer is actually defined can be risky and cause the mail to not be sent.</li><li>Create extra mail templates using the \"Enter abandoned cart state: Reminded\" type for use in the abandoned cart mail scheduling.</li><li>Configure the time schedule using the instruction found in the app configuration.&nbsp;</li><li>Navigate to Marketing &gt; Abandoned Carts to gain insight into cart conversions within your store and keep track of reminders being triggered.</li><p></p><p><br></p></ul>","shortDescription":"Get back conversions that you would otherwise have lost with this complete abandoned cart plugin. Sending reminders to your customers to finish their checkout has never been easier.","highlights":"Automatic scheduled abandoned cart reminder emails.\nInsights in a webshop's abandoned carts via an overview in the Administration.\nBoost your conversions with just a few clicks.\nGet customers back to your shop to finish a purchase.\nKnow which items get abandoned with cart detail insights.","features":"Automatic abandoned cart reminder emails.\nAbandoned cart insights via the Administration.\nFully customizable and configurable mail template.\nComplete control over the timing for a cart to be considered abandoned and notifications to be scheduled.\nConfigure a decay time to automatically clear up lost abandoned carts.\nInsights into the items of each abandoned cart.\nConversion statistics straight on your dashboard based on the mails sent and orders placed from abandoned carts\nMulti reminder support with our simple but powerful notification scheduling."}],"addons":["ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":166350,"bookingKey":"zeobv73779656144_M","bookingText":"Abandoned Carts Cloud","price":25,"duration":1,"trialPhaseIncluded":true,"discount":5,"discountAppliesForMonths":6,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5Q5zjp","preview":true,"priority":0,"id":98306},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe83EBr","preview":false,"priority":0,"id":98304},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpf35pJj","preview":false,"priority":0,"id":98305}],"comments":[],"ratingAverage":0,"label":"Verlassene Warenkorb (Cloud)","description":"<h4>Verlieren Sie keine Konversionen durch Kunden, die vergessen haben, ihren Kauf abzuschließen!</h4><p>Erhalten Sie Konvertierungen zurück, die Sie sonst mit diesem voll ausgestatteten, verlassene Warenkorb Plugin verloren hätten. Noch nie war es so einfach, Erinnerungen an Ihre Kunden zu senden, um ihre Kasse abzuschließen. Untersuchungen haben gezeigt, dass das Versenden von Erinnerungen an verlassene Warenkorb 69% mehr Umsatz einbrachte als eine einzige E-Mail.</p><p><br /></p><p>Dieses Plugin verwandelt Warenkorb, die von Ihren Besuchern zurückgelassen wurden, in sogenannte verlassene Warenkorb. Dies geschieht, sobald die E-Mail eines Besuchers im Checkout-Prozess bekannt ist oder wenn ein Besucher eingeloggt ist. Jetzt beginnt der Timer zu ticken. Nachdem die konfigurierte Zeit für einen verlassenen Warenkorb verstrichen ist, wird eine Erinnerungs-E-Mail an den Besitzer jedes Warenkorbs gesendet. Diese Erinnerung wird mit einer E-Mail-Vorlage erstellt und enthält einen einfachen Link, mit dem der Kunde seinen Warenkorb wiederbeleben und den Bestellvorgang in Ihrem Shop abschließen kann.</p><p><br /></p><p>Wir bieten auch eine Übersicht in der Administration, in der Sie den Status jedes verlassenen Warenkorbs und den Shop, in dem er verlassen wurde, einsehen können.</p><p><br /></p><p>Fügen Sie unbedingt eine Zeile in Ihre Datenschutzerklärung ein, dass Sie aufgegebene Warenkörbe verwenden. <br /></p>","installationManual":"<ul><li>Entpacken Sie die Zip-Datei in den Ordner custom/plugins oder verwenden Sie den Shopware-Plugin-Manager, installieren und aktivieren Sie das Plugin über die Kommandozeile oder über den Erweiterungsmanager in der Administration. </li><li>Nach der Installation und korrekten Aktivierung greifen Sie über die drei Punkte hinter dem Plugin-Namen in der Administration auf die Plugin-Konfiguration zu.</li><li>Wir stellen Ihnen eine Standard-E-Mail-Vorlage zur Verfügung, die als Basis für Ihre Abbruchmails dient. Diese finden Sie zwischen den anderen Mailvorlagen im Shopware Mailvorlagenmanager unter dem Namen \"Enter abandoned cart state: Reminded\". Sie können diese Vorlage nach Belieben bearbeiten, aber achten Sie darauf, dass Sie kein fehlerhaftes HTML erzeugen oder unzulässige Variablen verwenden. Die Abbruchmail verwendet die folgenden Template-Variablen: zeoAbandonedCart, salesChannel, customer. Beachten Sie, dass die Variable customer nicht garantiert mit Kundendaten gefüllt ist, da wir die E-Mail des Kunden so schnell wie möglich erhalten wollen. Dinge wie customer.firstName zu verwenden, ohne zu prüfen, ob der Kunde tatsächlich definiert ist, kann riskant sein und dazu führen, dass die Mail nicht gesendet wird.</li><li>Erstellen Sie zusätzliche Mail-Vorlagen mit dem Typ \"Enter abandoned cart state: Reminded\" für die Verwendung im Zeitplan für die Abbruchmails.</li><li>Konfigurieren Sie den Zeitplan anhand der Anleitung in der Plugin-Konfiguration. </li><li>Navigieren Sie zu Marketing &gt; Abgebrochene Warenkörbe, um einen Einblick in die Warenkorbkonversionen in Ihrem Shop zu erhalten und die ausgelösten Erinnerungen zu verfolgen.</li></ul>","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<p>- Added config translation</p><p><br /></p>","creationDate":{"date":"2022-10-04 14:10:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First version for Shopware 6</p><p><br /></p>","creationDate":{"date":"2022-09-17 07:00:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv73779656144","redirectToStore":false,"lowestPriceValue":25}