{"id":16058,"name":"FishnWebpConvert","code":"Fishn86052150390","lastChange":{"date":"2023-07-24 14:10:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDtVjtb","examplePageUrl":"","moduleKey":"FishnWebpConvert","creationDate":{"date":"2022-10-17 09:08:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-11-08 19:17:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-25 14:12:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3606,"prefix":"Fishn","name":"Fishnet Services","website":"//fishnet-services.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3606_fishnet.png"},"infos":[{"id":28008,"name":"Bilder in WebP umwandeln","description":"<p>Erleben Sie die Leistungsfähigkeit dieser Erweiterung, die Ihre Bilder mühelos in WebP konvertiert und die Bildkomprimierung revolutioniert. Ohne auf Tools von Drittanbietern angewiesen zu sein, können Sie Ihre konvertierten Bilder nahtlos speichern und dabei die Originale beibehalten. Für den Fall, dass der Browser eines Besuchers nicht WebP-kompatibel ist, stellt die Erweiterung sicher, dass stattdessen das Originalbild angezeigt wird.</p><br><p class=\"c-mrkdwn__pre\" data-stringify-type=\"pre\">Um das Potenzial sowohl für Produktbilder als auch für alle anderen visuellen Elemente in Ihrem Shop zu erschließen, benötigt dieses Plugin PHP-Unterstützung für GD-Images auf Ihrem Server. Sollte Ihr Server GD-Images nicht unterstützen, bieten wir Ihnen einen API-Schlüssel, mit dem Sie gegen eine geringe monatliche Gebühr mühelos Bilder über unseren Server erstellen können. Senden Sie einfach die Bilder Ihres Shops an unseren Server, und sie werden automatisch konvertiert und umgehend zurückgeschickt. Wenn Ihr Server PHP für GD-Images unterstützt, wenden Sie sich bitte an Ihren Hoster, um weitere Informationen zu erhalten.</p><br>Bei der Nutzung des \"picture\"-Markups ist es wichtig zu beachten, dass diese Funktion für nginx-Benutzer von Bedeutung ist. Wir empfehlen, Ihren Hoster für weitere Informationen zu konsultieren.<br><br>Update: Der Juni bringt aufregende Änderungen mit sich, denn wir haben die Funktionalität aus dem Bereich \"Medien\" komplett entfernt! Stattdessen führen wir die Seite \"WebP-Warteschlange\" ein, die Administratoren Zugriff auf eine umfassende Liste von Bildern gewährt, die auf ihre Konvertierung warten. Nach erfolgreicher Konvertierung wird der Status auf \"Fertig\" gesetzt, und Administratoren haben die Möglichkeit, den Status zu ändern, was eine erneute Konvertierung des Bildes auslöst. Umgekehrt werden Bilder, die während des Cronjobs unbearbeitet bleiben, übersprungen.<br><br>Auf der Seite \"WebP-Warteschlange\" können Administratoren außerdem Bilder zur Konvertierungswarteschlange hinzufügen. Mit einem einfachen Klick öffnet sich die Mediathek und ermöglicht eine einfache Auswahl der Bilder, die in die Warteschlange aufgenommen werden sollen. Sie können sicher sein, dass unser Konvertierungsprozess die Bilder sperrt und ein versehentliches Löschen aus der Warteschlange während des Konvertierungsprozesses verhindert. Verabschieden Sie sich von Zeitüberschreitungen und Fehlern, die üblicherweise mit Erweiterungen verbunden sind.<br><br>Außerdem bietet unsere Erweiterung eine optionale Funktion zur Automatisierung der Konvertierung neuer Bilder in WebP. Darüber hinaus erleichtert sie das Leeren und Optimieren des Caches nach der Verarbeitung einer bestimmten Stapelgröße, z. B. 10 Bilder. Sollte Ihr Server aufgrund einer umfangreichen Bildbibliothek stark belastet sein, können Sie diese Option flexibel deaktivieren.<br><br>Sie können die Anzahl der Bilder, die bei jedem Cronjob-Lauf konvertiert werden, einfach konfigurieren. Standardmäßig ist der Wert auf 10 eingestellt, und der Cronjob wird jede Minute gestartet, so dass 10 Bilder pro Minute konvertiert werden können. Wir verwenden diesen Ansatz der \"langsamen Aktion\", da Shopware bei jeder Konvertierung Thumbnails generiert.<br><br><p>Erleben Sie die Effizienz und Optimierung, die unsere Erweiterung bietet, und stärken Sie Ihre Webpräsenz mit einer hervorragenden Bildkomprimierung und nahtlosen WebP-Konvertierung.</p><p><br></p><p>Entdecken Sie die Leistungsfähigkeit der automatisierten WebP-Bildwarteschlange! Aktivieren Sie das automatische Hinzufügen von Bildern zu Ihrer WebP-Warteschlange mit nur einem einfachen Konfigurationsschalter. Maximieren Sie die Leistung Ihrer Website mit dieser unglaublichen Funktion!</p><p><br></p><p>Die Protokolldatei befindet sich in <b>/var/log/fishn_webp_convert_*.log</b>.<br></p>","installationManual":"Installieren Sie das Plugin unter \"<b>Erweiterungen</b>\".<br><br>Unter <b>Einstellungen - Erweiterungen - Bilder in WebP</b> konvertieren können Sie wählen, ob die Bilder auf Ihrem eigenen Server (empfohlen) oder über unseren Dienst konvertiert werden sollen.<br><b><br>Bitte beachten Sie, dass Sie für die Nutzung unseres Dienstes einen API-Schlüssel anfordern müssen.</b>&nbsp; Wenn Ihr eigener Server in der Lage ist, WebP-Bilder zu erstellen, benötigen Sie keinen API-Schlüssel. Probieren Sie es einfach aus :-)<br><br>Nachdem das Plugin konfiguriert ist, können Sie Bilder aus der Medienbibliothek zur WebP-Warteschlange hinzufügen. Die Bilder werden im Hintergrund zusätzlich zum bestehenden Originalbild konvertiert.<br><br><p>Auf diese Weise bleibt das alte png- oder jpg-Bild erhalten und dient als Fallback.</p>Wenn Sie Bilder automatisch zur WebP-Warteschlange hinzufügen möchten, müssen Sie in der Konfiguration den Schalter \"Automatically add media to convert queue\" aktivieren.<br><p><br></p><p>Der Cache wird automatisch geleert, nachdem alle Bilder konvertiert wurden.</p><p>Wenn Sie sie vorher anzeigen möchten, müssen Sie den Cache manuell löschen.</p><p><br></p><p>Die Protokolldatei befindet sich in <b>/var/log/fishn_webp_convert_*.log</b>.</p><p><br></p><p>Plugin ist nicht kompatibel mit <b>LazySizes und LazyLoading für passende Bilder-Sizes</b>!<br></p>","shortDescription":"Die Erweiterung konvertiert Bilder in WebP und speichert sie ohne die Notwendigkeit einer dritten Partei - Bilder können auf deinem Server oder durch unseren Service konvertiert werden.","highlights":"Bilder verlustarm komprimieren.\nVon Google bevorzugtes Bildformat.\nSchnellerer Shop, zufriedene Kunden, besseres Ranking.","features":"Komprimierung auf deinem Server. \nKein Drittanbieter notwendig!\nAutomatisches Fallback auf das Originalbild, falls Besucher kein WebP anzeigen können."},{"id":28013,"name":"Convert images to WebP","description":"<p>Experience the power of this extension that effortlessly converts your images to WebP, revolutionizing image compression. With no reliance on third-party tools, you can seamlessly save your converted images while retaining the originals. In the event that a visitor's browser lacks WebP compatibility, the extension ensures the display of the original image instead.</p><br>Unlocking the potential for both product images and all other visuals within your store, this plugin requires PHP support for GD images on your server. Should your server lack GD image support, we have you covered with an API key offering hassle-free image creation through our server for a nominal monthly fee. Simply send your store's images to our server, and they will be automatically converted and promptly returned. If your server supports PHP for GD images, kindly consult your hoster for further guidance.<br><br>Harnessing the power of the \"picture\" markup, it's crucial to note that this feature holds significance for nginx users. We recommend consulting your hoster for more information.<br><br>Update: June brings exciting changes as we have completely removed the functionality from the \"Media\" section! Instead, we introduce the \"WebP Queue\" page, granting administrators access to a comprehensive list of images awaiting conversion. Upon successful conversion, the status will be set as \"Done,\" and administrators have the option to change the status, triggering a re-conversion of the image. Conversely, images that remain unprocessed during the cronjob will be skipped.<br><br>The \"WebP Queue\" page also enables administrators to add images to the conversion queue. With a simple click, the media library opens, allowing for easy selection of images to include in the queue. Rest assured, our conversion process ensures the locking of images, preventing any accidental deletion from the queue during the conversion process. Say goodbye to timeouts and bugs commonly associated with extensions.<br><br>Moreover, our extension offers an optional feature to automate the conversion of new images to WebP. Additionally, it facilitates the clearing and optimization of the cache after processing a predetermined batch size, such as 10 images. Should your server experience high load due to an extensive image library, you have the flexibility to disable this option.<br><br>Easily configure the number of images converted in each cronjob run. By default, the value is set to 10, and the cronjob initiates every minute, allowing for the conversion of 10 images per minute. We employ this \"slow action\" approach due to Shopware's thumbnail generation process during each conversion.<br><br><p>Experience the efficiency and optimization provided by our extension, empowering your web presence with superior image compression and seamless WebP conversion.</p><p><br></p><p>Discover the Power of Automated WebP Image Queueing! Easily enable the automatic image addition to your WebP queue with just a simple configuration switch. Maximize your website's performance with this incredible feature!<br></p><p><br></p><p>Log file can be found in <b>/var/log/fishn_webp_convert_*.log</b>.<br></p>","installationManual":"Install the plugin under \"<b>Extensions</b>\".<br><br>Under <b>Settings - Extensions - Convert images to WebP</b> you can choose whether the images should be converted on your own server (recommended) or via our service.<br><br><b>Please note that you have to request an API key to use our service.</b>&nbsp; If your own server is capable of creating webP images, you don't need an API key. Just give it a try :-)<br><br>After the plugin is configured, you can add images from the media library to WebP queue. Images will be converted in background additionally to existing original image.<br><p>This way the old png or jpg image remains and serves as fallback. </p><p>If you want to add images automatically to WebP queue, you need to enable the switch in configuration - \"Automatically add media to convert queue\".</p><p><br></p><p>Cache is cleared automatically after all images have finished the conversion.</p><p>If you want to show them before that, you'll need to clear the cache manually.<br></p><p><br></p><p>Log file can be found at: <b>/var/log/fishn_webp_convert_*.log.</b></p><p><br></p><p class=\"info--title\" itemprop=\"name\">Plugin is not compatible with <b>LazySizes and LazyLoading for suitable image sizes!</b></p>","shortDescription":"The extension converts images to WebP and saves them without the need of a third party - images can be converted on your server or through our service.","highlights":"Compress images with minimal loss.\nImage format preferred by Google.\nFaster store, satisfied customers, better ranking.","features":"Compression on your server. \nNo third party provider necessary!\nAutomatic fallback to the original image if visitors can't view WebP."}],"addons":["highlightInListing"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":172267,"bookingKey":"Fishn86052150390","bookingText":"Convert images to WebP","price":150,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":172265,"bookingKey":"Fishn86052150390_M","bookingText":"Convert images to WebP","price":14.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":172266,"bookingKey":"Fishn86052150390_M12","bookingText":"Convert images to WebP","price":134.91,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVv8fv1","preview":true,"priority":0,"id":116102},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvsruob","preview":false,"priority":0,"id":116097},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpX0QFpV","preview":false,"priority":0,"id":116101},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphhKWfy","preview":false,"priority":0,"id":120922},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPtvP4M","preview":false,"priority":0,"id":120923}],"comments":[{"authorName":"Karl","text":"Das Plugin funktioniert bisher sauber, bringt die gewünschte Funktionalität und der Support ist schnell und hilfsbereit.\nMan sollte den Hinweis in der Beschreibung beachten, dass es nicht mit LazySizes und LazyLoading kompatibel ist (unter Konfigurationsanleitung) - dann läuft das. \n\nErste Tests zeigen, dass es auch nicht mit JTL in Konflikt kommt.","headline":"Gute Lösung für´s eigene Hosting","creationDate":{"date":"2023-07-07 21:38:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christoph Zue","text":"Hallo, liebe Shopware-Enthusiasten! Stellt euch mal Shopware ohne Plugins vor – ganz schön öde, oder? Keine Sorge, hier kommt ein Plugin, das eurem Shop neuen Glanz verleiht: Es erstellt selbst-gehostete Bilder im schicken WebP-Format!\n\nZugegeben, anfangs war es ein kleines Abenteuer, doch nach einer netten Plauderei mit dem hilfsbereiten Support von Fishnet Services wurden die typischen Startprobleme, die jedes junge Plugin so mit sich bringt, rasant gelöst.\n\nBevor ihr jedoch in die Vollen geht, legt euch am besten einen Testordner an und konvertiert ein paar Bilder, um das Plugin erstmal kennenzulernen. Achtung: Löscht niemals die alten .jpg und .png Bilder – das sage ich euch aus bitterer Erfahrung! Die sollten nämlich zur Browserkompatibilität erhalten bleiben.\n\nDieses flotte Plugin gibt eurem Shop ordentlich Tempo, indem es den Browser eurer Kunden checkt und, wenn möglich, alle Bilder im besseren .webp Format lädt. Das sorgt nicht nur für zufriedenere Kunden, sondern reduziert auch den Traffic im WWW. Das ist nicht unwichtig, denn auch die Umwelt freut sich – und Energie sparen ist ohnehin schick! Jeder gesparte MB, der nicht durchs Internet gejagt wird, ist ein Beitrag zur Umweltschonung.\n\nAlso, worauf wartet ihr noch? Schnappt euch dieses Plugin, probiert es aus und tüftelt gemeinsam mit dem Support von Fishnet Services an möglichen Verbesserungen.\n\nUnd jetzt kommt der Clou: Ein geheimnisvolles Vögelchen hat mir gezwitschert, dass bis Ende Mai ein großes Update kommen soll, das den Umfang des Plugins erweitert und noch einige nützliche Funktionen hinzufügt. Na, wenn das mal kein Grund zum Schmunzeln ist!","headline":"Das Turbo-Plugin für euren Shop: WebP-Bilder für mehr Tempo, Umweltfreundlichkeit und Kundenzufriedenheit!","creationDate":{"date":"2023-04-28 17:17:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Bilder in WebP umwandeln","description":"<p>Erleben Sie die Leistungsfähigkeit dieser Erweiterung, die Ihre Bilder mühelos in WebP konvertiert und die Bildkomprimierung revolutioniert. Ohne auf Tools von Drittanbietern angewiesen zu sein, können Sie Ihre konvertierten Bilder nahtlos speichern und dabei die Originale beibehalten. Für den Fall, dass der Browser eines Besuchers nicht WebP-kompatibel ist, stellt die Erweiterung sicher, dass stattdessen das Originalbild angezeigt wird.</p><br /><p>Um das Potenzial sowohl für Produktbilder als auch für alle anderen visuellen Elemente in Ihrem Shop zu erschließen, benötigt dieses Plugin PHP-Unterstützung für GD-Images auf Ihrem Server. Sollte Ihr Server GD-Images nicht unterstützen, bieten wir Ihnen einen API-Schlüssel, mit dem Sie gegen eine geringe monatliche Gebühr mühelos Bilder über unseren Server erstellen können. Senden Sie einfach die Bilder Ihres Shops an unseren Server, und sie werden automatisch konvertiert und umgehend zurückgeschickt. Wenn Ihr Server PHP für GD-Images unterstützt, wenden Sie sich bitte an Ihren Hoster, um weitere Informationen zu erhalten.</p><br />Bei der Nutzung des \"picture\"-Markups ist es wichtig zu beachten, dass diese Funktion für nginx-Benutzer von Bedeutung ist. Wir empfehlen, Ihren Hoster für weitere Informationen zu konsultieren.<br /><br />Update: Der Juni bringt aufregende Änderungen mit sich, denn wir haben die Funktionalität aus dem Bereich \"Medien\" komplett entfernt! Stattdessen führen wir die Seite \"WebP-Warteschlange\" ein, die Administratoren Zugriff auf eine umfassende Liste von Bildern gewährt, die auf ihre Konvertierung warten. Nach erfolgreicher Konvertierung wird der Status auf \"Fertig\" gesetzt, und Administratoren haben die Möglichkeit, den Status zu ändern, was eine erneute Konvertierung des Bildes auslöst. Umgekehrt werden Bilder, die während des Cronjobs unbearbeitet bleiben, übersprungen.<br /><br />Auf der Seite \"WebP-Warteschlange\" können Administratoren außerdem Bilder zur Konvertierungswarteschlange hinzufügen. Mit einem einfachen Klick öffnet sich die Mediathek und ermöglicht eine einfache Auswahl der Bilder, die in die Warteschlange aufgenommen werden sollen. Sie können sicher sein, dass unser Konvertierungsprozess die Bilder sperrt und ein versehentliches Löschen aus der Warteschlange während des Konvertierungsprozesses verhindert. Verabschieden Sie sich von Zeitüberschreitungen und Fehlern, die üblicherweise mit Erweiterungen verbunden sind.<br /><br />Außerdem bietet unsere Erweiterung eine optionale Funktion zur Automatisierung der Konvertierung neuer Bilder in WebP. Darüber hinaus erleichtert sie das Leeren und Optimieren des Caches nach der Verarbeitung einer bestimmten Stapelgröße, z. B. 10 Bilder. Sollte Ihr Server aufgrund einer umfangreichen Bildbibliothek stark belastet sein, können Sie diese Option flexibel deaktivieren.<br /><br />Sie können die Anzahl der Bilder, die bei jedem Cronjob-Lauf konvertiert werden, einfach konfigurieren. Standardmäßig ist der Wert auf 10 eingestellt, und der Cronjob wird jede Minute gestartet, so dass 10 Bilder pro Minute konvertiert werden können. Wir verwenden diesen Ansatz der \"langsamen Aktion\", da Shopware bei jeder Konvertierung Thumbnails generiert.<br /><br /><p>Erleben Sie die Effizienz und Optimierung, die unsere Erweiterung bietet, und stärken Sie Ihre Webpräsenz mit einer hervorragenden Bildkomprimierung und nahtlosen WebP-Konvertierung.</p><p><br /></p><p>Entdecken Sie die Leistungsfähigkeit der automatisierten WebP-Bildwarteschlange! Aktivieren Sie das automatische Hinzufügen von Bildern zu Ihrer WebP-Warteschlange mit nur einem einfachen Konfigurationsschalter. Maximieren Sie die Leistung Ihrer Website mit dieser unglaublichen Funktion!</p><p><br /></p><p>Die Protokolldatei befindet sich in <b>/var/log/fishn_webp_convert_*.log</b>.<br /></p>","installationManual":"Installieren Sie das Plugin unter \"<b>Erweiterungen</b>\".<br /><br />Unter <b>Einstellungen - Erweiterungen - Bilder in WebP</b> konvertieren können Sie wählen, ob die Bilder auf Ihrem eigenen Server (empfohlen) oder über unseren Dienst konvertiert werden sollen.<br /><b><br />Bitte beachten Sie, dass Sie für die Nutzung unseres Dienstes einen API-Schlüssel anfordern müssen.</b>  Wenn Ihr eigener Server in der Lage ist, WebP-Bilder zu erstellen, benötigen Sie keinen API-Schlüssel. Probieren Sie es einfach aus :-)<br /><br />Nachdem das Plugin konfiguriert ist, können Sie Bilder aus der Medienbibliothek zur WebP-Warteschlange hinzufügen. Die Bilder werden im Hintergrund zusätzlich zum bestehenden Originalbild konvertiert.<br /><br /><p>Auf diese Weise bleibt das alte png- oder jpg-Bild erhalten und dient als Fallback.</p>Wenn Sie Bilder automatisch zur WebP-Warteschlange hinzufügen möchten, müssen Sie in der Konfiguration den Schalter \"Automatically add media to convert queue\" aktivieren.<br /><p><br /></p><p>Der Cache wird automatisch geleert, nachdem alle Bilder konvertiert wurden.</p><p>Wenn Sie sie vorher anzeigen möchten, müssen Sie den Cache manuell löschen.</p><p><br /></p><p>Die Protokolldatei befindet sich in <b>/var/log/fishn_webp_convert_*.log</b>.</p><p><br /></p><p>Plugin ist nicht kompatibel mit <b>LazySizes und LazyLoading für passende Bilder-Sizes</b>!<br /></p>","version":"2.0.4","changelog":[{"version":"2.0.4","text":"<ul><li>Performance optimization. </li><li>Add a task for enqueuing images.<br /></li></ul>","creationDate":{"date":"2023-07-21 14:38:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<ul><li>Bugfixes: Media not converted, WebP image not displayed if there are no thumbnails.</li></ul>","creationDate":{"date":"2023-07-06 15:44:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<ul><li>Bugfixes: Fix error message.</li></ul><ul><li>Add webP media convert log.</li></ul>","creationDate":{"date":"2023-07-03 14:17:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<ul><li>Clear and warmup cache after all images are converted.</li><li>Delay the scheduled task.</li></ul>","creationDate":{"date":"2023-06-27 11:45:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul><li>Shopware 6.5.0 compatibility</li></ul>","creationDate":{"date":"2023-06-22 13:11:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.8","text":"<ul><li>Performance optimization.</li></ul><ul><li>Add a task for enqueuing images.</li></ul>","creationDate":{"date":"2023-07-24 14:09:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.7","text":"<ul><li>Bugfixes: WebP image not displayed if there are no thumbnails.</li></ul>","creationDate":{"date":"2023-07-06 14:24:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<ul><li>Bugfixes: Media not converted</li></ul>","creationDate":{"date":"2023-07-05 10:05:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<ul><li>* Bugfixes: Fix error message.</li></ul><ul><li>* Add webP media convert log.</li></ul>","creationDate":{"date":"2023-07-03 15:59:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>Clear the cache after all images are converted.</li></ul><ul><li>Delay the scheduled task.</li></ul>","creationDate":{"date":"2023-06-27 12:08:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<ul><li>Fix performance issues<br /></li></ul>","creationDate":{"date":"2023-06-22 12:37:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>Clear and warmup cache after converting image<br /></li></ul>","creationDate":{"date":"2023-06-06 14:45:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Bugfixes: Update error<br /></li></ul>","creationDate":{"date":"2023-06-06 10:10:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Images are added to the queue and converted in the background.</li></ul><ul><li>New page with a list of queued images and their status.</li></ul>","creationDate":{"date":"2023-06-05 15:30:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Bugfixes: Image display</li></ul>","creationDate":{"date":"2023-04-28 15:32:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<ul><li>Add information about removing old images</li><li>Bugfixes<br /></li></ul>","creationDate":{"date":"2023-04-26 11:56:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<ul><li>Shopware 6.5.0 compatibility</li></ul>","creationDate":{"date":"2023-03-31 13:37:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<ul><li>Improved browser support.</li></ul><ul><li>Use .webp image thumbnails.</li></ul>","creationDate":{"date":"2023-03-24 14:59:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p># 1.0.3</p><p><br /></p><p>* Bugfixes</p><p>* Add option to generate webp images for all existing images in media library at once.</p>","creationDate":{"date":"2022-12-22 13:48:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Bugfix: 500 error when editing a file with spaces in the name.</p><p><br /></p><p>Bugfix: 500 error when trying to convert a webp file to webp.</p>","creationDate":{"date":"2022-10-25 14:33:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>First release in Store<br /></li></ul>","creationDate":{"date":"2022-10-18 10:14:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Fishn86052150390","redirectToStore":true,"lowestPriceValue":14.99}