{"id":16060,"name":"eikon_akeneo_shopware_6_connector","code":"eikon26546946689","lastChange":{"date":"2023-07-18 11:16:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYlcPoW","examplePageUrl":"","moduleKey":"eikon_akeneo_shopware_6_connector","creationDate":{"date":"2022-10-17 10:54:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-12-13 15:40:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-12-31 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-10-25 14:58:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3735,"prefix":"eikon","name":"EIKONA Media GmbH","website":"//www.eikona-media.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3735_eimed_shopware.jpg"},"infos":[{"id":28011,"name":"Akeneo Shopware 6 Konnektor von EIKONA Media","description":"<p>Mit dem neuen Akeneo Shopware 6 Konnektor von EIKONA Media kannst du all deine Produktdaten reibungslos von Akeneo nach Shopware exportieren. Der Konnektor nutzt die Standardschnittstellen von Akeneo und Shopware, welche für den Datenaustausch vorgesehen sind. Profitiere von aktuellen Produktdaten in all deinen E-Commerce-Kanälen und sei schneller am Markt. Es sind Voll- und Deltaexporte nach Shopware möglich.</p><p><br></p><p>Hinweis: Um den Akeneo Konnektor für Shopware 6 zu nutzen, benötigst du eine bestehende Lizenz bei der EIKONA Media GmbH. Wenn du mehr über die Lizenzkosten erfahren möchtest, nimm gerne Kontakt zu uns auf unter hello@eikona-media.de oder wirf einen Blick auf unsere Webseite (www.eikona-media.de).</p>","installationManual":"<p>Nach der Installation der Erweiterung über den Shopware Store fülle bitte das angezeigte Formular des Herstellers aus. Dieser wird dich dann zeitnah über die nächsten Schritte informieren.</p><p><br></p><p>Hinweis: Die Nutzung des Akeneo Shopware Konnektors ist grundsätzlich auch ohne diese App möglich, da es sich hierbei um eine eigenständige Webanwendung Namens OSKAR handelt.</p>","shortDescription":"Dieser Konnektor ermöglicht einen reibungslosen Produktdatenaustausch von Akeneo PIM nach Shopware 6.  Profitiere von einer besseren time-to-market und immer aktuellen Produktdaten.","highlights":"Einfache Inbetriebnahme: In wenigen Stunden kannst du unsere SaaS Lösung in Betrieb nehmen\nEinfaches Preismodell: Unabhängig von Export- und Produkt-Anzahlen\nHohe Zeitersparnis: Importe und Exporte laufen völlig automatisiert und ganz ohne Personal\nZufriedene Mitarbeiter: Reduziere stupide manuelle Prozesse und steigern die Mitarbeiterzufriedenheit\nAktuelle Produktdaten: Schaffe durch Systemverbindungen immer aktuelle Produktinformationen in deinem Onlineshop","features":"Mapping: Hochgradig konfigurierbare Mapping-Schnittstelle für Produkt- und Artikeldaten\nProduktbilder: Produktbilder werden konvertiert und an der richtigen Stelle platziert, wenn sie an Shopware übertragen werden\nProduktmodelle: Der Konnektor konvertiert bestehende Akeneo-Produktmodelle auf intelligente Weise nach Shopware\nProduktvarianten: Alle Produktvarianten und Produktmodelle in Akeneo werden automatisch an Tradebyte übertragen\nSprachen: Wir können lokalisierbare Shopware-Informationen in mehreren Sprachen übertragen\nUnterstützte Produkt-Informationen: Kategoriebäume, Produkte, Produktmodelle, Attribute, Attributoptionen (Tags, Zusatzfelder, Eigenschaften), Media Assets, Vertriebskanäle\nFallback-Werte bei der Produkterstellung: Steuersatz, Nettopreis, Bruttopreis, Bestand, Vertriebskanäle\nMetrische Zieleinheit festlegen, z. B. alle Werte in kg für metrische Akeneo-Attribute umwandeln\nAnzahl der Dezimalstellen, auf die bei Attributen vom Typ Zahl gerundet werden soll\nHauptvariante für Produktmodelle\nTitelbild für Assets\nFilter für Produkte und Kategoriebäume in Akeneo"},{"id":28012,"name":"Akeneo Shopware 6 Connector by EIKONA Media","description":"<p>With the new Akeneo Shopware 6 connector from EIKONA Media you can export all your product data smoothly from Akeneo to Shopware. The connector uses the standard interfaces of Akeneo and Shopware, which are intended for data exchange. Benefit from up-to-date product data in all your e-commerce channels and be faster to market. Full and delta exports to Shopware are possible.</p><p><br>Note: To use the Akeneo connector for Shopware 6, you need an existing license with EIKONA Media GmbH. If you want to know more about the license costs, please contact us at hello@eikona-media.de or have a look at our website (www.eikona-media.de).</p>","installationManual":"<p>After installing the extension via the Shopware Store, please fill out the displayed form of the manufacturer. He will then inform you about the next steps in a timely manner.</p><p>Note: The use of the Akeneo Shopware connector is basically possible without this app, because it is a standalone web application called OSKAR.</p>","shortDescription":"This connector enables a smooth product data exchange from Akeneo PIM to Shopware 6. Benefit from a better time-to-market and always up-to-date product data.","highlights":"Easy startup: You can get our SaaS solution up and running in just a few hours\nSimple pricing model: Independent of export and product numbers\nHigh time savings: Imports and exports are fully automated and require no staff\nSatisfied employees: Reduce mindless manual processes and increase employee satisfaction\nUp-to-date product data: Create always up-to-date product information in your online store through system connections","features":"Mapping: Highly configurable mapping interface of product and item data\nProduct images: Product images are converted and placed in the correct location when transferred to Shopware\nProduct Models: The connector intelligently converts existing Akeneo product models to Shopware\nProduct variants: All product variants and product models in Akeneo are automatically transmitted to Shopware\nLanguages: We can transfer localizable Shopware information in multiple languages\nSupported product information: Category trees, products, product models, attributes, attribute options (tags, additional fields, properties), media assets, sales channels\nFallback values during product creation: tax rate, net price, gross price, inventory, distribution channels\nSet metric target unit, e.g. convert all values to kg for Akeneo metric attributes\nNumber of decimal places to round to for number type attributes\nMain variant for product models\nTitle screen for assets\nFilters for products and category trees in Akeneo"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166608,"bookingKey":"eikon26546946689","bookingText":"Akeneo Shopware 6 Connector by EIKONA Media","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCXoGxZ","preview":true,"priority":0,"id":100280},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHI9N32","preview":false,"priority":0,"id":100281},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOTGXZa","preview":false,"priority":0,"id":100282},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmDwaa6","preview":false,"priority":0,"id":100283},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYqaETJ","preview":false,"priority":0,"id":100284},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5mQeyX","preview":false,"priority":0,"id":100285},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCvdVlu","preview":false,"priority":0,"id":100286},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphMddzc","preview":false,"priority":0,"id":100287},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjy2Cq1","preview":false,"priority":0,"id":100288},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSxkhYJ","preview":false,"priority":0,"id":100289},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOj9jS6","preview":false,"priority":0,"id":101976}],"comments":[],"ratingAverage":0,"label":"Akeneo Shopware 6 Konnektor von EIKONA Media","description":"<p>Mit dem neuen Akeneo Shopware 6 Konnektor von EIKONA Media kannst du all deine Produktdaten reibungslos von Akeneo nach Shopware exportieren. Der Konnektor nutzt die Standardschnittstellen von Akeneo und Shopware, welche für den Datenaustausch vorgesehen sind. Profitiere von aktuellen Produktdaten in all deinen E-Commerce-Kanälen und sei schneller am Markt. Es sind Voll- und Deltaexporte nach Shopware möglich.</p><p><br /></p><p>Hinweis: Um den Akeneo Konnektor für Shopware 6 zu nutzen, benötigst du eine bestehende Lizenz bei der EIKONA Media GmbH. Wenn du mehr über die Lizenzkosten erfahren möchtest, nimm gerne Kontakt zu uns auf unter hello@eikona-media.de oder wirf einen Blick auf unsere Webseite (www.eikona-media.de).</p>","installationManual":"<p>Nach der Installation der Erweiterung über den Shopware Store fülle bitte das angezeigte Formular des Herstellers aus. Dieser wird dich dann zeitnah über die nächsten Schritte informieren.</p><p><br /></p><p>Hinweis: Die Nutzung des Akeneo Shopware Konnektors ist grundsätzlich auch ohne diese App möglich, da es sich hierbei um eine eigenständige Webanwendung Namens OSKAR handelt.</p>","version":"1.28.0","changelog":[{"version":"1.28.0","text":"<p>Features:</p>- Added buttons to test the registered API Crendentials<br />- Login via OAuth can now be configured<br />- Integration rights management<br />- Run Options are now displayed in Run Overview<br />- Added check for identical SKUs between SKU/model<br />- Added check on change of variant/product and vice versa<br />- In Language Mapping only the Shopware language has to be selected, not the Shopware locale<br />- Mapping forms are now correctly available in English/French<br />- Validation messages are now available in English/French<br />- Test mails can be sent in the UI<br />- Switch to PHP8<br />- Settings window on Flow Detail View removed<br />Bugfixes:<br />- Mail notifications for asynchronous flows work correctly now<br />- Error message for text filter without result adjusted<br />- User management bugfixes<br />- Failed Resources error on too long filter removed<br />- Language mapping is no longer checked in flow.config<br />- Sync is now also possible without saved API data<br />- Menu Options are now displayed correctly<br />","creationDate":{"date":"2022-11-10 13:03:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=eikon26546946689","redirectToStore":false,"lowestPriceValue":0}