{"id":16102,"name":"ZeobvMRMedia","code":"zeobv79826216599","lastChange":{"date":"2023-07-19 16:28:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAzAspV","examplePageUrl":"","moduleKey":"ZeobvMRMedia","creationDate":{"date":"2022-10-25 10:23:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-11-10 12:30:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-10-28 13:25:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":28092,"name":"3D-Modelle für Produkte mit VR/AR-Unterstützung","description":"<p>Das erste Virtual Reality Produktansichts-Plugin ist da! Sie können Ihren Kunden jetzt ein umfassendes VR-Erlebnis bieten und sie vollständig in Ihre Produkte eintauchen lassen! Sobald einer Ihrer Kunden Ihr Geschäft von einem Gerät aus besucht, das VR unterstützt, hat er die Möglichkeit, in ein unvergleichliches Erlebnis einzutauchen: die Möglichkeit, das Produkt so zu sehen, als ob es wirklich vor ihm wäre. Darüber hinaus können sie sogar um ihn herumgehen, um ihn aus verschiedenen Perspektiven zu betrachten! Außerdem hilft die Bereitstellung eines solchen Erlebnisses dem Kunden, ein Gefühl für die Größe des Produkts zu bekommen und nette kleine Details zu entdecken, die er sonst nie entdeckt hätte.</p><h3>Vorteile</h3><p><b>Leben auf dem neuesten Stand der Technik</b></p><p>Dies ist das erste Shopware-Plugin, das VR unterstützt. Stellen Sie sicher, dass Sie von dieser Technologie profitieren, indem Sie Ihren Kunden ein Erlebnis bieten, das kein anderes Plugin bietet. Sorgen Sie dafür, dass Kunden Ihr Produkt so sehen und erleben, als wären sie tatsächlich vor ihnen.</p><p><b>Erhöhte Conversions</b></p><p>Produkte werden oft erst in der Hand des Kunden erlebbar, was ihn zögerlicher und unsicherer machen kann, ob er das Produkt überhaupt haben möchte. Mit unserem VR-Plug-in können sie das Produkt jedoch direkt von zu Hause aus sehen und untersuchen! Dies wiederum führt zu einer geringeren Unsicherheit und damit zu einer höheren Konversionschance.</p><p><b>Ein unvergessliches Kundenerlebnis</b></p><p>Ein Produkt so zu erleben, als stünde es wirklich vor Ihnen, gibt Kunden ein Erlebnis, das sie noch nie zuvor hatten! Darüber hinaus kann es dazu führen, dass Kunden dazu neigen, mit anderen über ihre Erfahrungen zu sprechen, was Ihrer Marke noch mehr zugute kommt. Die Nutzung der VR-Technologie steigert also nicht nur die Käufe, sondern kann auch Anlass für unbezahltes Marketing sein!</p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<p><ul><li>Laden Sie die Erweiterung aus dem Community Store herunter</li><li>Aktivieren Sie die Erweiterung in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun. Alternativ können Sie auch die Schaltfläche \"Plugin hochladen\" verwenden, um die ZIP-Datei des Plugins hochzuladen.</li><li>Navigieren Sie zu einem Produkt in der Verwaltung und öffnen Sie die Registerkarte \"Spezifikationen\". Scrollen Sie nach unten zu den benutzerdefinierten Feldern und suchen Sie den Satz \"Mixed Reality Configuration\".</li><li>Innerhalb der \"Mixed Reality Configuration\" finden Sie das Feld \"3D-Objekt\". Laden Sie hier eine virtuelle 3D-Darstellung Ihres Produkts mit dem Dateityp \".glb\" hoch.</li><li>Die Vorschau sollte nun automatisch Ihr Modell rendern. Wenn Sie es nicht sehen, versuchen Sie, mit dem Skalierungswert zu spielen. Wir platzieren ein Dummy-Modell und einen Maßstab in die Szene, damit Sie sich besser vorstellen können, wie der Maßstab für den Kunden in VR aussehen wird. Der Maßstabswert ist ein prozentualer Wert des tatsächlichen Maßstabs des Modells, mit einer Voreinstellung von 20 %. Sie können auf das Aktualisierungssymbol oben rechts in der Vorschau klicken, um den Maßstab des Modells zu aktualisieren.</li><li>Wir bieten auch die Möglichkeit, einen Ständer zu rendern. Dies kann für kleinere Modelle wie Telefone oder Gadgets nützlich sein. Eine Rotationsanimation wird automatisch angewendet.</li><li>Schließlich haben Sie die Möglichkeit, ein Vorschaubild des 3D-Modells hochzuladen, das in den Thumbnails oder dem Galerie-Slider verwendet wird, wenn die Konfigurationsoption \"3D-Objekt im Medienslider anzeigen\" deaktiviert ist.</li></ul></p>","shortDescription":"Erwecken Sie Ihr Produkt mit dieser innovativen Erweiterung zum Leben. Ihre Kunden können endlich ein echtes Gefühl dafür bekommen, wie Ihre Produkte im wirklichen Leben aussehen.","highlights":"Geben Sie dem Kunden eine 360-Grad-Sicht auf das Produkt.\nSchaffen Sie ein unvergessliches Kundenerlebnis dass sie sich länger daran erinnern können\nEinfache Änderung der Produktpräsentation über unsere Debug-Vorschau-Funktion in der Administration.\nLassen Sie Kunden das Produkt wie im wirklichen Leben erleben, mit dem Einsatz von VR-Technologie.\nErhöhte Konversion Chancen aufgrund geringerer Unsicherheit bei den Kunden.","features":"Stellen Sie Ihr Produkt optional auf einen Ständer, um es wirklich hervorzuheben\nLassen Sie das Produkt auf dem Ständer rotieren, um eine dynamischere Interaktion zu schaffen\nVerwenden Sie die maßstabsgetreue Attrappe und die Größenmessung, um ein Gefühl für die Größe des Modells in der VR zu bekommen, ohne selbst hineinspringen zu müssen"},{"id":28093,"name":"3D-Models for products with VR/AR support","description":"<p>The first Virtual Reality product view plugin is here! You can now provide your customers with a full-on VR experience and have them become fully immersed in your products! As soon as one of your customers visits your store from a device that supports VR, they get the opportunity to dive into an experience like no other: the opportunity to view the product as if it is truly in front of them. Additionally, they can even walk around it to view it from different perspectives! Besides, providing such an experience helps the customer in getting a feel for the size of the product and discovering neat little details that they would otherwise have never discovered.</p><h3>Advantages</h3><strong>Living at the cutting edge of technology</strong><p>This is the first Shopware plugin that supports VR. Be sure to reap the benefit of this technology by offering an experience no other plugin provides your customers. Make customers see and experience your product as if they are actually there in front of them.</p><p><b>Increased conversions</b></p><p>Products often can only be experienced when they are in the customer’s hands, which can make them more hesitant and uncertain about whether they actually want the product. However, with the use of our VR plugin, they are able to see and examine the product right from their own home! This in turn leads to lower uncertainty and thus a higher chance of converting them.</p><p><b>A memorable customer experience</b></p><p>Experiencing a product as if it is really in front of you gives customers an experience that they will never have had before! Furthermore, it can cause a tendency from customers to talk to others about their experience, benefitting your brand even more. Thus, exploiting VR technology not only increases purchases, but can also be a cause for marketing for which one has not paid!</p><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the extension changed or improved, contact us via the Shopware support portal by selecting the extension or by sending a message to <b>support@diztech.nl</b>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process, it's best to provide as much information as possible or provide us with access to your test environment. This way, we can reproduce the issue for ourselves and come up with a solution quicker.</p><h3>About us</h3><p>At DizTech, we have established our reputation by prioritizing quality and speed. Our focus has been on developing over 50 high-quality Shopware 6 extensions, which you can find below, leading to our recognition as a Shopware Premium Extension Partner. We deeply value the importance of providing personal and fast support whenever you need it, and we draw inspiration from you, our valued customers. This approach enables us to create extensions that are tailored to your needs as well as the needs of your customers. To get to know us better, please visit our website at&nbsp;<a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<p><ul><li>Download the extension from the Community Store</li><li>Activate the extension in your Shopware 6 installation – this can be done via Extensions &gt; My Extensions &gt; Apps. Alternatively, you can use the \"Upload plugin\" button to upload the plugin ZIP file.</li><li>Navigate to a product in the administration and open the \"Specifications\" tab. Scroll down to custom fields and find the \"Mixed Reality Configuration\" set.</li><li>Within the \"Mixed Reality Configuration\" you find the \"3D object\" field. Upload a 3D virtual representation of your product here with the file type \".glb\".</li><li>The preview should now automatically render your model. If you don't see it, try playing with the scale value. We place a dummy model and a scale into the scene so you can better grasp what the scale will be like for the customer in VR. The scale value is a percentual value of the actual scale of the model, with a default of 20%. You can click the refresh icon in the top right of the preview to update the scale of the model.</li><li>We also offer the possibility to render a stand. This can be usefull for smaller models like phones or gadgets. A rotational animation will automatically get applied.</li><li>Finally, you have the option to upload a preview image of the 3D model which is used in thumbnails or the gallery slider if the \"Show 3D object in media slider\" configuration option is disabled.</li></ul></p><p><br></p>","shortDescription":"Make your product come to live with this cutting-edge extension. Your customers can finally get a real feel of how your products look in real life without leaving their homes.","highlights":"Give the customer a 360 view of the product.\nCreate a memorable customer experience that they may remember for a longer amount of time\nEasy modification of the presentation of the product using our debug preview function in the administration.\nLet customers experience the product in real life with the use of VR technology.\nIncreased conversion chances due to reduced uncertainty among customers.","features":"Optionally place your product on a stand to really make it stand out\nLet the product rotate on top of the stand to create a more dynamic interaction\nUsing the scale dummy and size measurement to get a feeling for the scale of the model in VR without having to actually jump in yourself"}],"addons":["ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":171553,"bookingKey":"zeobv79826216599","bookingText":"3D-Models for products with VR/AR support","price":190,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":171552,"bookingKey":"zeobv79826216599_M","bookingText":"3D-Models for products with VR/AR support","price":15,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXckl48","preview":true,"priority":0,"id":104589},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgOsqxj","preview":false,"priority":100,"id":104601},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpedUHqp","preview":false,"priority":90,"id":104588},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgUf9QL","preview":false,"priority":10,"id":101081},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9GDssw","preview":false,"priority":0,"id":101223}],"comments":[],"ratingAverage":0,"label":"3D-Modelle für Produkte mit VR/AR-Unterstützung","description":"<p>Das erste Virtual Reality Produktansichts-Plugin ist da! Sie können Ihren Kunden jetzt ein umfassendes VR-Erlebnis bieten und sie vollständig in Ihre Produkte eintauchen lassen! Sobald einer Ihrer Kunden Ihr Geschäft von einem Gerät aus besucht, das VR unterstützt, hat er die Möglichkeit, in ein unvergleichliches Erlebnis einzutauchen: die Möglichkeit, das Produkt so zu sehen, als ob es wirklich vor ihm wäre. Darüber hinaus können sie sogar um ihn herumgehen, um ihn aus verschiedenen Perspektiven zu betrachten! Außerdem hilft die Bereitstellung eines solchen Erlebnisses dem Kunden, ein Gefühl für die Größe des Produkts zu bekommen und nette kleine Details zu entdecken, die er sonst nie entdeckt hätte.</p><h3>Vorteile</h3><p><b>Leben auf dem neuesten Stand der Technik</b></p><p>Dies ist das erste Shopware-Plugin, das VR unterstützt. Stellen Sie sicher, dass Sie von dieser Technologie profitieren, indem Sie Ihren Kunden ein Erlebnis bieten, das kein anderes Plugin bietet. Sorgen Sie dafür, dass Kunden Ihr Produkt so sehen und erleben, als wären sie tatsächlich vor ihnen.</p><p><b>Erhöhte Conversions</b></p><p>Produkte werden oft erst in der Hand des Kunden erlebbar, was ihn zögerlicher und unsicherer machen kann, ob er das Produkt überhaupt haben möchte. Mit unserem VR-Plug-in können sie das Produkt jedoch direkt von zu Hause aus sehen und untersuchen! Dies wiederum führt zu einer geringeren Unsicherheit und damit zu einer höheren Konversionschance.</p><p><b>Ein unvergessliches Kundenerlebnis</b></p><p>Ein Produkt so zu erleben, als stünde es wirklich vor Ihnen, gibt Kunden ein Erlebnis, das sie noch nie zuvor hatten! Darüber hinaus kann es dazu führen, dass Kunden dazu neigen, mit anderen über ihre Erfahrungen zu sprechen, was Ihrer Marke noch mehr zugute kommt. Die Nutzung der VR-Technologie steigert also nicht nur die Käufe, sondern kann auch Anlass für unbezahltes Marketing sein!</p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Erweiterung ändern oder verbessern möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie die Erweiterung auswählen oder eine Nachricht an <b>support@diztech.nl</b> senden. Stellen Sie sicher, dass Sie Ihre aktuelle Shopware-Version und die Version des Plugins angeben, die Sie verwenden. Um den Support-Prozess zu beschleunigen, ist es am besten, so viele Informationen wie möglich bereitzustellen oder uns Zugriff auf Ihre Testumgebung zu gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Bei DizTech haben wir uns einen Namen gemacht, indem wir Qualität und Geschwindigkeit priorisieren. Unser Fokus lag darauf, über 50 hochwertige Shopware 6-Erweiterungen zu entwickeln, die Sie unten finden können, was uns als Shopware Premium Extension Partner anerkannt hat. Wir legen großen Wert darauf, Ihnen persönlichen und schnellen Support zu bieten, wann immer Sie ihn benötigen, und lassen uns von Ihnen, unseren geschätzten Kunden, inspirieren. Dieser Ansatz ermöglicht es uns, Erweiterungen zu erstellen, die auf Ihre Bedürfnisse sowie die Bedürfnisse Ihrer Kunden zugeschnitten sind. Um uns besser kennenzulernen, besuchen Sie bitte unsere Website unter <a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.diztech.nl</a>.</p>","installationManual":"<p></p><ul><li>Laden Sie die Erweiterung aus dem Community Store herunter</li><li>Aktivieren Sie die Erweiterung in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun. Alternativ können Sie auch die Schaltfläche \"Plugin hochladen\" verwenden, um die ZIP-Datei des Plugins hochzuladen.</li><li>Navigieren Sie zu einem Produkt in der Verwaltung und öffnen Sie die Registerkarte \"Spezifikationen\". Scrollen Sie nach unten zu den benutzerdefinierten Feldern und suchen Sie den Satz \"Mixed Reality Configuration\".</li><li>Innerhalb der \"Mixed Reality Configuration\" finden Sie das Feld \"3D-Objekt\". Laden Sie hier eine virtuelle 3D-Darstellung Ihres Produkts mit dem Dateityp \".glb\" hoch.</li><li>Die Vorschau sollte nun automatisch Ihr Modell rendern. Wenn Sie es nicht sehen, versuchen Sie, mit dem Skalierungswert zu spielen. Wir platzieren ein Dummy-Modell und einen Maßstab in die Szene, damit Sie sich besser vorstellen können, wie der Maßstab für den Kunden in VR aussehen wird. Der Maßstabswert ist ein prozentualer Wert des tatsächlichen Maßstabs des Modells, mit einer Voreinstellung von 20 %. Sie können auf das Aktualisierungssymbol oben rechts in der Vorschau klicken, um den Maßstab des Modells zu aktualisieren.</li><li>Wir bieten auch die Möglichkeit, einen Ständer zu rendern. Dies kann für kleinere Modelle wie Telefone oder Gadgets nützlich sein. Eine Rotationsanimation wird automatisch angewendet.</li><li>Schließlich haben Sie die Möglichkeit, ein Vorschaubild des 3D-Modells hochzuladen, das in den Thumbnails oder dem Galerie-Slider verwendet wird, wenn die Konfigurationsoption \"3D-Objekt im Medienslider anzeigen\" deaktiviert ist.</li></ul>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<p>-   Compatibility with Shopware 6.5 added</p><p><br /></p>","creationDate":{"date":"2023-04-18 15:11:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>-   Option zum Hinzufügen von AR-Medien speziell für AR-kompatible mobile Geräte hinzugefügt</p><p>-   Der Stil der Schaltfläche wurde überarbeitet, um sie optisch ansprechender zu gestalten.</p><p>-   Verbesserte Gerätekompatibilität</p>","creationDate":{"date":"2023-01-02 15:31:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First version for Shopware 6</p><p><br /></p>","creationDate":{"date":"2022-10-25 10:28:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv79826216599","redirectToStore":false,"lowestPriceValue":15}