{"id":16210,"name":"ZeobvQuotation","code":"zeobv91074772871","lastChange":{"date":"2023-07-19 16:25:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOierpY","examplePageUrl":"","moduleKey":"ZeobvQuotation","creationDate":{"date":"2022-11-18 10:14:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2022-12-08 13:13:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-07-19 16:25:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":28280,"name":"Angebotsanfrage  - Lassen Sie Ihre Kunden ein Angebot für Ihre Produkte anfordern","description":"<p>Suchen Sie nach einer Angebotserweiterung für Ihr Geschäft? Suchen Sie nicht weiter.&nbsp;</p><p>Mit dieser Erweiterung können Sie bestimmte Produkte so konfigurieren, dass sie Angebotsanfragen annehmen, die Sie als Shop-Betreiber dann über die Verwaltung bearbeiten können.</p><h3>Vorteile</h3><p><b>Geringe Auswirkungen</b></p><p>Diese Erweiterung nutzt die vorhandenen Shopware-Muster, um die Auswirkungen auf Ihren Shop so gering wie möglich zu halten.</p><p>Auf der Produktdetailseite erscheint eine Schaltfläche \"Angebot anfordern\", über die der Kunde das Produkt im Off-Canvas-Warenkorb zu seiner Angebotsliste hinzufügen kann.</p><p>Die Angebote werden dann in einer Übersicht im Bestellbereich der Verwaltung gesammelt.</p><p><b>Einfaches Umwandeln von Angeboten in Bestellungen</b></p><p>Mit dem Wechsel eines Status wird das Angebot in eine Bestellung umgewandelt und kann in Ihrer Verwaltung weiter bearbeitet werden.</p><p><b>Flow Builder kompatibel</b></p><p>Konfigurieren Sie einen Flow-Builder-Flow, um einem Kunden automatisch mitzuteilen, dass sein Angebot bearbeitet wurde.</p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Kaufabwicklung geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin Angebot anfordern auswählen oder eine Nachricht an plugins@zeo.nl senden. Geben Sie dabei unbedingt Ihre aktuelle Shopware-Version und die Version des von Ihnen verwendeten Plugins an. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter https://www.zeo.nl/.</p>","installationManual":"<h3>Starten Sie mit dem Zeo Quotation Plugin:</h3><p>Installieren und aktivieren Sie das Plugin in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun.</p><p>Standardmäßig kann ein Produkt nicht angeboten werden, daher müssen Sie Ihre Produkte zunächst so konfigurieren, dass sie angeboten werden können.</p><p>Anschließend kann ein Kunde ein Angebot für die konfigurierten Produkte anfordern und das Angebot wird in der Verwaltungsübersicht hinzugefügt, wo Sie es abschließen können.</p><h4>Produkt konfigurieren</h4><p>Um ein Produkt angebotsfähig zu machen, müssen Sie das benutzerdefinierte Feld für dieses Produkt konfigurieren. Sie finden den Abschnitt \"Benutzerdefinierte Felder\" unter der Registerkarte \"Spezifikationen\" auf der Produktdetailseite. Dort finden Sie das benutzerdefinierte Feld \"Angebot\" und können das Feld \"Angebotsanfrage verfügbar\" aktivieren oder deaktivieren.</p><h4>Angebot für Produkt(e) anfordern</h4><p>Nachdem Sie ein Produkt so konfiguriert haben, dass es quotiert werden kann, können Sie ein Angebot für dieses Produkt anfordern. In der Buybox auf der PDP gibt es eine Schaltfläche \"Angebot anfordern\". Wenn Sie auf diese Schaltfläche klicken, wird das Produkt zu Ihrem Angebot hinzugefügt.</p><p>Nachdem Sie auf die Schaltfläche geklickt haben, öffnet sich der Offcanvas und zeigt Ihr Angebot unterhalb Ihres Warenkorbs an. Klicken Sie nun auf die Schaltfläche \"Zum Angebot\".</p><p>Dadurch gelangen Sie auf die Angebotsübersichtsseite. Hier sieht der Kunde alle Produkte, die in seinem Angebot enthalten sind, und er kann jedes Produkt einzeln kommentieren.</p><p>Produkt einzeln kommentieren. Nachdem dies geschehen ist, können Sie auf die Schaltfläche \"Angebot anfordern\" klicken. Sie sollten nun eine Erfolgsmeldung sehen, dass Ihr Angebot erfolgreich erstellt wurde.</p><h4>Angebote in der Verwaltung anzeigen</h4><p>Wenn Sie sich in der Verwaltung anmelden, finden Sie unterhalb des Menüs \"Bestellung\" den Link zum Menü \"Angebote\". Klicken Sie darauf, um die Angebotsübersichtsseite zu öffnen.</p><p>In der Verwaltungsübersicht können Sie alle verfügbaren Angebote sehen. In dieser Übersicht sehen Sie für jedes Angebot die Angebotsnummer, den Kunden, den Vertriebskanal und den Angebotsstatus.</p><p>Klicken Sie auf die Angebotsnummer oder auf die 3 Punkte am Ende einer Zeile, um die Angebotsdetailseite zu öffnen.</p><h4>Angebote im Adminbereich verwalten</h4><p>Bei der Verwaltung der Angebote sind 2 Dinge wichtig. Erstens müssen Sie die richtigen Preise konfigurieren. Dies können Sie ganz einfach über die Schaltfläche \"Bearbeiten\" oben rechts auf der Angebotsseite tun. Scrollen Sie dann nach unten zur Artikelübersicht. Hier können Sie die Standardpreise bearbeiten, Werbeaktionen hinzufügen, Produkte oder benutzerdefinierte Artikel hinzufügen und sogar die Lieferkosten konfigurieren (klicken Sie einfach auf die Versandkosten). Um eine bestimmte Eigenschaft zu bearbeiten, doppelklicken Sie einfach Doppelklick auf die Eigenschaft in der Tabelle. Wenn Sie fertig sind, klicken Sie einfach auf die Schaltfläche \"Speichern\" oben rechts.</p><p>Nachdem Sie die Preise konfiguriert haben, können Sie das Angebot fertigstellen. Wenn Sie zurück zum Anfang der Seite scrollen, können Sie den Angebotsstatus konfigurieren.</p><p>Wenn Sie diesen auf \"Endgültig\" setzen, wird das Angebot abgeschlossen und Sie können den Kunden benachrichtigen.</p><h4>Automatische Benachrichtigung des Kunden konfigurieren (optional)</h4><p>Wenn Sie dem Kunden eine E-Mail senden möchten, wenn das Angebot als endgültig markiert wird, und Shopware für diese Art der E-Mail-Kommunikation verantwortlich sein soll, können Sie dies im Flow Builder konfigurieren. Die aktuelle Angebotsverwaltung ist vollständig mit dem Shopware Flow Builder kompatibel. Bevor Sie einen Ablauf hinzufügen, müssen Sie zunächst eine E-Mail-Vorlage erstellen. Um einen Flow hinzuzufügen, gehen Sie einfach zum Flow Builder (Einstellungen &gt; Flow Builder) und klicken Sie auf die Schaltfläche \"Flow hinzufügen\" oben rechts. Geben Sie Ihrem Fluss einen Namen, den Sie frei wählen können.</p><p>Öffnen Sie dann die Registerkarte \"Ablauf\", um den Auslöser und die Aktionen (und optional alle Bedingungen) zu konfigurieren. Wählen Sie nun den Auslöser \"Status eingeben &gt; Angebot &gt; Status &gt; Endgültig\".</p><p>Nun können Sie dem Ablauf beliebige Aktionen hinzufügen. Sie können die Aktion \"E-Mail senden\" hinzufügen, um dem Kunden eine E-Mail zu senden.</p>","shortDescription":"Fügen Sie Ihrem Shop eine Funktion zum Anfordern eines Angebots hinzu und lassen Sie Ihre Kunden ein Angebot für Ihre Produkte anfordern. Testen Sie es jetzt 1 Monat lang kostenlos","highlights":"Schaltfläche \"Angebot anfordern\" auf Produktdetailseiten\nBieten Sie dem Kunden einen letzten Überblick, bevor er sein Angebot abgibt\nInklusive Verwaltung des Angebotsstatus\nKonvertieren Sie Angebote in Bestellungen mit einem Mausklick\nAngebote sind vollständig über die Verwaltung editierbar","features":""},{"id":28281,"name":"Request a quote - Let your customers request a quote for your products","description":"<p>Looking for a quotation extension for your store? Look no further.&nbsp;</p><p>With this extension you can configure specific products to accept quotation requests, which you, as a store owner, can then process via the administration.</p><h3><b>Advantages</b></h3><p><b>Low impact</b></p><p>This extension makes use of existing Shopware patterns keeping the impact on your shop as low as possible.</p><p>A \"Request a quote\" button will appear on the product detail page allowing the customer to add the product to his quote list in the offcanvas cart.</p><p>Quotes are then collected in an overview in the order section of the Administration.</p><p><b>Easily convert quotes into orders</b></p><p>With the switch of a state the quote is converted into an order and can be further processed in your administration.</p><p><b>Flow builder compatible</b></p><p>Configure a flow builder flow to automatically notify a customer his quote has been processed.</p><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the extension changed or improved, contact us via the Shopware support portal by selecting the extension or by sending a message to <b>support@diztech.nl</b>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process, it's best to provide as much information as possible or provide us with access to your test environment. This way, we can reproduce the issue for ourselves and come up with a solution quicker.</p><h3>About us</h3><p>At DizTech, we have established our reputation by prioritizing quality and speed. Our focus has been on developing over 50 high-quality Shopware 6 extensions, which you can find below, leading to our recognition as a Shopware Premium Extension Partner. We deeply value the importance of providing personal and fast support whenever you need it, and we draw inspiration from you, our valued customers. This approach enables us to create extensions that are tailored to your needs as well as the needs of your customers. To get to know us better, please visit our website at&nbsp;<a href=\"https://www.diztech.nl\" target=\"_blank\" rel=\"noreferrer\">https://www.diztech.nl</a>.</p>","installationManual":"<h3>Get started with the Zeo Quotation Plugin:</h3><p>Install and activate the plugin in your Shopware 6 installation – this can be done via Extensions &gt; My Extensions &gt; Apps.</p><p>By default, a product cannot be quoted so you first have to configure your products to be able to be quoted.</p><p>Next a customer can request a quotation for the configured products and the quotation will be added in the admin overview where you can finalize it.</p><h4>Configure a product</h4><p>To make a product quoteable, you have to configure the custom field for it. You can find the custom fields section under the \"Specifications\" tab in the product detail page. There you can find yourself the \"Quotation\" custom field set and check or uncheck the \"Quotation request available\" field.</p><h4>Request quotation for product(s)</h4><p>After you have configured a product to be quoteable, you can request a quotation for it. In the buybox on the PDP there will be a \"Request quotation\" button. Click on this button and the product will be added to your quote.</p><p>After clicking the button, the offcanvas will open, showing your quote underneath your shopping cart. Now click the \"Go to quotation\" button.</p><p>This will take you to the quotation overview page. Here the customer can see all the products that are in his quote and he can comment on every</p><p>product individually. After that's been done, you can click the \"Request quotation\" button. Now you should see a success message showing your quotation is created successfully.</p><h4>View quotations in admin</h4><p>If you log into the admin, underneath the \"Order\" menu you will find the link to the \"Quotations\" menu. Click on it to open the quotation overview page.</p><p>In the admin overview you can see all the quotations that are available. You can see the quote number, customer, the sales channel and the quotation state for each quotation in this overview.</p><p>Click on the quotation number or the 3 dots at the end of a line to open the quotation detail page.</p><h4>Manage quotations in admin</h4><p>Regarding managing the quotations, 2 things are important. First, you have to configure the correct prices. You easily do that by pressing the \"Edit\" button at the top right of the quotation detail page. Then scroll down to the items overview. Here you can edit the default prices, add promotions, add products or custom items and you could even configure the delivery costs (just click on the shipping costs). To edit a specific property, just double click it in the table. After you're finished, just hit the save button on the top right.</p><p>After you have configured the prices, you can finalize the quotation. If you scroll back to the top of the page, you can configure the quotation status.</p><p>If you set this to \"Definitive\", the quotation will be finalized and you can notify the customer.</p><h4>Configure automatic notifications for the customer (optional)</h4><p>If you want to send the customer an email when the quotation is marked as definitive and Shopware will be responsible for this kind of email communication, you can configure this in the flow builder. The current quotation management is fully compatible with the Shopware flow builder. Before you add a flow, you first have to create an email template. To add a flow, just go to the flow builder (Settings &gt; Flow Builder) and click the \"Add flow\" button on the top right. Now name your flow to however you like.</p><p>Next, open the \"Flow\" tab to configure the trigger and the actions (and optionally any conditions). Now, select the \"State Enter &gt; Quotation &gt; State &gt; Definitive\" trigger.</p><p>Now you can add whatever actions you want to the flow. You can add the \"Send email\" action to email the customer.</p>","shortDescription":"Add a request a quote feature to your store and let your customers request a quote for your products. Quote management and conversion of quotes into orders.","highlights":"Request a quote button on product detail pages\nProvide the customer a final overview before submitting his quote\nQuote state management included\nConvert quotes to orders with the click of a button\nQuotes are fully editable via the Administration","features":""}],"addons":["ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":171547,"bookingKey":"zeobv91074772871","bookingText":"Request a quote - Let your customers request a quote for your products","price":450,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":171545,"bookingKey":"zeobv91074772871_M","bookingText":"Request a quote - Let your customers request a quote for your products","price":39,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":171546,"bookingKey":"zeobv91074772871_M12","bookingText":"Request a quote - Let your customers request a quote for your products","price":439.99,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDegCCP","preview":true,"priority":0,"id":102029},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjtzh23","preview":false,"priority":0,"id":102026},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpD4UTKM","preview":false,"priority":0,"id":102027},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplESO0t","preview":false,"priority":0,"id":102028},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpv9wLr6","preview":false,"priority":0,"id":102030},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNGAL3D","preview":false,"priority":0,"id":102031},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvCPokO","preview":false,"priority":0,"id":102032}],"comments":[],"ratingAverage":0,"label":"Angebotsanfrage  - Lassen Sie Ihre Kunden ein Angebot für Ihre Produkte anfordern","description":"<p>Suchen Sie nach einer Angebotserweiterung für Ihr Geschäft? Suchen Sie nicht weiter. </p><p>Mit dieser Erweiterung können Sie bestimmte Produkte so konfigurieren, dass sie Angebotsanfragen annehmen, die Sie als Shop-Betreiber dann über die Verwaltung bearbeiten können.</p><h3>Vorteile</h3><p><b>Geringe Auswirkungen</b></p><p>Diese Erweiterung nutzt die vorhandenen Shopware-Muster, um die Auswirkungen auf Ihren Shop so gering wie möglich zu halten.</p><p>Auf der Produktdetailseite erscheint eine Schaltfläche \"Angebot anfordern\", über die der Kunde das Produkt im Off-Canvas-Warenkorb zu seiner Angebotsliste hinzufügen kann.</p><p>Die Angebote werden dann in einer Übersicht im Bestellbereich der Verwaltung gesammelt.</p><p><b>Einfaches Umwandeln von Angeboten in Bestellungen</b></p><p>Mit dem Wechsel eines Status wird das Angebot in eine Bestellung umgewandelt und kann in Ihrer Verwaltung weiter bearbeitet werden.</p><p><b>Flow Builder kompatibel</b></p><p>Konfigurieren Sie einen Flow-Builder-Flow, um einem Kunden automatisch mitzuteilen, dass sein Angebot bearbeitet wurde.</p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt der Kaufabwicklung geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Supportportal, indem Sie das Plugin Angebot anfordern auswählen oder eine Nachricht an plugins@zeo.nl senden. Geben Sie dabei unbedingt Ihre aktuelle Shopware-Version und die Version des von Ihnen verwendeten Plugins an. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter https://www.zeo.nl/.</p>","installationManual":"<h3>Starten Sie mit dem Zeo Quotation Plugin:</h3><p>Installieren und aktivieren Sie das Plugin in Ihrer Shopware 6-Installation - dies können Sie über Erweiterungen &gt; Meine Erweiterungen &gt; Apps tun.</p><p>Standardmäßig kann ein Produkt nicht angeboten werden, daher müssen Sie Ihre Produkte zunächst so konfigurieren, dass sie angeboten werden können.</p><p>Anschließend kann ein Kunde ein Angebot für die konfigurierten Produkte anfordern und das Angebot wird in der Verwaltungsübersicht hinzugefügt, wo Sie es abschließen können.</p><h4>Produkt konfigurieren</h4><p>Um ein Produkt angebotsfähig zu machen, müssen Sie das benutzerdefinierte Feld für dieses Produkt konfigurieren. Sie finden den Abschnitt \"Benutzerdefinierte Felder\" unter der Registerkarte \"Spezifikationen\" auf der Produktdetailseite. Dort finden Sie das benutzerdefinierte Feld \"Angebot\" und können das Feld \"Angebotsanfrage verfügbar\" aktivieren oder deaktivieren.</p><h4>Angebot für Produkt(e) anfordern</h4><p>Nachdem Sie ein Produkt so konfiguriert haben, dass es quotiert werden kann, können Sie ein Angebot für dieses Produkt anfordern. In der Buybox auf der PDP gibt es eine Schaltfläche \"Angebot anfordern\". Wenn Sie auf diese Schaltfläche klicken, wird das Produkt zu Ihrem Angebot hinzugefügt.</p><p>Nachdem Sie auf die Schaltfläche geklickt haben, öffnet sich der Offcanvas und zeigt Ihr Angebot unterhalb Ihres Warenkorbs an. Klicken Sie nun auf die Schaltfläche \"Zum Angebot\".</p><p>Dadurch gelangen Sie auf die Angebotsübersichtsseite. Hier sieht der Kunde alle Produkte, die in seinem Angebot enthalten sind, und er kann jedes Produkt einzeln kommentieren.</p><p>Produkt einzeln kommentieren. Nachdem dies geschehen ist, können Sie auf die Schaltfläche \"Angebot anfordern\" klicken. Sie sollten nun eine Erfolgsmeldung sehen, dass Ihr Angebot erfolgreich erstellt wurde.</p><h4>Angebote in der Verwaltung anzeigen</h4><p>Wenn Sie sich in der Verwaltung anmelden, finden Sie unterhalb des Menüs \"Bestellung\" den Link zum Menü \"Angebote\". Klicken Sie darauf, um die Angebotsübersichtsseite zu öffnen.</p><p>In der Verwaltungsübersicht können Sie alle verfügbaren Angebote sehen. In dieser Übersicht sehen Sie für jedes Angebot die Angebotsnummer, den Kunden, den Vertriebskanal und den Angebotsstatus.</p><p>Klicken Sie auf die Angebotsnummer oder auf die 3 Punkte am Ende einer Zeile, um die Angebotsdetailseite zu öffnen.</p><h4>Angebote im Adminbereich verwalten</h4><p>Bei der Verwaltung der Angebote sind 2 Dinge wichtig. Erstens müssen Sie die richtigen Preise konfigurieren. Dies können Sie ganz einfach über die Schaltfläche \"Bearbeiten\" oben rechts auf der Angebotsseite tun. Scrollen Sie dann nach unten zur Artikelübersicht. Hier können Sie die Standardpreise bearbeiten, Werbeaktionen hinzufügen, Produkte oder benutzerdefinierte Artikel hinzufügen und sogar die Lieferkosten konfigurieren (klicken Sie einfach auf die Versandkosten). Um eine bestimmte Eigenschaft zu bearbeiten, doppelklicken Sie einfach Doppelklick auf die Eigenschaft in der Tabelle. Wenn Sie fertig sind, klicken Sie einfach auf die Schaltfläche \"Speichern\" oben rechts.</p><p>Nachdem Sie die Preise konfiguriert haben, können Sie das Angebot fertigstellen. Wenn Sie zurück zum Anfang der Seite scrollen, können Sie den Angebotsstatus konfigurieren.</p><p>Wenn Sie diesen auf \"Endgültig\" setzen, wird das Angebot abgeschlossen und Sie können den Kunden benachrichtigen.</p><h4>Automatische Benachrichtigung des Kunden konfigurieren (optional)</h4><p>Wenn Sie dem Kunden eine E-Mail senden möchten, wenn das Angebot als endgültig markiert wird, und Shopware für diese Art der E-Mail-Kommunikation verantwortlich sein soll, können Sie dies im Flow Builder konfigurieren. Die aktuelle Angebotsverwaltung ist vollständig mit dem Shopware Flow Builder kompatibel. Bevor Sie einen Ablauf hinzufügen, müssen Sie zunächst eine E-Mail-Vorlage erstellen. Um einen Flow hinzuzufügen, gehen Sie einfach zum Flow Builder (Einstellungen &gt; Flow Builder) und klicken Sie auf die Schaltfläche \"Flow hinzufügen\" oben rechts. Geben Sie Ihrem Fluss einen Namen, den Sie frei wählen können.</p><p>Öffnen Sie dann die Registerkarte \"Ablauf\", um den Auslöser und die Aktionen (und optional alle Bedingungen) zu konfigurieren. Wählen Sie nun den Auslöser \"Status eingeben &gt; Angebot &gt; Status &gt; Endgültig\".</p><p>Nun können Sie dem Ablauf beliebige Aktionen hinzufügen. Sie können die Aktion \"E-Mail senden\" hinzufügen, um dem Kunden eine E-Mail zu senden.</p>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<p>-   Introduced compatibility for Shopware 6.5.0</p><p><br /></p>","creationDate":{"date":"2023-04-18 14:05:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>-   Added quotation confirmation email</p><p>-   Added variant selection in quotation popup</p><p>-   Fixed bug in variant configurator for quote selection</p><p>-   Handled bug in cart to order conversion if cart error was present</p><p><br /></p>","creationDate":{"date":"2022-12-22 09:42:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>-   Added prevention for sending of order confirmation email on quotation creation</p><p><br /></p>","creationDate":{"date":"2022-12-19 08:32:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>-   First version of the plugin for Shopware 6</p><p><br /></p>","creationDate":{"date":"2022-11-18 10:46:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv91074772871","redirectToStore":true,"lowestPriceValue":39}