{"id":16318,"name":"GooddayCleanWidgets","code":"goodd76242689498","lastChange":{"date":"2023-07-11 09:35:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBprXcR","examplePageUrl":"","moduleKey":"GooddayCleanWidgets","creationDate":{"date":"2022-12-09 10:41:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2023-01-18 16:35:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-26 13:21:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1213,"prefix":"goodday","name":"goodday","website":"//goodday4u.com","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod1213_Goodday+logo128.png"},"infos":[{"id":28474,"name":"Clean Widgets | GoodDay","description":"<h2>Clean Widgets | GoodDay</h2><p>Willkommen bei Goodday Clean Widgets, einem leistungsstarken Plugin, das entwickelt wurde, um Ihr Shopware-Erlebnis zu verbessern. Mit unserer Vielzahl einzigartiger Elemente können Sie atemberaubende und fesselnde Landingpages, Shopseiten und Kategorie Layouts erstellen.</p><p>Vergleichen Sie Produkte, präsentieren Sie sie mit wunderschönen Galerien, zeigen Sie Empfehlungen und Bewertungen von Plattformen außerhalb von Shopware. Zeigen Sie Produktgruppen an beliebigen Stellen und erstellen Sie visuell ansprechende Präsentationen, die es Kunden ermöglichen, Ihr Angebot vollständig zu erkunden.</p><p>Beschränken Sie Ihre Kreativität nicht - entfesseln Sie sie mit Goodday Clean Widgets und bringen Sie Ihren Shopware-Shop auf die nächste Stufe.</p><p></p><h3>Zitat-Slider:</h3>ermöglicht die Präsentation von Zitaten zusammen mit der Unterschrift des Autors und erstellt eine dynamische, scrollbare Galerie von Aussagen. Mit dieser Funktion können Kundenbewertungen oder kurze, ermutigende Slogans in Form eines Sliders eingebunden werden.<p></p><p>Betonen Sie die Einzigartigkeit der Produkte, indem Sie einen solchen Slider auf der Produktseite platzieren.</p><h3>Galerie-Slider:</h3>ermöglicht es Benutzern, eine Sammlung von Bildern auf dynamische und interaktive Weise anzusehen. Er ermöglicht ein reibungsloses Scrollen oder Navigieren durch verschiedene visuelle Elemente und bietet ein ansprechendes Browsing-Erlebnis.<p></p><p>Verwenden Sie ihn, um verschiedene Farbvarianten Ihres Produkts, Fotogalerien oder sogar eine visuelle Darstellung des schrittweisen Kaufprozesses zu präsentieren.</p><p>Ein Button mit einem Link und Text ermöglicht es Ihnen, den Kunden an den richtigen Ort im Shop zu führen.</p><p></p><h3>Mauerwerk Galerie:</h3>ermöglicht die Hinzufügung und Präsentation von Fotos in einem ästhetischen, unregelmäßigen Galerie Format, das an eine Backsteinmauer erinnert. Mit einem zusätzlichen Button, der es Ihnen ermöglicht, weitere Bilder zu laden.<p></p><p>Verwenden Sie das Widget, um Produktgalerien oder Markenlogos zu erstellen.</p><p></p><h3>Bewertung Slider:</h3>präsentiert Bewertungen in Form von dynamischen Folien und ermöglicht die Hinzufügung von Fotos, Beschreibungen und Autoren Unterschriften. Seine Attraktivität liegt in der Möglichkeit, Elemente wie die Übergangszeit zwischen den Folien, Farben und die Art des Scrollens (Pfeile, Punkte) anzupassen.<p></p><p>Verwenden Sie das Widget auf der Produktseite, um zusätzliche positive Kundenbewertungen von Plattformen außerhalb von Shopware anzuzeigen. Platzieren Sie es auf der Startseite und wählen Sie die Bewertungen aus, die das größte Interesse potenzieller Kunden wecken.</p><p></p><h3>Produkt Raster:</h3>ermöglicht es Ihnen, bestimmte Produkte an verschiedenen Stellen auf Ihrer Website zu präsentieren. Sie können Produkte manuell zuweisen oder dynamische Gruppen erstellen, um festzulegen, welche Artikel angezeigt werden. Wenn ein Kunde auf ein Produkt klickt, öffnet sich ein Schiebe-Modal, das es ihm ermöglicht, einfach durch verschiedene Produktoptionen zu blättern und das ausgewählte Produkt zum Warenkorb hinzuzufügen. Das Erscheinungsbild des Produkts Rasters kann mit den verfügbaren Einstellungen an Ihre Vorlieben angepasst werden.<p></p><p>Verwenden Sie es, um Ihre attraktivsten Produkte zu bewerben, fügen Sie ein Widget auf Ihrer Startseite oder in der Kategorieliste hinzu.</p><p></p><h3>Reißverschluss:</h3>erleichtert die Präsentation und den Vergleich von zwei Bildern oder Texten. Mit einem zentral positionierten Slider können Benutzer den Inhalt nach links oder rechts schieben, um das Bild oder den Text aufzudecken oder zu verbergen.<p></p><p>Verwenden Sie diese Funktion, um zwei Produkte zu vergleichen und effektiv zwei unterschiedliche Eigenschaften jedes Produkts zu präsentieren.</p><h4>Kostenlose Updates:</h4><p>Um sicherzustellen, dass Sie immer über die neuesten Funktionen und Sicherheitsverbesserungen verfügen, bieten wir kostenlose Updates für dieses Plugin an. Bleiben Sie auf dem neuesten Stand der Entwicklungen und genießen Sie ein optimiertes Erlebnis.</p><h4>Blicken Sie in die Zukunft!</h4><p>Machen Sie sich mit den neuen Funktionen vertraut, die in Kürze eingeführt werden:</p><p><i>Karussell - Slider</i> - Er ermöglicht es Ihnen, Fotos in Form eines Karussells hinzuzufügen, mit der Option des automatischen Scrollens und animierten Effekten.</p><p><i>Pro Media Slider</i> - Ein hochentwickelter Slider, mit dem Sie mehrere Folien hinzufügen können, von denen jede verschiedene Arten von Daten enthält. Sie haben die Möglichkeit, aus Bildern, Videos vom Server, YouTube-Videos sowie einem einfarbigen Hintergrund zu wählen. Darüber hinaus haben Sie die Freiheit zu entscheiden, ob die Texte auf dem Element selbst (z. B. Bild oder Video) oder darunter in der mobilen Version angezeigt werden sollen. Die Möglichkeit, Schriftgrößen und -farben zu manipulieren, wird ein zusätzlicher Vorteil sein.<br></p><p>Wenn Sie Ideen haben, um unser Plugin weiter zu verbessern, würden wir gerne Ihre Vorschläge hören. Bitte zögern Sie nicht, sie mit uns zu teilen:&nbsp;<a href=\"https://goodday4u.com/contact/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://goodday4u.com/contact/</a></p><h3><b style=\"font-family: var(--sw-font-family); color: var(--sw-headline);\">24/7&nbsp;</b>&nbsp;<b>Engagierter &amp; Freundlicher Support:</b></h3><p>Wir bieten rund um die Uhr Unterstützung durch ein engagiertes und freundliches Team, das Ihnen immer gerne hilft. Wir bieten auch Anpassungsoptionen, um Ihre einzigartigen Markenanforderungen zu erfüllen.</p><p><b>E-Mail:</b><br><i>hello@goodday4u.pl<br></i><br><b>Wir freuen uns auf Ihr Feedback!</b><br></p><p><br></p>","installationManual":"<p>Installieren Sie das Plugin und aktivieren Sie es.</p><p>Gehen Sie dann zu Inhalte -&gt; Shopware Experience -&gt; Wenn Sie ein neues Layout erstellen möchten, wählen Sie aus Shopseite, Landingpage, Listen-Seite, Produktseite oder wählen Sie ein Layout aus der Liste aus, auf dem Sie Änderungen vornehmen oder ein neues Element hinzufügen möchten.</p><p>Wenn Sie ein neues Layout auswählen, klicken Sie auf \"Neues Layout erstellen\" und geben Sie ihm einen passenden Namen.</p><p>Fügen Sie dann einen Block aus der Block-Kategorieliste hinzu: Wählen Sie Universal Clean Widgets.</p><p>Sie haben folgende Optionen zur Auswahl:</p><p></p><ul><li>Zitat Slider</li><li>Galerie Slider</li><li>Mauerwerk Galerie</li><li>Bewertung Slider</li><li>Produkt Raster</li><li>Zipper-Widget</li></ul><p></p><p>Nachdem Sie jeden Block hinzugefügt und entsprechend konfiguriert haben, klicken Sie auf \"Speichern\" und bewundern Sie den neuen atemberaubenden Look Ihrer Website!</p>\n","shortDescription":"GooddayCleanWidgets ist eine Sammlung von  Erlebniswelten (\"Shopping Experiences\") -Elementen, die eine kreative Gestaltung von Landing Pages, Shop-Seiten und Kategorie-Layouts ermöglic","highlights":"Möglichkeit zur Erstellung personalisierter Layouts für Landingpages, Shopseiten und Kategorieseiten im Bereich Shopware-Erfahrung.\nEnthält nicht standardmäßige Elemente für verbesserte Einkaufserlebnisse, wie z.B. Reißverschluss, Galerie Slider, Mauerwerks Galerie, Bewertung Slider, Zitat Slider, Produkt Raster.\nZeigen Sie Kundenbewertungen und Zitate mit Optionen für automatisches Bildlauf, Hintergrundfarbe und Schriftanpassung.\nPräsentieren Sie Bilder und Produkte auf interessante Weise, die den Kunden dazu ermutigt, weitere Schritte zu unternehmen.","features":"Nicht standardmäßige Elemente für Einkaufserlebnisse.\nErmöglicht Ihnen, Ihre Produkte und Fotos auf moderne, interessante Weise zu präsentieren.\nErmöglicht Benutzern die Erstellung einzigartiger und personalisierter Layouts für Landingpages, Shopseiten und Kategorieseiten.\nGalerie-Slider - präsentieren Sie Ihre Produkte und Bilder auf fesselnde und ansprechende Weise und leiten Sie Kunden zum richtigen Ziel.\nZitat-Slider, Bewertung-Slider - präsentieren Sie Kundenmeinungen, Zitate, Aussagen und Empfehlungen. Beschreiben Sie Ihre Produkte und fügen Sie mit diesem vielseitigen Widget Mehrwert hinzu.\nProdukt Raster - zeigen Sie Ihre Produkte in einem optisch ansprechenden Rasterformat an, wo immer Sie möchten.\nMauerwerk Galerie - erstellen Sie atemberaubende Galerien mit Ihren Fotos und steigern Sie die visuelle Attraktivität Ihrer Website.\nReißverschluss - vergleichen Sie zwei Fotos oder ändern Sie nahtlos den Text mithilfe des Sliders und bieten Sie interaktiven und dynamischen Inhalt."},{"id":28475,"name":"Clean Widgets | GoodDay","description":"<h2>Clean Widgets | GoodDay</h2>Welcome to Goodday Clean Widgets, a powerful plugin designed to enhance your Shopware experience. With our wide range of unique elements, you can create stunning and captivating landing pages, store pages, and category layouts.<p></p><p>Compare products, showcase them with beautiful galleries, present recommendations and reviews from platforms beyond Shopware. Display product groups anywhere you desire, and create visually engaging presentations that allow customers to fully explore your offerings.</p><p>Don't restrict your creativity - unleash it with Goodday Clean Widgets and take your Shopware store to the next level.</p><p></p><h3><b>Quotation Slider:</b></h3>allows for the presentation of quotes along with the author's caption, creating a dynamic, scrollable gallery of statements. This feature can be used to incorporate customer reviews or short, encouraging slogans in the form of a slider.<p></p><p>Emphasize the uniqueness of products by adding such a slider on the product detail page..</p><p></p><h3><b>Gallery slider:</b></h3>allows users to view a collection of images in a dynamic and interactive manner. It enables smooth scrolling or navigation through various visuals, providing an engaging browsing experience.<p></p><p>Use it to present different color variants of your product, photo gallery,&nbsp; or even a visual representation of the step-by-step purchasing process.</p><p>Button with a link and text will allow you to direct the customer to the right place in the shop</p><p></p><h3><b>Masonry Gallery</b>&nbsp;:</h3>allows for the addition and presentation of photos in an aesthetic, irregular gallery format reminiscent of a brick wall.With an additional button that allows you to load more images.<p></p><p>Use the widget to create product galleries or brand logos</p><p></p><h3><b>Review Slider:</b></h3>presents reviews in the form of dynamic slides, allowing for the addition of photos, descriptions, and author captions. Its attractiveness lies in the ability to customize elements such as slide transition time, colors, and scrolling method (arrows, dots).<p></p><p>Use the widget on the product page to display additional positive customer reviews from platforms other than Shopware. Place it on the homepage and select those reviews that will attract the most attention from potential customers.</p><h3><b>Product Grid:</b></h3><p>allows you to showcase specific products in various locations on your website. You can manually assign products or create dynamic groups to determine which items are displayed. When a customer clicks on a product, a slider modal opens, allowing them to easily browse through different product options and add their chosen item to the cart. The appearance of the product grid can be customized to suit your preferences using the available settings.</p><p>Use it to promote your most attractive products, add a widget to your homepage or category list.</p><h3><b>Zipper:</b></h3><p>facilitates the presentation and comparison of two images or sets of texts. With a centrally positioned slider, users can slide the content left or right, revealing or hiding the image or text.</p><p>Use this feature to compare two products and effectively showcase two different properties of each product.</p><h4><b>Free Updates:</b></h4><p>To ensure that you always have the latest features and security enhancements, we provide free updates for this plugin. Stay up-to-date with the latest developments and enjoy an optimized experience.</p><h4><b>Look into the future!</b></h4><p>Familiarize yourself with the new features that will be introduced soon:</p><p><i>Carousel slider</i>&nbsp; - It will allow you to add photos in the form of a carousel with the option of automatic scrolling and animated effects.</p><p><i>Pro media slider</i>&nbsp; - A highly advanced slider that allows you to add multiple slides, each containing different types of data. You have the option to choose from: images, videos from a server, YouTube videos, as well as a solid color background.&nbsp; Additionally, you have the freedom to decide whether the texts will be displayed on the element itself (e.g., image or video) or below them on the mobile version. The ability to manipulate font sizes and colors will be an additional advantage.<br><br>If you have any ideas for further enhancing our plugin, we would love to hear your suggestions. Please feel free to share them with us:&nbsp;<a href=\"https://goodday4u.com/contact/\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://goodday4u.com/contact/</a><br></p><h3><b style=\"font-family: var(--sw-font-family); color: var(--sw-headline);\">24/7 Dedicated &amp; Friendly Support</b></h3><p>We offer 24/7 support with a dedicated and friendly team who are always willing to assist you, including customization options to align with your unique branding requirements.</p><p><b>E-Mail:</b><br><i>hello@goodday4u.pl<br></i><br><b>We look forward to your feedback!</b><br></p><p><br></p><p></p>","installationManual":"<p>Install and activate the plugin.&nbsp;&nbsp;</p><p>Then go to Content -&gt; Shopware Experience -&gt; If you want to create a new layout, choose from shop page, landing page, listing page, product page, or select a layout from the list on which you want to make changes or add a new element.</p><p>If you choose a new one, click on \"create new layout\" and give it an appropriate name.</p><p>Then add a block from the block category list: choose Universal Clean Widgets.</p><p>You will have the following options to choose from:</p><p><ul><li>Quotation slider</li><li>Gallery slider</li><li>Masonry gallery</li><li>Review slider</li><li>Product grid</li><li>Zipper widget</li></ul></p><p>After adding each block and configuring it accordingly, click on \"Save\" and admire the new stunning look of your website!</p><p></p><p></p>","shortDescription":"Don't be limited when creating landing pages, store pages, and category layouts. Use our plugin that will help you create unique Shopware experiences.","highlights":"Ability to create personalized layouts for landing pages, store pages, and category pages in the Shopware Experience section.\nIncludes non-standard elements for enhanced shopping experiences, such as  zipper, a gallery slider, masonry gallery, review slider, quotation slider, product grid.\nShowcase customer reviews and quotes with options for automatic slide scrolling, background color, and font customization.\nShow images , products in an interesting way that encourages the customer to take further steps.","features":"Non-standard elements Shopping experiences.\nEnables you to present your product, photos  in a modern, interesting way.\nAllows users to create unique and personalized layouts for landing pages, store pages, and category pages.\nGallery slider- present your products and images in a captivating and engaging manner, guiding customers to the right destination.\nQuotation slider,review slider - showcase customer opinions, quotes, statements, and recommendations. Describe your products and add value with this versatile widget.\nProduct grid - display your products in a visually appealing grid format, anywhere you desire.\nMasonry gallery - create stunning galleries using your photos, enhancing the visual appeal of your website.\nZipper - compare two photos or seamlessly change text using the slider, providing interactive and dynamic content."}],"addons":["emotionPreset"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166869,"bookingKey":"goodd76242689498","bookingText":"","price":115,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":166868,"bookingKey":"goodd76242689498_M","bookingText":"","price":30,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168068,"bookingKey":"goodd76242689498_M12","bookingText":"Goodday Clean Widgets | GoodDay","price":300,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzaSWG9","preview":true,"priority":0,"id":103494},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSOR38a","preview":false,"priority":0,"id":103487},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyNZegQ","preview":false,"priority":0,"id":103488},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFVEULK","preview":false,"priority":0,"id":103489},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUAKzoc","preview":false,"priority":0,"id":103490},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnJzlYf","preview":false,"priority":0,"id":103491},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZKKgzp","preview":false,"priority":0,"id":103493},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVl9UDA","preview":false,"priority":0,"id":103495},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXO4ZvQ","preview":false,"priority":0,"id":103496},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCLHDrC","preview":false,"priority":0,"id":103497},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpW8St8L","preview":false,"priority":0,"id":103498},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQKFiwe","preview":false,"priority":0,"id":103499},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeauXb7","preview":false,"priority":0,"id":103500},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXlNErx","preview":false,"priority":0,"id":103501},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6PyGEa","preview":false,"priority":0,"id":103502},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMRcuLM","preview":false,"priority":0,"id":103503},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpblXJwE","preview":false,"priority":0,"id":103504},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCF4mqX","preview":false,"priority":0,"id":103505}],"comments":[],"ratingAverage":0,"label":"Clean Widgets | GoodDay","description":"<h2>Clean Widgets | GoodDay</h2><p>Willkommen bei Goodday Clean Widgets, einem leistungsstarken Plugin, das entwickelt wurde, um Ihr Shopware-Erlebnis zu verbessern. Mit unserer Vielzahl einzigartiger Elemente können Sie atemberaubende und fesselnde Landingpages, Shopseiten und Kategorie Layouts erstellen.</p><p>Vergleichen Sie Produkte, präsentieren Sie sie mit wunderschönen Galerien, zeigen Sie Empfehlungen und Bewertungen von Plattformen außerhalb von Shopware. Zeigen Sie Produktgruppen an beliebigen Stellen und erstellen Sie visuell ansprechende Präsentationen, die es Kunden ermöglichen, Ihr Angebot vollständig zu erkunden.</p><p>Beschränken Sie Ihre Kreativität nicht - entfesseln Sie sie mit Goodday Clean Widgets und bringen Sie Ihren Shopware-Shop auf die nächste Stufe.</p><p></p><h3>Zitat-Slider:</h3>ermöglicht die Präsentation von Zitaten zusammen mit der Unterschrift des Autors und erstellt eine dynamische, scrollbare Galerie von Aussagen. Mit dieser Funktion können Kundenbewertungen oder kurze, ermutigende Slogans in Form eines Sliders eingebunden werden.<p></p><p>Betonen Sie die Einzigartigkeit der Produkte, indem Sie einen solchen Slider auf der Produktseite platzieren.</p><h3>Galerie-Slider:</h3>ermöglicht es Benutzern, eine Sammlung von Bildern auf dynamische und interaktive Weise anzusehen. Er ermöglicht ein reibungsloses Scrollen oder Navigieren durch verschiedene visuelle Elemente und bietet ein ansprechendes Browsing-Erlebnis.<p></p><p>Verwenden Sie ihn, um verschiedene Farbvarianten Ihres Produkts, Fotogalerien oder sogar eine visuelle Darstellung des schrittweisen Kaufprozesses zu präsentieren.</p><p>Ein Button mit einem Link und Text ermöglicht es Ihnen, den Kunden an den richtigen Ort im Shop zu führen.</p><p></p><h3>Mauerwerk Galerie:</h3>ermöglicht die Hinzufügung und Präsentation von Fotos in einem ästhetischen, unregelmäßigen Galerie Format, das an eine Backsteinmauer erinnert. Mit einem zusätzlichen Button, der es Ihnen ermöglicht, weitere Bilder zu laden.<p></p><p>Verwenden Sie das Widget, um Produktgalerien oder Markenlogos zu erstellen.</p><p></p><h3>Bewertung Slider:</h3>präsentiert Bewertungen in Form von dynamischen Folien und ermöglicht die Hinzufügung von Fotos, Beschreibungen und Autoren Unterschriften. Seine Attraktivität liegt in der Möglichkeit, Elemente wie die Übergangszeit zwischen den Folien, Farben und die Art des Scrollens (Pfeile, Punkte) anzupassen.<p></p><p>Verwenden Sie das Widget auf der Produktseite, um zusätzliche positive Kundenbewertungen von Plattformen außerhalb von Shopware anzuzeigen. Platzieren Sie es auf der Startseite und wählen Sie die Bewertungen aus, die das größte Interesse potenzieller Kunden wecken.</p><p></p><h3>Produkt Raster:</h3>ermöglicht es Ihnen, bestimmte Produkte an verschiedenen Stellen auf Ihrer Website zu präsentieren. Sie können Produkte manuell zuweisen oder dynamische Gruppen erstellen, um festzulegen, welche Artikel angezeigt werden. Wenn ein Kunde auf ein Produkt klickt, öffnet sich ein Schiebe-Modal, das es ihm ermöglicht, einfach durch verschiedene Produktoptionen zu blättern und das ausgewählte Produkt zum Warenkorb hinzuzufügen. Das Erscheinungsbild des Produkts Rasters kann mit den verfügbaren Einstellungen an Ihre Vorlieben angepasst werden.<p></p><p>Verwenden Sie es, um Ihre attraktivsten Produkte zu bewerben, fügen Sie ein Widget auf Ihrer Startseite oder in der Kategorieliste hinzu.</p><p></p><h3>Reißverschluss:</h3>erleichtert die Präsentation und den Vergleich von zwei Bildern oder Texten. Mit einem zentral positionierten Slider können Benutzer den Inhalt nach links oder rechts schieben, um das Bild oder den Text aufzudecken oder zu verbergen.<p></p><p>Verwenden Sie diese Funktion, um zwei Produkte zu vergleichen und effektiv zwei unterschiedliche Eigenschaften jedes Produkts zu präsentieren.</p><h4>Kostenlose Updates:</h4><p>Um sicherzustellen, dass Sie immer über die neuesten Funktionen und Sicherheitsverbesserungen verfügen, bieten wir kostenlose Updates für dieses Plugin an. Bleiben Sie auf dem neuesten Stand der Entwicklungen und genießen Sie ein optimiertes Erlebnis.</p><h4>Blicken Sie in die Zukunft!</h4><p>Machen Sie sich mit den neuen Funktionen vertraut, die in Kürze eingeführt werden:</p><p><i>Karussell - Slider</i> - Er ermöglicht es Ihnen, Fotos in Form eines Karussells hinzuzufügen, mit der Option des automatischen Scrollens und animierten Effekten.</p><p><i>Pro Media Slider</i> - Ein hochentwickelter Slider, mit dem Sie mehrere Folien hinzufügen können, von denen jede verschiedene Arten von Daten enthält. Sie haben die Möglichkeit, aus Bildern, Videos vom Server, YouTube-Videos sowie einem einfarbigen Hintergrund zu wählen. Darüber hinaus haben Sie die Freiheit zu entscheiden, ob die Texte auf dem Element selbst (z. B. Bild oder Video) oder darunter in der mobilen Version angezeigt werden sollen. Die Möglichkeit, Schriftgrößen und -farben zu manipulieren, wird ein zusätzlicher Vorteil sein.<br /></p><p>Wenn Sie Ideen haben, um unser Plugin weiter zu verbessern, würden wir gerne Ihre Vorschläge hören. Bitte zögern Sie nicht, sie mit uns zu teilen: <a href=\"https://goodday4u.com/contact/\" target=\"_blank\" rel=\"noreferrer noopener\">https://goodday4u.com/contact/</a></p><h3><b>24/7 </b> <b>Engagierter &amp; Freundlicher Support:</b></h3><p>Wir bieten rund um die Uhr Unterstützung durch ein engagiertes und freundliches Team, das Ihnen immer gerne hilft. Wir bieten auch Anpassungsoptionen, um Ihre einzigartigen Markenanforderungen zu erfüllen.</p><p><b>E-Mail:</b><br /><i>hello@goodday4u.pl<br /></i><br /><b>Wir freuen uns auf Ihr Feedback!</b><br /></p><p><br /></p>","installationManual":"<p>Installieren Sie das Plugin und aktivieren Sie es.</p><p>Gehen Sie dann zu Inhalte -&gt; Shopware Experience -&gt; Wenn Sie ein neues Layout erstellen möchten, wählen Sie aus Shopseite, Landingpage, Listen-Seite, Produktseite oder wählen Sie ein Layout aus der Liste aus, auf dem Sie Änderungen vornehmen oder ein neues Element hinzufügen möchten.</p><p>Wenn Sie ein neues Layout auswählen, klicken Sie auf \"Neues Layout erstellen\" und geben Sie ihm einen passenden Namen.</p><p>Fügen Sie dann einen Block aus der Block-Kategorieliste hinzu: Wählen Sie Universal Clean Widgets.</p><p>Sie haben folgende Optionen zur Auswahl:</p><p></p><ul><li>Zitat Slider</li><li>Galerie Slider</li><li>Mauerwerk Galerie</li><li>Bewertung Slider</li><li>Produkt Raster</li><li>Zipper-Widget</li></ul><p></p><p>Nachdem Sie jeden Block hinzugefügt und entsprechend konfiguriert haben, klicken Sie auf \"Speichern\" und bewundern Sie den neuen atemberaubenden Look Ihrer Website!</p>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<p>- Compatibility with Shopware 6.5.0.0 adjustments</p>","creationDate":{"date":"2023-06-15 16:02:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>- Changed the style of switch, added the ability to change its color</p><p>- Image size increased</p>","creationDate":{"date":"2023-07-05 15:57:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- Added a Zipper Widget that allows visual comparison of two images and/or texts using a sliding bar</p>","creationDate":{"date":"2023-06-15 15:48:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First version of the community store plugin</p>","creationDate":{"date":"2022-12-09 11:04:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=goodd76242689498","redirectToStore":true,"lowestPriceValue":30}