{"id":16365,"name":"synaigy_amyware","code":"synai30687495555","lastChange":{"date":"2023-07-18 11:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5iHKfp","examplePageUrl":"","moduleKey":"synaigy_amyware","creationDate":{"date":"2022-12-19 16:11:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-02-06 12:07:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-02-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-14 13:24:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1323,"prefix":"synaigy","name":"synaigy GmbH - brytes App","website":"//www.synaigy.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1323_128x128_synaigy_weiss.png"},"infos":[{"id":28566,"name":"brytes | Empathische Personalisierung","description":"<p></p><p></p><h3><br /></h3><p>Die\nbrytes Shopware App bietet Dir in Kombination mit Deinem persönlichen brytes\nAccount ein Gesamtpaket für die Online-Personalisierung Deiner Website. Mit\nHilfe wissenschaftlicher Erkenntnisse aus der Verhaltensökonomik haben wir\nMaßnahmen („Nudges“) entwickelt, die in Form von Pop-Ups ausgespielt werden und\nDeine User in Echtzeit auf ihrer Customer Journey unterstützen. Dadurch erhöhst\nDu nicht nur die Zufriedenheit Deiner User, sondern auch die relevanten KPI\nDeines Shops</p><p></p><p></p><h3><b>Funktionen</b><br /></h3>Die brytes Shopware App beinhaltet verschiedene Nudges\nauf wissenschaftlicher Basis aktueller verhaltensökonomischer Erkenntnisse. Im\npersönlichen Self Service Portal stehen Dir ausführliche Informationen zu den\neinzelnen Maßnahmen inklusive Beispieldarstellungen der Nudges, Informationen\nüber den Ausspielungszeitraum und den konsumpsychologischen Hintergründen zur\nVerfügung. <p>Derzeit bieten wir fünf verschiedene Maßnahmen („Nudges“) mit\nfolgenden Zielsetzungen an:  Die brytes Shopware App beinhaltet verschiedene Nudges\nauf wissenschaftlicher Basis aktueller verhaltensökonomischer Erkenntnisse. Im\npersönlichen Self Service Portal stehen Dir ausführliche Informationen zu den\neinzelnen Maßnahmen inklusive Beispieldarstellungen der Nudges, Informationen\nüber den Ausspielungszeitraum und den konsumpsychologischen Hintergründen zur\nVerfügung.</p><p></p><ol><li><b>Nudge: </b>Dieser Nudge zielt darauf ab neben der\nKaufwahrscheinlichkeit auch die Anzahl der Produkte im Warenkorb zu erhöhen. Indem\nwir gezielt das Vertrauen in deine Produkte erhöhen, kann ein schnellerer\nKaufabschluss Deiner User mit verhaltensökonomischen Erkenntnissen erzielt\nwerden. </li><li><b>Nudge: </b>Mithilfe einer weiteren Maßnahme unterstützt Du Deine User entlang ihrer\nCustomer Journey ganz individuell. Während\ndie einen möglicherweise schon weit fortgeschritten sind und ihre\nLieblingsprodukte bereits gefunden haben, benötigen andere eventuell eine\nkleine Hilfestellung auf dem Weg zu ihren Favoriten. Der Nudge unterstützt beide\nUser-Gruppen gleichmäßig und führt einerseits den bereits fortgeschrittenen\nKaufprozess zu einem erfolgreichen Abschluss und erhöht andererseits den\ndurchschnittlichen Warenkorbwert.</li><li><b><a href=\"https://account.shopware.com/producer/vouchers\"></a>Nudge: </b>Der Warenkorb Deiner User ist bereits gefüllt, aber der finale Check-Out lässt noch auf sich warten? In Abhängigkeit des aktuellen Warenkorbwertes ermitteln wir die Kaufwahrscheinlichkeit des Users und animieren entweder zu einer Erhöhung des Order Values oder vermindern die Wahrscheinlichkeit eines Exits.</li><li><b>Nudge</b>: Deine User verlassen Deine Website verfrüht, sodass Du sie noch nicht vollständig von Deinem Potenzial überzeugen konntest? Mithilfe des Nudges beugen wir einem vorzeitigen Exit vor und geben Dir ausreichend Zeit, um mit Deinem Angebot zu überzeugen und die Abschlusswahrscheinlichkeit zu erhöhen.</li><li><b>Nudge</b>: Besuchen\nUser ein sehr beliebtes Produkt, sollen sie dies sofort erfahren. Egal, ob im\nVergleichsprozess mehrerer Produkte oder direkt zum Start der Session -\nbeliebte Produkte sollten als solche sichtbar gemacht werden. Gerade neue User\nkennen sich noch nicht so gut mit dem Shop und ggf. der Produktpalette aus. Der\nNudge hilft ihnen die Produkte unterscheidbar zu machen und die besten Produkte\nfür die individuelle Auswahl zu finden.</li></ol><p>Da unsere App sich noch am Anfang ihres Funktionsumfanges befindet, werden wir die Maßnahmensets Stück für Stück erweitern. Natürlich halten wir dich auf dem Laufenden, sobald es Neuigkeiten über neue Nudges gibt.<br /></p><p><b>Unsere App ist genauso individuell wie deine Website...</b><br /></p><p>... und genau aus diesem Grund kannst Du die Maßnahmen der digital empathy\nengine an Dein Website-Design anpassen. Bevor die Pop-up Maßnahmen Deinen Usern\nendgültig ausgespielt werden, lassen sich die Maßnahmen mithilfe verschiedener\nAnpassungsmöglichkeiten individualisieren. Folgende Optionen stehen Dir unter\nanderem zur Auswahl:</p><p></p><ol><li><b>Anpassung der User-Ansprache</b>: Du hast die Möglichkeit zwischen einer\nDu- und Sie-Ansprache zu wählen, um Deine User gezielt zu erreichen.</li><li><b>Auswahl der Design-Farbe</b>: Binde die Maßnahme der digital empathy engine farblich\nin Dein vorhandenes Shop-Design ein, um eine stimmige Analogie herzustellen.</li><li><b>Aktivieren / Deaktiveren von Nudges: </b>Die Ausspielung der Maßnahmen kann\njederzeit individuell angepasst werden.</li><li><b>Ausschluss von Device Types, Seitentypen, URL: </b>Diverse\nKonfigurationsmöglichkeiten ermöglichen Dir den individuellen Ausschluss von\nDevice Types, Seitentypen sowie speziellen URLs.</li></ol><p></p><p>Kontinuierliche Updates erweitern die aktuellen\nIndividualisierungsmöglichkeiten, um die Inhalte optimal in Deinen Online-Shop\neinzubinden.</p><h3><b>Unsere Mission </b></h3><p>Menschen sind verschieden. Manch einer von uns ist eher unsicher und denkt\nlange über Entscheidungen nach, andere sind zielstrebig und\nentscheidungsfreudig. Deswegen benötigt jeder von uns eine Beratung, die auf\nunsere individuellen und speziellen Bedürfnisse abgestimmt ist. Im stationären\nHandel unterstützen uns Verkäufer:innen, die mithilfe von Empathie und einem\ngeschulten Auge gezielt auf unseren Bedarf reagieren und uns somit in unserem\nEntscheidungsprozess zur Seite stehen. Da diese individuelle Beratung im\ndigitalen Raum jedoch größtenteils verloren geht, haben wir mit unserer App ein\nPendant für die <b>empathische Online-Personalisierung</b> entwickelt.</p><p></p><p></p><p>Unsere Erfahrung aus jahrelanger Zusammenarbeit mit unseren Kunden haben wir\nin diese App verpackt und stellen Dir eine erste Version unserer brytes digital\nempathy engine zur Verfügung, um Dich bei der Personalisierung deines\nOnline-Shops zu unterstützen.</p><p></p><h3><b>Support</b></h3>Bei Fragen, Anregungen oder technischen\nHerausforderungen unterstützen wir Dich selbstverständlich jederzeit gerne. Du\nerreichst unser Experten-Team, die nicht nur bei technischen Themen an Deiner\nSeite sind, sondern Dich auch bei allen anderen Fragestellungen rund um unsere\nApp jederzeit supporten, über die folgenden Kanäle:<br /><p>E-Mail: <a href=\"mailto:support@brytes.de\">support@brytes.de </a><br />Website: <a href=\"http://www.brytes.de/\" target=\"_blank\" rel=\"noreferrer noopener\">www.brytes.de</a></p><h3><b>Regelmäßige technische Updates</b></h3><p>Unser Team arbeitet kontinuierlich daran die brytes Shopware App zu\noptimieren und versorgt Dich regelmäßig mit neuem Content. Neben Erweiterungen\nbezüglich der ausspielbaren Maßnahmen in Pop-up Form, bietet die App neue\ntechnische Funktionen, um die Inhalte optimal in Deinen Online-Shop\neinzubinden. Die Updates erreichen Dich automatisch, sodass Deine App immer auf\ndem neusten Stand ist.</p><p></p><p></p><h3><b>Technische Störungen und Bugs</b></h3><p>Trotz der kontinuierlichen Wartung und\nWeiterentwicklung sind auch technische Lösungen in Form von Apps nicht immer\nfrei von kleineren Fehlerquellen oder kurzzeitigen Störungen. Technische\nStörungen und Bugs werden von unserem Team aus Entwicklern und Data Scientists in\nkürzester Zeit behoben, um eine einwandfreie Nutzung der App sicherstellen.</p><p></p><p></p><p></p><h3><b>Zufriedenheitsgarantie</b></h3>Um Dich mit der brytes Shopware App vertraut zu machen und die ersten\nErgebnisse abzuwarten sind die ersten Monate für Dich komplett kostenfrei\nnutzbar. Du hast uneingeschränkten Zugang und kannst alle Funktionen in Ruhe\ntesten. Sollte unsere digital empathy engine Deine Erwartungen nicht erfüllen\nfinden wir eine gemeinsame Lösung. Versprochen! <h3><b>Du hast Fragen oder benötigst detailliertere Informationen?</b></h3><p>Kontaktiere uns gerne unter support@brytes.de oder schau dich auf unserer\nWebsite www.brytes.de um.\nFür alle weiteren Fragen steht Dir unser Team bestehend aus User Experience\nSpezialisten, Data Scientists und Entwicklern selbstverständlich beratend zur\nSeite.</p><p>Mit dem Kauf unserer App stimmst du automatisch dem <a href=\"https://www.brytes.de/datenschutz-app\" target=\"_blank\" rel=\"noreferrer noopener\">Vertrag zur Auftragsverarbeitung personenbezogener Daten</a> gemäß BDSG und DSGVO im Rahmen der Nutzung der brytes empathy engine zu. </p>","installationManual":"<p>Nach der Installation der Erweiterung in Deinem Shop kannst Du über den Extension Bereich Deines Shopware Backends Einstellungen für die brytes empathy engine vornehmen. Der Minimalaufwand hierfür beträgt lediglich 5 Minuten. Bei Fragen stehen wir Dir unter&nbsp;<a href=\"//mailto:support@brytes.de\" target=\"_blank\" rel=\"noreferrer\">support@brytes.de</a>&nbsp;gerne zur Verfügung. <br><b>Gerne gehen wir mit Dir gemeinsam den gesamten Installationsprozess durch. Schreib uns einfach eine Mail und wir machen einen Termin aus, um deine individuell besten Einstellungen zu finden und die brytes engine in Deinem Shop ans Laufen zu bringen.&nbsp;</b></p><p><br></p><p><b>1. Konto vervollständigen</b></p><p>Bitte öffne Deine Extension über das Shopware Backend (<a href=\"https://www.brytes.de/faq\" target=\"_blank\" rel=\"noreferrer\">Bildanleitung</a>). Hierüber erhältst Du Zugriff auf das Self Service Portal der brytes empathy engine, in dem Du Dich mit Mailadresse und Passwort registrieren kannst. Im Menü findest Du Kontoinformationen, die wir für den reibungslosen Betrieb von Dir benötigen. Diese Informationen beschränken sich jedoch hauptsächlich auf Rechnungs- und Vertragsinformationen.&nbsp;</p><p>In diesem Portal kannst Du die Auswertung Deiner Nudge Performance einsehen, hast Zugriff auf Hintergrundinformationen rund um das Thema Digital Nudging und eine Übersicht aller Konfigurationsoptionen für den optimalen Einsatz Deiner brytes empathy engine.&nbsp;</p><p><br></p><p><b>2. Tracking Access Key kopieren</b></p><p>Die einzige technische Anpassung, die Du für den reibungslosen Ablauf vornehmen musst, ist die Integration in des Tracking Endpoints Deines Shopware Shops. Nach dem Login findest du in deinen Account Informationen eine Tracking ID.&nbsp;Kopiere diese, gehe anschließend zurück zu Deinen Extensions, öffne den Konfigurationsbereich der brytes empathy engine Extension und trage unter \"Generell Settings\" beim Tracking Endpoint die Tracking ID ein. Jetzt musst Du die Einstellungen noch speichern und kannst im nächsten Schritt Deine Nudges aktivieren. Folge gerne unserer ausführlichen&nbsp;<a href=\"https://www.brytes.de/faq\" target=\"_blank\" rel=\"noreferrer\">Bildanleitung</a>.</p><p><br></p><p><b>3. Nudges konfigurieren</b></p><p>Die Übersicht Deiner Extensions gibt Dir die Option den Konfigurationsbereich für jede App individuell zu öffnen. Hier findest Du zu jedem Nudge einzelne Konfigurationsoptionen (Ein- und Ausschalten, bestimmte Seiten von der Ausspielung ausschließen). Die Nudges sind standardmäßig deaktiviert. Bitte aktiviere Deine gewünschten Inhalte, um die brytes empathy engine für Deinen Shop zu aktivieren. Sobald die Nudges aktiviert sind, startet die Ausspielung sofort für die passenden Nutzer und das Trackingsystem misst im Hintergrund automatisch mit, wie sich die relevanten KPI durch den Einsatz der Nudges verändern. Das Design deiner Nudges kannst du selbstverständlich noch an deine CI anpassen.</p><p><br></p><p>Solltest du Fragen haben, schaue gerne in unserem&nbsp;<a href=\"https://www.brytes.de/faq\" target=\"_blank\" rel=\"noreferrer\">FAQ</a>&nbsp;Bereich nach der passenden Antwort oder melde dich bei uns unter support@brytes.de.</p>","shortDescription":"Digital Nudging für deinen Webshop! Mit der brytes empathy engine holst du deine Nutzer individuell ab. Hilf ihnen passende Produkte zu finden und sich im Shop zu orientieren.","highlights":"Alles an einem Ort - Manage den gesamten Service über das Showpare Backend. Von hier aus kannst du alles steuern.  \nReagiere empathisch auf die individuellen Bedürfnisse Deiner User \nErmögliche Deinen Usern ein personalisiertes Erlebnis und mache sie zu glücklichen, wiederkehrenden Usern\nTracke die Wirksamkeit Deiner Personalisierungsmaßnahmen, um deine relevanten KPI (Konversionsrate, durchschnittlicher Warenkorbwert etc.) zu steigern\nWir begleiten Dich im Onboarding! Auf Wunsch führen wir Dich Schritt für Schritt durch den Onboarding Prozess und stellen Deine App gemeinsam ein","features":"Personalisierbare Maßnahmen mit integriertem Regelwerk \nAnalytics Bereich, um die Wirksamkeit Deiner Maßnahmen zu analysieren \nEigenständig anpassbare Template- und Farbauswahl\nStatistische A/B Testung, um die effektivste Maßnahme für Deinen Shop zu identifizieren\nSelbstständiges Ein- und Ausschalten der einzelnen Maßnahmen \nIP Ausschluss - Du und Deine Kolleg*innen sehen die Nudges, werden aber im Reporting nicht mit ausgewertet\nAuswahl zwischen \"Du\" und \"Sie\" Ansprache des Kunden\nTechnischer Support – Wenn Du Hilfe benötigst, steht Dir unser Team aus User Experience Spezialisten, Data Scientists und Programmierern gerne beratend zur Seite!\nOnboarding Begleitung - Wir helfen Dir beim kompletten Installationsprozess. Melde dich bei uns!"},{"id":28569,"name":"brytes | digital empathy engine for personalization","description":"<p><br></p><p>The brytes Shopware App offers you a complete package for the online personalization of your website in combination with your personal brytes account. With the help of scientific findings from behavioral economics, we have developed pop-up measures (\"nudges\") that support your users in real time on their customer journey. This will not only increase the satisfaction of your users, it will also improve the relevant KPIs of your store.&nbsp;</p><h3><b>Features</b></h3><p>The brytes Shopware App includes various nudges based on current scientific\nfindings in behavioral economics. In the personal self-service portal, you will\nfind detailed information about the individual pop-up measures, including\nexamples of the nudges, information about the playout period and the consumer\npsychology context.<br>We currently offer five different measures\n(\"nudges\") with the following aims:</p><p><ol><li><b>Nudge</b>: The nudge\nis designed to increase the number of products in the shopping cart in addition\nto the probability of purchase. By specifically increasing the trust in your\nproducts, a faster purchase completion of your users can be achieved with\nbehavioral economic insights.<br></li><li><b>Nudge</b>: With the help of a separate nudge, you can support your users individually along their customer journey. While some users may already be well advanced and have discovered their favorite products, others may need a little help on the way to their favorite products. The Nudge supports both user types equally and successfully leads the already advanced purchase process to a successful conclusion and increases the average shopping cart value on the other hand.</li><li><b>Nudge</b>: The shopping\ncart of your customers is already filled, but the final check-out is taking\nlonger than expected? Depending on the current shopping cart value, we\ndetermine the user's purchase probability and either encourage an increase in\nthe order value or reduce the probability of an exit.</li><li><b>Nudge</b>: Your users\nare leaving your website earlier than expected, so that you have not fully\nconvinced them of your potential yet? With the help of the nudge, we will\nprevent a hasty exit and give you enough time to convince them of your offering\nin order to increase the likelihood of a transaction.</li><li><b>Nudge</b>: If users\nvisit a very popular product, they should experience this immediately. Whether\nin the comparison process of several products or directly at the beginning of\nthe session - popular products should be made visible as those. Especially new\nusers are not familiar with the store and the range of products. The Nudge\nhelps them differentiate the products and find the best products for their\nindividual choice.</li></ol></p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">Since\nour app is still at the beginning of its functional scope, we will expand the\nsets of measures bit by bit.</p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><h3><b>Our app is as individual as your website...</b></h3>... and\nthat's why you can customize the pop-up measures of the digital empathy engine\nto match your website design. Before the nudges are finally played out to your\nusers, those can be individualized using various customization options. You can\nselect from the following options:</p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><ol><li><b>Customization of the user adress</b>: You can choose the address in order to reach your users in a targeted manner.</li><li><b>Selection of the design color</b>: Integrate the digital empathy engine pop-up measures into your existing store design in terms of color in order to create a coherent analogy.</li><li><b>Activation / deactivation of the nudges</b>: The playout of the nudges can be individually adjusted at any time.</li><li><b>Exclusion of device types, page types and URL</b>: Various configuration options allow you to individually exclude device types, page types and special URLs.</li></ol></p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">Continuous\nupdates expand the current individualization options in order to optimally\nintegrate the content into your online store.</p><h3 style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><b>Our mission&nbsp;</b></h3><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">People are\ndifferent. Some of us are rather insecure and spend a long time thinking about\ndecisions, others are determined and decisive. That's why each of us needs\nadvice that is tailored to our individual and specific needs. In physical\nretail, sales assistants support us by responding to our needs with empathy,\nthus assisting us in our decision-making process. However, since this individual\nadvice is mostly disappearing in the digital space, we have developed our app\nas a counterpart for empathetic online personalization.<br>We\nhave packed our experience from years of working with our customers into this\napp and provide you with a first version of our brytes digital empathy engine\nto support you in personalizing your online store.</p><h3 style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><b>Support</b></h3><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">If you\nhave any questions, suggestions or technical challenges, we will be happy to\nsupport you at any time. You can contact our team of experts, who are not only\nat your side for technical issues, but also support you with all other\nquestions regarding our app, via the following channels:</p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">Email: support@brytes.de<br>Website: www.brytes.de</p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><h3><b>Regular technical updates</b></h3>Our\nteam is continuously working on optimizing the brytes Shopware App and\nregularly provides you with new content. In addition to enhancements regarding\nthe playable measures in pop-up form, the app offers new technical functions to\noptimally integrate the content into your online store. The updates reach you\nautomatically, so that your app is always up to date.</p><h3 style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><b>Technical errors and bugs</b></h3><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">Despite\ncontinuous maintenance and further development, technical solutions in form of\napps are also not always free from minor errors or short-lived malfunctions.\nTechnical failures and bugs are fixed by our team of developers and Data\nScientists in the shortest possible time to ensure a flawless use of the app.</p><h3 style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><b>Satisfaction guarantee</b></h3><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">To get\nfamiliar with the brytes Shopware App and to experience first results, the\nfirst months are completely free of charge. You have unrestricted access and\nmay test all functions. If our digital empathy engine does not meet your\nexpectations, we will find a solution together. That's a promise!</p><h3 style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><b>You have questions or need more detailed information?</b></h3><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\">Feel\nfree to contact us at support@brytes.de or take a look at our website\nwww.brytes.de. For all further questions, our team of user experience\nspecialists, data scientists and developers will be happy to assist you.</p><p class=\"MsoNormal\" style=\"line-height: normal; background-image: initial; background-position: initial; background-size: initial; background-repeat: initial; background-attachment: initial; background-origin: initial; background-clip: initial;\"><br></p>","installationManual":"<p>After installing your brytes extension, you can adjust settings for your brytes empathy engine via the extension area of ​​your shopware backend. It only takes 5 minutes to get started. If you have any questions, we are happy to help you. You can reach us under support@brytes.de.</p><p><br></p><p>Please contact us in case you need help during your onboarding. We will guide you step by step and set up your perfect account together! Just send us a message -&gt; support@brytes.de!</p><p><br></p><p><br></p><h2>1. Complete account</h2><p><br></p><p>Please open your extension via the Shopware backend. This gives you access to the self-service portal of the brytes empathy engine, where you can register with your email address and password. In the menu you will find account information that we need from you for smooth operation. However, this information is mainly limited to billing and contract information.</p><p>In this portal you can see the evaluation of your nudge performance, have access to background information about digital nudging and an overview of all configuration options for the optimal use of your brytes empathy engine.</p><p><br></p><p><br></p><h2>2. Copy Tracking Access Key</h2><p><br></p><p>The only technical adjustment that you have to make for a smooth process is the integration into the tracking endpoint of your Shopware shop. After logging in, you will find a tracking ID in your account information. Copy this, then go back to your extensions, open the configuration area of ​​the brytes empathy engine extension and enter the tracking ID under \"General Settings\" for the tracking endpoint. Now you have to save the settings and in the next step you can activate your nudges.&nbsp;</p><p><br></p><p><br></p><h2>3. Configure nudges</h2><p><br></p><p>The overview of your extensions gives you the option to open the configuration area for each app individually. Here you will find individual configuration options for each nudge (switch on and off, exclude certain pages from the display). The nudges are disabled by default. Please activate your desired content to activate the brytes empathy engine for your shop. As soon as the nudges are activated, the play starts immediately for the appropriate users and the tracking system automatically measures you most relevant KPIs changes. You can of course adapt the design of your nudges to your CI.</p><p><br></p><p><br></p><p>If you have any questions, please look for the right answer in our FAQ area or contact us at support@brytes.de.</p>","shortDescription":"Digital Nudging for your shop! brytes empathy engine helps you to interpret your customers' digital body language and provides nudges to help your customers find the right products.","highlights":"All in one place - full service available via your Shopware backend. You don't need any extra accounts!\nReact to every users behaviour individually\nAnalyse your nudge performance to uplift your KPI (conversion rate, average order value)\nbrytes is helping your webshop to become more empathic\nWe support you throughout your whole onboarding process! Just send us a message and we will guide you step by step","features":"Rulebased personalized nudges\nReporting to measure the performance of your nudges\nAdapt our standard design to you individual corporate style\nA/B Testing to detect your most effective nudges\nSwitch every single nudge on/off per device type\nExclude your internal IPs from Reporting - You and your colleagues can still see the nudges\nCurrent available language is German - Including the option to choose between \"Du\" & \"Sie\" \nTechnical Support - our developers, data scientists and behavioral economists are there for you!"}],"addons":["SW6_integrated"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167345,"bookingKey":"synai30687495555","bookingText":"brytes | digital empathy engine for personalization","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGqL2bB","preview":true,"priority":0,"id":105292},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkTFa4v","preview":false,"priority":4,"id":105291},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmd27rj","preview":false,"priority":3,"id":104716},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWlAjUx","preview":false,"priority":2,"id":104717},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpksfqwu","preview":false,"priority":1,"id":105290}],"comments":[],"ratingAverage":0,"label":"brytes | Empathische Personalisierung","description":"<p></p><p></p><h3><br /></h3><p>Die\nbrytes Shopware App bietet Dir in Kombination mit Deinem persönlichen brytes\nAccount ein Gesamtpaket für die Online-Personalisierung Deiner Website. Mit\nHilfe wissenschaftlicher Erkenntnisse aus der Verhaltensökonomik haben wir\nMaßnahmen („Nudges“) entwickelt, die in Form von Pop-Ups ausgespielt werden und\nDeine User in Echtzeit auf ihrer Customer Journey unterstützen. Dadurch erhöhst\nDu nicht nur die Zufriedenheit Deiner User, sondern auch die relevanten KPI\nDeines Shops</p><p></p><p></p><h3><b>Funktionen</b><br /></h3>Die brytes Shopware App beinhaltet verschiedene Nudges\nauf wissenschaftlicher Basis aktueller verhaltensökonomischer Erkenntnisse. Im\npersönlichen Self Service Portal stehen Dir ausführliche Informationen zu den\neinzelnen Maßnahmen inklusive Beispieldarstellungen der Nudges, Informationen\nüber den Ausspielungszeitraum und den konsumpsychologischen Hintergründen zur\nVerfügung. <p>Derzeit bieten wir fünf verschiedene Maßnahmen („Nudges“) mit\nfolgenden Zielsetzungen an:  Die brytes Shopware App beinhaltet verschiedene Nudges\nauf wissenschaftlicher Basis aktueller verhaltensökonomischer Erkenntnisse. Im\npersönlichen Self Service Portal stehen Dir ausführliche Informationen zu den\neinzelnen Maßnahmen inklusive Beispieldarstellungen der Nudges, Informationen\nüber den Ausspielungszeitraum und den konsumpsychologischen Hintergründen zur\nVerfügung.</p><p></p><ol><li><b>Nudge: </b>Dieser Nudge zielt darauf ab neben der\nKaufwahrscheinlichkeit auch die Anzahl der Produkte im Warenkorb zu erhöhen. Indem\nwir gezielt das Vertrauen in deine Produkte erhöhen, kann ein schnellerer\nKaufabschluss Deiner User mit verhaltensökonomischen Erkenntnissen erzielt\nwerden. </li><li><b>Nudge: </b>Mithilfe einer weiteren Maßnahme unterstützt Du Deine User entlang ihrer\nCustomer Journey ganz individuell. Während\ndie einen möglicherweise schon weit fortgeschritten sind und ihre\nLieblingsprodukte bereits gefunden haben, benötigen andere eventuell eine\nkleine Hilfestellung auf dem Weg zu ihren Favoriten. Der Nudge unterstützt beide\nUser-Gruppen gleichmäßig und führt einerseits den bereits fortgeschrittenen\nKaufprozess zu einem erfolgreichen Abschluss und erhöht andererseits den\ndurchschnittlichen Warenkorbwert.</li><li><b><a href=\"https://account.shopware.com/producer/vouchers\"></a>Nudge: </b>Der Warenkorb Deiner User ist bereits gefüllt, aber der finale Check-Out lässt noch auf sich warten? In Abhängigkeit des aktuellen Warenkorbwertes ermitteln wir die Kaufwahrscheinlichkeit des Users und animieren entweder zu einer Erhöhung des Order Values oder vermindern die Wahrscheinlichkeit eines Exits.</li><li><b>Nudge</b>: Deine User verlassen Deine Website verfrüht, sodass Du sie noch nicht vollständig von Deinem Potenzial überzeugen konntest? Mithilfe des Nudges beugen wir einem vorzeitigen Exit vor und geben Dir ausreichend Zeit, um mit Deinem Angebot zu überzeugen und die Abschlusswahrscheinlichkeit zu erhöhen.</li><li><b>Nudge</b>: Besuchen\nUser ein sehr beliebtes Produkt, sollen sie dies sofort erfahren. Egal, ob im\nVergleichsprozess mehrerer Produkte oder direkt zum Start der Session -\nbeliebte Produkte sollten als solche sichtbar gemacht werden. Gerade neue User\nkennen sich noch nicht so gut mit dem Shop und ggf. der Produktpalette aus. Der\nNudge hilft ihnen die Produkte unterscheidbar zu machen und die besten Produkte\nfür die individuelle Auswahl zu finden.</li></ol><p>Da unsere App sich noch am Anfang ihres Funktionsumfanges befindet, werden wir die Maßnahmensets Stück für Stück erweitern. Natürlich halten wir dich auf dem Laufenden, sobald es Neuigkeiten über neue Nudges gibt.<br /></p><p><b>Unsere App ist genauso individuell wie deine Website...</b><br /></p><p>... und genau aus diesem Grund kannst Du die Maßnahmen der digital empathy\nengine an Dein Website-Design anpassen. Bevor die Pop-up Maßnahmen Deinen Usern\nendgültig ausgespielt werden, lassen sich die Maßnahmen mithilfe verschiedener\nAnpassungsmöglichkeiten individualisieren. Folgende Optionen stehen Dir unter\nanderem zur Auswahl:</p><p></p><ol><li><b>Anpassung der User-Ansprache</b>: Du hast die Möglichkeit zwischen einer\nDu- und Sie-Ansprache zu wählen, um Deine User gezielt zu erreichen.</li><li><b>Auswahl der Design-Farbe</b>: Binde die Maßnahme der digital empathy engine farblich\nin Dein vorhandenes Shop-Design ein, um eine stimmige Analogie herzustellen.</li><li><b>Aktivieren / Deaktiveren von Nudges: </b>Die Ausspielung der Maßnahmen kann\njederzeit individuell angepasst werden.</li><li><b>Ausschluss von Device Types, Seitentypen, URL: </b>Diverse\nKonfigurationsmöglichkeiten ermöglichen Dir den individuellen Ausschluss von\nDevice Types, Seitentypen sowie speziellen URLs.</li></ol><p></p><p>Kontinuierliche Updates erweitern die aktuellen\nIndividualisierungsmöglichkeiten, um die Inhalte optimal in Deinen Online-Shop\neinzubinden.</p><h3><b>Unsere Mission </b></h3><p>Menschen sind verschieden. Manch einer von uns ist eher unsicher und denkt\nlange über Entscheidungen nach, andere sind zielstrebig und\nentscheidungsfreudig. Deswegen benötigt jeder von uns eine Beratung, die auf\nunsere individuellen und speziellen Bedürfnisse abgestimmt ist. Im stationären\nHandel unterstützen uns Verkäufer:innen, die mithilfe von Empathie und einem\ngeschulten Auge gezielt auf unseren Bedarf reagieren und uns somit in unserem\nEntscheidungsprozess zur Seite stehen. Da diese individuelle Beratung im\ndigitalen Raum jedoch größtenteils verloren geht, haben wir mit unserer App ein\nPendant für die <b>empathische Online-Personalisierung</b> entwickelt.</p><p></p><p></p><p>Unsere Erfahrung aus jahrelanger Zusammenarbeit mit unseren Kunden haben wir\nin diese App verpackt und stellen Dir eine erste Version unserer brytes digital\nempathy engine zur Verfügung, um Dich bei der Personalisierung deines\nOnline-Shops zu unterstützen.</p><p></p><h3><b>Support</b></h3>Bei Fragen, Anregungen oder technischen\nHerausforderungen unterstützen wir Dich selbstverständlich jederzeit gerne. Du\nerreichst unser Experten-Team, die nicht nur bei technischen Themen an Deiner\nSeite sind, sondern Dich auch bei allen anderen Fragestellungen rund um unsere\nApp jederzeit supporten, über die folgenden Kanäle:<br /><p>E-Mail: <a href=\"mailto:support@brytes.de\">support@brytes.de </a><br />Website: <a href=\"http://www.brytes.de/\" target=\"_blank\" rel=\"noreferrer noopener\">www.brytes.de</a></p><h3><b>Regelmäßige technische Updates</b></h3><p>Unser Team arbeitet kontinuierlich daran die brytes Shopware App zu\noptimieren und versorgt Dich regelmäßig mit neuem Content. Neben Erweiterungen\nbezüglich der ausspielbaren Maßnahmen in Pop-up Form, bietet die App neue\ntechnische Funktionen, um die Inhalte optimal in Deinen Online-Shop\neinzubinden. Die Updates erreichen Dich automatisch, sodass Deine App immer auf\ndem neusten Stand ist.</p><p></p><p></p><h3><b>Technische Störungen und Bugs</b></h3><p>Trotz der kontinuierlichen Wartung und\nWeiterentwicklung sind auch technische Lösungen in Form von Apps nicht immer\nfrei von kleineren Fehlerquellen oder kurzzeitigen Störungen. Technische\nStörungen und Bugs werden von unserem Team aus Entwicklern und Data Scientists in\nkürzester Zeit behoben, um eine einwandfreie Nutzung der App sicherstellen.</p><p></p><p></p><p></p><h3><b>Zufriedenheitsgarantie</b></h3>Um Dich mit der brytes Shopware App vertraut zu machen und die ersten\nErgebnisse abzuwarten sind die ersten Monate für Dich komplett kostenfrei\nnutzbar. Du hast uneingeschränkten Zugang und kannst alle Funktionen in Ruhe\ntesten. Sollte unsere digital empathy engine Deine Erwartungen nicht erfüllen\nfinden wir eine gemeinsame Lösung. Versprochen! <h3><b>Du hast Fragen oder benötigst detailliertere Informationen?</b></h3><p>Kontaktiere uns gerne unter support@brytes.de oder schau dich auf unserer\nWebsite www.brytes.de um.\nFür alle weiteren Fragen steht Dir unser Team bestehend aus User Experience\nSpezialisten, Data Scientists und Entwicklern selbstverständlich beratend zur\nSeite.</p><p>Mit dem Kauf unserer App stimmst du automatisch dem <a href=\"https://www.brytes.de/datenschutz-app\" target=\"_blank\" rel=\"noreferrer noopener\">Vertrag zur Auftragsverarbeitung personenbezogener Daten</a> gemäß BDSG und DSGVO im Rahmen der Nutzung der brytes empathy engine zu. </p>","installationManual":"<p>Nach der Installation der Erweiterung in Deinem Shop kannst Du über den Extension Bereich Deines Shopware Backends Einstellungen für die brytes empathy engine vornehmen. Der Minimalaufwand hierfür beträgt lediglich 5 Minuten. Bei Fragen stehen wir Dir unter <a href=\"//brytes.de\" target=\"_blank\" rel=\"noreferrer noopener\">support@brytes.de</a> gerne zur Verfügung. <br /><b>Gerne gehen wir mit Dir gemeinsam den gesamten Installationsprozess durch. Schreib uns einfach eine Mail und wir machen einen Termin aus, um deine individuell besten Einstellungen zu finden und die brytes engine in Deinem Shop ans Laufen zu bringen. </b></p><p><br /></p><p><b>1. Konto vervollständigen</b></p><p>Bitte öffne Deine Extension über das Shopware Backend (<a href=\"https://www.brytes.de/faq\" target=\"_blank\" rel=\"noreferrer noopener\">Bildanleitung</a>). Hierüber erhältst Du Zugriff auf das Self Service Portal der brytes empathy engine, in dem Du Dich mit Mailadresse und Passwort registrieren kannst. Im Menü findest Du Kontoinformationen, die wir für den reibungslosen Betrieb von Dir benötigen. Diese Informationen beschränken sich jedoch hauptsächlich auf Rechnungs- und Vertragsinformationen. </p><p>In diesem Portal kannst Du die Auswertung Deiner Nudge Performance einsehen, hast Zugriff auf Hintergrundinformationen rund um das Thema Digital Nudging und eine Übersicht aller Konfigurationsoptionen für den optimalen Einsatz Deiner brytes empathy engine. </p><p><br /></p><p><b>2. Tracking Access Key kopieren</b></p><p>Die einzige technische Anpassung, die Du für den reibungslosen Ablauf vornehmen musst, ist die Integration in des Tracking Endpoints Deines Shopware Shops. Nach dem Login findest du in deinen Account Informationen eine Tracking ID. Kopiere diese, gehe anschließend zurück zu Deinen Extensions, öffne den Konfigurationsbereich der brytes empathy engine Extension und trage unter \"Generell Settings\" beim Tracking Endpoint die Tracking ID ein. Jetzt musst Du die Einstellungen noch speichern und kannst im nächsten Schritt Deine Nudges aktivieren. Folge gerne unserer ausführlichen <a href=\"https://www.brytes.de/faq\" target=\"_blank\" rel=\"noreferrer noopener\">Bildanleitung</a>.</p><p><br /></p><p><b>3. Nudges konfigurieren</b></p><p>Die Übersicht Deiner Extensions gibt Dir die Option den Konfigurationsbereich für jede App individuell zu öffnen. Hier findest Du zu jedem Nudge einzelne Konfigurationsoptionen (Ein- und Ausschalten, bestimmte Seiten von der Ausspielung ausschließen). Die Nudges sind standardmäßig deaktiviert. Bitte aktiviere Deine gewünschten Inhalte, um die brytes empathy engine für Deinen Shop zu aktivieren. Sobald die Nudges aktiviert sind, startet die Ausspielung sofort für die passenden Nutzer und das Trackingsystem misst im Hintergrund automatisch mit, wie sich die relevanten KPI durch den Einsatz der Nudges verändern. Das Design deiner Nudges kannst du selbstverständlich noch an deine CI anpassen.</p><p><br /></p><p>Solltest du Fragen haben, schaue gerne in unserem <a href=\"https://www.brytes.de/faq\" target=\"_blank\" rel=\"noreferrer noopener\">FAQ</a> Bereich nach der passenden Antwort oder melde dich bei uns unter support@brytes.de.</p>","version":"1.0.2","changelog":[{"version":"1.0.2","text":"<p>- minor bug fixing</p><p>- Improve perfomance</p>","creationDate":{"date":"2023-04-12 15:51:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Generel code refactoring</p><p>- Minor changes in rule set </p>","creationDate":{"date":"2023-03-14 13:10:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>This is the initial version of the brytes Shopware app.</p>","creationDate":{"date":"2023-01-25 14:30:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=synai30687495555","redirectToStore":false,"lowestPriceValue":0}