{"id":16405,"name":"ZeobvAITools","code":"zeobv55042180547","lastChange":{"date":"2023-07-18 11:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpngmFSn","examplePageUrl":"","moduleKey":"ZeobvAITools","creationDate":{"date":"2023-01-03 12:05:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-01-13 11:10:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-01-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-01-04 17:01:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4302,"prefix":"Diztech","name":"DizTech BV.","website":"//www.diztech.nl","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4302_diztech-icon-small.png"},"infos":[{"id":28645,"name":"AI SEO Inhalte","description":"<p>Willkommen im Zeitalter der KI. Diese Erweiterung wird Ihr bester Freund sein, denn sie hilft Ihnen, die Inhalte direkt vom Admin Ihres Shopware-Shops aus zu verwalten.</p><p>Über ein einfaches Onboarding-Verfahren verbinden Sie Ihren Webshop mit unserer KI-Engine, woraufhin Sie mit einem Mausklick von der Produktdetailseite aus SEO-Inhalte erstellen können.</p><p>Weitere Funktionen sind noch in Vorbereitung!&nbsp;</p><h3>Vorteile</h3><p><b>Erstellen Sie bessere SEO-Inhalte</b></p><p>Nutzen Sie KI, um SEO-Inhalte für Sie zu erstellen. Mit einem Klick auf eine Schaltfläche können Sie jetzt einen SEO-Titel und eine SEO-Beschreibung auf der Grundlage des Produktnamens erstellen und Schlüsselwörter direkt aus der Produktbeschreibung extrahieren. Inhalte, die automatisch für Suchmaschinen optimiert sind.</p><p><b>Sparen Sie Zeit</b><br></p><p>Mit Hilfe des AI Tools-Plugins können Sie eine Menge Zeit sparen, die Sie sonst mit dem Schreiben von Inhalten verbringen würden.</p><h3>Richtlinie für Anwendungsfälle</h3><p>Durch das Herunterladen/Installieren dieser Erweiterung erklären Sie sich damit einverstanden, dass Sie die Erweiterung nicht für die folgenden Anwendungsfälle nutzen werden:</p><p><b>Illegale oder schädliche Branchen</b></p><p><i>Dazu gehören Glücksspiel, Zahltagskredite, illegale Substanzen, Pseudo-Pharmazeutika, Multi-Level-Marketing, Waffenentwicklung, Kriegsführung, Cyberkriminalität, Erotikindustrie, Spam und unzulässige Überwachung.</i></p><p><b>Förderung von Unehrlichkeit</b></p><p><i>Umfasst die Erstellung von Testimonials, die Erstellung von Produkt- oder Dienstleistungsrezensionen, Unehrlichkeit im Bildungsbereich, Vertragsbetrug und Astroturfing.</i></p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt des Checkouts&nbsp;geändert oder verbessert haben möchten, kontaktieren Sie uns über das&nbsp;Shopware-Support Portal, indem Sie das Plugin auswählen oder&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a><b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\">&nbsp;</b>eine Nachricht an senden. Geben Sie dabei unbedingt Ihre&nbsp;aktuelle Shopware-Version und die Version des von Ihnen verwendeten Plugins an.&nbsp;Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele&nbsp;Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer&nbsp;Testumgebung gewähren. Auf diese Weise können wir das Problem selbst&nbsp;reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p>","installationManual":"<h2>Starten Sie mit der Erweiterung:</h2><h3>Installation</h3><p>- Entpacken Sie die Zip-Datei in den Ordner custom/apps oder verwenden Sie den Shopware-Erweiterungsmanager, und installieren und aktivieren Sie das Plugin über die Befehlszeile oder über den Erweiterungsmanager in der Verwaltung.</p><p>- Unter dem Menüpunkt Erweiterungen erscheint ein neuer Untermenüpunkt mit der Bezeichnung \"AI Tools - Onboarding\".</p><p>- Erstellen Sie ein neues Konto oder melden Sie sich mit einem bestehenden Konto an. Beachten Sie jedoch, dass ein Shop nur mit einem Konto verknüpft werden kann.</p><p>- Melden Sie sich für einen Plan an und schließen Sie den Bezahlvorgang ab.</p><p>- Danach werden Sie wieder zum Shop zurückgeleitet.</p><h4>Achtung! Wenn Sie eine der Generierungsoptionen verwenden, wird der vorherige Wert überschrieben.</h4><h3>Einen SEO-Titel generieren</h3><p>- Gehen Sie zu einem Produkt Ihrer Wahl über die Suchleiste oder \"Kataloge &gt; Produkte\".</p><p>- Vergewissern Sie sich, dass das von Ihnen ausgewählte Produkt einen passenden Titel hat, denn der SEO-Titel wird auf der Grundlage dieses Wertes generiert.</p><p>- Navigieren Sie zur Registerkarte SEO</p><p>- In der oberen Leiste finden Sie eine neue Schaltfläche mit einem ⋯ Symbol.</p><p>- Klicken Sie auf diese Schaltfläche und es werden Ihnen einige Aktionen angeboten</p><p>- Klicken Sie auf die Option \"SEO-Titel generieren\".</p><p>- Klicken Sie auf diese Aktion und warten Sie ein paar Augenblicke.</p><p>- Wenn die Aktion erfolgreich war, wird die Seite aktualisiert. Das Feld \"Meta-Titel\" wird Ihren frisch generierten SEO-Titel enthalten</p><h3>Eine SEO-Beschreibung generieren</h3><p>- Gehen Sie über die Suchleiste oder \"Kataloge &gt; Produkte\" zu einem Produkt Ihrer Wahl.</p><p>- Vergewissern Sie sich, dass das von Ihnen ausgewählte Produkt einen passenden Titel hat, denn die SEO-Beschreibung wird auf der Grundlage dieses Wertes erstellt.</p><p>- Navigieren Sie zur Registerkarte SEO</p><p>- In der oberen Leiste finden Sie eine neue Schaltfläche mit einem ⋯ Symbol.</p><p>- Klicken Sie auf diese Schaltfläche und es werden Ihnen einige Aktionen angeboten</p><p>- Klicken Sie auf die Option \"SEO-Beschreibung generieren\".</p><p>- Klicken Sie auf diese Aktion und warten Sie ein paar Augenblicke.</p><p>- Wenn die Aktion erfolgreich war, wird die Seite aktualisiert. Das Feld \"Meta-Beschreibung\" wird Ihre frisch generierte SEO-Beschreibung enthalten</p><h3>SEO und Suchbegriffe generieren</h3><p>- Gehen Sie über die Suchleiste oder \"Kataloge &gt; Produkte\" zu einem Produkt Ihrer Wahl.</p><p>- Vergewissern Sie sich, dass das von Ihnen gewählte Produkt eine passende Beschreibung hat, denn die Schlüsselwörter werden auf der Grundlage der Beschreibung des Produkts generiert.</p><p>- Navigieren Sie zur Registerkarte SEO</p><p>- In der oberen Leiste finden Sie eine neue Schaltfläche mit einem ⋯ Symbol.</p><p>- Klicken Sie auf diese Schaltfläche und es werden Ihnen einige Aktionen angeboten</p><p>- Klicken Sie auf die Option \"Schlüsselwörter generieren\".</p><p>- Klicken Sie auf diese Aktion und warten Sie ein paar Augenblicke.</p><p>- Wenn die Aktion erfolgreich war, wird die Seite aktualisiert. Die Felder \"SEO-Schlüsselwörter\" und \"Suchschlüsselwörter\" enthalten nun Ihre frisch generierten Schlüsselwörter.</p><h3>Generierung von KI-Kategorie-Inhalten</h3><p>Wir stellen Ihnen ein Snippet zur Verwendung in jedem der Inhaltsfelder der Kategorie zur Verfügung, z. B. in den Konfigurationsfeldern für die Beschreibung oder den Shopping Experience Content.</p><p>Das Snippet ist wie folgt aufgebaut:</p><p>{= Ihr Satz hier (maximale Anzahl von Wörtern)=}</p><p>Nehmen Sie das folgende Beispiel:</p><p>{= Schreiben Sie einen Inhalt über Küchenzubehör (500)=}</p>","shortDescription":"Fügen Sie AI zu Ihrem Webshop hinzu und profitieren Sie von Funktionen, die den SEO-Optimierungsprozess erleichtern. Generieren Sie SEO-Titel, Beschreibungen und Schlüsselwörter...","highlights":"Schlüsselwortgenerierung (sowohl für SEO als auch für die Suche!)\nMit einem Klick auf eine Schaltfläche werden SEO-optimierte Inhalte auf der Grundlage Ihrer Produktinformationen generiert\nLassen Sie sich von KI-generierten Inhalten inspirieren","features":"Automatisieren Sie die Erstellung von relevanten Suchbegriffen\nShortcut für die Erstellung eines attraktiven SEO-Produkttitels\nShortcut für die Erstellung einer attraktiven SEO-Produktbeschreibung\nNutzen Sie Ihre Inhalte, um die KI automatisch zu trainieren\nVerwenden Sie Smart Snippets in Ihren Kategorie-Inhalten, um schnell große Mengen an Inhalten zu generieren"},{"id":28646,"name":"AI SEO Content","description":"<p>Welcome to the age of AI. This extension will become your best friend as it helps you manage the content straight from the admin of your Shopware shop.</p><p>Via an easy onboarding process, you connect your webshop to our AI engine, whereafter you can easily generate SEO content from the product detail page with the click of a button.</p><p>More features are still to come!&nbsp;</p><h3>Advantages</h3><p><b>Create better SEO content</b></p><p>Use AI to generate SEO content for you. With the click of a button, you can now generate an SEO title and description based on the product name and extract keywords straight out of the product description. Content that is automatically optimized for search engines.</p><p><b>Safe time</b></p><p>With the help of the AI Tools plugin, you can save a massive amount of time you would otherwise spend in writing content.</p><h3>Use case policy</h3><p>By downloading/installing this extension you agree you won't be using the extension for the following use cases:</p><p><b>Illegal or harmful industries</b><br><i>Includes gambling, payday lending, illegal substances, pseudo-pharmaceuticals, multi-level marketing, weapons development, warfare, cybercrime, adult industries, spam, and non-consensual surveillance.</i></p><p><b>Promoting dishonesty</b></p><p><i>Includes testimonial generation, product or service review generation, educational dishonesty, contract cheating, and astroturfing.</i><br></p><h3>Contact</h3><p>If something unexpected has happened or like to see an aspect of the checkout changed or improved, contact us via the Shopware support portal by selecting the plugin or by sending a message to&nbsp;<a href=\"mailto://plugins@zeo.nl\" target=\"_blank\" rel=\"noreferrer\">plugins@zeo.nl</a>. Be sure to include your current Shopware version and the version of the plugin you are using. To accelerate the support process it's best to provide as much information as possible or provide us with access to your test environment. This way we can reproduce the issue for ourselves and come up with a solution more quickly.</p><h3>About us</h3><p>The team of professionals at Zeo has over 15 years of experience in both online marketing and web development. With this experience, we have helped over 80 clients in 11 different countries, both B2C and B2B. Several new e-commerce shops have been built from the ground up using the Shopware platform and Zeo’s plugins. Notable customers of ours include Simon Lévelt, 24Kae, ABN AMRO Bank, and Allianz Global Assistance. For more information about us, visit&nbsp;<a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer\">https://www.zeo.nl/</a>.</p><p><br></p>","installationManual":"<h2>Get started with the extension:</h2><h3>Installation</h3><p>-&nbsp; &nbsp;Extract the zip file in the custom/apps folder or use the Shopware extension manager, and install and activate the plugin using the command line or via the extension manager in the administration.</p><p>-&nbsp; &nbsp;A new submenu item will appear under the Extensions menu item labeled \"AI Tools - Onboarding\"</p><p>-&nbsp; &nbsp;Create a new account or sign in with an existing account, just be aware a shop can only be linked to one account.</p><p>-&nbsp; &nbsp;Sign up for a plan and complete the checkout process</p><p>-&nbsp; &nbsp;You'll be redirected back to the shop afterward</p><h4>Heads-up! When using any of the generation options the previous value will be overwritten.</h4><h3>Generating an SEO title</h3><p>-&nbsp; &nbsp;Head over to a product of your choice via the search bar or \"Catalogues &gt; Products\"</p><p>-&nbsp; &nbsp;Be sure the product you select has an applicable Title, the SEO title will be generated based on this value.</p><p>-&nbsp; &nbsp;Navigate to the SEO tab</p><p>-&nbsp; &nbsp;In the top bar you'll find a new button with an ⋯ icon.</p><p>-&nbsp; &nbsp;Click this button and you'll be presented with some actions</p><p>-&nbsp; &nbsp;Click the \"Generate SEO title\" option</p><p>-&nbsp; &nbsp;Click the on this action and wait a few moments.</p><p>-&nbsp; &nbsp;On success, the page will be refreshed. The \"Meta title\" field will contain your freshly generated SEO title</p><h3>Generating an SEO description</h3><p>-&nbsp; &nbsp;Head over to a product of your choice via the search bar or \"Catalogues &gt; Products\"</p><p>-&nbsp; &nbsp;Be sure the product you select has an applicable Title, the SEO description will be generated based on this value.</p><p>-&nbsp; &nbsp;Navigate to the SEO tab</p><p>-&nbsp; &nbsp;In the top bar you'll find a new button with an ⋯ icon.</p><p>-&nbsp; &nbsp;Click this button and you'll be presented with some actions</p><p>-&nbsp; &nbsp;Click the \"Generate SEO Description\" option</p><p>-&nbsp; &nbsp;Click the on this action and wait a few moments.</p><p>-&nbsp; &nbsp;On success, the page will be refreshed. The \"Meta description\" field will contain your freshly generated SEO description</p><h3>Generating an SEO and Search keywords</h3><p>-&nbsp; &nbsp;Head over to a product of your choice via the search bar or \"Catalogues &gt; Products\"</p><p>-&nbsp; &nbsp;Be sure the product you select has an applicable Description, the keywords will be generated based on the description of the product.</p><p>-&nbsp; &nbsp;Navigate to the SEO tab</p><p>-&nbsp; &nbsp;In the top bar you'll find a new button with an ⋯ icon.</p><p>-&nbsp; &nbsp;Click this button and you'll be presented with some actions</p><p>-&nbsp; &nbsp;Click the \"Generate Keywords\" option</p><p>-&nbsp; &nbsp;Click the on this action and wait a few moments.</p><p>-&nbsp; &nbsp;On success, the page will be refreshed. The \"SEO keywords\" and Search Keywords fields will contain your freshly generated keywords</p><h3>Generating AI category content</h3><p>We offer a free style snippet for use in any of the category content fields like the description or Shopping Experience Content configuration fields.</p><p>The snippet is structured as follows:</p><p>{= Your phrase here (max. number of words)=}</p><p>Take the following example:</p><p>{= Write some content about kitchen supplies (500)=}</p>","shortDescription":"Add AI to your webshop and benefit from functions that ease the SEO optimization process. Generate SEO titles, descriptions, and keywords with the click of a button.","highlights":"Keyword generation (Both for SEO and search!)\nWith the click of a button SEO-optimized content is generated based on your product information\nGet inspired by AI generated content","features":"Automate the creation of relevant search terms\nQuick action to generate an attractive product SEO title\nQuick action to generate an attractive product SEO description\nUse your content to automatically train the AI\nUse smart snippets in your category content to quickly generate vast amounts of content"}],"addons":["ignorePrefixCheck"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":166999,"bookingKey":"zeobv55042180547","bookingText":"AI Tools - Intelligent shop management","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpU0Vxp1","preview":true,"priority":100,"id":104672},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBuDfKz","preview":false,"priority":90,"id":107783},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpov6gh0","preview":false,"priority":80,"id":107782}],"comments":[],"ratingAverage":0,"label":"AI SEO Inhalte","description":"<p>Willkommen im Zeitalter der KI. Diese Erweiterung wird Ihr bester Freund sein, denn sie hilft Ihnen, die Inhalte direkt vom Admin Ihres Shopware-Shops aus zu verwalten.</p><p>Über ein einfaches Onboarding-Verfahren verbinden Sie Ihren Webshop mit unserer KI-Engine, woraufhin Sie mit einem Mausklick von der Produktdetailseite aus SEO-Inhalte erstellen können.</p><p>Weitere Funktionen sind noch in Vorbereitung! </p><h3>Vorteile</h3><p><b>Erstellen Sie bessere SEO-Inhalte</b></p><p>Nutzen Sie KI, um SEO-Inhalte für Sie zu erstellen. Mit einem Klick auf eine Schaltfläche können Sie jetzt einen SEO-Titel und eine SEO-Beschreibung auf der Grundlage des Produktnamens erstellen und Schlüsselwörter direkt aus der Produktbeschreibung extrahieren. Inhalte, die automatisch für Suchmaschinen optimiert sind.</p><p><b>Sparen Sie Zeit</b><br /></p><p>Mit Hilfe des AI Tools-Plugins können Sie eine Menge Zeit sparen, die Sie sonst mit dem Schreiben von Inhalten verbringen würden.</p><h3>Richtlinie für Anwendungsfälle</h3><p>Durch das Herunterladen/Installieren dieser Erweiterung erklären Sie sich damit einverstanden, dass Sie die Erweiterung nicht für die folgenden Anwendungsfälle nutzen werden:</p><p><b>Illegale oder schädliche Branchen</b></p><p><i>Dazu gehören Glücksspiel, Zahltagskredite, illegale Substanzen, Pseudo-Pharmazeutika, Multi-Level-Marketing, Waffenentwicklung, Kriegsführung, Cyberkriminalität, Erotikindustrie, Spam und unzulässige Überwachung.</i></p><p><b>Förderung von Unehrlichkeit</b></p><p><i>Umfasst die Erstellung von Testimonials, die Erstellung von Produkt- oder Dienstleistungsrezensionen, Unehrlichkeit im Bildungsbereich, Vertragsbetrug und Astroturfing.</i></p><h3>Kontakt</h3><p>Wenn etwas Unerwartetes passiert ist oder Sie einen Aspekt des Checkouts geändert oder verbessert haben möchten, kontaktieren Sie uns über das Shopware-Support Portal, indem Sie das Plugin auswählen oder <a href=\"mailto:\" target=\"_blank\" rel=\"noreferrer noopener\">plugins@zeo.nl</a><b> </b>eine Nachricht an senden. Geben Sie dabei unbedingt Ihre aktuelle Shopware-Version und die Version des von Ihnen verwendeten Plugins an. Um den Support-Prozess zu beschleunigen, ist es am besten, wenn Sie uns so viele Informationen wie möglich zur Verfügung stellen oder uns Zugang zu Ihrer Testumgebung gewähren. Auf diese Weise können wir das Problem selbst reproduzieren und schneller eine Lösung finden.</p><h3>Über uns</h3><p>Das professionelle Team von Zeo verfügt über mehr als 15 Jahre Erfahrung in den Bereichen Online-Marketing und Web-Entwicklung. Mit dieser Erfahrung haben wir über 80 Kunden in 11 verschiedenen Ländern geholfen, sowohl B2C als auch B2B. Mehrere neue E-Commerce-Shops wurden von Grund auf mit der Shopware-Plattform und den Plugins von Zeo entwickelt. Zu unseren namhaften Kunden gehören Simon Lévelt, 24Kae, ABN AMRO Bank und Allianz Global Assistance. Weitere Informationen über uns finden Sie unter <a href=\"https://www.zeo.nl/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.zeo.nl/</a>.</p>","installationManual":"<h2>Starten Sie mit der Erweiterung:</h2><h3>Installation</h3><p>- Entpacken Sie die Zip-Datei in den Ordner custom/apps oder verwenden Sie den Shopware-Erweiterungsmanager, und installieren und aktivieren Sie das Plugin über die Befehlszeile oder über den Erweiterungsmanager in der Verwaltung.</p><p>- Unter dem Menüpunkt Erweiterungen erscheint ein neuer Untermenüpunkt mit der Bezeichnung \"AI Tools - Onboarding\".</p><p>- Erstellen Sie ein neues Konto oder melden Sie sich mit einem bestehenden Konto an. Beachten Sie jedoch, dass ein Shop nur mit einem Konto verknüpft werden kann.</p><p>- Melden Sie sich für einen Plan an und schließen Sie den Bezahlvorgang ab.</p><p>- Danach werden Sie wieder zum Shop zurückgeleitet.</p><h4>Achtung! Wenn Sie eine der Generierungsoptionen verwenden, wird der vorherige Wert überschrieben.</h4><h3>Einen SEO-Titel generieren</h3><p>- Gehen Sie zu einem Produkt Ihrer Wahl über die Suchleiste oder \"Kataloge &gt; Produkte\".</p><p>- Vergewissern Sie sich, dass das von Ihnen ausgewählte Produkt einen passenden Titel hat, denn der SEO-Titel wird auf der Grundlage dieses Wertes generiert.</p><p>- Navigieren Sie zur Registerkarte SEO</p><p>- In der oberen Leiste finden Sie eine neue Schaltfläche mit einem ⋯ Symbol.</p><p>- Klicken Sie auf diese Schaltfläche und es werden Ihnen einige Aktionen angeboten</p><p>- Klicken Sie auf die Option \"SEO-Titel generieren\".</p><p>- Klicken Sie auf diese Aktion und warten Sie ein paar Augenblicke.</p><p>- Wenn die Aktion erfolgreich war, wird die Seite aktualisiert. Das Feld \"Meta-Titel\" wird Ihren frisch generierten SEO-Titel enthalten</p><h3>Eine SEO-Beschreibung generieren</h3><p>- Gehen Sie über die Suchleiste oder \"Kataloge &gt; Produkte\" zu einem Produkt Ihrer Wahl.</p><p>- Vergewissern Sie sich, dass das von Ihnen ausgewählte Produkt einen passenden Titel hat, denn die SEO-Beschreibung wird auf der Grundlage dieses Wertes erstellt.</p><p>- Navigieren Sie zur Registerkarte SEO</p><p>- In der oberen Leiste finden Sie eine neue Schaltfläche mit einem ⋯ Symbol.</p><p>- Klicken Sie auf diese Schaltfläche und es werden Ihnen einige Aktionen angeboten</p><p>- Klicken Sie auf die Option \"SEO-Beschreibung generieren\".</p><p>- Klicken Sie auf diese Aktion und warten Sie ein paar Augenblicke.</p><p>- Wenn die Aktion erfolgreich war, wird die Seite aktualisiert. Das Feld \"Meta-Beschreibung\" wird Ihre frisch generierte SEO-Beschreibung enthalten</p><h3>SEO und Suchbegriffe generieren</h3><p>- Gehen Sie über die Suchleiste oder \"Kataloge &gt; Produkte\" zu einem Produkt Ihrer Wahl.</p><p>- Vergewissern Sie sich, dass das von Ihnen gewählte Produkt eine passende Beschreibung hat, denn die Schlüsselwörter werden auf der Grundlage der Beschreibung des Produkts generiert.</p><p>- Navigieren Sie zur Registerkarte SEO</p><p>- In der oberen Leiste finden Sie eine neue Schaltfläche mit einem ⋯ Symbol.</p><p>- Klicken Sie auf diese Schaltfläche und es werden Ihnen einige Aktionen angeboten</p><p>- Klicken Sie auf die Option \"Schlüsselwörter generieren\".</p><p>- Klicken Sie auf diese Aktion und warten Sie ein paar Augenblicke.</p><p>- Wenn die Aktion erfolgreich war, wird die Seite aktualisiert. Die Felder \"SEO-Schlüsselwörter\" und \"Suchschlüsselwörter\" enthalten nun Ihre frisch generierten Schlüsselwörter.</p><h3>Generierung von KI-Kategorie-Inhalten</h3><p>Wir stellen Ihnen ein Snippet zur Verwendung in jedem der Inhaltsfelder der Kategorie zur Verfügung, z. B. in den Konfigurationsfeldern für die Beschreibung oder den Shopping Experience Content.</p><p>Das Snippet ist wie folgt aufgebaut:</p><p>{= Ihr Satz hier (maximale Anzahl von Wörtern)=}</p><p>Nehmen Sie das folgende Beispiel:</p><p>{= Schreiben Sie einen Inhalt über Küchenzubehör (500)=}</p>","version":"1.1.1","changelog":[{"version":"1.1.1","text":"<p>-   Fixed critical bugs in category content generation</p><p><br /></p>","creationDate":{"date":"2023-02-02 14:40:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>-   Added freestyle AI content generation for categories</p><p><br /></p>","creationDate":{"date":"2023-01-31 15:38:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>-   First version for Shopware 6</p><p><br /></p>","creationDate":{"date":"2023-01-03 14:14:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=zeobv55042180547","redirectToStore":false,"lowestPriceValue":0}