{"id":16469,"name":"ReepaBillwerk","code":"Reepa96857062844","lastChange":{"date":"2023-07-18 11:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8gNwFz","examplePageUrl":"","moduleKey":"ReepaBillwerk","creationDate":{"date":"2023-01-19 11:24:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-04-19 15:27:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-04-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-17 13:43:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3545,"prefix":"Reepa","name":"Billwerk+","website":"//billwerk.plus","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3545_BiLLWERK%252B_social_icon_neg_RGB_transparent.jpg"},"infos":[{"id":28759,"name":"Billwerk+","description":"<p>Das Plugin von Billwerk+ ist ein umfassendes Zahlungs- und Abonnement-Plugin für die E-Commerce-Plattform Shopware. Es ermöglicht Händlern, die Zahlungs- und Abonnementdienste von Billwerk+ einfach in ihren Shopware-Shop zu integrieren, sodass Kunden sichere Zahlungen vornehmen und wiederkehrende Dienste abonnieren können.</p><p><br></p><p>Das Plugin unterstützt verschiedene Zahlungsmethoden, darunter Kredit- und Debitkarten, mobile Zahlungen, Ratenzahlungen, Bankumleitungen, Lastschrift und mehr. Dies erleichtert Kunden die Auswahl der für sie am besten geeigneten Zahlungsmethode und trägt zur Steigerung der Konversionsraten bei.</p><p><br></p><p>Darüber hinaus ermöglicht die Abonnementfunktion Händlern, wiederkehrende Abrechnungen für Produkte oder Dienstleistungen einzurichten, wodurch der Abrechnungsprozess einfach verwaltet und automatisiert werden kann. Dies ist besonders nützlich für Unternehmen, die abonnementbasierte Produkte oder Dienstleistungen anbieten.</p><p><br></p><p>Mit Billwerk+ können Shopware-Händler ihre Zahlungen und Abonnements einfach verwalten, ihren Umsatz steigern und ihre Geschäftsabläufe optimieren. Das Plugin bietet auch einen detaillierten Transaktionsverlauf, der es Händlern ermöglicht, alle Transaktionen und Abonnements in Echtzeit zu verfolgen und zu überwachen.</p><p><br></p><p>Darüber hinaus tragen die Betrugspräventionsfunktionen von Billwerk+ dazu bei, Transaktionen sicher zu halten und das Betrugsrisiko zu verringern. Insgesamt ist Billwerk+ ein leistungsstarkes und flexibles Plugin, das Shopware-Händlern helfen kann, ihr Geschäft zu verwalten und auszubauen.</p>","installationManual":"<p>Der Einstieg in Billwerk+ für Shopware ist einfach und unkompliziert. Hier sind die grundlegenden Schritte, die Sie befolgen müssen:&nbsp;</p><p>1. Installieren Sie das Billwerk+-Plugin in Ihrem Shopware-Shop. Dies kann über den Shopware-Plugin-App-Store erfolgen.</p><p>&nbsp;2. Konfigurieren Sie das Plugin, indem Sie die API-Anmeldedaten Ihres Billwerk+-Kontos eingeben oder sich einfach anmelden.</p><p>&nbsp;3. Fügen Sie Ihrem Shopware-Shop die Billwerk+-Zahlungsmethoden hinzu, indem Sie die Zahlungsmethoden in Shopware aktivieren. Denken Sie daran, die Zahlungsmethoden auch in Billwerk+ zu aktivieren.</p><p>4. Testen Sie das Plugin, indem Sie eine Testtransaktion durchführen und sicherstellen, dass alles wie erwartet funktioniert.</p><p>5. Sobald Sie bestätigt haben, dass das Plugin korrekt funktioniert, können Sie live gehen und mit der Annahme von Zahlungen beginnen.</p><p><br></p><p>Es ist wichtig zu beachten, dass Sie sich vor der Verwendung von Billwerk+ für ein Konto bei Billwerk+ anmelden und die richtigen Anmeldeinformationen erhalten müssen, um das Plugin zu konfigurieren. \n\nBitte lesen Sie auch unbedingt die Dokumentation oder wenden Sie sich an den Support von Billwerk+, um das Plugin optimal zu nutzen und eventuell auftretende Probleme zu beheben. \n</p>","shortDescription":"Billwerk+ für Shopware ermöglicht sichere Zahlungen und Abonnements, unterstützt mehrere Zahlungsmethoden, ermöglicht eine einfache Verwaltung wiederkehrender Rechnungen und optimiert.","highlights":"Billwerk+ bietet einen Acquirer-unabhängigen Ansatz, der Ihnen volle Flexibilität gibt. \nEin grenzüberschreitendes Zahlungsgateway in der EU mit über 25 lokalen Zahlungsmethoden. \nPassen Sie Ihren Checkout mit den vielen Gestaltungsoptionen an. \nIntegrierte Abonnementverwaltungsplattform. Einer der absolut besten in Europa. \nIntuitive und benutzerfreundliche Verwaltungsoberfläche für den täglichen Betrieb und die Wartung.","features":"Unterstützt die folgenden Zahlungsmethoden: Dankort/Visa Dankort, Visa, Mastercard, Maestro, Visa Electron, Diners Club, American Express, UnionPay, JCB, Forbrugsforeningen, MobilePay Online, ViaBill, Resurs Bank, Paypal, Sepa Direct Debit, Przelewy24, GiroPay, Verkkopanki, iDEAL, Klarna Jetzt bezahlen, Klarna Später bezahlen, Klarna Slice It, Swish, Vipps, BLIK, Apple Pay und Google Pay. \nDank des Acquirer-unabhängigen Ansatzes unterstützt Billwerk+ eine breite Palette von Acquirern, sodass Händler den Acquirer auswählen können, der ihren Geschäftsanforderungen am besten entspricht. Zu diesen Acquirern gehören Elavon, Valitor, Nets, Swedbank, Worldline, Clearhaus, Global Payments, CMCIC, SIX, Worldpay, AIB MS, Barclays, First Data EU, Colombia CredibanCo und Thailand Kasikorn Bank (Kbank). \nUnterstützt 3DS 2.X und SCA, um das höchste Maß an Sicherheit für die Transaktionen zu gewährleisten. \nCheckout-Anpassungsoptionen für den Zahlungs-Checkout, z. B. Ändern von Farbschemata, Hinzufügen von benutzerdefinierten Logos, Anpassen des Layouts und Verwenden von benutzerdefinierten CSS-Stilen, sodass der Checkout für ein besseres Kundenerlebnis an die Website des Händlers angepasst werden kann. \nBetrugspräventionstools, die dazu beitragen, Transaktionen sicher zu halten und das Betrugsrisiko zu verringern. \nAbonnementpläne. Einrichten mehrerer Abonnementpläne mit unterschiedlichen Abrechnungszeiträumen und Preisen. \nKündigungs- und Bindungsfrist.  Legen Sie die Kündigungsfrist fest, um eine bestimmte Anzahl von Perioden nach der Kündigung des Abonnements zu garantieren..  Definieren Sie auch eine Bindungsfrist, um eine bestimmte Anzahl von Perioden für ein Abonnement ohne Kündigung zu garantieren. Sie können auch die automatische Beendigung eines Abonnements zum jetzigen Zeitpunkt oder zum Ende des Zeitraums festlegen. Ihnen stehen somit mehrere Optionen zur Verfügung. \nUpgrade und Downgrade. Sofortiges Up- oder Downgrade von Abonnements. \nParallele Preisanpassung. Mehrere Optionen zur Preisanpassung, z.B. neue Preise für neue Abonnenten und alte Preise für bestehende Abonnenten. \nRabatte, Coupons und Probezeiträume. Definieren Sie prozentuale und feste Rabatte für Abonnements. Coupons sind Codes, die Kunden gegeben werden, die mit diesen dann einen Rabatt einlösen können. Definieren Sie einen Testzeitraum, um einen kostenlosen Zeitraum für Neukunden anbieten zu können. \nZusätzliche Kosten. Weisen Sie einem Kunden oder einem Abonnement jederzeit zusätzliche Kosten zu, diese werden der nächsten Rechnung hinzugefügt. \nKredit. Weisen Sie ein Abo-Guthaben zu, das bei der nächsten Rechnung und eventuell bei den folgenden Rechnungen abgezogen wird. \nMahnung. Bei fehlgeschlagener Zahlung kommuniziert Billwerk+ mit dem Kunden, um aktualisierte Karteninformationen zu erhalten. Die Einrichtung des Mahnprozesses kann im Billwerk+ Admin vorgenommen werden. \nE-Mail-Vorlagen. Vorlagen für 20 verschiedene E-Mails, die basierend auf Triggern gesendet werden: Belege, Willkommensmail und so weiter."},{"id":28760,"name":"Billwerk+","description":"<p>The plugin from Billwerk+ is a comprehensive payment and subscription plugin for the Shopware e-commerce platform. It allows merchants to easily integrate Billwerk+'s payment and subscription services into their Shopware store, allowing customers to make secure payments and subscribe to recurring services.&nbsp;</p><p>The plugin supports various payment methods, including credit and debit cards, mobile payments, installments, bank redirects, direct debit, and more. This makes it easy for customers to choose the payment method that works best for them and helps to increase conversion rates.&nbsp;</p><p>Additionally, the subscription feature allows merchants to set up recurring billing for products or services, making it easy to manage and automate the billing process. This is particularly useful for businesses that offer subscription-based products or services.&nbsp;</p><p>With Billwerk+, Shopware merchants can easily manage their payments and subscriptions, increasing their revenue and streamlining their business operations. The plugin also offers a detailed transaction history, which allows merchants to track and monitor all transactions and subscriptions in real-time.</p><p>Furthermore, Billwerk+ fraud prevention features help to keep transactions secure and reduce the risk of fraud. Overall, Billwerk+ is a powerful and flexible plugin that can help Shopware merchants to manage and grow their businesses.</p>","installationManual":"<p>Getting started with Billwerk+ for Shopware is simple and straightforward. Here are the basic steps to follow:</p><p><br></p><p>1. Install the Billwerk+ plugin on your Shopware store. This can be done through the Shopware plugin app store.</p><p>2. Configure the plugin by entering your Billwerk+ account API credentials or simply logging in.</p><p>3. Add the Billwerk+ payment methods to your Shopware store by enabling the payment methods in Shopware. Remember to enable the payment methods in Billwerk+ as well.</p><p>4. Test the plugin by making a test transaction and ensuring that everything is working as expected.</p><p>5. Once you have confirmed that the plugin is working correctly, you can go live and start accepting payments.</p><p><br></p><p>It's important to note that, before starting to use Billwerk+, you will need to sign up for an account with Billwerk+ and get the right credentials to configure the plugin.</p><p>Please also make sure to read the documentation and support provided by Billwerk+ to get the most out of the plugin and troubleshoot any issues that may arise.</p>","shortDescription":"Billwerk+ for Shopware enables secure payments and subscriptions, supports multiple payment methods, allows easy recurring billing management, and streamlines business operations.","highlights":"Billwerk+ offers an acquirer-independent approach, giving you full flexibility.\nA cross-border payment gateway in the EU with +25 local payment methods.\nCustomize your checkout with the many styling options.\nBuilt-in subscription management platform. One of the absolute best in Europe.\nIntuitive and user-friendly admin interface for daily operations and maintenance.","features":"Supports the following payment methods: Dankort/Visa Dankort, Visa, Mastercard, Maestro, Visa Electron, Diners Club, American Express, UnionPay, JCB, Forbrugsforeningen, MobilePay Online, ViaBill, Resurs Bank, Paypal, Sepa Direct Debit, Przelewy24, GiroPay, Verkkopanki, iDEAL, Klarna Pay Now, Klarna Pay Later, Klarna Slice It, Swish, Vipps, BLIK, Apple Pay, and Google Pay. \nThanks to the acquirer-independent approach, Billwerk+ supports a wide range of acquirers, allowing merchants to choose the acquirer that best suits their business needs. These acquirers include Elavon, Valitor, Nets, Swedbank, Worldline, Clearhaus, Global Payments, CMCIC, SIX, Worldpay, AIB MS, Barclays, First Data EU, Colombia CredibanCo, and Thailand Kasikorn Bank (Kbank).\nSupports 3DS 2.X and SCA to ensure the highest level of security for the transactions.\nCheckout customization options for the payment checkout, such as changing color schemes, adding custom logos, adjusting the layout, and using custom CSS styles, allowing the checkout to match the merchant's website for a better customer experience.\nFraud prevention tools which help to keep transactions secure and reduce the risk of fraud.\nSubscription plans. Setting up multiple subscription plans with different billing sequences and prices.\nTermination and fixation period. Defining the notice period to guarantee a number of periods after subscription termination. Also define a binding period, to guarantee a number of periods for a subscription without closure. You can also set automatic termination of a subscription, now or by end of the period. Several options.\nUpgrading and downgrading. Instant up or downgrade of subscriptions.\nParallel price adjusting. Several options for adjusting prices, e.g. new price for new subscribers and old for old.\nDiscount, coupons, and trial periods. Define percent and fixed-amount discounts for subscriptions. Coupons are codes that can be given to customers who may then trigger a discount. mDefine a trial period to invoke a free period for new customers.\nAdditional costs. At any time, assign a customer or a subscription an additional cost, it will be added to the next invoice.\nCredit. Assign a subscription credit, which will be deducted next invoice and perhaps the following invoices.\nDunning. Upon failed payment, Reepay will communicate with the customer to get updated card information. The setup of the dunning process can be done from within the Reepay Admin.\nEmail templates. Templates for 20 different emails sent based upon triggers: receipt, welcome mail, and such."}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":167377,"bookingKey":"Reepa96857062844","bookingText":"Billwerk+","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkuE2ou","preview":true,"priority":0,"id":111003},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptfsWQ1","preview":false,"priority":0,"id":111004},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpj86GuU","preview":false,"priority":0,"id":111005},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0BMZSr","preview":false,"priority":0,"id":111006},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXwvjrL","preview":false,"priority":0,"id":111007}],"comments":[],"ratingAverage":0,"label":"Billwerk+","description":"<p>Das Plugin von Billwerk+ ist ein umfassendes Zahlungs- und Abonnement-Plugin für die E-Commerce-Plattform Shopware. Es ermöglicht Händlern, die Zahlungs- und Abonnementdienste von Billwerk+ einfach in ihren Shopware-Shop zu integrieren, sodass Kunden sichere Zahlungen vornehmen und wiederkehrende Dienste abonnieren können.</p><p><br /></p><p>Das Plugin unterstützt verschiedene Zahlungsmethoden, darunter Kredit- und Debitkarten, mobile Zahlungen, Ratenzahlungen, Bankumleitungen, Lastschrift und mehr. Dies erleichtert Kunden die Auswahl der für sie am besten geeigneten Zahlungsmethode und trägt zur Steigerung der Konversionsraten bei.</p><p><br /></p><p>Darüber hinaus ermöglicht die Abonnementfunktion Händlern, wiederkehrende Abrechnungen für Produkte oder Dienstleistungen einzurichten, wodurch der Abrechnungsprozess einfach verwaltet und automatisiert werden kann. Dies ist besonders nützlich für Unternehmen, die abonnementbasierte Produkte oder Dienstleistungen anbieten.</p><p><br /></p><p>Mit Billwerk+ können Shopware-Händler ihre Zahlungen und Abonnements einfach verwalten, ihren Umsatz steigern und ihre Geschäftsabläufe optimieren. Das Plugin bietet auch einen detaillierten Transaktionsverlauf, der es Händlern ermöglicht, alle Transaktionen und Abonnements in Echtzeit zu verfolgen und zu überwachen.</p><p><br /></p><p>Darüber hinaus tragen die Betrugspräventionsfunktionen von Billwerk+ dazu bei, Transaktionen sicher zu halten und das Betrugsrisiko zu verringern. Insgesamt ist Billwerk+ ein leistungsstarkes und flexibles Plugin, das Shopware-Händlern helfen kann, ihr Geschäft zu verwalten und auszubauen.</p>","installationManual":"<p>Der Einstieg in Billwerk+ für Shopware ist einfach und unkompliziert. Hier sind die grundlegenden Schritte, die Sie befolgen müssen: </p><p>1. Installieren Sie das Billwerk+-Plugin in Ihrem Shopware-Shop. Dies kann über den Shopware-Plugin-App-Store erfolgen.</p><p> 2. Konfigurieren Sie das Plugin, indem Sie die API-Anmeldedaten Ihres Billwerk+-Kontos eingeben oder sich einfach anmelden.</p><p> 3. Fügen Sie Ihrem Shopware-Shop die Billwerk+-Zahlungsmethoden hinzu, indem Sie die Zahlungsmethoden in Shopware aktivieren. Denken Sie daran, die Zahlungsmethoden auch in Billwerk+ zu aktivieren.</p><p>4. Testen Sie das Plugin, indem Sie eine Testtransaktion durchführen und sicherstellen, dass alles wie erwartet funktioniert.</p><p>5. Sobald Sie bestätigt haben, dass das Plugin korrekt funktioniert, können Sie live gehen und mit der Annahme von Zahlungen beginnen.</p><p><br /></p><p>Es ist wichtig zu beachten, dass Sie sich vor der Verwendung von Billwerk+ für ein Konto bei Billwerk+ anmelden und die richtigen Anmeldeinformationen erhalten müssen, um das Plugin zu konfigurieren. \n\nBitte lesen Sie auch unbedingt die Dokumentation oder wenden Sie sich an den Support von Billwerk+, um das Plugin optimal zu nutzen und eventuell auftretende Probleme zu beheben. \n</p>","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<p>* Added subscription features</p>","creationDate":{"date":"2023-04-25 08:14:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Version 1.0.0</p><p><br /></p><p>* Initial version</p>","creationDate":{"date":"2023-01-25 09:38:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Reepa96857062844","redirectToStore":false,"lowestPriceValue":0}