{"id":16566,"name":"xxx21LuigisBoxExtension","code":"xxx2198040688421","lastChange":{"date":"2023-07-20 07:32:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNRagCy","examplePageUrl":"","moduleKey":"xxx21LuigisBoxExtension","creationDate":{"date":"2023-02-09 17:33:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-06-27 13:30:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-06-30 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-29 11:28:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2767,"prefix":"xxx21","name":"Luigi's Box","website":"//www.luigisbox.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2767_Pictogram%2B03-04.png"},"infos":[{"id":28924,"name":"Luigi's Box Suche & Produktentdeckung Integration","description":"<h2>Was ist Luigi's Box?&nbsp;</h2><p><br></p><p>Luigi's Box ist ein Toolset mir der benutzerfreundlichsten Software, die Jahr&nbsp;für Jahr Auszeichnungen&nbsp;erhält und sich&nbsp;für Unternehmen jeder&nbsp;Größe, Art und in allen Segmenten eignet. Luigi's Box bietet personalisierte Produktentdeckungstools an, die von AI&nbsp;unterstützt werden, um die genauesten Suchergebnisse zu erzielen. Die Integration und Einrichtung sind reibungslos und erfordern keine IT-Kenntnisse.&nbsp;</p><p><br></p><h2>Luigi's Box Suche</h2><p><br></p><p>Luigi's Box bietet ein fortgeschrittenes AI-unterstütztes Suchtool an, mit dem Sie das Meiste aus Ihrer Suche herausholen können, indem Sie Daten sammeln und sie einsetzen, um bessere Geschäftsentscheidungen zu treffen. Lernen Sie von den Suchnutzern und verbessern Sie die Ergebnisse, basierend auf ihren Webseiteninteraktionen. Die Luigi’s Box Suche bietet verschiedene fortgeschrittene Funktionen an, die Ihre Suchfunktionen verfeinern, sodass Seitenbesucher die Produkte, nach denen sie suchen, schnell finden können und die verschwenderische Shoppingzeit reduziert wird.</p><p><br></p><h2>Luigi's Box Empfehler&nbsp;</h2><p><br></p><p>Luigi's Box bietet jedem Besucher, basierend auf vorherigen Interaktionen oder Präferenzen, personalisierte Empfehlerboxen an, die in jedem Bereich einer Webseite platziert werden können und sich wie ein natürlicher Bestandteil verhalten. Steigern Sie die Verkaufszahlen, indem Sie Verkaufsschlager, Produkte im Angebot oder andere Produkte empfehlen, die die Waren ergänzen, welche sich bereits im Warenkorb befinden.</p><p><br></p><h2>Luigi's Box Produktauflistung</h2><p><br>Luigi's Box bietet personalisierte Produktauflistungsseiten mit anpassbaren Facetten an, die die Browsingerfahrung verbessern. Kunden können die Produkte, die sie brauchen, ganz einfach finden, ihre Eigenschaften im Detail überprüfen, sie mit anderen Angeboten vergleichen, sich Produktbewertungen ansehen und schließlich einen Kauf tätigen.</p><p><br></p><h2>Luigi's Box Analytik</h2><p><br>Luigi's Box ist auch ein Analytiktool, das Ihnen relevante Informationen über die Leistung Ihrer Webseite gibt. Es stellt wertvolle Einblicke über die Interaktionen Ihrer Besucher zur Verfügung, analysiert die Suchnutzung, gibt Vorschläge für die Optimierung und ermöglicht die laufende Verbesserung Ihrer Konversionsraten.</p><p><br></p><h2>Was bringt Ihnen Luigi's Box?&nbsp;</h2><p><br>Luigi's Box bietet diverse intelligente Funktionen mit mehreren Anwendungsfällen an. Beispielsweise können Sie mit der Luigi’s Box Analytik Suchanfragen mit niedrigen Konversionen oder Ihren Warenkorbwert <b>entdecken</b> und diese Daten für Verbesserungen nutzen. <b>Lernen Sie, wie man Synonyme einsetzt</b>, um es zu vermeiden, Verkaufsgelegenheiten zu verpassen oder wie man Produkte fördert, um die Geschäftsziele zu unterstützen. <b>Erhöhen</b> Sie Ihre Umsätze mithilfe einer besseren Suche &amp; personalisierten Empfehlungen und steigern Sie die Suchbindung und -relevanz. <b>Vermeiden</b> Sie außerdem ergebnislose Suchanfragen ohne jegliche Klicks.</p>","installationManual":"<p>Luigi's Box bietet mehrere Implementierungsoptionen an, sodass unsere Kunden diejenige wählen können, die am besten zu ihnen passt. Für mehr Informationen über die Implementierung von Luigi’s Box auf Ihrer Webseite können Sie uns gerne über die&nbsp;<a href=\"https://www.luigisbox.de/implementierung/\" target=\"_blank\" rel=\"noreferrer\">Implementierungsseite</a>&nbsp;auf unserer Webseite kontaktieren.</p>","shortDescription":"Luigi's Box ist ein einzigartiges, technologisches Toolset, das AI und maschinelles Lernen einsetzt, um die Leistung Ihrer Webseite zu verbessern und Ihre Verkaufszahlen zu steigern.","highlights":"- 14-tägige kostenlose Analytik-Probephase\n- Reibungslose Selbstbedienungsintegration \n- Fortgeschrittene Funktionen für jede Plattform \n- Jahr für Jahr preisgekrönte Suche\n- Mehrere Tools in einer Lösung","features":"- AI, maschinelles Lernen, NLP - verbessert die Leistung der Suche und der Empfehlungen und steigert die Verkäufe \n- Sprachsuche - verbessert die Nutzererfahrung mit einer praktischen Suche, die mit Sprachbefehlen arbeitet \n- Tippfehler-Toleranz - garantiert korrekte Suchergebnisse, trotz Tippfehler \n- Synonymverwaltung - erhöht die Kundenzufriedenheit mit einer Suchfunktion, die Synonyme erkennt \n- Position pinnen - verbessert die Verkaufszahlen ausgewählter Produkte, indem ihnen in den Ergebnissen die gewünschte Position zugewiesen wird \n- Produktbanner in der Suche - regt das Kaufziel an, indem in der Suche Produkte mit anpassbaren Bannern beworben werden\n- Offline A/B Testing - verbessert die Leistung Ihrer Webseite mit Testing in einem Offline-Umfeld \n- Geo-Suche - bietet Ihren Kunden in verschiedenen Standorten die besten Produktergebnisse an \n- Dynamische Filter - spart Kunden Suchzeit und zeigt ihnen nur relevante Filteroptionen\n- Cross-Selling und Upselling - steigert Ihren durchschnittlichen Warenkorbwert \n- Personalisierung - steigert Ihre Umsätze mit einer Suche und mit Empfehlungen, die auf jeden Kunden zugeschnitten sind \n- Neuheitenpräferenz - bewirbt neue Produkte direkt in der Suche und erhöht die Verkaufschancen \n- Leistungsstarke Produkte - erfahren Sie mehr über Ihre Verkaufsschlager und nutzen Sie diese Daten für zukünftige Verbesserungen \n- Verpasste Gelegenheiten - entdecken Sie, warum und wie Sie Verkäufe verloren haben und stellen Sie sicher, dass Sie zukünftige Verluste verhindern \n- Produktauflistung - zeigt alle notwendigen Produktinformationen auf einen Blick an und reduziert verschwenderische Shoppingzeit"},{"id":28925,"name":"AI Search & Product Discovery by Luigi’s Box","description":"<h2>What is Luigi's Box?</h2><p>Luigi's Box is a year-by-year awarded set of tools with the easiest to use software, suitable for businesses of all sizes, kinds, and segments. Luigi's Box provides personalized product discovery tools powered by AI to bring the most accurate search results and increase sales with seamless integration and setup without needing IT knowledge.&nbsp;<br></p><p><br></p><h3>Luigi's Box Search&nbsp;</h3><p>Luigi's Box offers an advanced AI-driven search tool to get the most out of your search by collecting data and using them to make better business decisions by learning from search users and improving results based on their website interactions. Luigi's Box Search offers several advanced features to enhance your search capabilities, enabling site visitors to quickly find the products they're looking for and reducing wasteful shopping time.<br></p><p><br></p><h3>Luigi's Box Recommender&nbsp;</h3><p>Luigi's Box offers personalized recommendation boxes to each visitor based on previous interactions or preferences that can be placed in any website section and act like its native part. Increase sales by recommending best-selling products, products on sale, or complementary products to those in the cart.&nbsp;<br></p><p><br></p><h3>Luigi's Box Product Listing</h3><p></p><p>Luigi's Box provides personalized product listing pages with customizable facets to enhance the browsing experience. Customers can easily find the product they need, check its characteristics in detail, compare it with other offers, view product reviews, and ultimately make a purchase.<br></p><p><br></p><h3>Luigi's Box Analytics</h3><p>Luigi's Box is also an analytical tool that gives you all the relevant information about your website's performance. It provides valuable insights into your visitors' interactions, analyses your search usage, provides suggestions for optimization, and enables continuous improvement of your conversion rates.&nbsp;</p><p><br></p><h2>What will Luigi's Box bring you?&nbsp;</h2><p><br>Luigi's Box offers several intelligent features with multiple use cases. For example, with Luigi's Box Analytics,&nbsp;<b>discover</b> searches with low conversions or your cart value and use this data for improvements.&nbsp;<b>Learn how to use</b> synonyms to prevent losing sales opportunities or boosted items to support your business goals. <b>Increase</b> your revenue via better search &amp; personalized recommendations, and increase search retention and relevance. And last but not least, <b>avoid</b> no results and searches with zero clicks.&nbsp;</p>","installationManual":"<p>Once you have installed &amp; activated the extension, following things will happen automatically:<br>1. Luigi's Box script will be inserted into the storefront<br>2. Metadata of your products, categories and brands will be synchronized into Luigi's Box servers<br><br>Please\nproceed by opening the extension and fill the onboarding form. Our\nagents will reach out to you once the form will be submitted to discuss\nfurther steps - mostly what products you are interested in (Search,\nRecommender, Product Listing or all of them) and what requirements you\nhave. Afterwards, you will have opportunity to preview &amp; approve the\nservices prior launch.<br><br>You can find more information about our products<a href=\"https://www.luigisbox.com\" target=\"_blank\" rel=\"noreferrer\"> on our website</a></p><p></p><p><br></p>","shortDescription":"Luigi's Box is a unique technological set of tools that uses AI and machine learning to improve the performance of your website and increase your sales.","highlights":"14-day free trial for Analytics\nSeamless self-service integration\nAdvanced features for any platform \nYear-by-year award-winning Search\nMultiple tools in one solution","features":"AI, Machine Learning, NLP - improve the performance of search and recommendations and increase your sales\nVoice Search - enhance the user experience with a comfy search based on voice commands\nTypo Tolerance - ensure correct search results despite any typos that might've happened\nSynonyms Management - increase customer satisfaction with a search that can recognize synonyms \nPin to Position - improve sales of chosen products by assigning them a desired position in results\nProduct Banners in Search - encourage the purchase intent by promoting products with customizable banners in search\nOffline A/B testing - improve your website's performance with testing in an offline environment \nGeo Search - provide only the best product results for your customer from different geolocations \nDynamic Filters - save customers the time they spend searching and show them only relevant filter options\nCross-sell and Upsell - increase your average shopping cart value \nPersonalization - increase your revenue with search and recommendations tailor-made to each customer \nNovelty Preference - promote new products right in search and increase your chances of sales\nTop Performing Products - find out more about your best-selling products and use this data for future improvements\nLost Opportunities - discover why and how you lose sales and ensure to avoid future losses\nProduct Listing - show all necessary product information in one go and reduce wasteful browsing time"}],"addons":["SW6_integrated"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":169502,"bookingKey":"xxx2198040688421","bookingText":"AI Search & Product Discovery by Luigi’s Box","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpP6IwXb","preview":true,"priority":1,"id":108744},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwDYZYm","preview":false,"priority":0,"id":108745},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVbVwYI","preview":false,"priority":0,"id":108746},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEYyfc6","preview":false,"priority":0,"id":108747}],"comments":[],"ratingAverage":0,"label":"Luigi's Box Suche & Produktentdeckung Integration","description":"<h2>Was ist Luigi's Box? </h2><p><br /></p><p>Luigi's Box ist ein Toolset mir der benutzerfreundlichsten Software, die Jahr für Jahr Auszeichnungen erhält und sich für Unternehmen jeder Größe, Art und in allen Segmenten eignet. Luigi's Box bietet personalisierte Produktentdeckungstools an, die von AI unterstützt werden, um die genauesten Suchergebnisse zu erzielen. Die Integration und Einrichtung sind reibungslos und erfordern keine IT-Kenntnisse. </p><p><br /></p><h2>Luigi's Box Suche</h2><p><br /></p><p>Luigi's Box bietet ein fortgeschrittenes AI-unterstütztes Suchtool an, mit dem Sie das Meiste aus Ihrer Suche herausholen können, indem Sie Daten sammeln und sie einsetzen, um bessere Geschäftsentscheidungen zu treffen. Lernen Sie von den Suchnutzern und verbessern Sie die Ergebnisse, basierend auf ihren Webseiteninteraktionen. Die Luigi’s Box Suche bietet verschiedene fortgeschrittene Funktionen an, die Ihre Suchfunktionen verfeinern, sodass Seitenbesucher die Produkte, nach denen sie suchen, schnell finden können und die verschwenderische Shoppingzeit reduziert wird.</p><p><br /></p><h2>Luigi's Box Empfehler </h2><p><br /></p><p>Luigi's Box bietet jedem Besucher, basierend auf vorherigen Interaktionen oder Präferenzen, personalisierte Empfehlerboxen an, die in jedem Bereich einer Webseite platziert werden können und sich wie ein natürlicher Bestandteil verhalten. Steigern Sie die Verkaufszahlen, indem Sie Verkaufsschlager, Produkte im Angebot oder andere Produkte empfehlen, die die Waren ergänzen, welche sich bereits im Warenkorb befinden.</p><p><br /></p><h2>Luigi's Box Produktauflistung</h2><p><br />Luigi's Box bietet personalisierte Produktauflistungsseiten mit anpassbaren Facetten an, die die Browsingerfahrung verbessern. Kunden können die Produkte, die sie brauchen, ganz einfach finden, ihre Eigenschaften im Detail überprüfen, sie mit anderen Angeboten vergleichen, sich Produktbewertungen ansehen und schließlich einen Kauf tätigen.</p><p><br /></p><h2>Luigi's Box Analytik</h2><p><br />Luigi's Box ist auch ein Analytiktool, das Ihnen relevante Informationen über die Leistung Ihrer Webseite gibt. Es stellt wertvolle Einblicke über die Interaktionen Ihrer Besucher zur Verfügung, analysiert die Suchnutzung, gibt Vorschläge für die Optimierung und ermöglicht die laufende Verbesserung Ihrer Konversionsraten.</p><p><br /></p><h2>Was bringt Ihnen Luigi's Box? </h2><p><br />Luigi's Box bietet diverse intelligente Funktionen mit mehreren Anwendungsfällen an. Beispielsweise können Sie mit der Luigi’s Box Analytik Suchanfragen mit niedrigen Konversionen oder Ihren Warenkorbwert <b>entdecken</b> und diese Daten für Verbesserungen nutzen. <b>Lernen Sie, wie man Synonyme einsetzt</b>, um es zu vermeiden, Verkaufsgelegenheiten zu verpassen oder wie man Produkte fördert, um die Geschäftsziele zu unterstützen. <b>Erhöhen</b> Sie Ihre Umsätze mithilfe einer besseren Suche &amp; personalisierten Empfehlungen und steigern Sie die Suchbindung und -relevanz. <b>Vermeiden</b> Sie außerdem ergebnislose Suchanfragen ohne jegliche Klicks.</p>","installationManual":"<p>Luigi's Box bietet mehrere Implementierungsoptionen an, sodass unsere Kunden diejenige wählen können, die am besten zu ihnen passt. Für mehr Informationen über die Implementierung von Luigi’s Box auf Ihrer Webseite können Sie uns gerne über die <a href=\"https://www.luigisbox.de/implementierung/\" target=\"_blank\" rel=\"noreferrer noopener\">Implementierungsseite</a> auf unserer Webseite kontaktieren.</p>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p>Initial version. Upon installation, it creates account/project/site at Luigi's Box and triggers the product data synchronization.<br /></p>","creationDate":{"date":"2023-04-25 17:40:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=xxx2198040688421","redirectToStore":false,"lowestPriceValue":0}