{"id":16624,"name":"MillCategoryMenuBadge","code":"Mill275037257031","lastChange":{"date":"2023-07-18 11:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpj46ZT2","examplePageUrl":"","moduleKey":"MillCategoryMenuBadge","creationDate":{"date":"2023-02-23 16:27:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-03-08 08:57:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-03-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-28 12:41:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":419,"prefix":"Mill","name":"MILLENWORLD","website":"//www.millenworld.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod419_store_icon.png"},"infos":[{"id":29012,"name":"Kategorie Badges - Menüeinträge hervorheben","description":"<h2>Für wen ist diese App gedacht</h2><p>Sie möchten nicht nur Produkte, sondern auch Kategorien hervorheben - und das am liebsten übergreifend im gesamten Shop? Diese App erlaubt Ihnen pro Kategorie ein so genanntes \"Badge\" (Label/Abzeichen) zu definieren, welches als kleines farbiges Element hinter den jeweiligen Kategorienamen angezeigt wird. Dabei stehen Ihnen Standard Farben zur Verfügung (die Sie im Standard Theme anpassen können). Die Badges werden SEO konform (kein Bruch von strukturierten Daten) hinter den eigentlichen Kategoriebezeichnern ausgegeben - und das in allen Menüs: Haupt-Navigation, Footer-Navigation, Seiten-Navigation (Erlebniswelten) als auch Offcanvas Menü (Mobile). Die Einstellungen erlauben nicht nur sprachabhängig diese Informationen zu pflegen, sondern auch - falls erforderlich - Badges in bestimmten Menübereichen auszublenden.</p><h2>Anwendungsbeispiele</h2><h3>Neue Kategorien/Shopseiten</h3><p>Sie haben eine neue Kategorie im Shop aufgenommen und möchten auf diese aufmerksam machen? Im Standard nicht unbedingt so einfach - mit dieser Erweiterung ein Kinderspiel! Einfach ein Badge (z.B. \"NEU!\") innerhalb der Kategorie definieren, Farbe setzen (z.B. \"Information\") und speichern - das war es! Nun wird ein kleines (im Standard hellblaues) Badge in allen Menüs hinter dem Kategorienamen angezeigt. Ihre Kunden werden mit Sicherheit diese Kategorie nicht mehr übersehen! Übrigens: Die Badges werden auch in der ersten Menüebene der Haupt-Navigation angezeigt!</p><h3>Sale/Sonderverkauf</h3><p>Eine Kategorie mit Schnäppchen, Sonderposten, B-Ware ... sollte die Aufmerksamkeit auf sich ziehen können - mit einem Badge problemlos! Verleihen Sie ihren reduzierten Kategorien den nötigen Touch: Badge-Titel setzen (z.B. \"%\", \"SALE\", \"Rabatt!\" ...) und Farbe \"Gefahr\" (im Standard rot) - und schon sind Ihre Kategorien mit reduzierten Produkten einfach zu erkennen!</p><h3>Versandkostenfrei</h3><p>Gibt es eine Kategorie mit ausschließlich versandkostenfreien Produkten? Falls ja, könnte ein Badge auf diese aufmerksam machen!</p><h3>Bio/Vegan/Vegetarisch/Ökologisch/Nachhaltig</h3><p>Etwas grünes assoziieren die meisten mit etwas ökologischem: Badges setzen, Farbe \"Erfolg\" (im Standard grün) und in allen Menüs sichtbar machen: Hier gibt etwas nachhaltiges zu entdecken!</p><h2>Konfiguration pro Badge</h2><h3>Inhalt</h3><p>In diesem Feld definieren Sie den Text, der innerhalb des Badges angezeigt werden soll.</p><h3>Farbe</h3><p>Über dieses Feld können Sie definieren, welche Farbe das Badge haben soll. Zur Verfügung stellen alle Farben, die Bootstrap (das von Shopware genutzte Frontend Framework) bzw. Shopware zur Verfügung stellt: Primärfarbe, Sekundärfarbe, Erfolg, Gefahr, Warnung, Information, Hell und Dunkel.</p><h3>Auszuschließende Anzeigeorte</h3><p>Jedes Badge wird im Standard in allen Menüs angezeigt: Haupt-Navigation, Footer-Navigation, Seiten-Navigation (Sidebar, Erlebniswelt) als auch Offcanvas (Mobile). Über diese Einstellung können Sie in einer Mehrfachauswahl jedoch Bereiche angeben, in denen die von Ihnen definierten Badges nicht angezeigt werden sollen. Darüber ergeben sich sehr individuelle Möglichkeiten!</p><p><i>Hinweis</i>: Alle Konfigurationen/Angaben werden pro Sprache gespeichert. Bedeutet, dass Sie pro Sprache völlig unterschiedliche Badges definieren können!</p><h2>Import/Export</h2><p>Dadurch, dass alle relevanten Daten der Badges in Zusatzfelder gespeichert werden, können Sie alle Import/Exportmöglichkeiten des Shops nutzen, die zur Verfügung stehen. Der Import/Export des Shops wird hier konkreter erklärt:&nbsp;<a href=\"https://docs.shopware.com/de/shopware6-de/einstellungen/importexport#objekttyp-kategorien\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://docs.shopware.com/de/shopware6-de/einstellungen/importexport#objekttyp-kategorien</a></p><p>Im Bereich der \"translations\" können Daten in Zusatzfelder importiert werden. Folgende Zusatzfelder werden von der App genutzt:</p><h4>mill_category_menu_badge_text</h4><p>Badge Inhalt</p><h4>mill_category_menu_badge_color</h4><p>Badge-Farbe, mögliche Werte (einfach):&nbsp;<i>primary</i>,&nbsp;<i>secondary</i>,&nbsp;<i>danger</i>,&nbsp;<i>warning</i>,&nbsp;<i>information</i>,&nbsp;<i>success</i>,&nbsp;<i>light</i>,&nbsp;<i>dark</i></p><h4>mill_category_menu_badge_excluded_locations</h4><p>Liste mit Bereichen, die in der Anzeige ausgeschlossen werden. Mögliche Werte (mehrfach):<i>&nbsp;[main, footer, sidebar, offcanvas]</i></p><h2>Professionell und zukunftssicher</h2><p></p><p></p><p></p><p></p><ul><li>seit 2013 Shopware Entwickler</li><li>seit 2015 Hersteller im Shopware Store</li><li>Entwicklung nach aktuellen Coding Guidelines</li><li>Support aktueller Shopware Versionen</li><li>Hersteller mit insgesamt über 7000 Plugin Downloads</li></ul>","installationManual":"<h2>Installation</h2><p></p><ul><li>Plugin installieren</li><li>Plugin aktivieren</li></ul><h2>Verwaltung</h2><p></p><ul><li>alle Datenfelder finden Sie pro Kategorie im Bereich \"Zusatzfelder\" im Set \"Badge\"</li><li>Daten pflegen und Datensatz danach speichern!</li></ul><p><b>Hinweis</b>: Weitere Informationen zu den Datenfeldern können Sie der Plugin Beschreibung (mit Beispielen) entnehmen.</p><h2>Deinstallieren</h2><p></p><ul><li>Plugin deaktivieren</li><li>Plugin deinstallieren</li></ul><p><b>Hinweis</b>: Obwohl das Zusatzfeld Set mit allen zugehörigen Zusatzfeldern gelöscht wird, bleiben Ihre wertvoll gepflegten Badge-Daten erhalten! Die App kann daher problemlos deinstalliert und zu einem späteren Zeitpunkt wieder installiert werden - die Daten bleiben updatesicher erhalten!</p>","shortDescription":"Plugin für die Verwaltung und Anzeige von Badges/Labels in Kategorienamen - mehrsprachig, in verschiedenen Farben und an mehreren Orten (Haupt/Footer-Navigation, Seite, Offcanvas)","highlights":"Badges in Kategorien einfach verwalten und in Menüs ausgeben lassen\nFarbgestaltung anhand der im Theme definierten Standard Farben\nAngaben wie Inhalt (Name), Farbe und Anzeigeort mehrsprachig definierbar\nDatenhaltung ausschließlich mit Shopware Boardmitteln realisiert (Zusatzfelder)\nSEO konform (Erhaltung der strukturierten Daten) und Ausgabe als Bootstrap Komponenten","features":"Verwaltung und Anzeige von Badges in Kategorienamen\nInhalt (Text), Farbe und Anzeige pro Badge definierbar\nFarbe anhand der im Theme definierten Standard Farben (Primär, Sekundär, Gefahr, Warnung, ...)\nAnzeigeorte können in einer Mehrfachauswahl explizit pro Badge ausgeschlossen werden: Haupt-Navigation, Footer-Navigation, Seiten-Navigation (Erlebniswelten) und Offcanvas (Mobile)\nBadge Titel (Name) wie alle anderen Einstellungen pro Sprache spezifisch einstellbar\nDatenhaltung ausschließlich mit Boardmitteln (Zusatzfeldern), die für Sie automatisch angelegt werden\nUpdatesicher, zukunftssicher und einfache Möglichkeit zur Datenspeisung aus externen Datenquellen (ERP, PIM, ...) Dank Import/Export und API Unterstützung\nKeine zusätzliche Selektierung von Daten: Haushaltung nur mit bereits bestehenden Storefront Daten!\nNutzung von Bootstrap Komponenten: Maximaler Support mit eigenen Themes, Theme Anpassungen oder weiteren Plugins\nSEO konform: Badges werden außerhalb der \"name\" tags eingebettet und wirken sich somit nicht negativ auf Ihre strukturierten Daten (Structured Data) aus!"},{"id":29013,"name":"Category badges to highlight menu items","description":"<h2>Who is this app for?</h2><p>Do you want to highlight not only products but also categories - preferably throughout the entire shop? This app allows you to define a so-called \"badge\" for each category, which is displayed as a small colored element behind the respective category name. You have standard colors available (which you can customize in the standard theme). The badges are output SEO conform (no violation of structured data) behind the actual category names - and this in all menus: main navigation, footer navigation, page navigation (experience worlds) as well as off-canvas menu (mobile). The settings not only allow you to maintain this information dependent on language, but also to hide badges in certain menu areas if necessary.</p><h2>Application examples</h2><h3>New categories/shop pages</h3><p>You have added a new category to the shop and want to draw attention to it? Not necessarily easy in the standard version - but child's play with this extension! Simply define a badge (e.g. \"NEW!\") within the category, set the color (e.g. \"information\"), and save - that's it! Now a small (in the standard light blue) badge is displayed behind the category name in all menus. Your customers will certainly not overlook this category! By the way: The badges are also displayed in the first menu level of the main navigation!</p><h3>Sale/Special Offer</h3><p>A category with bargains, special items, B-stock ... should be able to attract attention - easily done with a badge! Give your reduced categories the necessary touch: set the badge title (e.g. \"%\", \"SALE\", \"discount!\" ...) and color \"danger\" (in standard red) - and your categories with reduced products are easy to recognize!</p><h3>Free shipping</h3><p>Is there a category with exclusively free shipping products? If so, a badge could draw attention to this!</p><h3>Organic/Vegan/Vegetarian/Ecological/Sustainable</h3><p>Most people associate something green with something ecological: set badges, color \"success\" (standard green), and make them visible in all menus: Here you can discover something sustainable!</p><h2>Configuration per badge</h2><h3>Content</h3><p>In this field, you define the text that should be displayed within the badge.</p><h3>Color</h3><p>Using this field, you can define the color the badge should have. All colors that Bootstrap (the frontend framework used by Shopware) and Shopware provide are available: primary color, secondary color, success, danger, warning, information, light, and dark.</p><h3>Excluded display locations</h3><p>By default, each badge is displayed in all menus: main navigation, footer navigation, page navigation (sidebar, experience world), as well as off-canvas (mobile). However, using this setting, you can specify areas in a multiple selection where the badges you have defined should not be displayed. This opens up very individual possibilities!</p><p><i>Note</i>: All configurations/specifications are saved per language. This means that you can define completely different badges per language!</p><h2>Import/Export</h2><p>By storing all relevant data of the badges in additional fields, you can use all import/export options available in the shop. The shop's import/export is explained in more detail here:&nbsp;<a href=\"https://docs.shopware.com/en/shopware6-en/settings/importexport#object-type-categories\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\">https://docs.shopware.com/en/shopware6-en/settings/importexport#object-type-categories</a></p><p>In the \"translations\" section, data can be imported into additional fields. The following additional fields are used by the app:</p><h4>\n\nmill_category_menu_badge_text</h4><p>Badge content</p><h4>mill_category_menu_badge_color</h4><p>Badge color, possible values (single): primary, secondary, danger, warning, information, success, light, dark</p><h4>mill_category_menu_badge_excluded_locations</h4><p>List of areas excluded from the display. Possible values (multiple): [main, footer, sidebar, offcanvas]</p><h2>Professional and future-proof</h2><p><ul><li>Shopware developer since 2013</li><li>Manufacturer in the Shopware Store since 2015</li><li>Development according to current coding guidelines</li><li>Support for current Shopware versions</li><li>Manufacturer with a total of over 7000 downloads</li></ul></p>","installationManual":"<h2>Installation</h2><p><ul><li>Install plugin</li><li>Activate plugin</li></ul></p><h2>Administration</h2><p>You can find all data fields per category in the \"custom fields\" section called \"Badge\". Simply edit and save badge data!</p><h2>Uninstall</h2><p><ul><li>Deactivate plugin</li><li>Uninstall plugin</li></ul></p><p><b>Note</b>: Even though the custom field set with all associated fields will be deleted, your valuable badge data will be preserved! Therefore, the app can be uninstalled and reinstalled at a later time without losing your data.\n</p>","shortDescription":"Plugin for managing and displaying badges/labels in menu items - SEO compliant, multilingual, in different colors and in multiple locations (main/footer navigation, sidebar, offcanvas).","highlights":"Easily manage badges in categories and display them in menus\nColors based on the default colors defined in the theme\nSpecifications such as content (name), color and display area definable\nData storage realized exclusively with Shopware functions (custom fields)\nSEO compliant (preservation of structured data) and output as Bootstrap components","features":"Management and display of category badges in menu items\nDefinable content (text), color and area per badge\nColor based on default colors defined in theme (primary, secondary, danger, warning, ...)\nDisplay locations can be explicitly excluded per badge in a multiple selection: Main Navigation, Footer Navigation, Page Navigation (shopping world) and Offcanvas (Mobile).\nBadge title (name) as all other settings per language specifically adjustable\nData management exclusively with Shopware functions (custom fields), which are automatically created for you\nUpdate-proof, future-proof and easy possibility to feed data from external data sources (ERP, PIM, ...) thanks to import/export support\nNo additional selection of data in the storefront\nUse of Bootstrap components: Maximum support with custom themes, theme customizations or additional apps\nSEO compliant: Badges are embedded outside the \"name\" tags and thus do not negatively affect your structured data"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167248,"bookingKey":"Mill275037257031","bookingText":"Kategorie Badges - Menüeinträge hervorheben","price":49,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":167247,"bookingKey":"Mill275037257031_M","bookingText":"Kategorie Badges - Menüeinträge hervorheben","price":4.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168233,"bookingKey":"Mill275037257031_M12","bookingText":"Category badges to highlight menu items","price":49,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3FhnGQ","preview":true,"priority":0,"id":109130},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5dsrrl","preview":false,"priority":0,"id":109131},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpr4yaIr","preview":false,"priority":0,"id":109132},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwPkA5k","preview":false,"priority":0,"id":109133},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYTluRn","preview":false,"priority":0,"id":109134},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzNMUOk","preview":false,"priority":0,"id":109135},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTH3XRD","preview":false,"priority":0,"id":109136},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCOnQ2Y","preview":false,"priority":0,"id":109137},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0fcFpn","preview":false,"priority":0,"id":109138},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXTyvFy","preview":false,"priority":0,"id":109141},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvn5EnQ","preview":false,"priority":0,"id":109179}],"comments":[],"ratingAverage":0,"label":"Kategorie Badges - Menüeinträge hervorheben","description":"<h2>Für wen ist diese App gedacht</h2><p>Sie möchten nicht nur Produkte, sondern auch Kategorien hervorheben - und das am liebsten übergreifend im gesamten Shop? Diese App erlaubt Ihnen pro Kategorie ein so genanntes \"Badge\" (Label/Abzeichen) zu definieren, welches als kleines farbiges Element hinter den jeweiligen Kategorienamen angezeigt wird. Dabei stehen Ihnen Standard Farben zur Verfügung (die Sie im Standard Theme anpassen können). Die Badges werden SEO konform (kein Bruch von strukturierten Daten) hinter den eigentlichen Kategoriebezeichnern ausgegeben - und das in allen Menüs: Haupt-Navigation, Footer-Navigation, Seiten-Navigation (Erlebniswelten) als auch Offcanvas Menü (Mobile). Die Einstellungen erlauben nicht nur sprachabhängig diese Informationen zu pflegen, sondern auch - falls erforderlich - Badges in bestimmten Menübereichen auszublenden.</p><h2>Anwendungsbeispiele</h2><h3>Neue Kategorien/Shopseiten</h3><p>Sie haben eine neue Kategorie im Shop aufgenommen und möchten auf diese aufmerksam machen? Im Standard nicht unbedingt so einfach - mit dieser Erweiterung ein Kinderspiel! Einfach ein Badge (z.B. \"NEU!\") innerhalb der Kategorie definieren, Farbe setzen (z.B. \"Information\") und speichern - das war es! Nun wird ein kleines (im Standard hellblaues) Badge in allen Menüs hinter dem Kategorienamen angezeigt. Ihre Kunden werden mit Sicherheit diese Kategorie nicht mehr übersehen! Übrigens: Die Badges werden auch in der ersten Menüebene der Haupt-Navigation angezeigt!</p><h3>Sale/Sonderverkauf</h3><p>Eine Kategorie mit Schnäppchen, Sonderposten, B-Ware ... sollte die Aufmerksamkeit auf sich ziehen können - mit einem Badge problemlos! Verleihen Sie ihren reduzierten Kategorien den nötigen Touch: Badge-Titel setzen (z.B. \"%\", \"SALE\", \"Rabatt!\" ...) und Farbe \"Gefahr\" (im Standard rot) - und schon sind Ihre Kategorien mit reduzierten Produkten einfach zu erkennen!</p><h3>Versandkostenfrei</h3><p>Gibt es eine Kategorie mit ausschließlich versandkostenfreien Produkten? Falls ja, könnte ein Badge auf diese aufmerksam machen!</p><h3>Bio/Vegan/Vegetarisch/Ökologisch/Nachhaltig</h3><p>Etwas grünes assoziieren die meisten mit etwas ökologischem: Badges setzen, Farbe \"Erfolg\" (im Standard grün) und in allen Menüs sichtbar machen: Hier gibt etwas nachhaltiges zu entdecken!</p><h2>Konfiguration pro Badge</h2><h3>Inhalt</h3><p>In diesem Feld definieren Sie den Text, der innerhalb des Badges angezeigt werden soll.</p><h3>Farbe</h3><p>Über dieses Feld können Sie definieren, welche Farbe das Badge haben soll. Zur Verfügung stellen alle Farben, die Bootstrap (das von Shopware genutzte Frontend Framework) bzw. Shopware zur Verfügung stellt: Primärfarbe, Sekundärfarbe, Erfolg, Gefahr, Warnung, Information, Hell und Dunkel.</p><h3>Auszuschließende Anzeigeorte</h3><p>Jedes Badge wird im Standard in allen Menüs angezeigt: Haupt-Navigation, Footer-Navigation, Seiten-Navigation (Sidebar, Erlebniswelt) als auch Offcanvas (Mobile). Über diese Einstellung können Sie in einer Mehrfachauswahl jedoch Bereiche angeben, in denen die von Ihnen definierten Badges nicht angezeigt werden sollen. Darüber ergeben sich sehr individuelle Möglichkeiten!</p><p><i>Hinweis</i>: Alle Konfigurationen/Angaben werden pro Sprache gespeichert. Bedeutet, dass Sie pro Sprache völlig unterschiedliche Badges definieren können!</p><h2>Import/Export</h2><p>Dadurch, dass alle relevanten Daten der Badges in Zusatzfelder gespeichert werden, können Sie alle Import/Exportmöglichkeiten des Shops nutzen, die zur Verfügung stehen. Der Import/Export des Shops wird hier konkreter erklärt: <a href=\"https://docs.shopware.com/de/shopware6-de/einstellungen/importexport#objekttyp-kategorien\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware6-de/einstellungen/importexport#objekttyp-kategorien</a></p><p>Im Bereich der \"translations\" können Daten in Zusatzfelder importiert werden. Folgende Zusatzfelder werden von der App genutzt:</p><h4>mill_category_menu_badge_text</h4><p>Badge Inhalt</p><h4>mill_category_menu_badge_color</h4><p>Badge-Farbe, mögliche Werte (einfach): <i>primary</i>, <i>secondary</i>, <i>danger</i>, <i>warning</i>, <i>information</i>, <i>success</i>, <i>light</i>, <i>dark</i></p><h4>mill_category_menu_badge_excluded_locations</h4><p>Liste mit Bereichen, die in der Anzeige ausgeschlossen werden. Mögliche Werte (mehrfach):<i> [main, footer, sidebar, offcanvas]</i></p><h2>Professionell und zukunftssicher</h2><p></p><p></p><p></p><p></p><ul><li>seit 2013 Shopware Entwickler</li><li>seit 2015 Hersteller im Shopware Store</li><li>Entwicklung nach aktuellen Coding Guidelines</li><li>Support aktueller Shopware Versionen</li><li>Hersteller mit insgesamt über 7000 Plugin Downloads</li></ul>","installationManual":"<h2>Installation</h2><p></p><ul><li>Plugin installieren</li><li>Plugin aktivieren</li></ul><h2>Verwaltung</h2><p></p><ul><li>alle Datenfelder finden Sie pro Kategorie im Bereich \"Zusatzfelder\" im Set \"Badge\"</li><li>Daten pflegen und Datensatz danach speichern!</li></ul><p><b>Hinweis</b>: Weitere Informationen zu den Datenfeldern können Sie der Plugin Beschreibung (mit Beispielen) entnehmen.</p><h2>Deinstallieren</h2><p></p><ul><li>Plugin deaktivieren</li><li>Plugin deinstallieren</li></ul><p><b>Hinweis</b>: Obwohl das Zusatzfeld Set mit allen zugehörigen Zusatzfeldern gelöscht wird, bleiben Ihre wertvoll gepflegten Badge-Daten erhalten! Die App kann daher problemlos deinstalliert und zu einem späteren Zeitpunkt wieder installiert werden - die Daten bleiben updatesicher erhalten!</p>","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<ul><li>Shopware 6.5</li><li>increased min. version</li><li>Bootstrap Update</li></ul>","creationDate":{"date":"2023-05-28 12:34:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>initial plugin release</li><li>Shopware 6.4 support</li></ul>","creationDate":{"date":"2023-02-23 21:39:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Mill275037257031","redirectToStore":true,"lowestPriceValue":4.9}