{"id":16640,"name":"SwissupArgentoStripesTheme","code":"swiss66950268459","lastChange":{"date":"2023-07-18 11:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplC4tYI","examplePageUrl":"","moduleKey":"SwissupArgentoStripesTheme","creationDate":{"date":"2023-02-27 15:26:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-03-20 10:43:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-03-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-24 10:30:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4120,"prefix":"swissup","name":"Swissuplabs","website":"//swissuplabs.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4120_swissuplabs.logo.png"},"infos":[{"id":29040,"name":"Argento Stripes","description":"<p>Das Konfigurationshandbuch finden Sie auf unserer <a href=\"https://docs.swissuplabs.com/shopware/argento/stripes/\" target=\"_blank\" rel=\"noreferrer\">Dokumentationsseite</a></p><p><br></p><p>Verwenden Sie das lebendige Design von Argento Stripe, um Kunden zum Kauf in Ihrem Geschäft anzuregen. Unser E-Commerce-Shopware-Theme zielt darauf ab, die Erfahrung der Benutzer mit seinen zusätzlichen Funktionen zu verbessern. Um eine hochfunktionale Website zu erstellen, wird das Template von Entwicklern erweitert.</p><br><p>Es ist verfügbar, Argento Stripes mit erweiterten Konfigurationsoptionen für Ihre Marke anzupassen.</p><p><br></p><h2>Vorteile der Verwendung</h2>Argento Stripes als vielseitiges Website-Template hat viele Vorteile für Sie. Sie können das Thema als hervorragenden Ausgangspunkt und als Thema für eine andere Art von Geschäft verwenden, wenn Sie mehr als ein Unternehmen in Ihrem Unternehmen betreiben. Es kann Ihnen Geld, Zeit und Mühe sparen.<br><br><p>Das Streifendesign ist eine gute Wahl für die Präsentation von Elektronik, Maschinen, Transportausrüstung, Baumaterialien und Markenprodukten von Unternehmen, Bekleidung, Medikamenten, Hardware, Uhren, Schmuck, Büchern und Sportartikeln. Kontrastdesign mit großen Call-to-Action-Schaltflächen hilft Ihnen, hervorzuheben, was für Ihre Zielgruppe wichtig ist.</p><p><br></p><h2>Responsive Design: vom Desktop bis zum Handy</h2><p>Das Argento Stripes-Design passt in jede Browserbreite und funktioniert gut auf allen Geräten und Auflösungen. Mit unserer Shopware-Vorlage erstellen Sie einen leistungsstarken und mobilfreundlichen E-Commerce-Shop.</p><p><br></p><h2>Verbesserte Suche und Navigation</h2>Mit Argento Stripes tragen Sie dazu bei, dass Besucher Ihre Website gerne erkunden. Wir konzentrieren uns auf die Suche und Navigation, was die Konversionsrate Ihres Shops erheblich verbessern kann.<br><br>Innerhalb der Vorlagenkonfiguration können Sie die Hintergrund-, Symbol- und Platzhalterfarbe des Suchfelds festlegen. Stellen Sie sicher, dass die Suchleiste leicht zu finden ist, da sie die Benutzererfahrung erheblich beeinflusst.<br><br>Mit dem Argento Stripes-Design können Sie auch die Navigation anpassen:<br>Stellen Sie die Hintergrundfarbe der Navigation, die Farbe der Links auf Ebene 1 und Ebene 2 ein.<br>Schaltet die Anzeige von Pfeilen für übergeordnete Elemente des Navigationsmenüs um.<br>Heben Sie den ersten Menüpunkt mit einem speziellen Stil hervor, wenn Sie ein Amazon-ähnliches Menü mit Abteilungen verwenden.<br><br><p>Eine organisierte Navigation wirkt sich auf die Benutzerfreundlichkeit Ihrer Website aus. Das Argento-Streifen-Design erleichtert die Weiterleitung von Besuchern auf verschiedene Seiten Ihrer Website, wodurch die Wahrscheinlichkeit verringert wird, dass Besucher die Website verlassen.</p><p><br></p><h2>Verbesserte Benutzererfahrung</h2>Das Argento Stripes-Design enthält zwei CMS-Blöcke. Sie können sie beim Erstellen oder Bearbeiten des Seitenlayouts verwenden.<br><br>Der erste ist der Logo Slider CMS-Block. Es verfügt über erweiterte Einstellungen, mit denen Sie ein Bildkarussell anzeigen können. Kunden können in einer Diashow durch die Bilder scrollen, um mehr über die Angebote Ihres Shops zu erfahren. Ein Bilderkarussell verbessert die Benutzererfahrung und macht Ihre Website interaktiver.<br><br>Der zweite CMS-Block ist der Produkt-Highlight-CMS-Block. Dies ist eine großartige Möglichkeit, bestimmte Produkte in Ihrem Online-Shop zu bewerben und die Benutzererfahrung zu optimieren, um mehr Conversions in den Einkaufswagen zu bringen.<br><br><p>Die Highlight-Funktion von Argento Stripes ermöglicht das Anzeigen eines zweireihigen Produkt-Sliders mit einem Link und einer Beschreibung. Sie können neue, vorgestellte, reduzierte, Bestseller und beliebte Produkte hinzufügen. Mit den erweiterten Blockierungseinstellungen ermutigen Sie Kunden, dieses Produkt direkt von der Startseite oder einer anderen Seite hinzuzufügen, auf der Sie die Blockierung vorgenommen haben.</p><p><br></p><h2>Social-Media-Unterstützung</h2>Mit dem Argento Stripes-Thema können Sie Social-Media-Symbole neben dem Connect With Us-Block in der Fußzeile Ihres Shopware-Shops anzeigen. Mit der Vorlagenkonfiguration können Sie soziale Links konfigurieren:<br>Wählen Sie die anzuzeigenden Links zu sozialen Netzwerken aus.<br>Passen Sie Symboltext- und Hintergrundfarben sowie Symbol-Hover-Farben an.<br>Legen Sie die URL zu Ihrer Shop-Seite mithilfe der vorgefertigten Liste von Snippets fest.<br><br><p>Die Integration in bekannte Social-Media-Dienste gibt Ihren Kunden Vertrauen in Ihre Marke.</p><p><br></p><h2>Verbesserte Produktseite</h2>Mit dem Design Argento Stripes können Sie Produktseitenstile und das Produktseitenlayout anpassen. Dies führt zu strukturierteren Inhalten der Produktseiten und einer besseren Kundenbindung. ·<br><br>Beim Anpassen des Produktseitenlayouts bietet unsere Shopware-Vorlage zwei Arten von Layouts für Produktregisterkarten: Standard und erweitert.<br>In erweiterten Registerkarten geben Sie den Nutzern einen guten Überblick über die Produktvorteile. Sobald Besucher alle Informationen zu einem Produkt bereits geöffnet haben, werden sie die versteckten Inhalte nicht übersehen. Es beugt Enttäuschungen wegen fehlender Detailinformationen - etwa guter Produktbewertungen - vor.<br><br>Innerhalb der Argento Stripes-Konfiguration ist es auch möglich:<br>Legen Sie das Layout der erweiterten Registerkarte für Cross-Selling-Produkte fest.<br>Anzeige des Produktherstellers aktivieren/deaktivieren.<br><br><p>Passen Sie die Produktbildgalerie an.</p><p><br></p><h2>Aktualisierte Warenkorbseite</h2>Der Warenkorb als Checkout-Bundle-Teil ist ein wichtiger Abschnitt, um ein erfolgreiches Checkout-Erlebnis zu schaffen. Indem Sie den Einkaufswagen mit den Einstellungen von Argento Stripes aktualisieren, reduzieren Sie die Aufgabe des Einkaufswagens und fördern schnelle Klicks auf „Bestellung senden“.<br><br>Mit der Vorlage haben Sie die Möglichkeit, das Seitenlayout des Einkaufswagens anzupassen. Sie können die Sichtbarkeit der Kopfzeile der Produkttabelle, des Einzelpreises und der Produktnummer in der Produkttabelle aktivieren. Sie können auch die Sichtbarkeit des Rabattfelds, des Felds zum Hinzufügen von Produkten und des Formulars zum Schätzen der Versandkosten in der Seitenleiste der Einkaufswagenseite aktivieren.<br><br><p>Mit dem Thema Argento Stripes stellen Sie sicher, dass Ihre Kunden die endgültigen Kosten kennen, bis sie ihr erstes Produkt in Ihrem Geschäft kaufen.</p><p><br></p><h2>Hervorragende Anpassungsmöglichkeiten</h2>Die Argento Stripes-Vorlage bietet 76 Einstellungsmöglichkeiten, 2 Einkaufserlebniselemente und eine einfache Anpassung.<br><br><p>Unser Theme bietet die beste Grundlage und dann können Sie die notwendigen Änderungen nach Ihren Wünschen vornehmen. Es sind keine Programmierkenntnisse erforderlich. Alle Customizing-Komponenten werden in unserer Shopware-Theme-Dokumentation erklärt. Mit dem Argento Stripes-Design mit unzähligen Konfigurationsmöglichkeiten verkaufen Sie Produkte aus einer breiten Palette von E-Commerce mit unterschiedlichen Anforderungen der Kunden.</p><p><br></p>Das Konfigurationshandbuch finden Sie auf unserer Dokumentationsseite","installationManual":"<h2>Hinzufügen von Argento Stripes zu Ihrem Shop</h2><p>Wenn Sie das Shopware-Konto verbunden haben, können Sie die Vorlage im Bereich Designs unter Erweiterungen sehen.</p><p><br></p><h2>Installation und Aktivierung</h2>Klicken Sie auf den Link Installieren und aktivieren Sie das Thema, indem Sie den Schalter drücken.<br><p><br></p><h2>Vorlage dem Verkaufskanal zuweisen</h2><p>Gehen\n Sie auf der Seite „Vertriebskanal bearbeiten“ zum Abschnitt „Design“. \nKlicken Sie auf die Schaltfläche Design ändern, wählen Sie das \nArgento-Design aus und drücken Sie Speichern, um es zuzuweisen.</p>","shortDescription":"Argento Stripes ist perfekt, um verschiedene Produktkategorien auf dem Desktop und auf Mobilgeräten zu verkaufen. Das Thema bietet 76 Einstellungsoptionen, 2 Einkaufserlebniselemente un","highlights":"","features":""},{"id":29042,"name":"Argento Stripes","description":"<p>Configuration manual can be found at our <a href=\"https://docs.swissuplabs.com/shopware/argento/stripes/ \" target=\"_blank\" rel=\"noreferrer\">documentation site </a></p><p><br></p><p>Use Argento Stripe's vibrant design to encourage customers to buy in your store. Our E-commerce Shopware theme targets enhancing the users' experience with its additional features. To create a highly-functional website, the template will be extended by developers.&nbsp;</p><p>It is available to customize Argento Stripes for your brand with advanced configuration options.</p><p><br></p><h4>Advantages of using</h4><p>Argento Stripes template&nbsp; as a multipurpose website template has lots of advantages for you. You can use the theme as an excellent starting point and as the theme for another type of store if you run more than one business in your company. It can save you money, time, and effort.&nbsp;</p><p>Stripes design is a good choice for showcasing electronics, machinery, transport equipment, building materials, and corporate branded products, apparel, medicines, hardware, watches, jewelry, books, sports goods. Contrast design with big call-to-action buttons helps you emphasize what's important for your targeted audience.</p><p><br></p><h4>Responsive design: from desktop to mobile</h4><p>Argento Stripes theme fits any browser width and works well on all devices and resolutions. With our Shopware template, you will create a powerful and mobile-friendly e-commerce store.</p><p><br></p><h4>Improved search and navigation</h4><p>With Argento Stripes, you help visitors enjoy exploring your website. We put in focus the search and navigation which can greatly improve the conversion rate of your store.&nbsp;</p><p>Within the template configuration, you can set the background, icon, and placeholder color of the search field. Make sure that the search bar is easy to find as it has a considerable impact on user experience.</p><p>With the Argento Stripes theme, you can also customize navigation:</p><ul><li><p>Set the navigation background color, level 1, and level 2 links color.</p></li><li><p>Toggle display of arrows for navigation menu parent items.</p></li><li><p>Highlight the first menu item with a special style when using an Amazon-like menu with Departments.</p></li></ul><p>Organized navigation affects the usability of your site. Argento Stripes theme makes directing visitors to various pages on your site easier which will reduce the chance visitors exit the website.</p><p><br></p><h4>Enhanced user experience</h4><p>Argento Stripes theme includes two CMS blocks. You can use them when you create or edit the page layout.</p><p>The first one is the Logo Slider CMS block. It comes with advanced settings which allow you to show an image carousel. Customers can scroll through images in a slideshow to learn more about your store's offers. An image carousel enhances the user experience and makes your site more interactive.&nbsp;</p><p>The second CMS block is the Products Highlight CMS block. This is a great way to promote specific products on your online store and optimize user experience for increased add-to-cart conversions.&nbsp;</p><p>Argento Stripes Highlight feature allows showing a two-row products slider with a link and description. You can add new, featured, on-sale, bestsellers, and popular products. With the block advanced settings, you encourage customers to add that product right from the homepage or any other page you put the block on.</p><p><br></p><h4>Social media support</h4><p>With the Argento Stripes theme, you can show social media icons next to the Connect With Us block in the footer of your Shopware shop. The template configuration allows you to configure social links:</p><ul><li><p>Select social network links to display.</p></li><li><p>Customize icon text and background colors, and icon hover colors.</p></li><li><p>Set the URL to your store page using the ready-made list of snippets.&nbsp;</p></li></ul><p>Integration into well-known social media services gives your customers confidence in your brand.</p><p><br></p><h4>Improved product page</h4><p>With the Argento Stripes theme, you can customize product page styles and the product page layout. It will result in more structured product page content and better customer engagement. ·&nbsp;</p><p>When customizing product page layout, our Shopware template offers two types of layout for product tabs: default and expanded.&nbsp;</p><p>In expanded tabs, you will provide users with a good overview of product advantages. Once visitors have all info about a product already opened, they will not overlook the hidden content. It will prevent disappointment because of a lack of detailed information - for instance, of good product reviews.</p><p>Within the Argento Stripes configuration it is also possible to:</p><ul><li><p>Set the expanded tab layout for cross-selling products.</p></li><li><p>Enable/disable the display of the product manufacturer.</p></li><li><p>Customize product image gallery.</p></li></ul><p><br></p><h4></h4><h4>Updated shopping cart page</h4><p>The shopping cart as a checkout bundle part is an important section to create a successful checkout experience. By updating the shopping cart with Argento Stripes settings you will reduce cart abandonment, and encourage quick Send Order clicks.</p><p>With the template, you've got the option to customize the shopping cart page layout. You can enable the visibility of the products table header, unit price, and product number in the products table. You can also enable the visibility of the discount field, product add field, and estimate shipping costs form in the shopping cart page sidebar.</p><p>With the Argento Stripes theme, you make sure your customers are aware of the final cost till the moment they purchase their first product in your store.</p><p><br></p><h2></h2><h4>Excellent customization options</h4><p>The Argento Stripes template offers 76 setting options, 2 shopping experience elements, and easy customization.</p><p>Our theme provides the best foundation and then you can make the necessary changes according to your wishes. No programming skills are required. All customizing components are explained in our Shopware theme documentation. Using the Argento Stripes design with countless configuration possibilities, you will sell products from a wide range of e-commerce with different requirements from the clients.</p>","installationManual":"<h2>#1 Adding Argento Stripes to your shop</h2><p>When you have the Shopware account connected, you can see the template in the Themes section at Extensions.&nbsp; <br></p><p><br></p><h2>#2 Installation and activation</h2><p>Click on the Install link and activate the theme by pressing the switch.</p><p><br></p><h2>#3 Assigning the template to Sales Channel</h2>Go\n to the Theme section on the Sales Channel Edit page. Click on the \nChange theme button, select Argento theme and press Save to assign it.<br><p><br><br></p>","shortDescription":"Argento Stripes is perfect to sell various product categories on desktop and mobile. The theme comes with 76 setting options, 2 shopping experience elements, and easy customization.","highlights":"","features":"Theme Header Configuration → Customize theme header styles and layout.\nTheme Footer Configuration → Customize theme footer styles and layout.\nCategory Page Configuration → Customize the look of the product items in the listing\nProduct Page Configuration - Set the expanded tab layout.\nAccount configuration→ Customize customer login page.\nSocial Media Integration → Use a ready-made list of icons and snippets to change the social link labels and set the URL to your store page.\nThe Benefits block → Set visibility of the icons, text, or links that demonstrate your shop services. The Benefits block is shown under the header.\nIncluded two blocks for Shopping Experiences → Place content in certain places in your template to improve user experience."}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":167269,"bookingKey":"swiss66950268459","bookingText":"Argento Stripes","price":190,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":167412,"bookingKey":"swiss66950268459_M","bookingText":"Argento Stripes","price":29,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGWp7sw","preview":true,"priority":0,"id":109323},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVBdtO4","preview":false,"priority":0,"id":109322},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyRLI8X","preview":false,"priority":0,"id":109324}],"comments":[],"ratingAverage":0,"label":"Argento Stripes","description":"<p>Das Konfigurationshandbuch finden Sie auf unserer <a href=\"https://docs.swissuplabs.com/shopware/argento/stripes/\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentationsseite</a></p><p><br /></p><p>Verwenden Sie das lebendige Design von Argento Stripe, um Kunden zum Kauf in Ihrem Geschäft anzuregen. Unser E-Commerce-Shopware-Theme zielt darauf ab, die Erfahrung der Benutzer mit seinen zusätzlichen Funktionen zu verbessern. Um eine hochfunktionale Website zu erstellen, wird das Template von Entwicklern erweitert.</p><br /><p>Es ist verfügbar, Argento Stripes mit erweiterten Konfigurationsoptionen für Ihre Marke anzupassen.</p><p><br /></p><h2>Vorteile der Verwendung</h2>Argento Stripes als vielseitiges Website-Template hat viele Vorteile für Sie. Sie können das Thema als hervorragenden Ausgangspunkt und als Thema für eine andere Art von Geschäft verwenden, wenn Sie mehr als ein Unternehmen in Ihrem Unternehmen betreiben. Es kann Ihnen Geld, Zeit und Mühe sparen.<br /><br /><p>Das Streifendesign ist eine gute Wahl für die Präsentation von Elektronik, Maschinen, Transportausrüstung, Baumaterialien und Markenprodukten von Unternehmen, Bekleidung, Medikamenten, Hardware, Uhren, Schmuck, Büchern und Sportartikeln. Kontrastdesign mit großen Call-to-Action-Schaltflächen hilft Ihnen, hervorzuheben, was für Ihre Zielgruppe wichtig ist.</p><p><br /></p><h2>Responsive Design: vom Desktop bis zum Handy</h2><p>Das Argento Stripes-Design passt in jede Browserbreite und funktioniert gut auf allen Geräten und Auflösungen. Mit unserer Shopware-Vorlage erstellen Sie einen leistungsstarken und mobilfreundlichen E-Commerce-Shop.</p><p><br /></p><h2>Verbesserte Suche und Navigation</h2>Mit Argento Stripes tragen Sie dazu bei, dass Besucher Ihre Website gerne erkunden. Wir konzentrieren uns auf die Suche und Navigation, was die Konversionsrate Ihres Shops erheblich verbessern kann.<br /><br />Innerhalb der Vorlagenkonfiguration können Sie die Hintergrund-, Symbol- und Platzhalterfarbe des Suchfelds festlegen. Stellen Sie sicher, dass die Suchleiste leicht zu finden ist, da sie die Benutzererfahrung erheblich beeinflusst.<br /><br />Mit dem Argento Stripes-Design können Sie auch die Navigation anpassen:<br />Stellen Sie die Hintergrundfarbe der Navigation, die Farbe der Links auf Ebene 1 und Ebene 2 ein.<br />Schaltet die Anzeige von Pfeilen für übergeordnete Elemente des Navigationsmenüs um.<br />Heben Sie den ersten Menüpunkt mit einem speziellen Stil hervor, wenn Sie ein Amazon-ähnliches Menü mit Abteilungen verwenden.<br /><br /><p>Eine organisierte Navigation wirkt sich auf die Benutzerfreundlichkeit Ihrer Website aus. Das Argento-Streifen-Design erleichtert die Weiterleitung von Besuchern auf verschiedene Seiten Ihrer Website, wodurch die Wahrscheinlichkeit verringert wird, dass Besucher die Website verlassen.</p><p><br /></p><h2>Verbesserte Benutzererfahrung</h2>Das Argento Stripes-Design enthält zwei CMS-Blöcke. Sie können sie beim Erstellen oder Bearbeiten des Seitenlayouts verwenden.<br /><br />Der erste ist der Logo Slider CMS-Block. Es verfügt über erweiterte Einstellungen, mit denen Sie ein Bildkarussell anzeigen können. Kunden können in einer Diashow durch die Bilder scrollen, um mehr über die Angebote Ihres Shops zu erfahren. Ein Bilderkarussell verbessert die Benutzererfahrung und macht Ihre Website interaktiver.<br /><br />Der zweite CMS-Block ist der Produkt-Highlight-CMS-Block. Dies ist eine großartige Möglichkeit, bestimmte Produkte in Ihrem Online-Shop zu bewerben und die Benutzererfahrung zu optimieren, um mehr Conversions in den Einkaufswagen zu bringen.<br /><br /><p>Die Highlight-Funktion von Argento Stripes ermöglicht das Anzeigen eines zweireihigen Produkt-Sliders mit einem Link und einer Beschreibung. Sie können neue, vorgestellte, reduzierte, Bestseller und beliebte Produkte hinzufügen. Mit den erweiterten Blockierungseinstellungen ermutigen Sie Kunden, dieses Produkt direkt von der Startseite oder einer anderen Seite hinzuzufügen, auf der Sie die Blockierung vorgenommen haben.</p><p><br /></p><h2>Social-Media-Unterstützung</h2>Mit dem Argento Stripes-Thema können Sie Social-Media-Symbole neben dem Connect With Us-Block in der Fußzeile Ihres Shopware-Shops anzeigen. Mit der Vorlagenkonfiguration können Sie soziale Links konfigurieren:<br />Wählen Sie die anzuzeigenden Links zu sozialen Netzwerken aus.<br />Passen Sie Symboltext- und Hintergrundfarben sowie Symbol-Hover-Farben an.<br />Legen Sie die URL zu Ihrer Shop-Seite mithilfe der vorgefertigten Liste von Snippets fest.<br /><br /><p>Die Integration in bekannte Social-Media-Dienste gibt Ihren Kunden Vertrauen in Ihre Marke.</p><p><br /></p><h2>Verbesserte Produktseite</h2>Mit dem Design Argento Stripes können Sie Produktseitenstile und das Produktseitenlayout anpassen. Dies führt zu strukturierteren Inhalten der Produktseiten und einer besseren Kundenbindung. ·<br /><br />Beim Anpassen des Produktseitenlayouts bietet unsere Shopware-Vorlage zwei Arten von Layouts für Produktregisterkarten: Standard und erweitert.<br />In erweiterten Registerkarten geben Sie den Nutzern einen guten Überblick über die Produktvorteile. Sobald Besucher alle Informationen zu einem Produkt bereits geöffnet haben, werden sie die versteckten Inhalte nicht übersehen. Es beugt Enttäuschungen wegen fehlender Detailinformationen - etwa guter Produktbewertungen - vor.<br /><br />Innerhalb der Argento Stripes-Konfiguration ist es auch möglich:<br />Legen Sie das Layout der erweiterten Registerkarte für Cross-Selling-Produkte fest.<br />Anzeige des Produktherstellers aktivieren/deaktivieren.<br /><br /><p>Passen Sie die Produktbildgalerie an.</p><p><br /></p><h2>Aktualisierte Warenkorbseite</h2>Der Warenkorb als Checkout-Bundle-Teil ist ein wichtiger Abschnitt, um ein erfolgreiches Checkout-Erlebnis zu schaffen. Indem Sie den Einkaufswagen mit den Einstellungen von Argento Stripes aktualisieren, reduzieren Sie die Aufgabe des Einkaufswagens und fördern schnelle Klicks auf „Bestellung senden“.<br /><br />Mit der Vorlage haben Sie die Möglichkeit, das Seitenlayout des Einkaufswagens anzupassen. Sie können die Sichtbarkeit der Kopfzeile der Produkttabelle, des Einzelpreises und der Produktnummer in der Produkttabelle aktivieren. Sie können auch die Sichtbarkeit des Rabattfelds, des Felds zum Hinzufügen von Produkten und des Formulars zum Schätzen der Versandkosten in der Seitenleiste der Einkaufswagenseite aktivieren.<br /><br /><p>Mit dem Thema Argento Stripes stellen Sie sicher, dass Ihre Kunden die endgültigen Kosten kennen, bis sie ihr erstes Produkt in Ihrem Geschäft kaufen.</p><p><br /></p><h2>Hervorragende Anpassungsmöglichkeiten</h2>Die Argento Stripes-Vorlage bietet 76 Einstellungsmöglichkeiten, 2 Einkaufserlebniselemente und eine einfache Anpassung.<br /><br /><p>Unser Theme bietet die beste Grundlage und dann können Sie die notwendigen Änderungen nach Ihren Wünschen vornehmen. Es sind keine Programmierkenntnisse erforderlich. Alle Customizing-Komponenten werden in unserer Shopware-Theme-Dokumentation erklärt. Mit dem Argento Stripes-Design mit unzähligen Konfigurationsmöglichkeiten verkaufen Sie Produkte aus einer breiten Palette von E-Commerce mit unterschiedlichen Anforderungen der Kunden.</p><p><br /></p>Das Konfigurationshandbuch finden Sie auf unserer Dokumentationsseite","installationManual":"<h2>Hinzufügen von Argento Stripes zu Ihrem Shop</h2><p>Wenn Sie das Shopware-Konto verbunden haben, können Sie die Vorlage im Bereich Designs unter Erweiterungen sehen.</p><p><br /></p><h2>Installation und Aktivierung</h2>Klicken Sie auf den Link Installieren und aktivieren Sie das Thema, indem Sie den Schalter drücken.<br /><p><br /></p><h2>Vorlage dem Verkaufskanal zuweisen</h2><p>Gehen\n Sie auf der Seite „Vertriebskanal bearbeiten“ zum Abschnitt „Design“. \nKlicken Sie auf die Schaltfläche Design ändern, wählen Sie das \nArgento-Design aus und drücken Sie Speichern, um es zuzuweisen.</p>","version":"2.0.0","changelog":[{"version":"2.0.0","text":"<ul><li>Bootstrap 5 compatibility:\n<ul><li>fixed breadcrumbs styles</li><li>fixed badges styles</li><li>fixed buttons styles</li><li>fixed forms styles</li><li>added quantity selector styles</li><li>fixed navigation flyout bar styles</li><li>fixed media-breakpoint-down mixin usage</li><li>replaced the removed hover-focus mixin</li><li>updated templates to use newly renamed Bootstrap utilities, helpers, and components classes</li></ul>\n</li><li>Updated cart and checkout to use new line item templates (Shopware 6.5 compatibility)</li><li>Removed previously deprecated code from templates</li><li>Fixed js error on product page with cross selling block</li><li>Added product gallery config to control dots navigation (disabled by default)</li><li>Reviews link style fix on product page</li></ul>","creationDate":{"date":"2023-06-15 15:23:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Multiply updates according to quality guidlines<br /></p>","creationDate":{"date":"2023-03-08 16:40:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>Initial release of Argento Stripes theme</li></ul>","creationDate":{"date":"2023-02-27 17:11:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=swiss66950268459","redirectToStore":false,"lowestPriceValue":29}