{"id":16756,"name":"BarnPromotion","code":"barn731467363293","lastChange":{"date":"2023-07-18 11:16:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3K07YW","examplePageUrl":"","moduleKey":"BarnPromotion","creationDate":{"date":"2023-03-17 15:15:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-03-23 16:31:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-03-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-03-20 17:27:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3496,"prefix":"barn","name":"Barn Projects","website":"//barnprojects.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3496_Logo_sm2.png"},"infos":[{"id":29235,"name":"Promotion Pro - Interne Werbung im Warenkorb","description":"<h2>Promotion Pro - Das effektive Shopware 6-Plugin zur Steigerung Ihrer Umsätze</h2><p>Promotion Pro ist das ultimative Shopware 6-Plugin, mit dem Sie Ihre Umsätze steigern und Ihre Verkäufe maximieren können. Mit diesem Plugin können Sie einen maßgeschneiderten Banner im Warenkorb und im Off-Canvas-Warenkorb platzieren, um spezielle Angebote und Aktionen zu bewerben. Das Besondere daran ist, dass Sie ein Bild hinterlegen können, das automatisch an die Größe des Warenkorbs angepasst wird, und den Zeitraum festlegen können, in dem der Banner angezeigt wird. Dadurch haben Sie die volle Kontrolle darüber, wann und wie Ihre Werbeaktionen präsentiert werden.</p><p><br></p><p>Was Promotion Pro auszeichnet, ist seine einfache Bedienbarkeit. Mit nur wenigen Klicks können Sie den Banner individuell anpassen und Ihre Werbeaktionen starten. Das Plugin ist sehr benutzerfreundlich gestaltet, sodass auch Shopbetreiber ohne technisches Know-how das Plugin problemlos nutzen können.</p><p>Eine weitere besondere Funktion von Promotion Pro ist die Möglichkeit, den Banner automatisch ein- und auszublenden. Sie können somit genau bestimmen, wann Ihre Werbeaktionen angezeigt werden sollen und wann nicht. So können Sie beispielsweise den Banner nur während bestimmter Zeiträume anzeigen lassen.</p><p>Promotion Pro ist nicht nur ein einfaches Plugin, sondern ein effektives Werkzeug zur Steigerung Ihrer Umsätze.</p><p><br></p><p>Hier sind einige Vorteile von Promotion Pro im Überblick:</p><p><br></p><ul><li>Effektive Steigerung der Umsätze durch gezielte Werbeaktionen</li><li>Einfache Bedienbarkeit auch für Shopbetreiber ohne technisches Know-how</li><li>Automatisches Ein- und Ausblenden des Banners</li><li>Anpassung an die Größe des Warenkorbs</li><li>Vielfältige Anpassungsoptionen an Ihre Branding-Anforderungen<br><br></li></ul><p></p><p>Wenn Sie also Ihre Verkäufe maximieren und Ihre Umsätze steigern möchten, dann ist Promotion Pro das perfekte Plugin für Sie.</p>","installationManual":"","shortDescription":"Steigern Sie Ihre Umsätze und fördern Sie Ihre Aktionen mit Promotion Pro! Mit einem Werbebanner im Warenkorb können Sie spezielle Angebote und Aktionen bewerben.","highlights":"Targeted advertising campaigns: With Promotion Pro, shop owners can place a custom banner in the shopping cart and off-canvas shopping cart to advertise special offers and promotions.\nEase of use: The plugin is designed to be very user-friendly and can be customized with just a few clicks.\nAutomatic showing and hiding: The banner can be automatically shown or hidden, so shop owners can specify exactly when their advertising campaigns should be displayed.\nAdjustment to the size of the shopping cart: The plugin automatically adjusts to the size of the shopping cart, ensuring that the image is always displayed in the optimal size.\nFlexibility: Shop owners can customize the banner and adjust the advertising campaigns to their needs. For example, they can set the period during which the banner will be displayed and customize the banner to their branding requirements.","features":"Banner advertising in the shopping cart and off-canvas shopping cart.\nOption for individual customization of the banner to meet the shop owner's needs.\nAutomatic showing and hiding of the banner.\nOption to set the period during which the banner will be displayed.\nEasy installation and setup of the plugin.\nLow technical effort required to use the plugin."},{"id":29236,"name":"Promotion Pro - Internal Advertising in the Shopping Cart","description":"<h2>Promotion Pro - The effective Shopware 6 plugin for increasing your sales</h2><p>Promotion Pro is the ultimate Shopware 6 plugin that allows you to increase your sales and maximize your revenue. With this plugin, you can place a custom banner in the shopping cart and off-canvas shopping cart to advertise special offers and promotions. What's special about it is that you can add an image that will automatically adjust to the size of the shopping cart, and you can set the period during which the banner will be displayed. This gives you full control over when and how your advertising campaigns are presented.</p><p><br></p><p>What sets Promotion Pro apart is its ease of use. With just a few clicks, you can customize the banner and start your advertising campaigns. The plugin is designed to be very user-friendly, so even shop owners without technical knowledge can easily use it.</p><p>Another special feature of Promotion Pro is the ability to automatically show or hide the banner. You can specify exactly when your advertising campaigns should be displayed and when they should not. For example, you can choose to display the banner only during specific time periods.</p><p>Promotion Pro is not just a simple plugin, but an effective tool for increasing your sales.</p><p><br></p><p>Here are some of the advantages of Promotion Pro:</p><p><br></p><ul><li>Effective increase in sales through targeted advertising campaigns</li><li>Easy to use, even for shop owners without technical knowledge</li><li>Automatic showing and hiding of the banner</li><li>Adjustment to the size of the shopping cart</li><li>Various customization options for your branding requirements<br><br></li></ul><p></p><p>If you want to maximize your sales and increase your revenue, then Promotion Pro is the perfect plugin for you.</p>\n\n\n","installationManual":"","shortDescription":"Increase your sales and promote your campaigns with Promotion Pro! With a promotional banner in the shopping cart, you can advertise special offers and promotions.","highlights":"Gezielte Werbeaktionen: Mit Promotion Pro können Shopbetreiber einen maßgeschneiderten Banner im Warenkorb und im Off-Canvas-Warenkorb platzieren, um spezielle Angebote und Aktionen zu bewerben.\nEinfache Bedienbarkeit: Das Plugin ist sehr benutzerfreundlich gestaltet und lässt sich mit nur wenigen Klicks individuell anpassen.\nAutomatisches Ein- und Ausblenden: Der Banner kann automatisch ein- und ausgeblendet werden, sodass Shopbetreiber genau bestimmen können, wann ihre Werbeaktionen angezeigt werden sollen.\nAnpassung an die Größe des Warenkorbs: Das Plugin passt sich automatisch an die Größe des Warenkorbs an, sodass das Bild immer in der optimalen Größe dargestellt wird.\nFlexibilität: Shopbetreiber können den Banner individuell anpassen und die Werbeaktionen an ihre Bedürfnisse anpassen. Sie können beispielsweise den Zeitraum festlegen, in dem der Banner angezeigt wird, und den Banner an ihre Branding-Anforderungen anpassen.","features":"Banner-Werbung im Warenkorb und im Off-Canvas-Warenkorb\nMöglichkeit zur individuellen Anpassung des Banners an die Bedürfnisse des Shop-Betreibers\nAutomatisches Ein- und Ausblenden des Banners\nMöglichkeit zur Festlegung des Zeitraums, in dem der Banner angezeigt wird\nEinfache Installation und Einrichtung des Plugins\nGeringer technischer Aufwand zur Nutzung des Plugins"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167394,"bookingKey":"barn731467363293","bookingText":"Promotion Pro - Internal Advertising in the Shopping Cart","price":30,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":167393,"bookingKey":"barn731467363293_M","bookingText":"Promotion Pro - Internal Advertising in the Shopping Cart","price":3,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVs4gXl","preview":true,"priority":0,"id":111043},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOubm6k","preview":false,"priority":3,"id":111224},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGuqa1m","preview":false,"priority":2,"id":111225},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1EqE39","preview":false,"priority":1,"id":111226},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJunwCQ","preview":false,"priority":0,"id":111551}],"comments":[],"ratingAverage":0,"label":"Promotion Pro - Interne Werbung im Warenkorb","description":"<h2>Promotion Pro - Das effektive Shopware 6-Plugin zur Steigerung Ihrer Umsätze</h2><p>Promotion Pro ist das ultimative Shopware 6-Plugin, mit dem Sie Ihre Umsätze steigern und Ihre Verkäufe maximieren können. Mit diesem Plugin können Sie einen maßgeschneiderten Banner im Warenkorb und im Off-Canvas-Warenkorb platzieren, um spezielle Angebote und Aktionen zu bewerben. Das Besondere daran ist, dass Sie ein Bild hinterlegen können, das automatisch an die Größe des Warenkorbs angepasst wird, und den Zeitraum festlegen können, in dem der Banner angezeigt wird. Dadurch haben Sie die volle Kontrolle darüber, wann und wie Ihre Werbeaktionen präsentiert werden.</p><p><br /></p><p>Was Promotion Pro auszeichnet, ist seine einfache Bedienbarkeit. Mit nur wenigen Klicks können Sie den Banner individuell anpassen und Ihre Werbeaktionen starten. Das Plugin ist sehr benutzerfreundlich gestaltet, sodass auch Shopbetreiber ohne technisches Know-how das Plugin problemlos nutzen können.</p><p>Eine weitere besondere Funktion von Promotion Pro ist die Möglichkeit, den Banner automatisch ein- und auszublenden. Sie können somit genau bestimmen, wann Ihre Werbeaktionen angezeigt werden sollen und wann nicht. So können Sie beispielsweise den Banner nur während bestimmter Zeiträume anzeigen lassen.</p><p>Promotion Pro ist nicht nur ein einfaches Plugin, sondern ein effektives Werkzeug zur Steigerung Ihrer Umsätze.</p><p><br /></p><p>Hier sind einige Vorteile von Promotion Pro im Überblick:</p><p><br /></p><ul><li>Effektive Steigerung der Umsätze durch gezielte Werbeaktionen</li><li>Einfache Bedienbarkeit auch für Shopbetreiber ohne technisches Know-how</li><li>Automatisches Ein- und Ausblenden des Banners</li><li>Anpassung an die Größe des Warenkorbs</li><li>Vielfältige Anpassungsoptionen an Ihre Branding-Anforderungen<br /><br /></li></ul><p></p><p>Wenn Sie also Ihre Verkäufe maximieren und Ihre Umsätze steigern möchten, dann ist Promotion Pro das perfekte Plugin für Sie.</p>","installationManual":"","version":"1.0.1","changelog":[{"version":"1.0.1","text":"<p>Compatibility with Shopware 6.5</p>","creationDate":{"date":"2023-06-14 15:28:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial Release in Store</p>","creationDate":{"date":"2023-03-20 17:35:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=barn731467363293","redirectToStore":false,"lowestPriceValue":3}