{"id":16824,"name":"ACSInformatik_WFV","code":"ACSIn15176916291","lastChange":{"date":"2023-07-18 11:16:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpL2oort","examplePageUrl":"","moduleKey":"ACSInformatik_WFV","creationDate":{"date":"2023-03-30 15:55:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-05-05 16:20:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-04-30 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-04-18 15:46:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4112,"prefix":"ACSIn","name":"ACS Informatik GmbH","website":"//qaddress.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4112_190107-QADDRESS-ICON-Q_dot-fade-128x128.png"},"infos":[{"id":29351,"name":"Adressprüfung, AutoComplete, Adress-Validierung für Shopware 6","description":"<p class=\"A1\"><b>q.address</b>&nbsp;unterstützt Ihre Shop-Kunden bei der Eingabe ihrer Rechnungs- und Lieferanschrift durch smarte Hilfestellungen, inklusive&nbsp;<b>AutoComplete</b>,&nbsp;<b>AutoFill&nbsp;</b>und&nbsp;<b>AutoCorrect</b>. Als App (\"App First\") unterstützt q.address alle Shopware-Plattformen Cloud (SaaS), Paas und Self-hosted.&nbsp;</p><p class=\"A1\">Dabei arbeitet&nbsp;<b>q.address</b>&nbsp;mit den Referenzdaten der Deutschen Post (Datafactory) und der jeweiligen nationalen Organisationen und reduziert dadurch die Kosten für nachträgliche Leitcodierungen, Rückläufer und Rückfragen. Korrekte Adressen verbessern außerdem die Adressqualität in Ihren Nachfolgesystemen (CRM, ERP, Warenwirtschaft) und erleichtern die Dublettenerkennung und Dublettenvermeidung.</p><p class=\"A1\"><b>q.address</b>&nbsp;unterstützt alle Standard- und selbst angepassten oder neu erstellten Formularvarianten und passt diese Ihren Wünschen optional an, indem es etwa das Land vor die Adresse oder die Straße hinter die PLZ- und Ortsangabe verschiebt. Auch können weitere Datenfelder wie eine separate Hausnummer (inkl. automatischer Abspaltung der Hausnummer), der Ortsteil, das Bundesland (bzw. Kanton), der Gemeindeschlüssel oder der DHL-Straßencode für die Leitcodierung bedient werden. Bei alledem ist&nbsp;<b>q.address</b>&nbsp;responsiv, so dass es auch auf Smartphones und Tablets optimal dargestellt wird.</p><p class=\"A1\"><b>q.address</b>&nbsp;zeichnet sich durch besondere Benutzerfreundlichkeit aus, berichtigt Eingabefehler, macht Berichtigungsvorschläge, ergänzt und vervollständigt Eingaben, wo es möglich und sinnvoll ist. Die Adresseingabe erfolgt am Ende des Bestellprozesses, da ist es wichtig, dass Ihren Kunden die gewohnte und zügige Eingabe seiner Adresse angeboten wird, damit es nicht im letzten Augenblick zum Bestellabbruch kommt!&nbsp;</p><p class=\"A1\">Testen Sie&nbsp;<b>q.address</b>&nbsp;am besten selbst:&nbsp;<a href=\"https://apps.qaddress.com/autocomplete\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\"><b>Zum Test</b></a></p>","installationManual":"<p>Die App wird wie üblich aus dem Shopware Store installiert.</p><p>Nach der Installation der App müssen Sie einmalig das <b>q.address Anwender Portal</b> besuchen, um die Erweiterung dadurch zu initialisieren. Gehen Sie dazu in der <b>Administration</b> Ihres Shops zu <b>Erweiterungen</b> und dann zu <b>Meine Erweiterungen</b> und wählen Sie hier <b>q.address konfigurieren</b> (via Drei-Punkte-Menü), um dann mit einem Rechtsklick das <b>q.address Anwender Portal</b> aufzurufen. Weitere Maßnahmen sind nicht erforderlich.</p><p>Sie können das Anwender Portal sofort wieder schließen oder einen Blick auf die Einstellungen und Konfiguration werfen und eventuell einige Anpassungen vornehmen. Alle Anpassungen werden wirksam, sobald Sie sie bestätigen (Schaltfläche \"Speichern\"). Nach Ihrem Besuch des Anwender Portals ist die Erweiterung einsatzbereit.</p><p>In der Administration Ihres Shops (siehe oben: Meine Erweiterungen) finden Sie auch Links zu den <b>Datenschutzhinweisen</b>, dem <b>Auftragsverarbeitungsvertrag</b> (AVV) sowie für die <b>Bestellung</b> weiterer kostenloser Testprüfungen sowie kostenpflichtiger produktiver Prüfungen nach Beendigung der Testperiode.</p><p><br></p>","shortDescription":"q.address unterstützt Ihren Shop-Kunden bei der Eingabe seiner Anschrift durch smarte Hilfestellungen und AutoComplete, AutoFill, AutoCorrect sowie einen finalen Adresscheck.","highlights":"Höchste Benutzerfreundlichkeit durch smarten Adresseingabe-Assistenten\nAutomatische Fehlerberichtigung, AutoComplete, AutoFill, AutoCorrect\nResponsiv und adaptiv für die mobile Nutzung\nZuverlässige Leitcode-Generierung, keine Kosten mehr für die Nachcodierung\nEinfache Anpassung an geänderte und individuelle Formularvarianten","features":"Vorteile korrekter Adressen:\n... Zuverlässige Zustellung: Vermeidung von Reklamationen, Retouren, Rückfragen \n... Störungsfreie Verarbeitungsprozesse: verbesserte Dublettenerkennung und Wiedererkennung von Kunden bei der Übernahme neuer Bestellungen, zuverlässige DHL-Leitcode-Generierung (keine Kosten mehr für Nachcodierung)\n... Abwehr von Betrugsversuchen und der Umgehung von Kundensperren\nInstallation und Konfiguration:\n... One-Click-Installation aus dem Shopware Store\n... Komfortabler Konfigurationsdialog im q.address Kundenportal\n... Automatische Anpassung der Shopware Adressformulare (optionale Verschiebung des Landes vor die Adresse, der Straße hinter PLZ/Ort)\n... Unterstützung individueller Formulare und Felder (z.B. Hausnummer, Ortsteil, Bundesland, Gemeindeschlüssel, DHL Straßencode)\n... Prüfung auf Hausnummer und Abspaltung in eigenes Feld\n... Individuelle Anpassungen durch den Hersteller möglich (gegen Berechnung)\n... In Kürze verfügbar: Kartenbasierte Auswahl von DHL Paketshops und Packstationen \nDeutsches Produkt, deutschsprachige Beratung und Support für Shopbetreiber und Agenturen\nApp First: Unterstützt als App Shopware 6 Cloud (SaaS), Paas und Self hosted\n100% DSGV konform: q.address Cloud Services ausschließlich in Deutschland gehostet, eingebundene Services von Drittanbietern ausschließlich in Deutschland oder der EU gehostet, keine Weitergabe personenbezogener Daten in Drittländer oder die USA etwa durch den Einsatz des Google Maps API."},{"id":29352,"name":"Address check, AutoComplete, address validation for Shopware 6","description":"<b>q.address</b> supports your store customers in entering their billing and shipping addresses with smart assistance, including <b>AutoComplete</b>, <b>AutoFill </b>and <b>AutoCorrect</b>. As an app (\"App First\"), it supports all Shopware platforms&nbsp; Cloud (SaaS), Paas and Self-hosted.&nbsp;<p>&nbsp;In doing so, q.address works with the reference data of Deutsche Post (Datafactory) and national organizations and thus reduces the costs for subsequent routing recoding, returns and callbacks. Correct addresses also improve the address quality in your subsequent systems (CRM, ERP, merchandise management) and help to identify and avoid duplicate addresses.&nbsp;</p><p><b>q.address</b> supports all standard and self-customized or newly created form variants and optionally adapts them to your wishes, for example by moving the country in first place of address or the street behind the postal code and city name. Additional data fields such as a separate house number (including automatic splitting of the house number), the district, the federal state (or canton), the community key or the DHL street code required for the routing code (DHL Leitcode) can also be provided. In all this,&nbsp;<b style=\"color: var(--sw-paragraph); font-family: var(--sw-font-family);\">q.address</b> is responsive, so that it is also optimally presented on smartphones and tablets.&nbsp;</p><p><b>q.address</b> is particularly user-friendly, corrects input errors, suggests corrections, and completes entries where possible and useful. The address is entered at the end of the ordering process, so it is important that your customer is able to enter their address in the accustomed way and quickly, so that the order process is not aborted at the last moment!&nbsp;</p><p>Best try out <b>q.address</b> for yourself:&nbsp;<a href=\"https://apps.qaddress.com/autocomplete\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: var(--sw-font-family);\"><b>Go to test</b></a></p>","installationManual":"<p>The app is installed as usual out of the Shopware Store.</p><p>After installing the app, you must visit the <b>q.address User Portal</b> once in order to initialize the extension. To do this, go to <b>Extensions</b> in the <b>Administration</b> of your shop and then to <b>My extensions</b> and select here <b>Configure q.address</b> (via Three-Dot-Menu), and open the <b>q.address User Portal</b> with a right click. No further action is required.</p><p>You can close the User Portal right away or take a look at the settings and configuration and maybe make some adjustments. Any adjustments take effect as soon as you confirm them (button “Save”). After your visit of the User Portal, the extension is ready for use.</p><p>In the Administration of your shop (see above: My Extensions) you will also find links to the <b>Privacy Statement</b>, the <b>Data Processing Agreement</b> (DPA) and for <b>Ordering</b> further free test checks as well as paid productive checks after the end of the test period.</p><p><br></p>","shortDescription":"q.address supports your store customer when entering his address with smart help and AutoComplete, AutoFill, AutoCorrect as well as a final AddressCheck.","highlights":"Maximum user-friendliness thanks to smart address entry wizard\nAutomatic error correction, AutoComplete, AutoFill, AutoCorrect\nResponsive and adaptive for mobile use\nReliable routing code generation (DHL Leitcode), no longer re-coding costs\nEasy customization to modified and individual form variants","features":"Advantages of correct addresses:\n... Reliable delivery: avoid complaints, returns, callbacks\n... Trouble-free processing: improved duplicate detection and customer recognition when taking over new orders, reliable DHL routing code generation (no longer costs for re-coding)\n... Prevention of fraud attempts and attempts to circumvent blacklists\nInstallation and configuration:\n... One-click installation from the Shopware Store\n... Comfortable configuration dialog in the q.address Customer Portal\n... Automatic customization of the Shopware address forms (optional moving of country in first place of addresses, street behind postal code/city).\n... Support of individual forms and fields (e.g. house number, district, federal state, community key, DHL street code)\n... Check for house number and splitting off into separate field\n... Individual adaptations by the manufacturer possible (at extra charge)\nGerman product, English and German consulting and support for store operators and agencies\nApp First: As an app, it supports Shopware 6 Cloud (SaaS), Paas and Self-hosted\n100% GDPR compliant: q.address cloud services hosted exclusively in Germany, integrated third-party services hosted exclusively in Germany or the EU, no transfer of personal data to third countries or the USA, for example by using the Google Maps API."}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167525,"bookingKey":"ACSIn15176916291","bookingText":"Adressprüfung, AutoComplete, Adress-Validierung für Shopware 6","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCFIzLG","preview":true,"priority":290,"id":114065},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeaAq5T","preview":false,"priority":280,"id":115343},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoRJ86V","preview":false,"priority":260,"id":115345},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphWxkOD","preview":false,"priority":240,"id":115344},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvN1kqS","preview":false,"priority":220,"id":115346},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprghTIM","preview":false,"priority":200,"id":115347}],"comments":[],"ratingAverage":0,"label":"Adressprüfung, AutoComplete, Adress-Validierung für Shopware 6","description":"<p><b>q.address</b> unterstützt Ihre Shop-Kunden bei der Eingabe ihrer Rechnungs- und Lieferanschrift durch smarte Hilfestellungen, inklusive <b>AutoComplete</b>, <b>AutoFill </b>und <b>AutoCorrect</b>. Als App (\"App First\") unterstützt q.address alle Shopware-Plattformen Cloud (SaaS), Paas und Self-hosted. </p><p>Dabei arbeitet <b>q.address</b> mit den Referenzdaten der Deutschen Post (Datafactory) und der jeweiligen nationalen Organisationen und reduziert dadurch die Kosten für nachträgliche Leitcodierungen, Rückläufer und Rückfragen. Korrekte Adressen verbessern außerdem die Adressqualität in Ihren Nachfolgesystemen (CRM, ERP, Warenwirtschaft) und erleichtern die Dublettenerkennung und Dublettenvermeidung.</p><p><b>q.address</b> unterstützt alle Standard- und selbst angepassten oder neu erstellten Formularvarianten und passt diese Ihren Wünschen optional an, indem es etwa das Land vor die Adresse oder die Straße hinter die PLZ- und Ortsangabe verschiebt. Auch können weitere Datenfelder wie eine separate Hausnummer (inkl. automatischer Abspaltung der Hausnummer), der Ortsteil, das Bundesland (bzw. Kanton), der Gemeindeschlüssel oder der DHL-Straßencode für die Leitcodierung bedient werden. Bei alledem ist <b>q.address</b> responsiv, so dass es auch auf Smartphones und Tablets optimal dargestellt wird.</p><p><b>q.address</b> zeichnet sich durch besondere Benutzerfreundlichkeit aus, berichtigt Eingabefehler, macht Berichtigungsvorschläge, ergänzt und vervollständigt Eingaben, wo es möglich und sinnvoll ist. Die Adresseingabe erfolgt am Ende des Bestellprozesses, da ist es wichtig, dass Ihren Kunden die gewohnte und zügige Eingabe seiner Adresse angeboten wird, damit es nicht im letzten Augenblick zum Bestellabbruch kommt! </p><p>Testen Sie <b>q.address</b> am besten selbst: <a href=\"https://apps.qaddress.com/autocomplete\" target=\"_blank\" rel=\"noreferrer noopener\"><b>Zum Test</b></a></p>","installationManual":"<p>Die App wird wie üblich aus dem Shopware Store installiert.</p><p>Nach der Installation der App müssen Sie einmalig das <b>q.address Anwender Portal</b> besuchen, um die Erweiterung dadurch zu initialisieren. Gehen Sie dazu in der <b>Administration</b> Ihres Shops zu <b>Erweiterungen</b> und dann zu <b>Meine Erweiterungen</b> und wählen Sie hier <b>q.address konfigurieren</b> (via Drei-Punkte-Menü), um dann mit einem Rechtsklick das <b>q.address Anwender Portal</b> aufzurufen. Weitere Maßnahmen sind nicht erforderlich.</p><p>Sie können das Anwender Portal sofort wieder schließen oder einen Blick auf die Einstellungen und Konfiguration werfen und eventuell einige Anpassungen vornehmen. Alle Anpassungen werden wirksam, sobald Sie sie bestätigen (Schaltfläche \"Speichern\"). Nach Ihrem Besuch des Anwender Portals ist die Erweiterung einsatzbereit.</p><p>In der Administration Ihres Shops (siehe oben: Meine Erweiterungen) finden Sie auch Links zu den <b>Datenschutzhinweisen</b>, dem <b>Auftragsverarbeitungsvertrag</b> (AVV) sowie für die <b>Bestellung</b> weiterer kostenloser Testprüfungen sowie kostenpflichtiger produktiver Prüfungen nach Beendigung der Testperiode.</p><p><br /></p>","version":"1.2.5","changelog":[{"version":"1.2.5","text":"<p>The versions 1.2.4 and 1.2.5 are functionally identical and differ only in the supported Shopware version 6.4 and 6.5. If you install or update the Extension from the Shopware Store, the Store will automatically select the version that fits your shop.</p><p>Changes: Support of new address form “modern” (postal code and city on one field) besides Form “classic” (postal code and city two fields). Other minor improvements.</p>","creationDate":{"date":"2023-06-09 11:37:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"<p>See Version 1.1.5.</p><p>Compatibility: Shopware 6.5</p>","creationDate":{"date":"2023-06-09 11:36:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>See Version 1.1.4.</p><p>Compatibility: Shopware 6.5</p>","creationDate":{"date":"2023-05-17 12:45:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>Changes: Improvements of sort and ranking of Smart Assistant suggestions.</p><p>Compatibility: Shopware 6.4</p>","creationDate":{"date":"2023-05-17 12:53:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Initial release of the q.address Extension for Shopware 6.4.</p>","creationDate":{"date":"2023-05-15 16:39:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Initial release of the q.address Extebnsion for Shopware 6.5.</p>","creationDate":{"date":"2023-03-31 20:43:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=ACSIn15176916291","redirectToStore":false,"lowestPriceValue":0}