{"id":16909,"name":"AcrisFlowBuilderDelayCS","code":"acris91356760259","lastChange":{"date":"2023-07-24 09:06:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKjmSqX","examplePageUrl":"","moduleKey":"AcrisFlowBuilderDelayCS","creationDate":{"date":"2023-04-26 09:57:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2023-05-24 09:36:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-04-26 09:59:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":469,"prefix":"acris","name":"ACRIS E-Commerce GmbH","website":"//www.acris.at","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod469_ACRIS_Logo_128x128px.jpg"},"infos":[{"id":29504,"name":"Flow Builder Erweiterung: Zeitliche Verzögerung (Minuten, Stunden, Tage)","description":"<h3>Zweck des Plugins</h3><p>Der Shopware Flow Builder ist ein \nleistungsfähiges Werkzeug, mit dem Du automatisierte Workflows erstellen\n und Deine Geschäftsprozesse optimieren kannst. <br><b>Im Shopware \nStandard fehlt jedoch eines der nützlichen Features des Flow Builders:&nbsp; \nDie Möglichkeit, zeitverzögerte Aktionen zu definieren.</b></p><p>Mit \nzeitverzögerten Flow Actions kannst Du eine oder mehrere Aktionen nach \neinem bestimmten Zeitraum auslösen. Das bedeutet, dass Du Flows aus dem \nFlow Builder zeitversetzt auslösen kannst. So kannst Du beispielsweise \nautomatisierte E-Mails versenden, eine Woche nach einer Bestellung, um \nnach einer Produktbewertung zu fragen oder weitere passende Angebote zum\n Produkt vorzuschlagen.</p><p>Die Verwendung von zeitverzögerten \nAktionen ist eine effektive Möglichkeit, um Deine Kundenbindung zu \nstärken und Deine Verkaufszahlen zu steigern. Indem Du Deinen Kunden \nautomatisierte und personalisierte E-Mails mit relevanten Angeboten und \nProdukten sendest, kannst Du ihre Erfahrung mit Deinem Unternehmen \nverbessern und ihre Zufriedenheit steigern.</p><p>Zusätzlich dazu gibt \nDir die Verwendung von zeitverzögerten Aktionen die Möglichkeit, Zeit \nund Ressourcen zu sparen. Indem Du Prozesse automatisierst, die \nnormalerweise manuell ausgeführt werden müssten, kannst Du Dich auf \nandere wichtige Aufgaben konzentrieren, die Dein Unternehmen \nvoranbringen.</p><p>Insgesamt bietet der Flow Builder mit \nzeitverzögerten Aktionen eine leistungsstarke Möglichkeit, Deine \nGeschäftsprozesse zu automatisieren und Deine Kundenbindung zu stärken. \nNutze dieses Feature, um Dein Unternehmen zu optimieren und erfolgreich \nzu sein.<br><br>Neues Feature &gt;1.4.x : Log Modul hinzugefügt, so dass man sehen kann, welche Flows abgearbeitet wurden.<br></p><p><br></p><h3>Nutzung des Plugins</h3><p>Nach erfolgter Installation des Plugins steht beim Flow Builder, wenn ein Flow angelegt wird, eine zusätzliche Option zur Verfügung: Add delay (WAIT) zur Verfügung.</p><p>Es gibt hier die Optionen: <b>Minuten, Stunde und Tage </b>zur Verfügung. (es sind nur ganze Zahlen erlaubt). Somit ist auf einfache Weise eine Unterbrechung des Flows mit einer zeitlichen Komponente möglich.</p><p><br></p><p>Alle wartenden (verzögerten) Flows sind hier aufgelistet: Einstellungen &gt; Erweiterungen &gt; Flow Builder Verzögerungen<br></p><p>Es wird hier die \"nächste Ausführungszeit, der Flow Name, der nächste Aktionstyp, die nächste Aktion sowie das Erstellungsdatum der Verzögerung angeführt.</p><p>Wenn Flows erfolgreich abgearbeitet wurden, dann wird der Task aus der Liste gelöscht - nur wenn ein Fehler auftritt, dann bleibt der Eintrag hier bestehen und wird mit einem Fehler markiert.</p><p><br></p><h3>Mitgelieferte Flows /Rule Builder Regeln / E-Mail Template (sollen die Möglichkeiten zeigen)<br></h3><p>Wir haben einige nützliche Flows mitgeliefert, diese können je nach Wunsch angepasst bzw. natürlich auch neue Flows mit zeitlicher Verzögerung erstellt werden. Diese sind im Standard nicht aktiv und sollten auf jeden Fall überprüft / getestet werden, ob dieser den Anforderungen entspricht. (Die Flow Builder Namen sind in englisch, da es im Shopware Standard keine Möglichkeit für eine Übersetzung der Flow Namen gibt.)<br><b>Einstellungen &gt; Flow Builder:<br></b></p><ul><li>ACRIS send review email 7 days after the order delivery state status is changed to \"Shipped\"</li><li>ACRIS set order and payment status to \"Canceled\" after 14 days if payment method is \"Paid in advance\" and order payment status is not set to \"Paid\"</li><li>ACRIS send payment reminder email after 7 days if payment method is \"Paid in advance\" and payment status is not set to \"Paid\"</li><li>ACRIS send payment reminder email after 7 days for non-completed and non-cancelled payment and order</li><li>ACRIS set the order status to \"Canceled\" after 24 hours if the order payment status is set to \"Failed\"</li><li>ACRIS set the order status to \"Canceled\" after 24 hours if the order payment status is set to \"Canceled\"<br></li></ul><p><br></p><p>Zusätzlich haben wir 2 RuleBuilder Regeln mitgeliefert, diese bitte ebenfalls prüfen, bevor sie diese produktiv einsetzen:</p><p><b>Einstellungen &gt; RuleBuilder</b><br></p><ul><li>ACRIS payment method \"Paid in advance\" and the payment status is not \"Paid\"</li><li>ACRIS payment reminder for non-completed and non-cancelled payment and order</li></ul><p><br></p><p>Für Testzwecke der Flows haben wir auch ein Demo E-Mail Template mitgeliefert:<br></p><p><b>Einstellungen &gt; E-Mail Template</b></p><ul><li>ACRIS Flow Builder Delay: payment has not yet been made</li></ul><p><br></p><p><b>Zusätzliche RuleBuilder / Flow Builder Conditions<br></b></p><ul><li>Zahlungsstatus der Bestellung (bezahlt, offen, ...)</li></ul><ul><li>Bestellung Lieferstatus (versandt, offen,...)</li></ul><ul><li>Bestellungsstatus (erledigt, offen,...)</li></ul><p><br></p><h3>Funktionsweise der Verzögerungsfunktion</h3><p>Wenn eine Verzögerung in den Flow eingebaut wird, dann wird der Workflow bis dahin abgearbeitet und wartet dann die angegebene Zeit bis der nächste Schritt ausgeführt wird. Sobald durch den auszulösenden Trigger der Flow gestartet wird, läuft der Flow bis zur Verzögerung und es wird ein entsprechender Eintrag bei dem Flow hinzugefügt - dieser kann entweder direkt beim Flow eintsprechenden Tab angesehen werden bzw. alle wartenden Flows sind unter Einstellungen &gt; Erweiterungen &gt; Flow Builder Verzögerung aufgelistet. Die Abarbeitung findet durch die in Shopware implementierten Funktionen \"Scheduled Tasks\" bzw. der \"Message Queue\" statt und sobald der Flow weitergelaufen ist, wird der wartende Eintrag geleert. &nbsp; <br></p><p><br></p><h3>Voraussetzungen</h3><p>Damit die Zeitverzögerung korrekt abgearbeitet wird, setzt das Plugin die korrekte Konfiguration des Scheduled Task bzw. der Message Queue voraus<br>https://docs.shopware.com/de/shopware-6-de/tutorials-und-faq/message-queue-und-scheduled-tasks</p><p><br></p><h3>Bekannte Einschränkungen</h3><p>Die Zeitverzögerungen starten mit dem auszulösenden Trigger - das bedeutet im Umkehrschluss, dass z.B. alte Bestellungen nicht berücksichtigt werden, sondern erst ab Aktivierung des Triggers die Funktion ausgelöst wird.<br></p>","installationManual":"<p>Die Installation des Plugin erfolgt wie in Shopware üblich. Danach steht beim Flow Builder eine zusätzliche Option der Zeitverzögerung zur Verfügung. Zusätzlich werden mehrere Demo Flows hinzugefügt sowie mehrere Rule Builder Rules und ein E-Mail Template - diese dienen zu Demo Zwecken und müssen vor der produktiven Nutzung entsprechend getestet und angepasst werden. Unter Einstellungen &gt; Erweiterungen &gt; Flow Builder Zeitverzögerung werden alle zeitlich verzögerten Flows aufgelistet.</p>","shortDescription":"Erweitert den Flow Builder um die Option zeitliche Verzögerungen in die Flows zu implementieren. Somit können Flows um Minuten, Stunden oder Tage verzögert werden.","highlights":"Erweitert den Flow Builder um die Möglichkeit einer Zeitverzögerung\nMöglich sind Verzögerungen um Minuten, Stunden, Tagen\nNahtlose Integration in den Flow Builder von Shopware\nAlle zeitverzögerten Flows werden aufgelistet und wenn diese abgearbeitet werden wieder gelöscht","features":"Flow Builder Feature: Zeitverzögerung um Minute, Stunden oder Tage möglich\nAuflistung der getriggerten Flows die auf die Abarbeitung warten (danach werden diese aus der Liste wieder entfernt)\nEs werden mehrere Muster für sinnvolle Flows mitgeliefert\nEs werden einige Rule Builder Rules für Demo Zwecke mitgeliefert\nEs wird dein E-Mail Template für Demo Zwecke mitgeliefert"},{"id":29505,"name":"Flow Builder extension: Time delay (minutes, hours, days)","description":"<h3>Purpose of the Plugin</h3><p>The Shopware Flow Builder is a powerful tool that allows you to create automated workflows and optimize your business processes. However, one of the useful features of the Flow Builder is missing in the Shopware standard: the ability to define delayed actions.</p><p>With delayed flow actions, you can trigger one or more actions after a certain period of time. This means that you can trigger flows from the Flow Builder after a delay. For example, you can automatically send emails to request a product review or suggest other relevant offers a week after an order has been placed.</p><p>Using delayed actions is an effective way to strengthen customer loyalty and increase sales. By sending automated and personalized emails with relevant offers and products, you can improve your customers' experience with your company and increase their satisfaction.</p><p>In addition, using delayed actions allows you to save time and resources. By automating processes that would normally have to be performed manually, you can focus on other important tasks that will move your business forward.</p><p>Overall, the Flow Builder with delayed actions offers a powerful way to automate your business processes and strengthen customer loyalty. Use this feature to optimize your business and be successful.</p><p><br>New Feature &gt;1.4.x : Added Log Modul, so its possible to see what happened in the past.<br></p><p><br></p><h3>Usage of the Plugin</h3><p>After installing the plugin, when creating a flow in the Flow Builder, an additional option is available: Add delay (WAIT).</p><p>There are options for minutes, hours, and days (only whole numbers are allowed) to create a delay in the flow.</p><p>All waiting (delayed) flows are listed here: Settings &gt; Extensions &gt; Flow Builder Delays. The \"next execution time,\" flow name, next action type, next action, and creation date of the delay are listed.</p><p>If flows are successfully completed, the task is removed from the list. If an error occurs, the entry remains in the list and is marked with an error.</p><p><br></p><h3>Supplied Flows/Rule Builder Rules/Email Template (to demonstrate the possibilities):</h3><p>We have included some useful flows that can be customized or new flows with delayed actions can be created as desired. These are not active by default and should definitely be checked/tested to ensure that they meet your requirements. (Flow Builder names are in English as there is no way to translate flow names in the Shopware standard.)</p><p><b>Settings &gt; Flow Builder:</b></p><ul><li>ACRIS send review email 7 days after the order delivery state status is changed to \"Shipped\"</li><li>ACRIS\n set order and payment status to \"Canceled\" after 14 days if payment \nmethod is \"Paid in advance\" and order payment status is not set to \n\"Paid\"</li><li>ACRIS send payment reminder email after 7 days if payment method is \"Paid in advance\" and payment status is not set to \"Paid\"</li><li>ACRIS send payment reminder email after 7 days for non-completed and non-cancelled payment and order</li><li>ACRIS set the order status to \"Canceled\" after 24 hours if the order payment status is set to \"Failed\"</li><li>ACRIS set the order status to \"Canceled\" after 24 hours if the order payment status is set to \"Canceled\"<br></li></ul><p><br></p><p>In addition, we have included 2 RuleBuilder rules, which should also be checked before using them productively:</p><p><b>Settings &gt; RuleBuilder</b></p><ul><li>ACRIS payment method \"Paid in advance\" and the payment status is not \"Paid\"</li><li>ACRIS payment reminder for non-completed and non-cancelled payment and order</li></ul><p><br></p><p>For testing purposes of the flows, we have also included a demo email template:</p><p><b>Settings &gt; Email Template</b></p><ul><li>ACRIS Flow Builder Delay: payment has not yet been made</li></ul><p><br></p><p><b>Additional RuleBuilder / Flow Builder conditions</b></p><ul><li>Order Payment Status (paid, open, ...)</li></ul><ul><li>Order Delivery Status (shipped, open,...)</li></ul><ul><li>Order Status (done, open,...)</li></ul><p><br></p><h3>Functionality of the Delay Function</h3><p>When a delay is built into the flow, the workflow is executed up until that point and then waits for the specified time before executing the next step. Once the flow is triggered, it runs up to the delay, and an entry is added to the flow indicating the waiting time. This entry can be viewed either directly at the corresponding tab of the flow or under Settings &gt; Extensions &gt; Flow Builder Delay, where all waiting flows are listed. The execution is performed through the \"Scheduled Tasks\" or \"Message Queue\" functions implemented in Shopware, and once the flow has continued running, the waiting entry is cleared.</p><p>Requirements</p><p>To ensure proper execution of the delay, the plugin requires the correct configuration of the Scheduled Task or Message Queue.\n<br><a href=\"https://docs.shopware.com/en/shopware-6-en/tutorials-and-faq/message-queue-and-scheduled-tasks\" target=\"_new\">https://docs.shopware.com/en/shopware-6-en/tutorials-and-faq/message-queue-and-scheduled-tasks</a></p><p><br></p><h3>Known Limitations</h3><p>The time delays start with the trigger to be triggered - this means conversely that e.g. old orders are not taken into account, but the function is only triggered from the activation of the trigger.</p><p></p><p></p><p></p>","installationManual":"<p>The installation of the plugin is done as usual in Shopware. After that, an additional option of time delay is available in the Flow Builder. In addition, several demo flows are added as well as several Rule Builder Rules and an email template - these are for demo purposes and must be tested and adjusted accordingly before productive use. Under Settings &gt; Extensions &gt; Flow Builder Time Delay all time delayed flows are listed.</p>","shortDescription":"Extends the Flow Builder with the option to implement time delays in the flows. Thus, flows can be delayed by minutes, hours or days. Additionally all time-delayed flows are listed.","highlights":"Extends the Flow Builder with the possibility of a time delay.\nPossible delays are minutes, hours, days\nSeamless integration with Shopware's Flow Builder\nAll time-delayed flows are listed and deleted when they are processed again","features":"Flow Builder feature: time delay by minute, hours or days possible\nList of triggered flows waiting for processing (after that they are removed from the list)\nSeveral patterns for useful flows are provided\nSome rule builder rules are provided for demo purposes\nYour e-mail template is provided for demo purposes"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167591,"bookingKey":"acris91356760259","bookingText":"Flow Builder Verzögerung","price":199,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":167590,"bookingKey":"acris91356760259_M","bookingText":"Flow Builder Verzögerung","price":39,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqJPB1b","preview":true,"priority":0,"id":113626},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1mgpHV","preview":false,"priority":9,"id":113735},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRov7wu","preview":false,"priority":8,"id":113727},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpl1O7mS","preview":false,"priority":7,"id":113722},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpo2yCT3","preview":false,"priority":0,"id":113723},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpf17yGm","preview":false,"priority":0,"id":113725},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpr9OPqc","preview":false,"priority":0,"id":113726},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7sso2J","preview":false,"priority":0,"id":113728}],"comments":[{"authorName":"Wolfgang Pöltl","text":"Ein absolutes Muss für alle Shopbetreiber, die ihre Workflows automatisieren möchten! Dieses Plugin erweitert den Shopware-Standard basierend auf dem FlowBuilder und bietet die Möglichkeit, zeitverzögerte \"Actions\" durchzuführen. Dadurch können Bestellstatus und Zahlungsstatus automatisch gesetzt werden, ebenso wie zeitlich verzögerte E-Mails verschickt werden können, wie beispielsweise Zahlungserinnerungen oder Bewertungsanfragen nach erfolgreicher Lieferung und Nicht-Retournierung der Produkte. Dieses Plugin ist praktisch unverzichtbar für jeden Shopbetreiber!","headline":"Unverzichtbares Plugin für alle die Workflows automatisieren möchten","creationDate":{"date":"2023-06-14 10:10:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Flow Builder Erweiterung: Zeitliche Verzögerung (Minuten, Stunden, Tage)","description":"<h3>Zweck des Plugins</h3><p>Der Shopware Flow Builder ist ein \nleistungsfähiges Werkzeug, mit dem Du automatisierte Workflows erstellen\n und Deine Geschäftsprozesse optimieren kannst. <br /><b>Im Shopware \nStandard fehlt jedoch eines der nützlichen Features des Flow Builders:  \nDie Möglichkeit, zeitverzögerte Aktionen zu definieren.</b></p><p>Mit \nzeitverzögerten Flow Actions kannst Du eine oder mehrere Aktionen nach \neinem bestimmten Zeitraum auslösen. Das bedeutet, dass Du Flows aus dem \nFlow Builder zeitversetzt auslösen kannst. So kannst Du beispielsweise \nautomatisierte E-Mails versenden, eine Woche nach einer Bestellung, um \nnach einer Produktbewertung zu fragen oder weitere passende Angebote zum\n Produkt vorzuschlagen.</p><p>Die Verwendung von zeitverzögerten \nAktionen ist eine effektive Möglichkeit, um Deine Kundenbindung zu \nstärken und Deine Verkaufszahlen zu steigern. Indem Du Deinen Kunden \nautomatisierte und personalisierte E-Mails mit relevanten Angeboten und \nProdukten sendest, kannst Du ihre Erfahrung mit Deinem Unternehmen \nverbessern und ihre Zufriedenheit steigern.</p><p>Zusätzlich dazu gibt \nDir die Verwendung von zeitverzögerten Aktionen die Möglichkeit, Zeit \nund Ressourcen zu sparen. Indem Du Prozesse automatisierst, die \nnormalerweise manuell ausgeführt werden müssten, kannst Du Dich auf \nandere wichtige Aufgaben konzentrieren, die Dein Unternehmen \nvoranbringen.</p><p>Insgesamt bietet der Flow Builder mit \nzeitverzögerten Aktionen eine leistungsstarke Möglichkeit, Deine \nGeschäftsprozesse zu automatisieren und Deine Kundenbindung zu stärken. \nNutze dieses Feature, um Dein Unternehmen zu optimieren und erfolgreich \nzu sein.<br /><br />Neues Feature &gt;1.4.x : Log Modul hinzugefügt, so dass man sehen kann, welche Flows abgearbeitet wurden.<br /></p><p><br /></p><h3>Nutzung des Plugins</h3><p>Nach erfolgter Installation des Plugins steht beim Flow Builder, wenn ein Flow angelegt wird, eine zusätzliche Option zur Verfügung: Add delay (WAIT) zur Verfügung.</p><p>Es gibt hier die Optionen: <b>Minuten, Stunde und Tage </b>zur Verfügung. (es sind nur ganze Zahlen erlaubt). Somit ist auf einfache Weise eine Unterbrechung des Flows mit einer zeitlichen Komponente möglich.</p><p><br /></p><p>Alle wartenden (verzögerten) Flows sind hier aufgelistet: Einstellungen &gt; Erweiterungen &gt; Flow Builder Verzögerungen<br /></p><p>Es wird hier die \"nächste Ausführungszeit, der Flow Name, der nächste Aktionstyp, die nächste Aktion sowie das Erstellungsdatum der Verzögerung angeführt.</p><p>Wenn Flows erfolgreich abgearbeitet wurden, dann wird der Task aus der Liste gelöscht - nur wenn ein Fehler auftritt, dann bleibt der Eintrag hier bestehen und wird mit einem Fehler markiert.</p><p><br /></p><h3>Mitgelieferte Flows /Rule Builder Regeln / E-Mail Template (sollen die Möglichkeiten zeigen)<br /></h3><p>Wir haben einige nützliche Flows mitgeliefert, diese können je nach Wunsch angepasst bzw. natürlich auch neue Flows mit zeitlicher Verzögerung erstellt werden. Diese sind im Standard nicht aktiv und sollten auf jeden Fall überprüft / getestet werden, ob dieser den Anforderungen entspricht. (Die Flow Builder Namen sind in englisch, da es im Shopware Standard keine Möglichkeit für eine Übersetzung der Flow Namen gibt.)<br /><b>Einstellungen &gt; Flow Builder:<br /></b></p><ul><li>ACRIS send review email 7 days after the order delivery state status is changed to \"Shipped\"</li><li>ACRIS set order and payment status to \"Canceled\" after 14 days if payment method is \"Paid in advance\" and order payment status is not set to \"Paid\"</li><li>ACRIS send payment reminder email after 7 days if payment method is \"Paid in advance\" and payment status is not set to \"Paid\"</li><li>ACRIS send payment reminder email after 7 days for non-completed and non-cancelled payment and order</li><li>ACRIS set the order status to \"Canceled\" after 24 hours if the order payment status is set to \"Failed\"</li><li>ACRIS set the order status to \"Canceled\" after 24 hours if the order payment status is set to \"Canceled\"<br /></li></ul><p><br /></p><p>Zusätzlich haben wir 2 RuleBuilder Regeln mitgeliefert, diese bitte ebenfalls prüfen, bevor sie diese produktiv einsetzen:</p><p><b>Einstellungen &gt; RuleBuilder</b><br /></p><ul><li>ACRIS payment method \"Paid in advance\" and the payment status is not \"Paid\"</li><li>ACRIS payment reminder for non-completed and non-cancelled payment and order</li></ul><p><br /></p><p>Für Testzwecke der Flows haben wir auch ein Demo E-Mail Template mitgeliefert:<br /></p><p><b>Einstellungen &gt; E-Mail Template</b></p><ul><li>ACRIS Flow Builder Delay: payment has not yet been made</li></ul><p><br /></p><p><b>Zusätzliche RuleBuilder / Flow Builder Conditions<br /></b></p><ul><li>Zahlungsstatus der Bestellung (bezahlt, offen, ...)</li></ul><ul><li>Bestellung Lieferstatus (versandt, offen,...)</li></ul><ul><li>Bestellungsstatus (erledigt, offen,...)</li></ul><p><br /></p><h3>Funktionsweise der Verzögerungsfunktion</h3><p>Wenn eine Verzögerung in den Flow eingebaut wird, dann wird der Workflow bis dahin abgearbeitet und wartet dann die angegebene Zeit bis der nächste Schritt ausgeführt wird. Sobald durch den auszulösenden Trigger der Flow gestartet wird, läuft der Flow bis zur Verzögerung und es wird ein entsprechender Eintrag bei dem Flow hinzugefügt - dieser kann entweder direkt beim Flow eintsprechenden Tab angesehen werden bzw. alle wartenden Flows sind unter Einstellungen &gt; Erweiterungen &gt; Flow Builder Verzögerung aufgelistet. Die Abarbeitung findet durch die in Shopware implementierten Funktionen \"Scheduled Tasks\" bzw. der \"Message Queue\" statt und sobald der Flow weitergelaufen ist, wird der wartende Eintrag geleert.   <br /></p><p><br /></p><h3>Voraussetzungen</h3><p>Damit die Zeitverzögerung korrekt abgearbeitet wird, setzt das Plugin die korrekte Konfiguration des Scheduled Task bzw. der Message Queue voraus<br />https://docs.shopware.com/de/shopware-6-de/tutorials-und-faq/message-queue-und-scheduled-tasks</p><p><br /></p><h3>Bekannte Einschränkungen</h3><p>Die Zeitverzögerungen starten mit dem auszulösenden Trigger - das bedeutet im Umkehrschluss, dass z.B. alte Bestellungen nicht berücksichtigt werden, sondern erst ab Aktivierung des Triggers die Funktion ausgelöst wird.<br /></p>","installationManual":"<p>Die Installation des Plugin erfolgt wie in Shopware üblich. Danach steht beim Flow Builder eine zusätzliche Option der Zeitverzögerung zur Verfügung. Zusätzlich werden mehrere Demo Flows hinzugefügt sowie mehrere Rule Builder Rules und ein E-Mail Template - diese dienen zu Demo Zwecken und müssen vor der produktiven Nutzung entsprechend getestet und angepasst werden. Unter Einstellungen &gt; Erweiterungen &gt; Flow Builder Zeitverzögerung werden alle zeitlich verzögerten Flows aufgelistet.</p>","version":"2.3.1","changelog":[{"version":"2.3.1","text":"<p>Improves plugin compatibility.</p>","creationDate":{"date":"2023-07-21 14:44:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"- Optimises the creation of the delays of the Flow Builder.<br />- Optimises the execution of the delays of the Flow Builder.<br />- Optimises the loading of the delay data in the administration.<br />- Optimises the writing of the delay sequence data to the database.<br /><p>- Optimises the loading of the delayed sequences in the administration.</p>","creationDate":{"date":"2023-07-19 11:57:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p>Store Release, Veröffentlichung</p>","creationDate":{"date":"2023-06-16 10:40:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<ul><li>Fixed administration scss import error.</li></ul>","creationDate":{"date":"2023-07-24 09:06:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Optimises the creation of the Flow Builder delays.</p>","creationDate":{"date":"2023-07-19 11:56:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<p>Optimizes executing of the flow builder delays.</p>","creationDate":{"date":"2023-06-21 09:13:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.4","text":"<p>Improves plugin compatibility.</p>","creationDate":{"date":"2023-06-21 09:12:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>Optimizes loading of the delay data in the Administration.</p>","creationDate":{"date":"2023-06-14 14:44:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>Optimizes writing of the delayed sequences data to database.</p>","creationDate":{"date":"2023-06-13 12:40:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>Optimizes loading of the delayed sequences in the Administration.</p>","creationDate":{"date":"2023-06-13 11:42:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>Adds the log module in the administration</p>","creationDate":{"date":"2023-05-24 09:44:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<p>Store Release, Veröffentlichung</p>","creationDate":{"date":"2023-05-11 07:21:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>Store Release, Veröffentlichung<br /></p>","creationDate":{"date":"2023-04-28 08:13:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=acris91356760259","redirectToStore":false,"lowestPriceValue":39}