{"id":16932,"name":"EmcgnNoVariantPreselectionApp","code":"emcgn60342178836","lastChange":{"date":"2023-07-18 11:16:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz0xil6","examplePageUrl":"","moduleKey":"EmcgnNoVariantPreselectionApp","creationDate":{"date":"2023-05-02 10:21:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-06-01 14:59:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-24 07:42:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":406,"prefix":"emcgn","name":"e-nitio mediasign GmbH & Co. KG","website":"//www.e-nitio.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpZyqleg"},"infos":[{"id":29543,"name":"Keine Varianten Vorauswahl","description":"<p>Standardmäßig wird in Shopware 6 bei Variantenartikeln immer eine Variante für die Darstellung vorausgewählt. Ein&nbsp;<b>Stammartikel</b>&nbsp;wie in&nbsp;<b>Shopware 5</b>&nbsp;existiert nur virtuell und wird im Frontend nicht angezeigt. Dies kann zum Beispiel auf der Kategorieseite zu Irritationen der Kunden führen. Sie könnten davon ausgehen, dass ihr Wunschartikel nur in einer bestimmten Farbe oder Größe zur Verfügung steht. Dieser Eindruck wird durch den Button „In den Warenkorb“ verstärkt. Der Hinweis auf weitere Modelle wird hingegen leicht übersehen.&nbsp;</p><p>Auch auf der Produktseite ist im Standard ebenfalls immer direkt eine Variante aktiv. Dies ist jedoch nicht immer die günstigste, sodass es auch hier zu Irritationen seitens der Kunden kommen kann. Insbesondere, wenn diese es aus ihrer Kauferfahrung gewohnt sind, dass ihnen zunächst die günstigste Ausführung präsentiert wird. Bei mehrdimensionalen Varianten ist es häufig gewünscht, dass die Kunden aktiv die gewünschte Variantenkombination aktivieren müssen und erst im Anschluss die Variante in den Warenkorb legen können.&nbsp;<b>Die aus Shopware 5 bekannte Funktion \"Varianten-Auswahl\" existiert nicht.</b>&nbsp;</p><p>Unsere Erweiterung&nbsp;<b>Keine Varianten Vorauswahl</b>&nbsp;sorgt dafür, dass auf der Kategorieseite statt der Variante der Stammartikel angezeigt wird. Auf der Produktseite wird die Vorauswahl aufgehoben. Erst nachdem sich ein Kunde bewusst für eine Variation entschieden hat, kann er den Artikel in den Warenkorb legen. Darüber hinaus ermöglicht die Erweiterung, die Informationen zum Stammartikel in vollem Umfang im Shop zu präsentieren, zum Beispiel durch ein Hauptbild, das die verschiedenen Produktgruppen auf einen Blick zeigt.</p>","installationManual":"<ul><li>Standard-Installation über den Erweiterungs-Manager</li></ul><p><br></p><p><b>Optional:</b></p><p></p><ul><li>Rufen Sie nach der Installation im Erweiterungs-Manager die Konfiguration auf (Klick auf die drei Punkte).</li><li>Wählen Sie den Modus aus (standardmäßig ist „Global keine Varianten Vorauswahl“ vorausgewählt).</li><li>Wenn Sie den Modus „Für jede Artikel separat einstellen“ wählen, müssen Sie den entsprechenden Artikel konfigurieren. Öffnen Sie hierzu den Artikel unter Kataloge -&gt; Produkte. Wählen Sie den Tab Spezifikationen aus. Scrollen Sie herunter zu den Zusatzfeldern. Aktivieren Sie den Schalter unter „Keine Varianten Vorauswahl“.<br><b>Achtung!&nbsp;</b>Den Schalter müssen Sie für jede Sprache in Ihrem Shop separat aktivieren.</li><li>Die Einstellungen sind für jeden Verkaufskanal individuell möglich.</li></ul>","shortDescription":"Ermöglicht die Anzeige des Stammartikels auf Kategorieseiten und in den Suchergebnissen statt der Varianten. Auf Produktseiten wird eine \"Bitte wählen\" Funktion integriert.","highlights":"Der Stammartikel wird auf der Kategorie-, Produkt- und Suchseite sowie in den Suchvorschlägen angezeigt\nKeine Varianten Vorauswahl, die das Kaufverhalten des Kunden beeinflussen\nInformationen zum Stammprodukt werden komplett angezeigt\nIntegration einer \"Bitte wählen\" Funktion auf Produktseiten\nDeaktivierung des Warenkorb-Buttons bis zur vollständigen Variantenauswahl","features":"Zwei verschiedene Modi zur Deaktivierung der Vorauswahl möglich: global oder individuell für jeden Artikel\nErgänzt die aus Shopware 5 bekannte Funktion zur Variantenauswahl für Artikelseiten\nPraktisch für Konfigurationsartikel, auch bei mehrdimensionalen Varianten\nLäuft komplett im Hintergrund\nKompatibel mit Shopware Custom Products"},{"id":29544,"name":"No variants preselection","description":"<p>By default, a variant is always preselected for the display of variant articles in Shopware 6. A&nbsp;<b>master article</b>&nbsp;as in&nbsp;<b>Shopware 5</b>&nbsp;only exists virtually and is not displayed in the frontend. This can lead to irritation for customers on the category page, for example. They might assume that their desired item is only available in a certain colour or size. This impression is reinforced by the \"Add to shopping cart\" button. The reference to other models, on the other hand, is easily overlooked.&nbsp;</p><p>On the product page, too, one variant is always directly active in the standard. However, this is not always the most favourable one, so that customers can also be irritated here. Especially if they are used to the cheapest version being presented to them first from their purchasing experience. In the case of multi-dimensional variants, it is often desired that the customers have to actively activate the desired variant combination and can only then place the variant in the shopping basket.&nbsp;<b>The \"variant selection\" function known from Shopware 5 does not exist.</b>&nbsp;</p><p>Our extension&nbsp;<b>No variants preselection</b>&nbsp;ensures that the master article is displayed on the category page instead of the variant. On the product page, the preselection is cancelled. Only after a customer has consciously decided on a variation, he can put the article into the shopping cart. In addition, the extension makes it possible to present the information on the master article in full in the shop, for example by means of a main picture that shows the different product groups at a glance.</p>","installationManual":"<ul><li>Install the extension via the Extension Manager.</li></ul><br><ul></ul><b>Optional:</b><ul><li>After installation, call up the configuration in the Extension Manager (click on the three dots).</li><li>Select the mode (by default \"Global no variants preselection\" is preselected).</li><li>If you select the mode \"Set separately for each article\", you must configure the corresponding article. To do this, open the item under Catalogues -&gt; Products. Select the Specifications tab. Scroll down to the additional fields. Activate the switch under \"No variants preselection\".<br><b>Attention!</b>&nbsp;You must activate the switch separately for each language in your shop.</li></ul><ul><li>The settings can be made individually for each sales channel.</li></ul>","shortDescription":"Enables the master article to be displayed on category pages and in search results instead of variants. A \"Please select\" function is integrated on product pages.","highlights":"The master article is displayed on the category, product and search page as well as in the search suggestions\nNo pre-selection variants that influence the customer's buying behaviour\nInformation on the master product is displayed in full\nIntegration of a \"Please select\" function on product pages\nDeactivation of the shopping cart button until the variant selection is complete","features":"Two different modes for deactivating the preselection possible: globally or individually for each article\nComplements the variant selection function for article pages known from Shopware 5\nPractical for configuration articles, also for multi-dimensional variants\nRuns completely in the background\nCompatibility with Shopware Custom Products"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167613,"bookingKey":"emcgn60342178836_M","bookingText":"No variants preselection","price":49,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":167879,"bookingKey":"emcgn60342178836_M12","bookingText":"No variants preselection","price":490,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzeTuii","preview":true,"priority":7,"id":113826},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpi6BDpw","preview":false,"priority":2,"id":113825},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkw7bdJ","preview":false,"priority":1,"id":113823},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKfgbnN","preview":false,"priority":0,"id":113824}],"comments":[],"ratingAverage":0,"label":"Keine Varianten Vorauswahl","description":"<p>Standardmäßig wird in Shopware 6 bei Variantenartikeln immer eine Variante für die Darstellung vorausgewählt. Ein <b>Stammartikel</b> wie in <b>Shopware 5</b> existiert nur virtuell und wird im Frontend nicht angezeigt. Dies kann zum Beispiel auf der Kategorieseite zu Irritationen der Kunden führen. Sie könnten davon ausgehen, dass ihr Wunschartikel nur in einer bestimmten Farbe oder Größe zur Verfügung steht. Dieser Eindruck wird durch den Button „In den Warenkorb“ verstärkt. Der Hinweis auf weitere Modelle wird hingegen leicht übersehen. </p><p>Auch auf der Produktseite ist im Standard ebenfalls immer direkt eine Variante aktiv. Dies ist jedoch nicht immer die günstigste, sodass es auch hier zu Irritationen seitens der Kunden kommen kann. Insbesondere, wenn diese es aus ihrer Kauferfahrung gewohnt sind, dass ihnen zunächst die günstigste Ausführung präsentiert wird. Bei mehrdimensionalen Varianten ist es häufig gewünscht, dass die Kunden aktiv die gewünschte Variantenkombination aktivieren müssen und erst im Anschluss die Variante in den Warenkorb legen können. <b>Die aus Shopware 5 bekannte Funktion \"Varianten-Auswahl\" existiert nicht.</b> </p><p>Unsere Erweiterung <b>Keine Varianten Vorauswahl</b> sorgt dafür, dass auf der Kategorieseite statt der Variante der Stammartikel angezeigt wird. Auf der Produktseite wird die Vorauswahl aufgehoben. Erst nachdem sich ein Kunde bewusst für eine Variation entschieden hat, kann er den Artikel in den Warenkorb legen. Darüber hinaus ermöglicht die Erweiterung, die Informationen zum Stammartikel in vollem Umfang im Shop zu präsentieren, zum Beispiel durch ein Hauptbild, das die verschiedenen Produktgruppen auf einen Blick zeigt.</p>","installationManual":"<ul><li>Standard-Installation über den Erweiterungs-Manager</li></ul><p><br /></p><p><b>Optional:</b></p><p></p><ul><li>Rufen Sie nach der Installation im Erweiterungs-Manager die Konfiguration auf (Klick auf die drei Punkte).</li><li>Wählen Sie den Modus aus (standardmäßig ist „Global keine Varianten Vorauswahl“ vorausgewählt).</li><li>Wenn Sie den Modus „Für jede Artikel separat einstellen“ wählen, müssen Sie den entsprechenden Artikel konfigurieren. Öffnen Sie hierzu den Artikel unter Kataloge -&gt; Produkte. Wählen Sie den Tab Spezifikationen aus. Scrollen Sie herunter zu den Zusatzfeldern. Aktivieren Sie den Schalter unter „Keine Varianten Vorauswahl“.<br /><b>Achtung! </b>Den Schalter müssen Sie für jede Sprache in Ihrem Shop separat aktivieren.</li><li>Die Einstellungen sind für jeden Verkaufskanal individuell möglich.</li></ul>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<ul><li>First release of the plugin</li></ul>","creationDate":{"date":"2023-05-24 15:58:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=emcgn60342178836","redirectToStore":true,"lowestPriceValue":49}