{"id":16943,"name":"JJIdeFGPinterestFeed","code":"JJIde60024096251","lastChange":{"date":"2023-07-18 11:16:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyAv27P","examplePageUrl":"","moduleKey":"JJIdeFGPinterestFeed","creationDate":{"date":"2023-05-05 16:05:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-05-23 15:58:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-05-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-13 12:06:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3618,"prefix":"JJIde","name":"J&J Ideenschmiede GmbH","website":"//jj-ideenschmiede.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3618_favicon-big.jpg"},"infos":[{"id":29562,"name":"Pinterest - automatischer Produktfeed","description":"<h2>Ihre App zur Generierung eines vollständigen Pinterest Produktdatenfeeds, der Pinterest automatisch mit Produkten befüllt!</h2><p>Mit unserer Pinterest App haben Sie die Möglichkeit, automatisiert einen&nbsp;<b>umfangreichen Produktdatenfeed</b>&nbsp;für Ihren Social Commerce Handel bei Pinterest bereitzustellen. Der CSV Feed kann via Link direkt im Business Hub bei Pinterest hinterlegt werden und automatisiert Ihre Produkte anlegen und updaten.</p><p>Dank der umfangreichen Funktionalitäten und Konfigurationsmöglichkeiten der App bestehen die Optionen, entweder live oder via scheduled Tasks automatisiert einen Produktdatenfeed zur Anlage und zum Updaten Ihrer Produkte direkt aus Ihrem Shopware Shop für Ihren Social Media Kanal Pinterest bereitzustellen. Darüber hinaus können Sie viele weitere Konfigurationen direkt in der App vornehmen und benötigen somit keinerlei Programmierkenntnisse oder Beratung, um einen für Pinterest optimierten Produktdatenfeed anzulegen und bereitzustellen.</p><p>Dank der Anlage von Zusatzfeldern speziell für Pinterest direkt bei Installation der App können Sie (natürlich nur bei Bedarf) kanalspezifische Informationen für Pinterest bereitstellen und somit Ihre Produktdaten relevanter für die Plattform gestalten, die Felder sind selbstverständlich auch via API befüllbar.&nbsp;</p><p>Wir übertragen alle relevanten Produktdatenfelder und noch mehr zu Pinterest, die weit über die Mindestanforderungen hinausgehen!</p><h3>Folgende Felder im Pinterest Feed übertragen wir aus Shopware direkt im Feed:</h3><p></p><ul><li><b>availability</b>&nbsp;- Lagerbestand, bei einem positiven Bestand wird \"in stock\" gesetzt, ansonsten wird \"out of stock\" gesetzt</li><li><b>description</b> - Beschreibung (die HTML Elemente werden herausgefiltert)</li><li><b>id</b> - Produktnummer</li><li><b>image link</b> - zugewiesenes Cover Bild</li><li><b>link</b> - Produktlink zum Shop</li><li><b>price</b> - Preis (Brutto)</li><li><b>title</b> - Produktname</li><li><b>additional_image_link</b> - weitere Bildlinks, bis zu 10 Stück</li><li><b>product_type</b> - Neu angelegtes Zusatzfeld „Produkttyp“ in jedem Produkt, um die Pinterest Kategorie zu definieren</li><li><b>sale_price</b> - Streichpreis (Brutto) is der neue \"price\" sofern gepflegt, der eigentliche Preis wird dann zum \"sale_price\"</li><li><b>brand</b> - Marke des Produktes</li><li><b>gtin</b> - GTIN/EAN</li><li><b>item_group_id</b> - Parent ID bei Variationssets</li><li><b>mpn</b> - Hersteller-Produktnummer</li><li><b>age_group</b> - Neu angelegtes Zusatzfeld \"Altersgruppe\" in jedem Produkt</li><li><b>color</b> - Neu angelegtes Zusatzfeld \"Farbe\" in jedem Produkt</li><li><b>gender</b> - Neu angelegtes Zusatzfeld \"Geschlecht\" in jedem Produkt</li><li><b>material</b> - Neu angelegtes Zusatzfeld \"Material\" in jedem Produkt</li><li><b>pattern</b> - Neu angelegtes Zusatzfeld \"Muster\" in jedem Produkt</li><li><b>size</b> - Neu angelegtes Zusatzfeld \"Größe\" in jedem Produkt</li><li><b>variant_names</b> - Varianten Identifikator (z.B. Größe) pro Variante</li><li><b>variant_values</b> - Varianten Ausprägungen (z.B: L) pro Variante</li><li><b>free_shipping_label</b> - Versandkostenfrei Definition</li><li><b>condition</b> - Neu angelegtes Zusatzfeld \"Zustand\" in jedem Produkt&nbsp;</li><li><b>google_product_category</b> - Neu angelegtes Zusatzfeld „Google Produktkategorie“ in jedem Produkt</li></ul><p>Somit können Sie über unsere App Pinterest erfolgreich und mit minimalem Aufwand mit Produktdaten automatisiert bespielen!</p><p>Die App gibt eine Feed URL mit einem verknüpften Verkaufskanal aus und kann keine weiteren Verkaufskanäle verknüpfen und ist somit lediglich mit einem Verkaufskanal kompatibel.</p><p></p>","installationManual":"<p>Zunächst muss die App installiert und anschließend aktiviert werden.</p><p>Mit der Installation und Aktivierung werden Zusatzfelder mit umfangreichen Pflegemöglichkeiten für den Pinterest Product Feed eingepflegt. Diese können nach Installation pro Produkt gepflegt werden.&nbsp;</p><p>Außerdem muss die App Konfiguriert werden, sodass anschließend der Feed generiert werden kann.</p><p>Die Konfiguration der Apps finden Sie unter:</p><p><b>Erweiterungen -&gt; Meine Erweiterungen -&gt; Klick auf die 3 Punkte neben der App -&gt; Konfigurieren.</b></p><p>Hier kann dann die Konfiguration der App durchgeführt werden.&nbsp;</p><p>Nach erfolgreichem Speichern der Konfiguration ist die Aktualisierung der Produkte für den Feed notwendig. Um dies anzustoßen, reicht der Klick auf ein beliebiges Produkt, in der Produktübersicht. Auf der Produktdetailübersicht finden Sie oben rechts 3 Punkte, mit Klick auf diese können Sie die Konfiguration aktualisieren. Die zweite Möglichkeit besteht in der gesamtem Produktübersicht, hier können Sie eine Checkbox eines beliebigen Produktes anhaken. Hier finden Sie dann ebenfalls 3 Punkte oben rechts, mit Klick auf diese können Sie dann ebenfalls wie in der Produktdetailübersicht mit einem Klick die Konfiguration aktualisieren.</p><p>Nach ausführen der Aktualisierung wird der Feed zum ersten mal generiert bzw. bei Update der Konfiguration nach Ersteinrichtung generell aktualisiert, sodass die neue Konfiguration der App greift.</p><p>Die Konfiguration der App greift für alle Produkte immer erst nach Aktualisierung des Feeds über die genannten Optionen.</p><p>Die vollumfängliche Dokumentation unserer App finden Sie&nbsp;<a href=\"https://docs.feedgenie.de/doku/shopware6-pinterest-feed/\" target=\"_blank\" rel=\"noreferrer\">HIER</a>.</p>","shortDescription":"Stellen Sie einen automatisch generierten und umfangreichen Produktdatenfeed für Pinterest bereit. Der Feed ist via Link erreichbar und umfangreich konfigurierbar direkt in der App!","highlights":"Mit wenigen Klicks einen automatisierten Produktdatenfeed für Pinterest generieren\nDank Zusatzfeldern und globaler Konfiguration kanalspezifische Produktdaten bereitstellen\nUmfangreiche Konfigurationsmöglichkeiten direkt in der App - der Feed ist umfangreich individualisierter!\nZu übertragende Produkte dank dynamischen Produktgruppen auswählen und filtern\nNutzbar für Cloud & Self-hosted Shopware 6 Shops!","features":"Spezifische Zusatzfelder für Pinterest werden automatisch angelegt und sind via API bespielbar\nMöglichkeit der Generierung des Feeds entweder live oder via scheduled Tasks\nKonfiguration des Produktfeeds ohne Programmierkenntnisse direkt in Shopware\nPflichtinfos + viele zusätzliche Informationen spezifisch für Pinterest direkt in Shopware pflegen\nVielseitige Individualisierungsmöglichkeiten dank Konfiguration, Zusatzfeldern und mehr"},{"id":29563,"name":"Pinterest - automatic product feed","description":"<h2>Your App to generate a complete Pinterest product data feed that automatically transfers your products to Pinterest!</h2><p>With our Pinterest app you have the possibility to automatically provide the perfect product data feed for your social commerce trade on Pinterest. The CSV feed can be stored directly in the Pinterest Business Hub via a link and automatically create and update your products.</p><p>Thanks to the extensive functionalities and configuration options of the app, you have the options of providing a product data feed for creating and updating your products directly from your Shopware store for your Pinterest social media channel, either live or via scheduled tasks. In addition, you can make many other configurations directly in the app without any programming knowledge or consulting to create and provide a product data feed optimized for Pinterest.</p><p>Thanks to the creation of additional fields especially for Pinterest directly during the installation of the app, you can (of course only if required) provide channel-specific information for Pinterest and with that make your product data more relevant for the platform, the fields can of course also be filled via API.&nbsp;</p><p>We transfer all relevant product data fields and even more to Pinterest, which go far beyond the minimum requirements!</p><h3>The following Fields in the Pinterest are being transferred from Shopware directly into the Feed:</h3><p><ul><li><b>availability</b> - If the Stock is positive, the product will be set to \"in stock\", otherwise it is set to \"out of stock\"</li><li><b>description</b> - Description (the HTML Elements are automatically filtered)</li><li><b>id</b> - Product number</li><li><b>image_link</b> - Cover Picture</li><li><b>link</b> - Product link to the Shop</li><li><b>price</b> - Price (gross)</li><li><b>title</b> - Product name</li><li><b>additional_image_link</b> -additional picture links, up to 10</li><li><b>product_type</b> - Newly added Custom Field „Product type“ in each product, to define the Pinterest category</li><li><b>sale_price</b> - List price (gross) is the new \"Price\" if set, and the Price becomes the \"sale_price\"</li><li><b>brand</b> - Brand of the product</li><li><b>gtin</b> - GTIN/EAN</li><li><b>item_group_id</b> - Parent ID of the variation set</li><li><b>mpn</b> - Manufacturer product number</li><li><b>age_group</b> - Newly added Custom Field \"Age group\" in each product</li><li><b>color</b> - Newly added Custom Field \"Color\" in each product</li><li><b>gender</b> - Newly added Custom Field \"Gender\" in each product</li><li><b>material</b> - Newly added Custom Field \"Material\" in each product</li><li><b>pattern</b> - Newly added Custom Field \"Pattern\" in each product</li><li><b>size</b> - Newly added Custom Field \"Size\" in each product</li><li><b>variant_names</b> - Variant identifier (e.g. Size)</li><li><b>variant_values</b> - Variant characteristics</li><li><b>free_shipping_label</b> - Free Shipping definition</li><li><b>condition</b> - Newly added Custom Field \"Condition\" in each product</li><li><b>google_product_category</b> - Newly added Custom Field \"Google product category\" in each product</li></ul><p>In conclusion you can use our app to successfully automate providing product data for Pinterest with minimal effort!</p></p><p>The app outputs a feed URL with a linked sales channel and cannot link any other sales channels and is therefore only compatible with one sales channel.</p>","installationManual":"<p>First, the app must be installed and then activated.</p><p>With the installation and activation, additional fields with extensive maintenance options are entered for the Pinterest product feed. These can be maintained per product after installation.</p><p>In addition, the app must be configured so that the feed can then be generated afterwards.</p><p>The configuration of the app can be found under:</p><p><b>Extensions -&gt; My Extensions -&gt; Click on the 3 dots next to the app -&gt; Configure.</b></p><p>Here you can configure the app.&nbsp;</p><p>After successfully saving the configuration, the update of the products for the feed is necessary. To trigger this, just click on any product in the product overview. On the product detail page you will find 3 dots on the top right, by clicking on them you can trigger an update of the configuration. The second possibility is located in the entire product overview, here you can check one or more checkboxes of any product. After checking one or more products you will also find 3 points in the upper right corner, by clicking on them you can also update the configuration.</p><p>After executing the update, the feed is generated for the first time or generally updated when updating the configuration after the initial setup, so that the new configuration of the app takes effect.</p><p>The configuration of the app always takes effect for all products and the entire feed, but only after updating the feed via the options mentioned.</p><p>The full Documentation of our App can be found&nbsp;<a href=\"https://docs.feedgenie.de/doku/shopware6-pinterest-feed/\" target=\"_blank\" rel=\"noreferrer\">HERE</a>.</p>","shortDescription":"Provide an automatically generated and extensive product data feed for Pinterest. The feed is accessible via a link and can be configured in depth directly in the app!","highlights":"Generate an automated product data feed for Pinterest with just a few clicks.\nProvide channel-specific product data thanks to additional fields and global configuration\nExtensive configuration options directly in the app - the feed is extensively individualizable\nSelect and filter products to be transferred thanks to dynamic product groups\nUsable for both Cloud & Self-hosted Shopware 6 Shops!","features":"Specific additional fields for Pinterest are created automatically and are fillable via API\nPossibility to generate the feed either live or via scheduled tasks\nConfiguration of the product feed without programming knowledge directly in Shopware\nMaintain mandatory information + a lot of additional information specific to Pinterest directly in Shopware\nVersatile customization options thanks to configuration, additional fields and more"}],"addons":["highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167632,"bookingKey":"JJIde60024096251_M","bookingText":"","price":10,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169058,"bookingKey":"JJIde60024096251_M12","bookingText":"Pinterest - automatic product feed","price":90,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsRLOs1","preview":true,"priority":9,"id":114591},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTtMphU","preview":false,"priority":9,"id":114953},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPZ73GX","preview":false,"priority":8,"id":114595},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpI0fq4N","preview":false,"priority":6,"id":114592},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjvhD7E","preview":false,"priority":5,"id":114594},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPHTmh0","preview":false,"priority":4,"id":114593},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMIE25L","preview":false,"priority":3,"id":114596},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8HvMNp","preview":false,"priority":2,"id":114601},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNg3saF","preview":false,"priority":1,"id":114603},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzeJvOD","preview":false,"priority":0,"id":114955}],"comments":[],"ratingAverage":0,"label":"Pinterest - automatischer Produktfeed","description":"<h2>Ihre App zur Generierung eines vollständigen Pinterest Produktdatenfeeds, der Pinterest automatisch mit Produkten befüllt!</h2><p>Mit unserer Pinterest App haben Sie die Möglichkeit, automatisiert einen <b>umfangreichen Produktdatenfeed</b> für Ihren Social Commerce Handel bei Pinterest bereitzustellen. Der CSV Feed kann via Link direkt im Business Hub bei Pinterest hinterlegt werden und automatisiert Ihre Produkte anlegen und updaten.</p><p>Dank der umfangreichen Funktionalitäten und Konfigurationsmöglichkeiten der App bestehen die Optionen, entweder live oder via scheduled Tasks automatisiert einen Produktdatenfeed zur Anlage und zum Updaten Ihrer Produkte direkt aus Ihrem Shopware Shop für Ihren Social Media Kanal Pinterest bereitzustellen. Darüber hinaus können Sie viele weitere Konfigurationen direkt in der App vornehmen und benötigen somit keinerlei Programmierkenntnisse oder Beratung, um einen für Pinterest optimierten Produktdatenfeed anzulegen und bereitzustellen.</p><p>Dank der Anlage von Zusatzfeldern speziell für Pinterest direkt bei Installation der App können Sie (natürlich nur bei Bedarf) kanalspezifische Informationen für Pinterest bereitstellen und somit Ihre Produktdaten relevanter für die Plattform gestalten, die Felder sind selbstverständlich auch via API befüllbar. </p><p>Wir übertragen alle relevanten Produktdatenfelder und noch mehr zu Pinterest, die weit über die Mindestanforderungen hinausgehen!</p><h3>Folgende Felder im Pinterest Feed übertragen wir aus Shopware direkt im Feed:</h3><p></p><ul><li><b>availability</b> - Lagerbestand, bei einem positiven Bestand wird \"in stock\" gesetzt, ansonsten wird \"out of stock\" gesetzt</li><li><b>description</b> - Beschreibung (die HTML Elemente werden herausgefiltert)</li><li><b>id</b> - Produktnummer</li><li><b>image link</b> - zugewiesenes Cover Bild</li><li><b>link</b> - Produktlink zum Shop</li><li><b>price</b> - Preis (Brutto)</li><li><b>title</b> - Produktname</li><li><b>additional_image_link</b> - weitere Bildlinks, bis zu 10 Stück</li><li><b>product_type</b> - Neu angelegtes Zusatzfeld „Produkttyp“ in jedem Produkt, um die Pinterest Kategorie zu definieren</li><li><b>sale_price</b> - Streichpreis (Brutto) is der neue \"price\" sofern gepflegt, der eigentliche Preis wird dann zum \"sale_price\"</li><li><b>brand</b> - Marke des Produktes</li><li><b>gtin</b> - GTIN/EAN</li><li><b>item_group_id</b> - Parent ID bei Variationssets</li><li><b>mpn</b> - Hersteller-Produktnummer</li><li><b>age_group</b> - Neu angelegtes Zusatzfeld \"Altersgruppe\" in jedem Produkt</li><li><b>color</b> - Neu angelegtes Zusatzfeld \"Farbe\" in jedem Produkt</li><li><b>gender</b> - Neu angelegtes Zusatzfeld \"Geschlecht\" in jedem Produkt</li><li><b>material</b> - Neu angelegtes Zusatzfeld \"Material\" in jedem Produkt</li><li><b>pattern</b> - Neu angelegtes Zusatzfeld \"Muster\" in jedem Produkt</li><li><b>size</b> - Neu angelegtes Zusatzfeld \"Größe\" in jedem Produkt</li><li><b>variant_names</b> - Varianten Identifikator (z.B. Größe) pro Variante</li><li><b>variant_values</b> - Varianten Ausprägungen (z.B: L) pro Variante</li><li><b>free_shipping_label</b> - Versandkostenfrei Definition</li><li><b>condition</b> - Neu angelegtes Zusatzfeld \"Zustand\" in jedem Produkt </li><li><b>google_product_category</b> - Neu angelegtes Zusatzfeld „Google Produktkategorie“ in jedem Produkt</li></ul><p>Somit können Sie über unsere App Pinterest erfolgreich und mit minimalem Aufwand mit Produktdaten automatisiert bespielen!</p><p>Die App gibt eine Feed URL mit einem verknüpften Verkaufskanal aus und kann keine weiteren Verkaufskanäle verknüpfen und ist somit lediglich mit einem Verkaufskanal kompatibel.</p><p></p>","installationManual":"<p>Zunächst muss die App installiert und anschließend aktiviert werden.</p><p>Mit der Installation und Aktivierung werden Zusatzfelder mit umfangreichen Pflegemöglichkeiten für den Pinterest Product Feed eingepflegt. Diese können nach Installation pro Produkt gepflegt werden. </p><p>Außerdem muss die App Konfiguriert werden, sodass anschließend der Feed generiert werden kann.</p><p>Die Konfiguration der Apps finden Sie unter:</p><p><b>Erweiterungen -&gt; Meine Erweiterungen -&gt; Klick auf die 3 Punkte neben der App -&gt; Konfigurieren.</b></p><p>Hier kann dann die Konfiguration der App durchgeführt werden. </p><p>Nach erfolgreichem Speichern der Konfiguration ist die Aktualisierung der Produkte für den Feed notwendig. Um dies anzustoßen, reicht der Klick auf ein beliebiges Produkt, in der Produktübersicht. Auf der Produktdetailübersicht finden Sie oben rechts 3 Punkte, mit Klick auf diese können Sie die Konfiguration aktualisieren. Die zweite Möglichkeit besteht in der gesamtem Produktübersicht, hier können Sie eine Checkbox eines beliebigen Produktes anhaken. Hier finden Sie dann ebenfalls 3 Punkte oben rechts, mit Klick auf diese können Sie dann ebenfalls wie in der Produktdetailübersicht mit einem Klick die Konfiguration aktualisieren.</p><p>Nach ausführen der Aktualisierung wird der Feed zum ersten mal generiert bzw. bei Update der Konfiguration nach Ersteinrichtung generell aktualisiert, sodass die neue Konfiguration der App greift.</p><p>Die Konfiguration der App greift für alle Produkte immer erst nach Aktualisierung des Feeds über die genannten Optionen.</p><p>Die vollumfängliche Dokumentation unserer App finden Sie <a href=\"https://docs.feedgenie.de/doku/shopware6-pinterest-feed/\" target=\"_blank\" rel=\"noreferrer noopener\">HIER</a>.</p>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p>feat: First version of the final shopware6 app.</p>","creationDate":{"date":"2023-05-10 17:36:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=JJIde60024096251","redirectToStore":true,"lowestPriceValue":10}