{"id":17044,"name":"DvsnReturnShipmentApp","code":"dvsn337881331732","lastChange":{"date":"2023-07-21 00:30:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgSegi8","examplePageUrl":"","moduleKey":"DvsnReturnShipmentApp","creationDate":{"date":"2023-05-23 19:08:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-05-30 10:39:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-05-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-23 22:49:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":29746,"name":"Rücksendungen / Reklamationen / Retouren anlegen (inkl. DHL Label) App","description":"\n\n\n\n\n\n\n<h2>\n    Rücksendungen / Reklamationen / Retouren anlegen (inkl. DHL Label) App\n\n</h2><p><h4>Hinweise zur App</h4><p>\n\n\nDies ist die alternative Cloud App für das gleichnamige self-hosted Shopware 6 Plugin.\nDie App versucht einen Großteil der Funktionalität des Plugins abzubilden, ist jedoch durch\ntechnische Restriktionen der zugrunde liegenden Cloud Architektur in Ihren Möglichkeiten beschränkt.\nIch bitte daher um Verständnis, dass die App nicht den vollen Funktionsumfang des Plugins bietet.\n\n</p><h4>Beschreibung</h4><p>\nBieten Sie Ihren Kunden die Möglichkeit Rücksendungen direkt aus ihrem Kundenkonto anzulegen.\nDazu können die Kunden die Anzahl der Produkte, einen Grund, eine gewünschte Vorgehensweise und optionale Kommentare angeben.\nDie Gründe (z.B. FAG, Produkt defekt etc.) und Vorgehensweisen (z.B. Gutschrift, Auszahlung etc.) können dabei\ninnerhalb eines eigenen Moduls in den Shopware Einstellungen administriert werden.\n\nZudem können Sie Rücksendungen nur für bestimmte Kundengruppen oder für definierbare\nBestellstatus aktivieren.\n\n\n</p><p>\nDer Kunde kann pro Bestellung beliebig viele Rücksendungen anlegen. Bei jeder neu angelegten Rücksendung\nkann er jedoch lediglich die Produkte auswählen, die bisher noch in keiner früheren Rücksendung\nreklamiert wurden. Somit kann er die gleichen Produkte nicht mehrfach zurück senden.\n\n</p><p>\nDer Kunde wird mit einer Schritt-für-Schritt Anleitung durch den Prozess einer\nRücksendung geführt. Innerhalb der Liste seiner Bestellungen kommt er direkt mit einem\nLink auf die Liste der Rücksendungen einer Bestellung oder zum Formular zum Anlegen neuer Rücksendungen.\nDazu kann er sich auch ein Rücksende-Dokument als PDF\nherunterladen und dem Paket beilegen.\n</p><p>\nZudem haben Ihre Kunden - unter Beachtung von verschiedenen Bedingungen (z.B. Kundengruppe) - die Möglichkeit direkt ein DHL\nLabel oder DHL QR Code zu erstellen und auszudrucken.\n</p><p>\nInnerhalb der Administration finden Sie unter dem Reiter \"Bestellungen\" den neuen Menüpunkt \"Rücksendungen\".\nHier können Sie jede eingegangene Rücksendung einsehen und bearbeiten. Um den Vorgang besser in\nIhre eigenen Prozesse zu integrieren, können sie auch alle Status selber definieren - vorhandene Status löschen und editieren\noder neue Status anlegen (z.B. \"Rücksendung wartet auf Rückmeldung durch Hersteller\").\n</p><h4>Gäste</h4><p>\n\n\nDas Anlegen von Rücksendungen kann auch unter der Angabe\nder Bestellnummer und der zugehörigen Email Adresse erfolgen.\nSo können z.B. auch Gäste (ohne Kundenkonto) Rücksendungen anlegen\noder vorhandene Rücksendungen einsehen.\nZudem können Sie den Link auf dieses Anmelde-Formular überall im Shop platzieren.\n\n\n\n</p><p>\n\nAufgrund von technischen Restriktionen einer App ist das Anmelde-Formular ausschließlich\nüber einen technischen Link (ohne SEO Url) zu erreichen.\n<br /><br />\nTechnischer Link: /storefront/script/dvsn/return-shipment-app/index<br />\nBeispiel: https://www.ihr-shop.de/storefront/script/dvsn/return-shipment-app/index\n\n</p><h4>Produkte in Bestände buchen</h4><p>\n\nInnerhalb der Administration einer Rücksendung haben Sie die Möglichkeit ausgewählte Produkte\ndirekt zurück in den Bestand zu buchen. So können Produkte, die tatsächlich (z.B. als FAG Rücksendung) zurück gesendet wurden\nund wieder in den Verkauf können, direkt eingebucht werden.\n\n</p><h4>Fristen</h4><p>\n\nSie können in der App Konfiguration definieren, ob eine Rücksendung nur für einen bestimmten Zeitraum (ab\nVersand) angelegt werden darf. So können Sie z.B. das Erstellen einer Rücksendung nur bis zu 21 Tage nach Versand\nermöglichen.\n\n</p><h4>Produkte von Rücksendungen ausschließen</h4><p>\n\nDie App gibt standardmäßig nur \"normale\" Shopware Produkte für eine Rücksendung frei. So können\nz.B. Gutscheine und/oder Rabatte bei einer Rücksendung nicht ausgewählt werden. Sie haben zudem die Möglichkeit\nin den Zusatzfeldern von Produkten diese spezifisch von Rücksendungen auszuschließen.\n\n</p><h4>DHL Retouren Label</h4><p>\n\nSie können Ihren Kunden anbieten, dass diese direkt ein DHL Retouren Label für ihre Bestellung\nerzeugen und ausdrucken können. Zudem können sich Ihre Kunden auch ein QR Code speichern,\num damit bei der DHL Filiale ein Label drucken lassen zu können.\n\n</p><p>\nBitte achten Sie darauf die Gewichte der Produkte in der Administration korrekt zu pflegen.\nDas Gewicht auf dem Label berechnet sich automatisch nach den ausgewählten Produkten.\n\n</p><p>\n\nSie können mit der Schnittstelle zum DHL Geschäftskundenportal ein\nRetouren Label erzeugen lassen. Das Label enthält dabei automatisch Sie als Empfänger\nund den Kunden als Absender.\n\n\n</p><p>\n\nUm DHL Labels erzeugen zu können, benötigen Sie einen Zugang zum DHL Geschäftskundenportal.\nZudem müssen Sie für die Versandabwicklung über das Geschäftskundenportal berechtigt sein.\nFür eine Freischaltung wenden Sie sich bitte an Ihren DHL Kundenberater.\n\n\n\n</p><h4>DHL Retouren Label via DHL Geschäftskundenportal</h4><p><b>Kunden-/EKP-Nummer:</b><br />\nIhre 10-stellige DHL Kundennummer.<br /><br /><b>Verfahrens-Nummer:</b><br />\nDie Verfahrens-Nummer für den DHL Versand. Beispiel: 07 für Deutschland, 53 für Österreich.<br /><br /><b>Teilnahme-Nummer:</b><br />\nEine 2-stellige Nummer zur Untergliederung von Abrechnungen nach Standorten, Saisongeschäft oder\nunterschiedlichen Konditionen. Die Teilnahmenummern der verschiedenen DHL Produkte entsprechen\njeweils den letzten zwei Stellen der zugehörigen Abrechnungsnummern.<br /><br /><b>Retourenempfänger:</b><br />\nIm DHL Geschäftskundenportal im Menü \"Retoure\" im Untermenü \"Einstellungen\" werden Ihnen alle\nRetourenempfängernamen (=ReceiverIds) aufgelistet. Bitte geben Sie hier die gewünschte\n\"Receiver Id\" an.<br /><br /><b>DHL Geschäftskundenportal Benutzer:</b><br />\nDer Benutzer aus dem DHL Geschäftskundenportal. Der Benutzer muss für Retoure berechtigt sein!\nIdealerweise legen Sie einen weiteren Benutzer für die Erstellung der Labels an.\n<br /><br /><b>DHL Geschäftskundenportal Passwort:</b><br />\nDas Passwort des oben genannten Benutzers. Die Passwortgültigkeit eines \"Benutzers\" beträgt 90 Tage.\nDie Passwortgültigkeit eines \"Systembenutzers\" beträgt 365 Tage. Mit einem \"Systembenutzer\" ist eine\nAnmeldung am DHL Geschäftskundenportal nicht möglich.\n\n\n\n\n\n\n\n</p><h4>DHL Retouren Label im Ausland</h4><p>\n\n\nSie können pro Land und/oder Verkaufskanal unterschiedliche DHL Zugangsdaten hinterlegen.\nIm Menüpunkt \"DHL Zugangsdaten\" können Sie hier z.B. für das Land Österreich\neinen eigenen Datensatz hinterlegen. Dann wird für sämtliche Kunden aus Österreich ein\nDHL Label mit diesen Zugangsdaten erzeugt.\n\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie die App</li><li>prüfen Sie die App Konfiguration, ob diese Ihren Wünschen entspricht</li><li>definieren Sie insbesondere gültige Bestellstatus und/oder Kundengruppen</li><li>definieren Sie Ihre gewünschten Gründe und Vorgehensweisen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.ihr-shop.de/storefront/script/dvsn/return-shipment-app/index</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die die Hinweise aus der App Beschreibung</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>Textbausteine</strong><br />\nDie App verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie App ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Apps von Drittanbietern nutzen, dann sollten Sie die App vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die App ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie App kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Apps entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser App haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Apps entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>20+ Jahre Erfahrung</strong><br />\nSeit über 20 Jahren im E-Commerce und seit über 10 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 20 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"\n\n\n<h4>Anleitung</h4><ul><li>installieren Sie die App</li><li>prüfen Sie die App Konfiguration, ob diese Ihren Wünschen entspricht</li><li>definieren Sie insbesondere gültige Bestellstatus und/oder Kundengruppen</li><li>definieren Sie Ihre gewünschten Gründe und Vorgehensweisen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.ihr-shop.de/storefront/script/dvsn/return-shipment-app/index</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die die Hinweise aus der App Beschreibung</li></ul>\n\n\n","shortDescription":"Kunden können direkt und bequem in Ihrem Shop eine Rücksendung anlegen (inkl. DHL Label). Abwicklung von Retouren einfach gemacht! Reklamationen mit DHL Label","highlights":"","features":""},{"id":29747,"name":"Return shipments (incl. DHL label) App","description":"\n\n\n\n\n\n\n<h2>\n    Return shipments (incl. DHL label) App\n\n</h2><p><h4>Notes about the app</h4><p>\n\n\nThis is the alternative cloud app for the self-hosted Shopware 6 plugin of the same name. The app tries to reproduce most of the functionality of the plugin, but is limited by technical restrictions of the underlying cloud architecture. I therefore ask for your understanding that the app does not offer the full functionality of the plugin.\n\n</p><h4>Description</h4><p>\nOffer your customers the possibility to create returns directly from their customer account. To do this, customers can specify the number of products, a reason, a desired procedure and optional comments. The reasons (e.g. FAG, product defective, etc.) and procedures (e.g. credit note, payment, etc.) can be administered within a separate module in the Shopware settings. In addition, you can activate returns only for certain customer groups or for definable order statuses.\n\n\n</p><p>\nThe customer can create any number of returns per order. However, for each new return, the customer can only select the products that have not yet been claimed in a previous return. Thus, he cannot return the same products more than once.\n\n</p><p>\nThe customer is guided through the process of a return with a step-by-step guide. Within the list of his orders he comes directly with a link to the list of returns of an order or to the form for creating new returns. He can also download a return document as a PDF and enclose it with the package.\n</p><p>\nIn addition, your customers - taking into account various conditions (e.g. customer group) - have the option of directly creating and printing a DHL label or DHL QR code.\n</p><p>\nWithin the administration you will find the new menu item \"Returns\" under the tab \"Orders\". Here you can view and edit every received return. In order to better integrate the process into your own processes, you can also define all statuses yourself - delete and edit existing statuses or create new statuses (e.g. \"Return awaiting feedback from manufacturer\").\n</p><h4>Guests</h4><p>\n\n\nThe creation of returns can also be done by entering the order number and the corresponding email address. Thus, for example, guests (without a customer account) can also create returns or view existing returns. In addition, you can place the link to this registration form anywhere in the store.\n\n\n\n</p><p>\n\nDue to technical restrictions of an app, the registration form can only be reached via a technical link (without SEO url).\nvia a technical link (without SEO url).\n<br /><br />\nTechnical link: /storefront/script/dvsn/return-shipment-app/index<br />\nExample link: https://www.your-shop.com/storefront/script/dvsn/return-shipment-app/index\n\n</p><h4>Restock products to inventories</h4><p>\n\nWithin the administration of a return you have the possibility to book selected products directly back into the stock. In this way, products that have actually been returned (e.g. as FAG returns) and can be put back on sale can be posted directly.\n\n</p><h4>Deadlines</h4><p>\n\nYou can define in the app configuration whether a return can only be created for a certain period of time (from shipping). For example, you can enable the creation of a return only up to 21 days after shipment.\n\n</p><h4>Exclude products from returns</h4><p>\n\nBy default, the app only allows \"normal\" Shopware products to be returned. This means, for example, that vouchers and/or discounts cannot be selected for a return. You also have the option to specifically exclude products from returns in the additional fields.\n\n</p><h4>DHL returns label</h4><p>\n\nYou can offer your customers that they can directly generate and print a DHL return label for their order. In addition, your customers can also save a QR code in order to print a label at the DHL branch.\n\n</p><p>\nPlease make sure to maintain the weights of the products correctly in the administration. The weight on the label is calculated automatically according to the selected products.\n\n</p><p>\n\nYou can generate a returns label with the interface to the DHL business customer portal. The label automatically contains you as the recipient and the customer as the sender.\n\n\n</p><p>\n\nTo be able to generate DHL Labels, you need access to the DHL Business Customer Portal. In addition, you must be authorized for shipping processing via the business customer portal. For activation, please contact your DHL customer advisor.\n\n\n\n</p><h4>DHL Returns Label via DHL Business Customer Portal</h4><p><b>Customer/EKP number:</b><br />\nYour 10-digit DHL customer number.<br /><br /><b>Procedure number:</b><br />\nThe procedure number for DHL shipping. Example: 07 for Germany, 53 for Austria.<br /><br /><b>Participation number:</b><br />\nA 2-digit number for subdividing settlements by location, seasonal business or different conditions. The participation numbers of the various DHL products each correspond to the last two digits of the associated billing numbers.\n\n<br /><br /><b>Return recipient:</b><br />\nIn the DHL Business Customer Portal in the menu \"Returns\" in the submenu \"Settings\" all return recipient names (=ReceiverIds) are listed. Please enter the desired \"Receiver Id\" here.\n\n<br /><br /><b>DHL Business Customer Portal User:</b><br />\nThe user from the DHL Business Customer Portal. The user must be authorized for returns! Ideally, you create another user for the creation of the labels.\n<br /><br /><b>DHL Business Customer Portal Password:</b><br />\nThe password of the above user. The password validity of a \"user\" is 90 days. The password validity of a \"system user\" is 365 days. It is not possible to log in to the DHL Business Customer Portal with a \"system user\".\n\n\n\n\n\n\n\n</p><h4>DHL returns label abroad</h4><p>\n\n\nYou can store different DHL access data per country and/or sales channel. In the menu item \"DHL access data\" you can, for example, store a separate data record for the country Austria. A DHL label with this access data will then be generated for all customers from Austria.\n\n\n\n</p><h4>Instructions</h4><ul><li>install the app</li><li>check the app configuration to see if it meets your needs</li><li>specifically define valid order statuses and/or customer groups</li><li>define your desired reasons and procedures</li><li>link on any place of your store (eg category, store page etc) to the form to create a return (eg for guests)</li><li>you can find the form at https://www.your-shop.com/storefront/script/dvsn/return-shipment-app/index</li><li>registered customers can additionally always create returns directly from their customer account</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die die Hinweise aus der App Beschreibung</li></ul><br /><br /><h4>General information</h4><ul><li><strong>Snippets</strong><br />\nThe app uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe app is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party apps, you should test the app thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the app is fully responsive\n</li><li><strong>Test version</strong><br />\nThe app can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my apps according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe app manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the app - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>20+ years of experience</strong><br />\nFor over 20 years in e-commerce and for over 10 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 20 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my apps according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed apps according to your wishes.\n</p>","installationManual":"\n\n\n\n<h4>Instructions</h4><ul><li>install the app</li><li>check the app configuration to see if it meets your needs</li><li>specifically define valid order statuses and/or customer groups</li><li>define your desired reasons and procedures</li><li>link on any place of your store (eg category, store page etc) to the form to create a return (eg for guests)</li><li>you can find the form at https://www.your-shop.com/storefront/script/dvsn/return-shipment-app/index</li><li>registered customers can additionally always create returns directly from their customer account</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die die Hinweise aus der App Beschreibung</li></ul>\n\n\n\n","shortDescription":"Customers can create a return directly and conveniently in your store (incl. DHL label). Processing returns made easy! The app even supports creating DHL labels","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":167877,"bookingKey":"dvsn337881331732_M","bookingText":"Return shipments (incl. DHL label) App","price":49,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":167878,"bookingKey":"dvsn337881331732_M12","bookingText":"Return shipments (incl. DHL label) App","price":499,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKbpqg7","preview":true,"priority":9900,"id":115525},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbiV6p8","preview":false,"priority":9800,"id":115526},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzaGSWk","preview":false,"priority":9700,"id":115523},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpScSGLE","preview":false,"priority":9600,"id":115521},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRtt8oS","preview":false,"priority":8900,"id":115519},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFipyYS","preview":false,"priority":8800,"id":115522},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSKc8fM","preview":false,"priority":7900,"id":115520},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwREv3a","preview":false,"priority":7800,"id":115518},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBFXtr9","preview":false,"priority":6900,"id":115517},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNsACWQ","preview":false,"priority":5900,"id":115515},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8hZn54","preview":false,"priority":4900,"id":115513},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpl8AKiI","preview":false,"priority":4800,"id":115514},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdKlTTB","preview":false,"priority":4700,"id":115516},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpX4LPCR","preview":false,"priority":4600,"id":115512},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQxctqH","preview":false,"priority":4500,"id":115511},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdzC4Cb","preview":false,"priority":3900,"id":115510},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT9kO97","preview":false,"priority":3800,"id":115508},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMpIqoA","preview":false,"priority":3700,"id":115507},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpc2KffQ","preview":false,"priority":3600,"id":115504},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSeDyAS","preview":false,"priority":2900,"id":115505},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4qdwmK","preview":false,"priority":1900,"id":115506},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwgazzM","preview":false,"priority":1800,"id":115509},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXTpfgz","preview":false,"priority":1700,"id":115503}],"comments":[],"ratingAverage":0,"label":"Rücksendungen / Reklamationen / Retouren anlegen (inkl. DHL Label) App","description":"<h2>\n    Rücksendungen / Reklamationen / Retouren anlegen (inkl. DHL Label) App\n\n</h2><p></p><h4>Hinweise zur App</h4><p>\n\n\nDies ist die alternative Cloud App für das gleichnamige self-hosted Shopware 6 Plugin.\nDie App versucht einen Großteil der Funktionalität des Plugins abzubilden, ist jedoch durch\ntechnische Restriktionen der zugrunde liegenden Cloud Architektur in Ihren Möglichkeiten beschränkt.\nIch bitte daher um Verständnis, dass die App nicht den vollen Funktionsumfang des Plugins bietet.\n\n</p><h4>Beschreibung</h4><p>\nBieten Sie Ihren Kunden die Möglichkeit Rücksendungen direkt aus ihrem Kundenkonto anzulegen.\nDazu können die Kunden die Anzahl der Produkte, einen Grund, eine gewünschte Vorgehensweise und optionale Kommentare angeben.\nDie Gründe (z.B. FAG, Produkt defekt etc.) und Vorgehensweisen (z.B. Gutschrift, Auszahlung etc.) können dabei\ninnerhalb eines eigenen Moduls in den Shopware Einstellungen administriert werden.\n\nZudem können Sie Rücksendungen nur für bestimmte Kundengruppen oder für definierbare\nBestellstatus aktivieren.\n\n\n</p><p>\nDer Kunde kann pro Bestellung beliebig viele Rücksendungen anlegen. Bei jeder neu angelegten Rücksendung\nkann er jedoch lediglich die Produkte auswählen, die bisher noch in keiner früheren Rücksendung\nreklamiert wurden. Somit kann er die gleichen Produkte nicht mehrfach zurück senden.\n\n</p><p>\nDer Kunde wird mit einer Schritt-für-Schritt Anleitung durch den Prozess einer\nRücksendung geführt. Innerhalb der Liste seiner Bestellungen kommt er direkt mit einem\nLink auf die Liste der Rücksendungen einer Bestellung oder zum Formular zum Anlegen neuer Rücksendungen.\nDazu kann er sich auch ein Rücksende-Dokument als PDF\nherunterladen und dem Paket beilegen.\n</p><p>\nZudem haben Ihre Kunden - unter Beachtung von verschiedenen Bedingungen (z.B. Kundengruppe) - die Möglichkeit direkt ein DHL\nLabel oder DHL QR Code zu erstellen und auszudrucken.\n</p><p>\nInnerhalb der Administration finden Sie unter dem Reiter \"Bestellungen\" den neuen Menüpunkt \"Rücksendungen\".\nHier können Sie jede eingegangene Rücksendung einsehen und bearbeiten. Um den Vorgang besser in\nIhre eigenen Prozesse zu integrieren, können sie auch alle Status selber definieren - vorhandene Status löschen und editieren\noder neue Status anlegen (z.B. \"Rücksendung wartet auf Rückmeldung durch Hersteller\").\n</p><h4>Gäste</h4><p>\n\n\nDas Anlegen von Rücksendungen kann auch unter der Angabe\nder Bestellnummer und der zugehörigen Email Adresse erfolgen.\nSo können z.B. auch Gäste (ohne Kundenkonto) Rücksendungen anlegen\noder vorhandene Rücksendungen einsehen.\nZudem können Sie den Link auf dieses Anmelde-Formular überall im Shop platzieren.\n\n\n\n</p><p>\n\nAufgrund von technischen Restriktionen einer App ist das Anmelde-Formular ausschließlich\nüber einen technischen Link (ohne SEO Url) zu erreichen.\n<br /><br />\nTechnischer Link: /storefront/script/dvsn/return-shipment-app/index<br />\nBeispiel: https://www.ihr-shop.de/storefront/script/dvsn/return-shipment-app/index\n\n</p><h4>Produkte in Bestände buchen</h4><p>\n\nInnerhalb der Administration einer Rücksendung haben Sie die Möglichkeit ausgewählte Produkte\ndirekt zurück in den Bestand zu buchen. So können Produkte, die tatsächlich (z.B. als FAG Rücksendung) zurück gesendet wurden\nund wieder in den Verkauf können, direkt eingebucht werden.\n\n</p><h4>Fristen</h4><p>\n\nSie können in der App Konfiguration definieren, ob eine Rücksendung nur für einen bestimmten Zeitraum (ab\nVersand) angelegt werden darf. So können Sie z.B. das Erstellen einer Rücksendung nur bis zu 21 Tage nach Versand\nermöglichen.\n\n</p><h4>Produkte von Rücksendungen ausschließen</h4><p>\n\nDie App gibt standardmäßig nur \"normale\" Shopware Produkte für eine Rücksendung frei. So können\nz.B. Gutscheine und/oder Rabatte bei einer Rücksendung nicht ausgewählt werden. Sie haben zudem die Möglichkeit\nin den Zusatzfeldern von Produkten diese spezifisch von Rücksendungen auszuschließen.\n\n</p><h4>DHL Retouren Label</h4><p>\n\nSie können Ihren Kunden anbieten, dass diese direkt ein DHL Retouren Label für ihre Bestellung\nerzeugen und ausdrucken können. Zudem können sich Ihre Kunden auch ein QR Code speichern,\num damit bei der DHL Filiale ein Label drucken lassen zu können.\n\n</p><p>\nBitte achten Sie darauf die Gewichte der Produkte in der Administration korrekt zu pflegen.\nDas Gewicht auf dem Label berechnet sich automatisch nach den ausgewählten Produkten.\n\n</p><p>\n\nSie können mit der Schnittstelle zum DHL Geschäftskundenportal ein\nRetouren Label erzeugen lassen. Das Label enthält dabei automatisch Sie als Empfänger\nund den Kunden als Absender.\n\n\n</p><p>\n\nUm DHL Labels erzeugen zu können, benötigen Sie einen Zugang zum DHL Geschäftskundenportal.\nZudem müssen Sie für die Versandabwicklung über das Geschäftskundenportal berechtigt sein.\nFür eine Freischaltung wenden Sie sich bitte an Ihren DHL Kundenberater.\n\n\n\n</p><h4>DHL Retouren Label via DHL Geschäftskundenportal</h4><p><b>Kunden-/EKP-Nummer:</b><br />\nIhre 10-stellige DHL Kundennummer.<br /><br /><b>Verfahrens-Nummer:</b><br />\nDie Verfahrens-Nummer für den DHL Versand. Beispiel: 07 für Deutschland, 53 für Österreich.<br /><br /><b>Teilnahme-Nummer:</b><br />\nEine 2-stellige Nummer zur Untergliederung von Abrechnungen nach Standorten, Saisongeschäft oder\nunterschiedlichen Konditionen. Die Teilnahmenummern der verschiedenen DHL Produkte entsprechen\njeweils den letzten zwei Stellen der zugehörigen Abrechnungsnummern.<br /><br /><b>Retourenempfänger:</b><br />\nIm DHL Geschäftskundenportal im Menü \"Retoure\" im Untermenü \"Einstellungen\" werden Ihnen alle\nRetourenempfängernamen (=ReceiverIds) aufgelistet. Bitte geben Sie hier die gewünschte\n\"Receiver Id\" an.<br /><br /><b>DHL Geschäftskundenportal Benutzer:</b><br />\nDer Benutzer aus dem DHL Geschäftskundenportal. Der Benutzer muss für Retoure berechtigt sein!\nIdealerweise legen Sie einen weiteren Benutzer für die Erstellung der Labels an.\n<br /><br /><b>DHL Geschäftskundenportal Passwort:</b><br />\nDas Passwort des oben genannten Benutzers. Die Passwortgültigkeit eines \"Benutzers\" beträgt 90 Tage.\nDie Passwortgültigkeit eines \"Systembenutzers\" beträgt 365 Tage. Mit einem \"Systembenutzer\" ist eine\nAnmeldung am DHL Geschäftskundenportal nicht möglich.\n\n\n\n\n\n\n\n</p><h4>DHL Retouren Label im Ausland</h4><p>\n\n\nSie können pro Land und/oder Verkaufskanal unterschiedliche DHL Zugangsdaten hinterlegen.\nIm Menüpunkt \"DHL Zugangsdaten\" können Sie hier z.B. für das Land Österreich\neinen eigenen Datensatz hinterlegen. Dann wird für sämtliche Kunden aus Österreich ein\nDHL Label mit diesen Zugangsdaten erzeugt.\n\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie die App</li><li>prüfen Sie die App Konfiguration, ob diese Ihren Wünschen entspricht</li><li>definieren Sie insbesondere gültige Bestellstatus und/oder Kundengruppen</li><li>definieren Sie Ihre gewünschten Gründe und Vorgehensweisen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.ihr-shop.de/storefront/script/dvsn/return-shipment-app/index</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die die Hinweise aus der App Beschreibung</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>Textbausteine</strong><br />\nDie App verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie App ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Apps von Drittanbietern nutzen, dann sollten Sie die App vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die App ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie App kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Apps entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser App haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Apps entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>20+ Jahre Erfahrung</strong><br />\nSeit über 20 Jahren im E-Commerce und seit über 10 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 20 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie die App</li><li>prüfen Sie die App Konfiguration, ob diese Ihren Wünschen entspricht</li><li>definieren Sie insbesondere gültige Bestellstatus und/oder Kundengruppen</li><li>definieren Sie Ihre gewünschten Gründe und Vorgehensweisen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.ihr-shop.de/storefront/script/dvsn/return-shipment-app/index</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die die Hinweise aus der App Beschreibung</li></ul>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"- first app version release","creationDate":{"date":"2023-05-23 22:50:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn337881331732","redirectToStore":true,"lowestPriceValue":49}