{"id":17082,"name":"synQ1app","code":"synQ160167791324","lastChange":{"date":"2023-07-20 07:39:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmxc9bd","examplePageUrl":"","moduleKey":"synQ1app","creationDate":{"date":"2023-05-30 17:09:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-06-13 09:12:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-30 17:46:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4242,"prefix":"synQ1","name":"synQup GmbH","website":"//www.synqup.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4242_MicrosoftTeams-image%2B%252817%2529.png"},"infos":[{"id":29812,"name":"synQup iPaaS - flexible data integration","description":"<p>synQup ist ein iPaaS E-Commerce Data Integration Framework. Die Integrationsplattform vernetzt unterschiedliche Anwendungen aus der breiten IT-Systemlandschaft (z.B. ERP, PIM, CRM, CMS, MAM/DAM). Dabei synchronisiert synQup die Datenströme der verschiedenen Applikationen und Datenquellen. Daten und Prozesse werden digitalisiert, integriert, organisiert und automatisiert, wodurch synQup eine einheitliche und übersichtliche Datenbasis erschafft und einen effizienten Datenaustausch ermöglicht.</p><br><p>synQup lässt sich zu 100% auf jedes Unternehmen anwenden, unabhängig davon, welche Systeme und Prozesse vorhanden sind. Durch den Einsatz von Industriestandard-Technologie erhält synQup zudem volle Flexibilität und Skalierbarkeit. Die Datendrehscheibe arbeitet unter höchsten Sicherheitsstandards und DSGVO-Vorgaben. Zudem sorgen ein umfangreiches Monitoring und intelligente Health-Checks für einen störungsfreien Betrieb.</p><p><br></p><p>Im Rahmen der Integration von synQup entstehen neben den Lizenzkosten weitere Kosten um synQup in Ihre E-Commerce IT-Systemlandschaft zu integrieren. <br>Gerne prüfen wir in einem Scoping Workshop den Aufwand der Umsetzung Ihres Projektes und erstellen ein Angebot. <br><br>Wenn Sie nach einer zuverlässigen und leistungsstarken Middleware suchen, steht Ihnen synQup zur Seite. Unsere Schnittstellenlösung bietet eine umfassende Integration, schnelle Updatefähigkeit und uneingeschränkte Expertise, um Ihre E-Commerce-Herausforderungen zu meistern. Erfahren Sie mehr über synQup und kontaktieren Sie uns für weitere Informationen!<br></p>","installationManual":"","shortDescription":"synQup ist ein iPaaS E-Commerce Data Integration Framework. Die flexible Integrationsplattform vernetzt Anwendungen aus der IT-Systemlandschaft (z.B. Shop, ERP, PIM, CRM, CMS, MAM/DAM).","highlights":"Passgenau - 100% Anwendbarkeit auf Ihr Unternehmen, Integration von vorhandenen Prozessen und Systemen.\nFlexibel - Enorme Freiheit in der Softwareauswahl und Datenverarbeitung.\nIntelligent - Health-Checks und umfangreiches Monitoring garantieren störungsfreien Betrieb.\nSicher - Arbeiten unter höchsten Sicherheitsstandards und DSGVO-Vorgaben.\nSchnell - Hohe Entwicklungs- & Updategeschwindigkeit","features":"Datenimport der Artikelstammdaten vom ERP zu Shopware\nDatenimport und -anreicherung der Artikelzusatzinformationen vom PIM zu Shopware\nDatenimport-und -anreicherung der Artikeldokumente vom DAM zu Shopware\nDatenimport der Zusatzdaten (beispielsweise Ansprechpartner aus Excel…) zu Shopware\nDatenexport Shopware Bestellungen zum ERP\nDatenexport Rechnungen/Lieferscheine vom ERP/DMS zu Shopware\nDatenexport Shopware Warenkorbinformationen vom CRM zu Shopware\nDatenvalidierung nach Ihren Wunschregeln und Reporting"},{"id":29813,"name":"synQup iPaaS - flexible data integration","description":"<p>synQup is an iPaaS e-commerce data integration framework. The flexible integration platform connects different applications from the broad IT system landscape (e.g. ERP, PIM, CRM, CMS, MAM/DAM).&nbsp; In doing so, synQup synchronizes the data streams of the different applications and data sources. Data and processes are digitalised, integrated, organized and automated, whereby synQup creates a uniform and clear database and enables efficient data exchange.<br><br></p>synQup is 100% applicable to any organization, regardless of what systems and processes are in place. The use of industry-standard technology also gives synQup full flexibility and scalability. The data hub operates under the highest security standards and DSGVO requirements. The data hub operates under the highest security standards and DSGVO requirements. In addition, comprehensive monitoring and intelligent health checks ensure trouble-free operation.<br><p><br></p><p>In the context of the integration of synQup, further costs may arise in addition to the license costs in order to integrate synQup into your e-commerce IT system landscape. We would be happy to review the costs of implementing your project in a scoping workshop and provide you with a quote. <br><br>If you are looking for a reliable and powerful middleware solution, synQup is at your side. Our middleware offers comprehensive integration, rapid update capability, and unlimited expertise to meet your e-commerce challenges. Learn more about synQup and contact us for more information!<br></p>","installationManual":"","shortDescription":"synQup is an iPaaS data integration framework. The flexible integration platform connects applications from the IT system landscape (e.g. shop system, ERP, PIM, CRM, CMS, MAM/DAM).","highlights":"A perfect fit - 100% applicability to your company, integration of existing processes and systems.\nFlexible - Enormous freedom in software selection and data processing.\nIntelligent - Health checks and extensive monitoring guarantee trouble-free operation.\nSecure - Works under the highest security standards and DSGVO requirements.\nFast - High development & update speed","features":"Data import of article master data from ERP to Shopware\nData import and enrichment of article supplementary information from PIM to Shopware\nData import and enrichment of article documents from DAM to Shopware\nData import of additional data (e.g. contact persons from Excel...) to Shopware\nData export Shopware orders to ERP\nData export of invoices/delivery bills from ERP/DMS to Shopware\nData export Shopware shopping cart information from CRM to Shopware\nData validation according to your desired rules and reporting"}],"addons":["SW6_integrated"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":168444,"bookingKey":"synQ160167791324","bookingText":"synQup iPaaS - flexible data integration","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBcrMvZ","preview":true,"priority":0,"id":115860},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3zZRVf","preview":false,"priority":0,"id":115909},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcfmtB3","preview":false,"priority":0,"id":115910}],"comments":[],"ratingAverage":0,"label":"synQup iPaaS - flexible data integration","description":"<p>synQup ist ein iPaaS E-Commerce Data Integration Framework. Die Integrationsplattform vernetzt unterschiedliche Anwendungen aus der breiten IT-Systemlandschaft (z.B. ERP, PIM, CRM, CMS, MAM/DAM). Dabei synchronisiert synQup die Datenströme der verschiedenen Applikationen und Datenquellen. Daten und Prozesse werden digitalisiert, integriert, organisiert und automatisiert, wodurch synQup eine einheitliche und übersichtliche Datenbasis erschafft und einen effizienten Datenaustausch ermöglicht.</p><br /><p>synQup lässt sich zu 100% auf jedes Unternehmen anwenden, unabhängig davon, welche Systeme und Prozesse vorhanden sind. Durch den Einsatz von Industriestandard-Technologie erhält synQup zudem volle Flexibilität und Skalierbarkeit. Die Datendrehscheibe arbeitet unter höchsten Sicherheitsstandards und DSGVO-Vorgaben. Zudem sorgen ein umfangreiches Monitoring und intelligente Health-Checks für einen störungsfreien Betrieb.</p><p><br /></p><p>Im Rahmen der Integration von synQup entstehen neben den Lizenzkosten weitere Kosten um synQup in Ihre E-Commerce IT-Systemlandschaft zu integrieren. <br />Gerne prüfen wir in einem Scoping Workshop den Aufwand der Umsetzung Ihres Projektes und erstellen ein Angebot. <br /><br />Wenn Sie nach einer zuverlässigen und leistungsstarken Middleware suchen, steht Ihnen synQup zur Seite. Unsere Schnittstellenlösung bietet eine umfassende Integration, schnelle Updatefähigkeit und uneingeschränkte Expertise, um Ihre E-Commerce-Herausforderungen zu meistern. Erfahren Sie mehr über synQup und kontaktieren Sie uns für weitere Informationen!<br /></p>","installationManual":"","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p>This release is an initial release of the new version.</p>","creationDate":{"date":"2023-05-30 17:53:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=synQ160167791324","redirectToStore":false,"lowestPriceValue":0}