{"id":17147,"name":"DvsnAffiliateBasicApp","code":"dvsn515619650915","lastChange":{"date":"2023-07-18 11:16:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe4tUXn","examplePageUrl":"","moduleKey":"DvsnAffiliateBasicApp","creationDate":{"date":"2023-06-13 20:21:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-06-21 16:56:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-13 20:23:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":29920,"name":"Affiliate program / commissions for customers (customers recruit customers) App","description":"\n\n\n\n\n\n\n<h2>\n    Affiliate program / commissions for customers (customers recruit customers) App\n\n</h2><p><h4>Notes about the app</h4><p>\n\n\nThis is the alternative cloud app for the self-hosted Shopware 6 plugin of the same name. The app tries to reproduce most of the functionality of the plugin, but is limited by technical restrictions of the underlying cloud architecture. I therefore ask for your understanding that the app does not offer the full functionality of the plugin.\n\n</p><h4>Description</h4><p>\n\nTurn your customers into valuable advertising partners!\n</p><p>\n\n\nThis app brings you an affiliate program for Shopware 6 that you may still know from Shopware 5. In addition, however, the partner program is extended so that your customers can register themselves and advertise for a commission for you with friends, in forums, etc.. To do this, your customers can register for the affiliate program in their customer account. After that they have the possibility to generate links that contain their affiliate code. Orders generated through this affiliate code show up in the customer's statistics. Depending on the setting, a commission is then calculated. Your customers can redeem this commission directly as a voucher and use this voucher to make purchases in your store.\n\n</p><p>\nWho will still recommend the competition if they can easily get a commission from you? Do you have a large community that is active in forums, on Facebook or Instagram? The members of this community will specifically link to your store and make a purchase recommendation. There is no better advertising!\n\n\n\n</p><p>\n\nOwn links (incl. own partner code) can be generated in the customer account under \"Partner program\". Your partner can take any link from the store and simply attach their own partner code through a button. The link can now simply be copied and distributed.\n\n</p><p>\n\nYou can also activate that a partner voucher is automatically generated for the partner. Your partner can then use this voucher - e.g. 10% discount - to recruit and entice further customers. Each customer who uses this voucher is automatically assigned to the partner.\n\n\n</p><h4>Assignment of customers to partners</h4><p>\n\n\nThe assignment of a partner to a logged in / registered customer is permanent. This means that every future order is assigned to the partner and commissioned for the partner. If a new customer enters the store via a partner link, then the partner code is stored in the customer's browser. When the new customer logs in or registers, the assignment to the partner is stored permanently.\n\n\n\n</p><p>\n\n\nAlternatively, you can also activate the app configuration \"Assigned customers may be poached by other partners\". In this case, other partners can poach an already assigned customer - e.g. through a partner link or partner voucher - so that future orders are commissioned for the new partner.\n\n\n\n</p><h4>Commission</h4><p>\n\n\nEach partner can be assigned an individual commission. This can be either percentage (e.g. 5%) or absolute (e.g. 5,- EUR). In addition, you can define whether and in what amount subsequent orders should be commissioned. For example, you can commission only the first order of a recruited new customer or you can reduce the commission to a lower rate for further orders. The commission is always calculated on the basis of the net sales prices - without shipping costs.\n\n</p><h4>Partner code and vouchers</h4><p>\n\nDepending on the app configuration, the partner can freely select or change his partner code and even the voucher code. However, any changes must always be enabled in the administration first. However, the partner can, for example, choose his own name or Instagram profile as the partner code or voucher.\n\n</p><h4>Participation in the partner program</h4><p>\n\nYou can define the requirements for signing up to the affiliate program. For example, you can exclude customer groups or require a minimum turnover. In addition, you can define whether each customer can sign up by himself or whether a customer must apply for the affiliate program. For this purpose, he can specify any partner code and write a free comment. Each application must then be manually activated in the administration.\n\n</p><h4>Commissionable orders</h4><p>\n\nFor an order to generate a commission for an affiliate, it must meet certain requirements. For example, you can specify that an order must be at least 14 days old, the order should have the status \"Completed\" and merchants are excluded.\n</p><h4>Payment of the commission</h4><p>\n\n\nYour customers can completely independently exchange the commission for vouchers in your store. You have no additional effort! In addition, you can define all the rules of the vouchers - e.g. restriction to store, manufacturer, etc.. You specify which vouchers are available - e.g. 10,- Euro, 50,- Euro etc.\n\n\n\n\n\n</p><h4>Administration</h4><p>\n\nThe app provides a new menu item for administration. So you can not only see at any time which customers are advertising for you or how high the sales are - but you can also, for example, increase the commission for particularly successful partners. In addition, you have detailed statistics for each partner available at any time.\n\n</p><h4>Affiliate program for price comparisons</h4><p>\n\nSince Shopware 6 lacks an affiliate program, you can of course use the app to measure successes of other portals (e.g. Google Shopping or Idealo). You can attach the partner code to the links you distribute in the portals. The affiliate program will then show you all the statistics clearly and in detail.\n\n</p><h4>Procedure for a partner</h4><ul><li>your customers can register themselves to the affiliate program in the customer account</li><li>the app creates a new partner for this customer in the partner program</li><li>this partner is managed with the commission set in the app configuration (e.g. 5%)</li><li>depending on the app configuration, a partner is activated directly or must be checked manually</li><li>your partner can now generate affiliate links and distribute them to his friends, on Facebook etc.</li><li>if activated, your partner can also distribute vouchers to increase the purchase incentive for referred customers</li><li>he can see his commission himself at any time and exchange it for vouchers</li></ul><h4>Instructions</h4><ul><li>install the app</li><li>the app generates three partner vouchers directly during installation</li><li>you can create more vouchers or customize the generated vouchers according to your needs</li><li>please note that vouchers have an absolute discount and that you have activated \"use individual voucher codes\"</li><li>please do not generate coupon codes and do not use multiple discounts or discounts with different currencies</li><li>in the app configuration select newly created vouchers</li><li>check valid customer groups for partners in the app configuration</li><li>check the conditions for commissionable orders in the app configuration</li><li>the age of the order indicates the days since the order - and not since the shipment. So make sure you have a big enough buffer (e.g. because of returns)</li></ul><br /><br /><h4>General information</h4><ul><li><strong>Snippets</strong><br />\nThe app uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe app is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party apps, you should test the app thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the app is fully responsive\n</li><li><strong>Test version</strong><br />\nThe app can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my apps according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe app manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the app - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>20+ years of experience</strong><br />\nFor over 20 years in e-commerce and for over 10 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 20 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my apps according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed apps according to your wishes.\n</p>","installationManual":"\n\n<h4>Instructions</h4><ul><li>install the app</li><li>the app generates three partner vouchers directly during installation</li><li>you can create more vouchers or customize the generated vouchers according to your needs</li><li>please note that vouchers have an absolute discount and that you have activated \"use individual voucher codes\"</li><li>please do not generate coupon codes and do not use multiple discounts or discounts with different currencies</li><li>in the app configuration select newly created vouchers</li><li>check valid customer groups for partners in the app configuration</li><li>check the conditions for commissionable orders in the app configuration</li><li>the age of the order indicates the days since the order - and not since the shipment. So make sure you have a big enough buffer (e.g. because of returns)</li></ul>\n\n","shortDescription":"Turn your customers into valuable advertising partners - customers recruit customers. Your partners can convert the commission from referred order directly into vouchers for your store.","highlights":"","features":""},{"id":29921,"name":"Kunden werben Kunden - Gutscheine für Provision (Partnerprogramm, Affiliate)","description":"\n\n\n\n\n\n\n<h2>\n    Partnerprogramm / Provisionen für Kunden (Kunden werben Kunden) App\n\n</h2><p><h4>Hinweise zur App</h4><p>\n\n\nDies ist die alternative Cloud App für das gleichnamige self-hosted Shopware 6 Plugin.\nDie App versucht einen Großteil der Funktionalität des Plugins abzubilden, ist jedoch durch\ntechnische Restriktionen der zugrunde liegenden Cloud Architektur in Ihren Möglichkeiten beschränkt.\nIch bitte daher um Verständnis, dass die App nicht den vollen Funktionsumfang des Plugins bietet.\n\n</p><h4>Beschreibung</h4><p>\n\nMachen Sie Ihre Kunden zu wertvollen Werbepartnern!\n</p><p>\n\n\nDiese App bringt Ihnen für Shopware 6 ein Partnerprogramm, das Sie eventuell\nnoch von Shopware 5 kennen. Zusätzlich wird das Partnerprogramm\njedoch erweitert, damit sich Ihre Kunden selber registrieren\nkönnen und für eine Provision für Sie bei Freunden, in Foren etc. werben. Dazu können sich Ihre\nKunden in ihrem Kundenkonto für das Partnerprogramm anmelden. Danach haben sie die Möglichkeit\nLinks zu generieren, die ihren Partner-Code enthalten. Bestellungen, die über diesen Partner-Code\ngeneriert werden, tauchen in der Statistik des Kunden auf. Je nach Einstellung wird dann eine\nProvision berechnet. Diese Provision können sich Ihre Kunden direkt als Gutschein einlösen und\nmit diesem Gutschein in Ihrem Shop einkaufen.\n\n</p><p>\nWer wird noch die Konkurrenz empfehlen, wenn er bei Ihnen ganz einfach eine Provision\nerhalten kann? Haben Sie evtl. sogar eine große Community, die z.B. in Foren, auf Facebook oder Instagram aktiv\nist? Die Mitglieder dieser Community werden gezielt auf Ihren Shop verlinken und eine\nKaufempfehlung aussprechen. Eine bessere Werbung gibt es nicht!\n\n\n\n</p><p>\n\nEigene Links (inkl. eigenem Partner-Code) können im Kundenkonto unter \"Partnerprogramm\"\ngeneriert werden. Ihr Partner kann einen beliebigen Link aus dem Shop nehmen\nund durch einen Button den eigenen Partner-Code einfach anhängen.\nDer Link kann nun einfach kopiert und verteilt werden.\n\n</p><p>\n\nAußerdem können Sie aktivieren, dass für den Partner automatisch ein\nPartner-Gutschein generiert wird.\nIhr Partner kann dann mit diesem Gutschein - z.B. 10 % Rabatt - weitere Kunden werben und locken.\nJeder Kunde, der diesen Gutschein verwendet, wird automatisch dem Partner zugewiesen.\n\n\n</p><h4>Zuordnung von Kunden zu Partnern</h4><p>\n\n\nDie Zuordnung von einem Partner zu einem angemeldeten / registrierten Kunden ist permanent.\nDas heißt, dass jede zukünftige Bestellung dem Partner zugewiesen und für den Partner\nprovisioniert wird. Wenn ein Neukunde den Shop über einen Partner-Link betritt, dann wird\nder Partner-Code im Browser des Kunden gespeichert. Wenn sich der Neukunde anmeldet oder registriert, wird die Zuordnung\nzum Partner permanent gespeichert.\n\n\n\n</p><p>\n\n\nAlternativ können Sie auch die App Konfiguration \"Zugewiesene Kunden dürfen von anderen Partnern abgeworben werden\"\naktivieren. In diesem Fall können andere Partner einen bereits zugewiesen Kunden\nabwerben - z.B. durch einen Partner-Link oder Partner-Gutschein - so dass zukünftige\nBestellungen für den neuen Partner provisioniert werden.\n\n\n\n</p><h4>Provision</h4><p>\n\n\nJedem Partner kann eine individuelle Provision zugewiesen werden. Diese kann entweder prozentual\n(z.B. 5%) oder absolut (z.B. 5,- EUR) sein. Zusätzlich können Sie definieren, ob und in welcher\nHöhe Folgebestellungen provisioniert werden\nsollen. So können Sie z.B. nur die erste Bestellung eines geworbenen Neukunden provisionieren oder Sie\nreduzieren die Provision auf einen geringeren Satz für weitere Bestellungen.\nDie Provision wird dabei immer anhand der Netto-Verkaufspreise berechnet - ohne Versandkosten.\n\n</p><h4>Partner-Code und Gutscheine</h4><p>\n\nJe nach App Konfiguration kann der Partner seinen Partner-Code und sogar den Gutschein-Code\nfrei wählen oder ändern. Jede Änderungen muss jedoch immer erst\nin der Administration freigeschaltet werden. So kann der Partner jedoch z.B. seinen\neigenen Namen oder sein Instagram Profil als Partner-Code oder als Gutschein wählen.\n\n</p><h4>Teilnahme am Partnerprogramm</h4><p>\n\nSie können die Voraussetzungen für die Anmeldung am Partnerprogramm definieren. So können\nSie z.B. Kundengruppen ausschließen oder einen Mindest-Umsatz voraussetzen.\nZudem können Sie definieren, ob sich jeder Kunde selber anmelden darf\noder ob sich ein Kunde für das Partnerprogramm bewerben muss. Dazu kann er einen beliebigen Partner-Code\nangeben und einen freien Kommentar schreiben. Jede Bewerbung muss dann manuell\nin der Administration freigeschaltet werden.\n\n</p><h4>Provisionsfähige Bestellungen</h4><p>\n\nDamit eine Bestellung eine Provision für einen Partner generiert, muss diese\nbestimmte Voraussetzungen erfüllen. So können Sie z.B. angeben, dass eine Bestellung\nmindestens 14 Tage alt sein muss, die Bestellung den Status \"Abgeschlossen\" haben soll und Händler ausgeschlossen sind.\n</p><h4>Auszahlung der Provision</h4><p>\n\n\nIhre Kunden können sich vollständig selbstständig die Provision gegen Gutscheine\nin Ihrem Shop eintauschen. Sie haben keinerlei Mehraufwand! Außerdem können\nSie sämtliche Regeln der Gutscheine definieren - z.B. Beschränkung auf Shop, Hersteller etc.\nSie geben dabei vor welche\nGutscheine zur Verfügung stehen - z.B. 10,- Euro, 50,- Euro usw.\n\n\n\n\n\n</p><h4>Administration</h4><p>\n\nDie App liefert einen neuen Menüpunkt für die Administration.\nSo können Sie nicht nur jederzeit sehen, welche Kunden für Sie werben oder wie hoch die Umsätze\nsind - sondern Sie können z.B. auch die Provision für besonders erfolgreiche Partner erhöhen.\nZudem haben Sie jederzeit ausführliche Statistiken für jeden Partner zur Verfügung.\n\n</p><h4>Partnerprogramm für Preisvergleiche</h4><p>\n\nDa Shopware 6 ein Partnerprogramm fehlt, können Sie die App natürlich auch\nnutzen, um Erfolge anderer Portale (z.B. Google Shopping oder Idealo) zu messen.\nSie können den Partner-Code\nan die Links hängen, die Sie in den Portalen verteilen. Das Partnerprogramm\nzeigt Ihnen dann sämtliche Statistiken übersichtlich und detailliert an.\n\n</p><h4>Ablauf für einen Partner</h4><ul><li>Ihre Kunden können sich selber am Partnerprogramm im Kundenkonto anmelden</li><li>die App erzeugt für diesen Kunden im Partnerprogramm einen neuen Partner</li><li>dieser Partner wird mit der, in der App Konfiguration festgesetzten Provision (z.B. 5%) geführt</li><li>je nach App Konfiguration ist ein Partner direkt freigeschaltet oder muss manuell geprüft werden</li><li>Ihr Partner kann nun Partnerlinks generieren und an seine Freunde, auf Facebook etc. verteilen</li><li>falls aktiviert kann Ihr Partner auch Gutscheine verteilen, um den Kaufanreiz für geworbene Kunden zu erhöhen</li><li>seine Provision kann er jederzeit selber einsehen und in Gutscheine eintauschen</li></ul><h4>Anleitung</h4><ul><li>installieren Sie die App</li><li>die App erzeugt bei der Installation direkt drei Partner-Gutscheine</li><li>Sie können weitere Gutscheine anlegen oder die erzeugten Gutscheine nach Ihren Wünschen anpassen</li><li>bitte beachten Sie, dass Gutscheine einen absoluten Rabatt haben und dass Sie \"individuelle Gutscheincodes verwenden\" aktiviert haben</li><li>bitte generieren Sie keine Gutscheincodes und verwenden Sie keine mehrfachen Rabatte oder Rabatte mit unterschiedlichen Währungen</li><li>in der App Konfiguration wählen Sie neu angelegte Gutscheine aus</li><li>prüfen Sie gültige Kundengruppen für Partner in der App Konfiguration</li><li>prüfen Sie die Bedingungen für provisionsfähige Bestellungen in der App Konfiguration</li><li>das Alter der Bestellung gibt die Tage seit der Bestellung an - und nicht seit dem Versand. Achten Sie also auf einen ausreichend großen Puffer (z.B. wegen Rücksendungen)</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>Textbausteine</strong><br />\nDie App verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie App ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Apps von Drittanbietern nutzen, dann sollten Sie die App vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die App ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie App kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Apps entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser App haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Apps entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>20+ Jahre Erfahrung</strong><br />\nSeit über 20 Jahren im E-Commerce und seit über 10 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 20 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie die App</li><li>die App erzeugt bei der Installation direkt drei Partner-Gutscheine</li><li>Sie können weitere Gutscheine anlegen oder die erzeugten Gutscheine nach Ihren Wünschen anpassen</li><li>bitte beachten Sie, dass Gutscheine einen absoluten Rabatt haben und dass Sie \"individuelle Gutscheincodes verwenden\" aktiviert haben</li><li>bitte generieren Sie keine Gutscheincodes und verwenden Sie keine mehrfachen Rabatte oder Rabatte mit unterschiedlichen Währungen</li><li>in der App Konfiguration wählen Sie neu angelegte Gutscheine aus</li><li>prüfen Sie gültige Kundengruppen für Partner in der App Konfiguration</li><li>prüfen Sie die Bedingungen für provisionsfähige Bestellungen in der App Konfiguration</li><li>das Alter der Bestellung gibt die Tage seit der Bestellung an - und nicht seit dem Versand. Achten Sie also auf einen ausreichend großen Puffer (z.B. wegen Rücksendungen)</li></ul>\n\n","shortDescription":"Machen Sie Ihre Kunden zu wertvollen Werbepartnern - Kunden werben Kunden. Ihre Partner können die Provision von geworbenen Bestellung direkt in Gutscheine für Ihren Shop umwandeln.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":169746,"bookingKey":"dvsn515619650915_M","bookingText":"Affiliate program / commissions for customers (customers recruit customers) App","price":39,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169747,"bookingKey":"dvsn515619650915_M12","bookingText":"Affiliate program / commissions for customers (customers recruit customers) App","price":351,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjaAGCE","preview":true,"priority":9900,"id":116518},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkUjTUl","preview":false,"priority":9800,"id":116526},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbceApe","preview":false,"priority":9700,"id":116523},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppQtgFi","preview":false,"priority":9600,"id":116525},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpS0KgCD","preview":false,"priority":9500,"id":116522},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXOjlfy","preview":false,"priority":4900,"id":116524},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBbqqhn","preview":false,"priority":3900,"id":116520},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpM75LH9","preview":false,"priority":3800,"id":116521},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpc0phdN","preview":false,"priority":3700,"id":116519},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz4ETHt","preview":false,"priority":1900,"id":116531},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php33qW4v","preview":false,"priority":1800,"id":116529},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJyUYd8","preview":false,"priority":1700,"id":116528},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkgJY2d","preview":false,"priority":1600,"id":116530},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsDUA7X","preview":false,"priority":1500,"id":116527}],"comments":[],"ratingAverage":0,"label":"Affiliate program / commissions for customers (customers recruit customers) App","description":"<h2>\n    Affiliate program / commissions for customers (customers recruit customers) App\n\n</h2><p></p><h4>Notes about the app</h4><p>\n\n\nThis is the alternative cloud app for the self-hosted Shopware 6 plugin of the same name. The app tries to reproduce most of the functionality of the plugin, but is limited by technical restrictions of the underlying cloud architecture. I therefore ask for your understanding that the app does not offer the full functionality of the plugin.\n\n</p><h4>Description</h4><p>\n\nTurn your customers into valuable advertising partners!\n</p><p>\n\n\nThis app brings you an affiliate program for Shopware 6 that you may still know from Shopware 5. In addition, however, the partner program is extended so that your customers can register themselves and advertise for a commission for you with friends, in forums, etc.. To do this, your customers can register for the affiliate program in their customer account. After that they have the possibility to generate links that contain their affiliate code. Orders generated through this affiliate code show up in the customer's statistics. Depending on the setting, a commission is then calculated. Your customers can redeem this commission directly as a voucher and use this voucher to make purchases in your store.\n\n</p><p>\nWho will still recommend the competition if they can easily get a commission from you? Do you have a large community that is active in forums, on Facebook or Instagram? The members of this community will specifically link to your store and make a purchase recommendation. There is no better advertising!\n\n\n\n</p><p>\n\nOwn links (incl. own partner code) can be generated in the customer account under \"Partner program\". Your partner can take any link from the store and simply attach their own partner code through a button. The link can now simply be copied and distributed.\n\n</p><p>\n\nYou can also activate that a partner voucher is automatically generated for the partner. Your partner can then use this voucher - e.g. 10% discount - to recruit and entice further customers. Each customer who uses this voucher is automatically assigned to the partner.\n\n\n</p><h4>Assignment of customers to partners</h4><p>\n\n\nThe assignment of a partner to a logged in / registered customer is permanent. This means that every future order is assigned to the partner and commissioned for the partner. If a new customer enters the store via a partner link, then the partner code is stored in the customer's browser. When the new customer logs in or registers, the assignment to the partner is stored permanently.\n\n\n\n</p><p>\n\n\nAlternatively, you can also activate the app configuration \"Assigned customers may be poached by other partners\". In this case, other partners can poach an already assigned customer - e.g. through a partner link or partner voucher - so that future orders are commissioned for the new partner.\n\n\n\n</p><h4>Commission</h4><p>\n\n\nEach partner can be assigned an individual commission. This can be either percentage (e.g. 5%) or absolute (e.g. 5,- EUR). In addition, you can define whether and in what amount subsequent orders should be commissioned. For example, you can commission only the first order of a recruited new customer or you can reduce the commission to a lower rate for further orders. The commission is always calculated on the basis of the net sales prices - without shipping costs.\n\n</p><h4>Partner code and vouchers</h4><p>\n\nDepending on the app configuration, the partner can freely select or change his partner code and even the voucher code. However, any changes must always be enabled in the administration first. However, the partner can, for example, choose his own name or Instagram profile as the partner code or voucher.\n\n</p><h4>Participation in the partner program</h4><p>\n\nYou can define the requirements for signing up to the affiliate program. For example, you can exclude customer groups or require a minimum turnover. In addition, you can define whether each customer can sign up by himself or whether a customer must apply for the affiliate program. For this purpose, he can specify any partner code and write a free comment. Each application must then be manually activated in the administration.\n\n</p><h4>Commissionable orders</h4><p>\n\nFor an order to generate a commission for an affiliate, it must meet certain requirements. For example, you can specify that an order must be at least 14 days old, the order should have the status \"Completed\" and merchants are excluded.\n</p><h4>Payment of the commission</h4><p>\n\n\nYour customers can completely independently exchange the commission for vouchers in your store. You have no additional effort! In addition, you can define all the rules of the vouchers - e.g. restriction to store, manufacturer, etc.. You specify which vouchers are available - e.g. 10,- Euro, 50,- Euro etc.\n\n\n\n\n\n</p><h4>Administration</h4><p>\n\nThe app provides a new menu item for administration. So you can not only see at any time which customers are advertising for you or how high the sales are - but you can also, for example, increase the commission for particularly successful partners. In addition, you have detailed statistics for each partner available at any time.\n\n</p><h4>Affiliate program for price comparisons</h4><p>\n\nSince Shopware 6 lacks an affiliate program, you can of course use the app to measure successes of other portals (e.g. Google Shopping or Idealo). You can attach the partner code to the links you distribute in the portals. The affiliate program will then show you all the statistics clearly and in detail.\n\n</p><h4>Procedure for a partner</h4><ul><li>your customers can register themselves to the affiliate program in the customer account</li><li>the app creates a new partner for this customer in the partner program</li><li>this partner is managed with the commission set in the app configuration (e.g. 5%)</li><li>depending on the app configuration, a partner is activated directly or must be checked manually</li><li>your partner can now generate affiliate links and distribute them to his friends, on Facebook etc.</li><li>if activated, your partner can also distribute vouchers to increase the purchase incentive for referred customers</li><li>he can see his commission himself at any time and exchange it for vouchers</li></ul><h4>Instructions</h4><ul><li>install the app</li><li>the app generates three partner vouchers directly during installation</li><li>you can create more vouchers or customize the generated vouchers according to your needs</li><li>please note that vouchers have an absolute discount and that you have activated \"use individual voucher codes\"</li><li>please do not generate coupon codes and do not use multiple discounts or discounts with different currencies</li><li>in the app configuration select newly created vouchers</li><li>check valid customer groups for partners in the app configuration</li><li>check the conditions for commissionable orders in the app configuration</li><li>the age of the order indicates the days since the order - and not since the shipment. So make sure you have a big enough buffer (e.g. because of returns)</li></ul><br /><br /><h4>General information</h4><ul><li><strong>Snippets</strong><br />\nThe app uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe app is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party apps, you should test the app thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the app is fully responsive\n</li><li><strong>Test version</strong><br />\nThe app can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my apps according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe app manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the app - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>20+ years of experience</strong><br />\nFor over 20 years in e-commerce and for over 10 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 20 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my apps according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed apps according to your wishes.\n</p>","installationManual":"<h4>Instructions</h4><ul><li>install the app</li><li>the app generates three partner vouchers directly during installation</li><li>you can create more vouchers or customize the generated vouchers according to your needs</li><li>please note that vouchers have an absolute discount and that you have activated \"use individual voucher codes\"</li><li>please do not generate coupon codes and do not use multiple discounts or discounts with different currencies</li><li>in the app configuration select newly created vouchers</li><li>check valid customer groups for partners in the app configuration</li><li>check the conditions for commissionable orders in the app configuration</li><li>the age of the order indicates the days since the order - and not since the shipment. So make sure you have a big enough buffer (e.g. because of returns)</li></ul>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"- first app release version","creationDate":{"date":"2023-06-14 09:30:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn515619650915","redirectToStore":true,"lowestPriceValue":39}