{"id":17178,"name":"P2LabProductVideo","code":"P2Lab44832515866","lastChange":{"date":"2023-07-24 16:48:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXGR62W","examplePageUrl":"","moduleKey":"P2LabProductVideo","creationDate":{"date":"2023-06-20 06:32:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2023-07-05 14:02:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-07-24 16:37:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4264,"prefix":"P2Lab","name":"P2Lab sp. z o.o.","website":"//p2lab.eu","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4264_p2lab.jpg"},"infos":[{"id":29976,"name":"Product Video (YouTube, Vimeo, Facebook, Dailymotion, HTML5)","description":"<p>This plugin extends the capabilities of the standard product gallery to support video. You'll be able to manage video materials in the same way as before with photos. The plugin provides the possibility to embed videos from YouTube, Vimeo, Facebook, Dailymotion or upload your own video files. If you have videos in several languages, you can set a separate link/file to each of them. For added videos you can customize the thumbnail or use an automatically downloaded one from YouTube or Vimeo.&nbsp;You can also edit the settings of previously added videos.</p>","installationManual":"<h2>Installation</h2><p>The plugin can easily be installed via the Shopware Plugin Manager in <b>Extensions</b> -&gt; <b>My extensions</b></p><h2>How to use</h2><p>After installation and activation, the plugin is ready to use. Go to edit products where you will see three new tabs in the Media section:</p><p></p><ul><li><b>File</b> - in this tab you can add media files as before<br><br></li><li><b>Embed Video</b> - in this tab you can embed videos from YouTube, Vimeo, Facebook and Dailymotion. If you have more than 1 language in your store, you will see two tabs: <b>General&nbsp;</b>and <b>Other languages</b>, otherwise only the content of the tab <b>General&nbsp;</b>is visible.<br><br>To embed a video follow these steps:<ul><li>Copy the URL to the video and paste in the field <b>URL</b></li><li>Select from media library or upload the thumbnail of the video in the field <b>Thumbnail</b>. This is a mandatory field if you are embedding a video from Facebook or Dailymotion. For videos from YouTube and Vimeo, if you do not select your thumbnail, it will be downloaded automatically</li><li>If you have more languages, go to the tab <b>Other languages</b> where you can provide a separate URL to the video in each other language. Leave fields blank if you want to use the URL from the <b>General&nbsp;</b>tab. Remember, the source of all URLs in <b>Other languages&nbsp;</b>tab must be the same as the source of URL in the <b>General&nbsp;</b>tab. In other words, if you paste the URL to a YouTube video in the<b>&nbsp;General&nbsp;</b>tab, all videos in other languages must also come from YouTube.</li><li>After filling out all the necessary fields, you can add the video to the product gallery using the button <b>Add</b></li></ul></li><li><b>Video </b>-&nbsp;in this tab you can add video files such as .mp4, .webm, etc.<br><br>To add a video file follow these steps:<ul><li>Select from media library or upload the video in the field <b>Video</b>. If you have the selected video in more than one format, click the button <b>Add this video in another format</b>&nbsp;and select the next file from the library.&nbsp;Due to the limited supported video formats by mobile devices (especially iPhones), we recommend adding each video file also as MP4.</li><li>Select from media library or upload the thumbnail of the video in the field <b>Thumbnail</b></li><li>If you have more languages, go to the tab <b>Other languages</b> where you can provide a separate video file in each other language. Leave fields blank if you want to use the video from <b>General&nbsp;</b>tab</li><li>After filling out all the necessary fields, you can add the video to the product gallery using the button <b>Add</b></li></ul></li></ul><p>You can also move the videos in the tile layout as usual by Drag &amp; Drop to set their order. To edit a previously added video or to set it as a cover, use the context menu of the selected element.</p><h2>Configuration</h2><p>After installing the plugin, click the context menu button to go to its configuration where you can customize the following options:</p><ul><li>Use alternative domain youtube-nocookie.com for YouTube videos - YouTube offers to serve videos from the alternative domain www.youtube-nocookie.com which is not setting cookies. After activating this option, there will not be necessary to accept cookies from YouTube to play these videos</li><li>Disable third-party cookie checking - in order to be GDPR compliant, by default the ability to play videos is blocked until the customer accepts third-party cookies. After activating this option, it will be possible to play videos without accepting third-party cookies. Option not recommended if you have a store in a country where GDPR regulations are applicable.</li><li>To speed up page loading, by default a video preview is displayed instead of an iframe. Therefore only when the customer clicks on the image preview then video will be embedded as an iframe. Keep in mind that only YouTube, Vimeo and Dailymotion allow to automatically play the video after loading the iframe. For Facebook will be necessary to click directly on the video inside iframe to start playing, so for it the customer will need to click twice to play video (for the first time on the preview image to load iframe and for the second time on the video inside iframe to play it). With this option you can choose for which sources the iframe will be loaded immediately.</li><li>You can choose between two modes of displaying preview image of embedded videos (option useful if iframes are not loaded immediately):</li><ul><li><b>contain</b> - scale the image, while preserving its intrinsic aspect ratio (if any), to the largest size such that both its width and its height can fit inside the background positioning area</li><li><b>cover</b> - scale the image, while preserving its intrinsic aspect ratio (if any), to the smallest size such that both its width and its height can completely cover the background positioning area</li></ul><li>If you have a custom thumbnail list view, you can also set an additional container selector to which will be added the play icon. This setting can be useful if you are using a custom template, however if you have no knowledge of HTML/JavaScript, you should not enter anything in this field without consulting your developer<br></li></ul><p><b>Important note</b>:&nbsp;If you have changed the plugin configuration and do not see your changes, please go to <b>Settings </b>-&gt; <b>System </b>-&gt; <b>Caches &amp; indexes</b> -&gt; and click the button <b>Clear caches</b></p><p></p>","shortDescription":"This plugin adds support for embedding videos from external services (YouTube, Vimeo, Facebook, Dailymotion) and the possibility to upload video files directly in the product gallery.","highlights":"Embedding support from YouTube, Vimeo, Facebook, Dailymotion\nSupport for HTML5 videos and multilingual content\nManage videos and photos from one place\nAutomatically download the thumbnails from YouTube and Vimeo\nCustomizable video thumbnails","features":"Possibility to set the thumbnail of added video as the cover\nAuto stop video when switching slides/closing gallery\nEdit settings of previously added videos\nManaging the order of added video files\nGDPR compliance - video will be embedded only after cookie approval (ability to change this behavior from the configuration plugin area)\nTo speed up page loading and improve the user experience, by default is displayed a video preview instead of an iframe. Therefore only when the user clicks on the image preview then video will be embedded as an iframe (you can also choose for which sources the iframe will be loaded immediately)"},{"id":29977,"name":"Produktvideo (YouTube, Vimeo, Facebook, Dailymotion, HTML5)","description":"<p>Dieses Plugin erweitert die Möglichkeiten der Standard-Produktgalerie um die Unterstützung von Videos. Sie werden in der Lage sein, Videomaterial auf die gleiche Weise zu verwalten wie zuvor mit Fotos. Das Plugin bietet die Möglichkeit, Videos von YouTube, Vimeo, Facebook, Dailymotion einzubetten oder Ihre eigenen Videodateien hochzuladen. Wenn Sie Videos in mehreren Sprachen haben, können Sie einen separaten Link zu jeder dieser Sprachen setzen. Für eingebettete Videos können Sie das Vorschaubild anpassen oder ein automatisch heruntergeladenes von YouTube oder Vimeo verwenden. Sie können auch die Einstellungen von bereits eingebetteten Videos bearbeiten.</p>","installationManual":"<h2>Einrichtung</h2><p>Das Plugin kann einfach über den Shopware Plugin Manager in <b>Erweiterungen</b>&nbsp;-&gt;&nbsp;<b>Meine Erweiterungen</b></p><h2>Wie zu verwenden</h2><p>Nach der Installation und Aktivierung ist das Plugin einsatzbereit. Gehen Sie zu Produkte bearbeiten, wo Sie drei neue Registerkarten im Abschnitt Medien sehen:</p><p></p><ul><li><b>Datei</b>&nbsp;- Auf dieser Registerkarte können Sie wie zuvor Mediendateien hinzufügen<br><br></li><li><b>Video einbetten</b>&nbsp;- In dieser Registerkarte können Sie Videos von YouTube, Vimeo, Facebook und Dailymotion einbetten. Wenn Sie mehr als 1 Sprache in Ihrem Shop haben, sehen Sie zwei Registerkarten: <b>Allgemein&nbsp;</b>und <b>Andere Sprachen</b>, ansonsten ist nur der Inhalt der Registerkarte&nbsp;<b>Allgemein</b>&nbsp;sichtbar.<br><br>Um ein Video einzubetten, gehen Sie folgendermaßen vor:<ul><li>Kopieren Sie die URL des Videos und fügen Sie sie in das Feld URL ein<br></li><li>Wählen Sie aus der Mediathek oder laden Sie das Thumbnail des Videos in das Feld Thumbnail hoch. Dies ist ein Pflichtfeld, wenn Sie ein Video von Facebook oder Dailymotion einbetten. Bei Videos von YouTube und Vimeo wird das Vorschaubild automatisch heruntergeladen, wenn Sie es nicht auswählen.<br></li><li>Wenn Sie mehrere Sprachen haben, gehen Sie auf die Registerkarte Andere Sprachen, wo Sie eine separate URL für das Video in jeder anderen Sprache angeben können. Lassen Sie die Felder leer, wenn Sie die URL auf der Registerkarte&nbsp;<b>Allgemein</b>&nbsp;verwenden möchten. Denken Sie daran, dass die Quelle aller URLs auf der Registerkarte Andere Sprachen dieselbe sein muss wie die Quelle der URL auf der Registerkarte&nbsp;<b>Allgemein</b>. Mit anderen Worten: Wenn Sie die URL zu einem YouTube-Video auf der Registerkarte&nbsp;<b>Allgemein</b>&nbsp;einfügen, müssen alle Videos in anderen Sprachen ebenfalls von YouTube stammen.<br></li><li>Nachdem Sie alle erforderlichen Felder ausgefüllt haben, können Sie das Video über die Schaltfläche Hinzufügen zur Produktgalerie hinzufügen.<br></li></ul></li><li><b>Video </b>-&nbsp;in this tab you can add video files such as .mp4, .webm, etc.<br><br>Um eine Videodatei hinzuzufügen, gehen Sie folgendermaßen vor:<ul><li>Wählen Sie aus der Medienbibliothek oder laden Sie das Video im Feld Video hoch. Wenn Sie das ausgewählte Video in mehr als einem Format haben, klicken Sie auf die Schaltfläche Dieses Video in einem anderen Format hinzufügen und wählen Sie die nächste Datei aus der Bibliothek. Aufgrund der begrenzten Unterstützung von Videoformaten durch mobile Geräte (insbesondere iPhones), empfehlen wir, jede Videodatei auch als MP4 hinzuzufügen.<br></li><li>Wählen Sie aus der Medienbibliothek oder laden Sie die Miniaturansicht des Videos in das Feld Miniaturansicht hoch<br></li><li>Wenn Sie mehrere Sprachen haben, gehen Sie auf die Registerkarte Andere Sprachen, wo Sie eine separate Videodatei in jeder anderen Sprache bereitstellen können. Lassen Sie die Felder leer, wenn Sie das Video von der Registerkarte&nbsp;<b>Allgemein</b>&nbsp;verwenden möchten<br></li><li>Nachdem Sie alle erforderlichen Felder ausgefüllt haben, können Sie das Video über die Schaltfläche Hinzufügen zur Produktgalerie hinzufügen<br></li></ul></li></ul><p>Sie können die Videos im Kachel-Layout auch wie gewohnt per Drag &amp; Drop verschieben, um ihre Reihenfolge festzulegen. Um ein zuvor hinzugefügtes Video zu bearbeiten oder als Cover festzulegen, verwenden Sie das Kontextmenü des ausgewählten Elements.</p><h2>Konfiguration</h2><p>Nachdem Sie das Plugin installiert haben, klicken Sie auf die Schaltfläche im Kontextmenü, um zur Konfiguration zu gelangen, wo Sie die folgenden Optionen anpassen können:</p><ul><li>Alternative Domain youtube-nocookie.com für YouTube-Videos verwenden - YouTube bietet an, Videos von der alternativen Domain www.youtube-nocookie.com abzuspielen, die keine Cookies setzt. Nach Aktivierung dieser Option ist es nicht mehr notwendig, Cookies von YouTube zu akzeptieren, um diese Videos abzuspielen</li><li>Deaktivieren Sie die Cookie-Prüfung von Drittanbietern - um GDPR-konform zu sein, ist die Möglichkeit, Videos abzuspielen, standardmäßig blockiert, bis der Kunde Cookies von Drittanbietern akzeptiert hat. Nach der Aktivierung dieser Option ist es möglich, Videos abzuspielen, ohne Cookies von Drittanbietern zu akzeptieren. Diese Option wird nicht empfohlen, wenn Sie einen Shop in einem Land haben, in dem die GDPR-Vorschriften gelten</li><li>Um das Laden der Seite zu beschleunigen, wird standardmäßig eine Videovorschau anstelle eines iframe angezeigt. Erst wenn der Kunde auf die Bildvorschau klickt, wird das Video als Iframe eingebettet. Beachten Sie, dass nur YouTube, Vimeo und Dailymotion das automatische Abspielen des Videos nach dem Laden des iframe ermöglichen. Bei Facebook ist es notwendig, direkt auf das Video innerhalb des iframe zu klicken, um die Wiedergabe zu starten, so dass der Kunde zweimal klicken muss, um das Video abzuspielen (zum ersten Mal auf das Vorschaubild, um den iframe zu laden, und zum zweiten Mal auf das Video innerhalb des iframe, um es abzuspielen). Mit dieser Option können Sie wählen, für welche Quellen der iframe sofort geladen wird.</li><li>Sie können zwischen zwei Modi für die Anzeige des Vorschaubildes von eingebetteten Videos wählen (diese Option ist nützlich, wenn iframes nicht sofort geladen werden):</li><ul><li><b>inhalt</b>&nbsp;- das Bild unter Beibehaltung seines Seitenverhältnisses (falls vorhanden) auf die größte Größe skalieren, so dass sowohl seine Breite als auch seine Höhe in den Hintergrund-Positionierungsbereich passen</li><li><b>abdeckung</b>&nbsp;- das Bild unter Beibehaltung seines Seitenverhältnisses (falls vorhanden) auf die kleinste Größe skalieren, so dass sowohl seine Breite als auch seine Höhe den Hintergrund-Positionierungsbereich vollständig abdecken kann</li></ul><li>Wenn Sie eine benutzerdefinierte Thumbnail-Listenansicht haben, können Sie auch einen zusätzlichen Container-Selektor festlegen, dem das Abspielsymbol hinzugefügt wird. Diese Einstellung kann nützlich sein, wenn Sie eine benutzerdefinierte Vorlage verwenden. Wenn Sie jedoch keine Kenntnisse in HTML/JavaScript haben, sollten Sie in diesem Feld nichts eingeben, ohne Ihren Entwickler zu konsultieren<br></li></ul><p><b>Wichtiger Hinweis</b>: Wenn Sie die Plugin-Konfiguration geändert haben und Ihre Änderungen nicht angezeigt werden, gehen Sie bitte zu <b>Einstellungen </b>-&gt; <b>System </b>-&gt; <b>Caches &amp; Indizes</b> -&gt; und klicken Sie auf die Schaltfläche&nbsp;<b>Caches leeren</b><br></p><p></p>","shortDescription":"Hinzufügen der Unterstützung für das Einbetten von Videos von externen Diensten (YouTube, Vimeo, Facebook, Dailymotion) und der Möglichkeit, Videos in die Produktgalerie hochzuladen.","highlights":"Unterstützung für die Einbettung von YouTube, Vimeo, Facebook, Dailymotion\nUnterstützung für HTML5-Videos und mehrsprachige Inhalte\nVerwalten von Videos und Fotos von einem Ort aus\nAutomatisches Herunterladen der Miniaturansichten von YouTube und Vimeo\nAnpassbare Video-Miniaturansichten","features":"Möglichkeit, das Thumbnail des hinzugefügten Videos als Cover zu verwenden\nAutomatisches Anhalten des Videos beim Wechseln der Folien/Schließen der Galerie\nBearbeiten der Einstellungen von zuvor hinzugefügten Videos\nVerwaltung der Reihenfolge der hinzugefügten Videodateien\nGDPR-Konformität - das Video wird nur nach Zustimmung des Cookies eingebettet (dieses Verhalten kann im Konfigurationsbereich des Plugins geändert werden)\nUm das Laden der Seite zu beschleunigen und die Benutzerfreundlichkeit zu verbessern, wird standardmäßig eine Videovorschau anstelle eines iframe angezeigt. Daher wird das Video nur dann als Iframe eingebettet, wenn der Benutzer auf die Bildvorschau klickt (Sie können auch wählen, für welche Quellen der Iframe sofort geladen wird)"}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":172325,"bookingKey":"P2Lab44832515866","bookingText":"Product Video (YouTube, Vimeo, Facebook, Dailymotion, HTML5)","price":39.99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":172323,"bookingKey":"P2Lab44832515866_M","bookingText":"Product Video (YouTube, Vimeo, Facebook, Dailymotion, HTML5)","price":2.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":172324,"bookingKey":"P2Lab44832515866_M12","bookingText":"Product Video (YouTube, Vimeo, Facebook, Dailymotion, HTML5)","price":29.99,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWPWRbH","preview":true,"priority":0,"id":120348},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqcySyq","preview":false,"priority":0,"id":120349},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpid07ZC","preview":false,"priority":0,"id":120350},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVXb0QY","preview":false,"priority":0,"id":120351},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTWY7ua","preview":false,"priority":0,"id":120352},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgfuDPz","preview":false,"priority":0,"id":120353},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJOCMZm","preview":false,"priority":0,"id":120354}],"comments":[{"authorName":"Super Support, vielen Dank!","text":"","headline":"Tolles Plugin, toller Support!","creationDate":{"date":"2023-07-24 16:48:03.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Product Video (YouTube, Vimeo, Facebook, Dailymotion, HTML5)","description":"<p>This plugin extends the capabilities of the standard product gallery to support video. You'll be able to manage video materials in the same way as before with photos. The plugin provides the possibility to embed videos from YouTube, Vimeo, Facebook, Dailymotion or upload your own video files. If you have videos in several languages, you can set a separate link/file to each of them. For added videos you can customize the thumbnail or use an automatically downloaded one from YouTube or Vimeo. You can also edit the settings of previously added videos.</p>","installationManual":"<h2>Installation</h2><p>The plugin can easily be installed via the Shopware Plugin Manager in <b>Extensions</b> -&gt; <b>My extensions</b></p><h2>How to use</h2><p>After installation and activation, the plugin is ready to use. Go to edit products where you will see three new tabs in the Media section:</p><p></p><ul><li><b>File</b> - in this tab you can add media files as before<br /><br /></li><li><b>Embed Video</b> - in this tab you can embed videos from YouTube, Vimeo, Facebook and Dailymotion. If you have more than 1 language in your store, you will see two tabs: <b>General </b>and <b>Other languages</b>, otherwise only the content of the tab <b>General </b>is visible.<br /><br />To embed a video follow these steps:<ul><li>Copy the URL to the video and paste in the field <b>URL</b></li><li>Select from media library or upload the thumbnail of the video in the field <b>Thumbnail</b>. This is a mandatory field if you are embedding a video from Facebook or Dailymotion. For videos from YouTube and Vimeo, if you do not select your thumbnail, it will be downloaded automatically</li><li>If you have more languages, go to the tab <b>Other languages</b> where you can provide a separate URL to the video in each other language. Leave fields blank if you want to use the URL from the <b>General </b>tab. Remember, the source of all URLs in <b>Other languages </b>tab must be the same as the source of URL in the <b>General </b>tab. In other words, if you paste the URL to a YouTube video in the<b> General </b>tab, all videos in other languages must also come from YouTube.</li><li>After filling out all the necessary fields, you can add the video to the product gallery using the button <b>Add</b></li></ul></li><li><b>Video </b>- in this tab you can add video files such as .mp4, .webm, etc.<br /><br />To add a video file follow these steps:<ul><li>Select from media library or upload the video in the field <b>Video</b>. If you have the selected video in more than one format, click the button <b>Add this video in another format</b> and select the next file from the library. Due to the limited supported video formats by mobile devices (especially iPhones), we recommend adding each video file also as MP4.</li><li>Select from media library or upload the thumbnail of the video in the field <b>Thumbnail</b></li><li>If you have more languages, go to the tab <b>Other languages</b> where you can provide a separate video file in each other language. Leave fields blank if you want to use the video from <b>General </b>tab</li><li>After filling out all the necessary fields, you can add the video to the product gallery using the button <b>Add</b></li></ul></li></ul><p>You can also move the videos in the tile layout as usual by Drag &amp; Drop to set their order. To edit a previously added video or to set it as a cover, use the context menu of the selected element.</p><h2>Configuration</h2><p>After installing the plugin, click the context menu button to go to its configuration where you can customize the following options:</p><ul><li>Use alternative domain youtube-nocookie.com for YouTube videos - YouTube offers to serve videos from the alternative domain www.youtube-nocookie.com which is not setting cookies. After activating this option, there will not be necessary to accept cookies from YouTube to play these videos</li><li>Disable third-party cookie checking - in order to be GDPR compliant, by default the ability to play videos is blocked until the customer accepts third-party cookies. After activating this option, it will be possible to play videos without accepting third-party cookies. Option not recommended if you have a store in a country where GDPR regulations are applicable.</li><li>To speed up page loading, by default a video preview is displayed instead of an iframe. Therefore only when the customer clicks on the image preview then video will be embedded as an iframe. Keep in mind that only YouTube, Vimeo and Dailymotion allow to automatically play the video after loading the iframe. For Facebook will be necessary to click directly on the video inside iframe to start playing, so for it the customer will need to click twice to play video (for the first time on the preview image to load iframe and for the second time on the video inside iframe to play it). With this option you can choose for which sources the iframe will be loaded immediately.</li><li>You can choose between two modes of displaying preview image of embedded videos (option useful if iframes are not loaded immediately):<ul><li><b>contain</b> - scale the image, while preserving its intrinsic aspect ratio (if any), to the largest size such that both its width and its height can fit inside the background positioning area</li><li><b>cover</b> - scale the image, while preserving its intrinsic aspect ratio (if any), to the smallest size such that both its width and its height can completely cover the background positioning area</li></ul></li><li>If you have a custom thumbnail list view, you can also set an additional container selector to which will be added the play icon. This setting can be useful if you are using a custom template, however if you have no knowledge of HTML/JavaScript, you should not enter anything in this field without consulting your developer<br /></li></ul><p><b>Important note</b>: If you have changed the plugin configuration and do not see your changes, please go to <b>Settings </b>-&gt; <b>System </b>-&gt; <b>Caches &amp; indexes</b> -&gt; and click the button <b>Clear caches</b></p><p></p>","version":"2.1.2","changelog":[{"version":"2.1.2","text":"<ul><li>Some minor improvements</li></ul>","creationDate":{"date":"2023-07-20 18:47:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<ul><li>Some minor improvements</li></ul>","creationDate":{"date":"2023-07-19 15:00:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p></p><ul><li>Added support for Shopware 6.5.3.x.<br /></li></ul>","creationDate":{"date":"2023-07-16 16:42:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<ul><li></li><li>Some minor improvements</li></ul>","creationDate":{"date":"2023-07-20 18:37:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p></p><ul><li>Some minor improvements</li></ul>","creationDate":{"date":"2023-07-19 14:54:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<ul><li>Added possibility to set additional settings for videos.</li><li>Added possibility to upload the same video in several formats.</li></ul>","creationDate":{"date":"2023-07-16 18:38:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>Added support for Shopware (&gt;=6.5 &lt;6.5.3)</p>","creationDate":{"date":"2023-06-23 18:10:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release (&gt;=6.4.3.0 &lt;6.5)</p>","creationDate":{"date":"2023-06-23 17:49:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=P2Lab44832515866","redirectToStore":true,"lowestPriceValue":2.99}