{"id":17193,"name":"Digi8SuchErgebnis","code":"Digi897266750717","lastChange":{"date":"2023-07-18 11:16:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphzaEmq","examplePageUrl":"","moduleKey":"Digi8SuchErgebnis","creationDate":{"date":"2023-06-21 16:35:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2023-07-10 08:34:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-21 17:14:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3608,"prefix":"Digi8","name":"Digital Touched","website":"//","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3608_logo+digital+touched.png"},"infos":[{"id":29999,"name":"Translate 'Top Results' on the search results page","description":"We are excited to introduce our new plugin, \"Translate 'Top Results' on the search results page,\" which provides a vital solution for online stores operating in different languages.<br><br>In the German and English sales channels, the sorting order in the search result list is translated by default. However, a challenge arises as other languages like Italian or French still display \"Beste Ergebnisse\" (German for \"Top Results\"). This inconsistency can lead to confusion among non-German or non-English-speaking customers.<br><br>With our plugin, this issue is resolved in Shopware 6. It ensures that the correct translation for the sorting order in the search result list is displayed in every language. Customers from different countries and cultures can enjoy an optimized shopping experience by receiving search results in their preferred language and with complete clarity.<br><br>The significance of this plugin lies in its ability to significantly enhance the user-friendliness of your online store. By ensuring that your customers can see the sorting order in their native language, you increase the chances of a positive shopping experience and strengthen trust in your shop.<br><br>Don't miss the opportunity to overcome the language barrier and better serve your international customers. Install our \"Translate 'Top Results' on the search results page\" plugin today and experience the benefits of seamless translation of the sorting order in any sales channel of your choice.<br><p><br></p><p><br></p>","installationManual":"<p>Install through the Plugin Manager.<br>Empty Cache and compile Theme.<br></p>","shortDescription":"Introducing \"Translate 'Top Results' on search page\" plugin for multilingual sorting order translations.\nInstall now to overcome language barriers and errors.","highlights":"1. Multilingual Solution: Resolve translation inconsistencies for sorting order in online stores operating in different languages.\n2. Enhanced Shopping Experience: Provide clear and accurate sorting order translations in the preferred language of customers from diverse countries and cultures.\n3. User-Friendliness: Improve the usability of your online store by ensuring sorting order visibility in customers' native languages.\n4. Build Trust: Increase customer confidence by demonstrating attention to detail and catering to their language preferences.\n5. Seamless Integration: Easily install the \"Translate 'Top Results' on the search results page\" plugin to start benefiting from enhanced sorting order translations across all sales channels.","features":""},{"id":30000,"name":"'Bestes Ergebnis' auf der Suchergebnisseite übersetzen","description":"Wir freuen uns, Ihnen unser neues Plugin \"'Bestes Ergebnis' auf der Suchergebnisseite übersetzen\" vorzustellen, das eine wichtige Lösung für Online-Shops bietet, die in verschiedenen Sprachen betrieben werden.<br><br>In den Verkaufskanälen Deutsch und Englisch ist die Sortierreihenfolge in der Suchergebnisliste standardmäßig übersetzt. Jedoch stellt sich eine Herausforderung dar, da in anderen Sprachen wie Italienisch oder Französisch weiterhin die Anzeige \"Beste Ergebnisse\" verwendet wird. Diese Inkonsistenz kann zu Verwirrung bei nicht-deutsch- oder nicht-englischsprachigen Kunden führen.<br><br>Mit unserem Plugin wird dieser Fehler in Shopware 6 behoben. Es gewährleistet, dass in jeder Sprache die korrekte Übersetzung für die Sortierreihenfolge in der Suchergebnisliste angezeigt wird. Kunden aus verschiedenen Ländern und Kulturen können so ein optimiertes Einkaufserlebnis genießen, da sie die Suchergebnisse in ihrer bevorzugten Sprache und mit voller Klarheit erhalten.<br><br>Die Bedeutung dieses Plugins liegt in seiner Fähigkeit, die Benutzerfreundlichkeit Ihres Online-Shops erheblich zu verbessern. Indem Sie sicherstellen, dass Ihre Kunden die Sortierreihenfolge in ihrer Muttersprache sehen können, erhöhen Sie die Chancen auf ein positives Einkaufserlebnis und stärken das Vertrauen in Ihren Shop.<br><br>Verpassen Sie nicht die Gelegenheit, die Sprachbarriere zu überwinden und Ihre internationalen Kunden besser zu bedienen. Installieren Sie noch heute unser Plugin \"'Bestes Ergebnis' auf der Suchergebnisseite übersetzen\" und erleben Sie die Vorteile einer nahtlosen Übersetzung der Sortierreihenfolge in jedem Verkaufskanal Ihrer Wahl.<br><p><br></p>","installationManual":"<p>Installation über den Pluginmanager.<br>Leeren des Cache und kompilieren des Themes<br></p>","shortDescription":"Unser Plugin \"'Bestes Ergebnis' auf der Suchergebnisseite übersetzen\" korrigiert die Übersetzung in der Sortierreihenfolge so dass sich Kunden aus anderen Ländern  heimisch fühlen.","highlights":"1.  Lösen Sie Übersetzungsinkonsistenzen für die Sortierreihenfolge in Online-Shops, die in verschiedenen Sprachen betrieben werden.\n2. Bieten Sie klare und genaue Übersetzungen der Sortierreihenfolge in der bevorzugten Sprache von Kunden aus verschiedenen Ländern und Kulturen.\n3. Verbessern Sie die Nutzerfreundlichkeit Ihres Online-Shops, indem Sie die Sichtbarkeit der Sortierreihenfolge in der Muttersprache Ihrer Kunden gewährleisten.\n4. Steigern Sie das Vertrauen der Kunden, indem Sie auf Details achten und deren Sprachpräferenzen berücksichtigen.\n5.  Installieren Sie das Plugin \"'Bestes Ergebnis' auf der Suchergebnisseite übersetzen\", um von verbesserten Übersetzungen der Sortierreihenfolge in allen Verkaufskanälen zu profitieren.","features":""}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":169290,"bookingKey":"Digi897266750717_M","bookingText":"Translate 'Top Results' on the search results page","price":2,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAKCo4x","preview":true,"priority":0,"id":117105},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwV7TuH","preview":false,"priority":0,"id":117107}],"comments":[],"ratingAverage":0,"label":"Translate 'Top Results' on the search results page","description":"We are excited to introduce our new plugin, \"Translate 'Top Results' on the search results page,\" which provides a vital solution for online stores operating in different languages.<br /><br />In the German and English sales channels, the sorting order in the search result list is translated by default. However, a challenge arises as other languages like Italian or French still display \"Beste Ergebnisse\" (German for \"Top Results\"). This inconsistency can lead to confusion among non-German or non-English-speaking customers.<br /><br />With our plugin, this issue is resolved in Shopware 6. It ensures that the correct translation for the sorting order in the search result list is displayed in every language. Customers from different countries and cultures can enjoy an optimized shopping experience by receiving search results in their preferred language and with complete clarity.<br /><br />The significance of this plugin lies in its ability to significantly enhance the user-friendliness of your online store. By ensuring that your customers can see the sorting order in their native language, you increase the chances of a positive shopping experience and strengthen trust in your shop.<br /><br />Don't miss the opportunity to overcome the language barrier and better serve your international customers. Install our \"Translate 'Top Results' on the search results page\" plugin today and experience the benefits of seamless translation of the sorting order in any sales channel of your choice.<br /><p><br /></p><p><br /></p>","installationManual":"<p>Install through the Plugin Manager.<br />Empty Cache and compile Theme.<br /></p>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p>- published in Store<br /></p>","creationDate":{"date":"2023-06-21 17:14:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Digi897266750717","redirectToStore":false,"lowestPriceValue":2}