{"id":17226,"name":"SkifStockReport","code":"Skif541778499283","lastChange":{"date":"2023-07-20 10:21:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8jlyDM","examplePageUrl":"","moduleKey":"SkifStockReport","creationDate":{"date":"2023-06-26 15:04:52.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2023-07-20 10:21:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-26 15:47:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":4185,"prefix":"Skif","name":"SkifTechs","website":"//skiftechs.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod4185_skiftechs-logo.jpg"},"infos":[{"id":30054,"name":"Stock History Export: Exporting Products Stock to Any Past Date","description":"<p>Introducing our groundbreaking solution that revolutionizes product exports by enabling you to effortlessly <b>retrieve up-to-date stock data on any past date</b>. This innovative tool opens up a world of possibilities, catering to a variety of needs and scenarios.</p><p><br></p><p>First and foremost, our solution proves invaluable for tax enquiries. With the ability to access historical stock information, you can accurately assess and report your inventory holdings for tax purposes. Say goodbye to the hassle of manually compiling data or making estimates based on incomplete information. Our tool ensures that you have the most precise and reliable stock data at your disposal.</p><p><br></p><p>Additionally, our solution streamlines stock count and reconciliation processes. Whether you need to reconcile discrepancies or investigate past inventory levels, our tool empowers you to go back in time and retrieve the exact stock data for any given date. Effortlessly compare your records, identify anomalies, and achieve accurate stock reconciliations with ease.</p><p><br></p><p>Furthermore, our solution is a game-changer for stock forecasting. By analyzing historical stock trends and fluctuations, you gain valuable insights into demand patterns, seasonal variations, and market trends. Armed with this information, you can make more informed decisions about inventory management, optimize stocking levels, and effectively plan for future demand.</p><p><br></p><p>Last but not least, our tool proves invaluable for inventory retrieval. In case of unforeseen circumstances such as data loss or system errors, you can rely on our solution to retrieve crucial stock information from any specific date in the past. Safeguard your business against disruptions, confidently restore inventory records, and ensure seamless continuity.</p><p><br></p><p>Unlock the power of time-traveling stock exports with our solution, empowering you to address tax enquiries, streamline stock reconciliation, enhance stock forecasting, and retrieve historical inventory data effortlessly. Experience the convenience and reliability of having up-to-date stock information at your fingertips, regardless of the date in the past.</p>","installationManual":"<p>1. Install and activate the plugin</p><p>2. Go to Catalogues -&gt; Stock History Export</p><p>3. Select a date in the past in the Date field</p><p>4. Select the export file format</p><p>5. Click Export and wait. The export waiting time depends on the number of items</p><p>6. The file upload will start automatically as soon as the file is ready</p>","shortDescription":"Product export with an up-to-date stock on any date in the past.\n- tax enquiry\n- stock count and reconciliation\n- stock forecasting\n- inventory retrieval","highlights":"1. The plugin performs export of products stock at any date in the past.\nIf the product has not yet been created at the time of the selected export date, it will not be in the upload.\n2. Export is possible in CSV and XLSX format\n3. The standard fields of the export file: id (gtin), Brand, Name, SKU, Stock, Price, Date, Category","features":"1. Export to XLSX and CSV\n2. Retrieve up-to-date stock data on any past date"},{"id":30055,"name":"Bestandshistorie exportieren: Export von Produktbeständen zu einem vergangenen Datum","description":"<p>Wir möchten Ihnen unsere bahnbrechende Lösung vorstellen, die den Produktexport revolutioniert, indem Sie mühelos die aktuellsten Lagerbestandsdaten zu jedem vergangenen Datum abrufen können. Dieses innovative Tool eröffnet eine Vielzahl von Möglichkeiten und erfüllt unterschiedliche Bedürfnisse und Szenarien.</p><p><br></p><p>Zunächst einmal ist unsere Lösung für Steueranfragen von unschätzbarem Wert. Mit der Möglichkeit, historische Lagerbestandsinformationen abzurufen, können Sie Ihren Bestand genau bewerten und für steuerliche Zwecke angeben. Schluss mit dem Aufwand des manuellen Zusammenstellens von Daten oder Schätzungen aufgrund unvollständiger Informationen. Unser Tool stellt sicher, dass Sie über die präzisesten und zuverlässigsten Lagerbestandsdaten verfügen.</p><p><br></p><p>Darüber hinaus optimiert unsere Lösung den Bestandszählungs- und Abgleichsprozess. Egal, ob Sie Unstimmigkeiten abgleichen oder vergangene Lagerbestandsniveaus untersuchen müssen, unser Tool ermöglicht es Ihnen, in die Vergangenheit zu reisen und die genauen Bestandsdaten für ein beliebiges Datum abzurufen. Vergleichen Sie Ihre Aufzeichnungen mühelos, identifizieren Sie Anomalien und erreichen Sie problemlos genaue Bestandsabgleiche.</p><p><br></p><p>Darüber hinaus ist unsere Lösung ein echter Gamechanger für die Bestandsprognose. Durch die Analyse historischer Lagerbestandstrends und Schwankungen erhalten Sie wertvolle Einblicke in Nachfrageverhalten, saisonale Variationen und Markttrends. Mit diesen Informationen können Sie fundiertere Entscheidungen über das Bestandsmanagement treffen, Bestandsniveaus optimieren und die Nachfrage für die Zukunft effektiv planen.</p><p><br></p><p>Nicht zuletzt ist unser Tool von unschätzbarem Wert für den Bestandsabruf. Im Falle von unvorhergesehenen Umständen wie Datenverlust oder Systemfehlern können Sie sich auf unsere Lösung verlassen, um entscheidende Lagerbestandsinformationen von einem bestimmten Datum in der Vergangenheit abzurufen. Schützen Sie Ihr Unternehmen vor Unterbrechungen, stellen Sie Lagerbestandsaufzeichnungen sicher wieder her und gewährleisten Sie eine nahtlose Kontinuität.</p><p><br></p><p>Entdecken Sie die Möglichkeiten des zeitgereisten Produktexports mit unserer Lösung, die es Ihnen ermöglicht, Steueranfragen zu bearbeiten, den Bestandsabgleich zu optimieren, die Bestandsprognose zu verbessern und historische Lagerbestandsdaten mühelos abzurufen. Erleben Sie den Komfort und die Zuverlässigkeit, jederzeit über aktuelle Lagerbestandsinformationen zu verfügen, unabhängig vom Datum in der Vergangenheit.</p>","installationManual":"<p>1. Installieren und aktivieren Sie das Plugin</p><p>2. Gehen Sie zu Kataloge -&gt; Bestandsverlauf exportieren</p><p>3. Wählen Sie im Feld Datum ein Datum aus, das in der Vergangenheit liegt</p><p>4. Wählen Sie das Format der Exportdatei</p><p>5. Klicken Sie auf Exportieren und warten Sie. Die Wartezeit für den Export hängt von der Anzahl der Elemente ab</p><p>6. Der Datei-Upload wird automatisch gestartet, sobald die Datei fertig ist</p>","shortDescription":"Produktexport mit aktuellem Lagerbestand zu einem beliebigen vergangenen Datum.\n- Steueranfrage\n- Bestandszählung und Abgleich\n- Bestandsprognose\n- Bestandsabruf","highlights":"1. Das Plugin exportiert Produkte, die zu einem beliebigen Zeitpunkt in der Vergangenheit auf Lager waren.\nWenn das Produkt zum Zeitpunkt des gewählten Exportdatums noch nicht erstellt wurde, wird es nicht in den Upload aufgenommen.\n2. Der Export ist im CSV- und XLSX-Format möglich.\n3. Die Standardfelder der Exportdatei: id (gtin), Brand, Name, SKU, Stock, Price, Date, Category","features":""}],"addons":[],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":171744,"bookingKey":"Skif541778499283_M","bookingText":"Stock History Export: Exporting Products Stock to Any Past Date","price":35,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":171745,"bookingKey":"Skif541778499283_M12","bookingText":"Stock History Export: Exporting Products Stock to Any Past Date","price":315,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSkTazb","preview":true,"priority":0,"id":120197},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfBA4PQ","preview":false,"priority":0,"id":120196}],"comments":[],"ratingAverage":0,"label":"Stock History Export: Exporting Products Stock to Any Past Date","description":"<p>Introducing our groundbreaking solution that revolutionizes product exports by enabling you to effortlessly <b>retrieve up-to-date stock data on any past date</b>. This innovative tool opens up a world of possibilities, catering to a variety of needs and scenarios.</p><p><br /></p><p>First and foremost, our solution proves invaluable for tax enquiries. With the ability to access historical stock information, you can accurately assess and report your inventory holdings for tax purposes. Say goodbye to the hassle of manually compiling data or making estimates based on incomplete information. Our tool ensures that you have the most precise and reliable stock data at your disposal.</p><p><br /></p><p>Additionally, our solution streamlines stock count and reconciliation processes. Whether you need to reconcile discrepancies or investigate past inventory levels, our tool empowers you to go back in time and retrieve the exact stock data for any given date. Effortlessly compare your records, identify anomalies, and achieve accurate stock reconciliations with ease.</p><p><br /></p><p>Furthermore, our solution is a game-changer for stock forecasting. By analyzing historical stock trends and fluctuations, you gain valuable insights into demand patterns, seasonal variations, and market trends. Armed with this information, you can make more informed decisions about inventory management, optimize stocking levels, and effectively plan for future demand.</p><p><br /></p><p>Last but not least, our tool proves invaluable for inventory retrieval. In case of unforeseen circumstances such as data loss or system errors, you can rely on our solution to retrieve crucial stock information from any specific date in the past. Safeguard your business against disruptions, confidently restore inventory records, and ensure seamless continuity.</p><p><br /></p><p>Unlock the power of time-traveling stock exports with our solution, empowering you to address tax enquiries, streamline stock reconciliation, enhance stock forecasting, and retrieve historical inventory data effortlessly. Experience the convenience and reliability of having up-to-date stock information at your fingertips, regardless of the date in the past.</p>","installationManual":"<p>1. Install and activate the plugin</p><p>2. Go to Catalogues -&gt; Stock History Export</p><p>3. Select a date in the past in the Date field</p><p>4. Select the export file format</p><p>5. Click Export and wait. The export waiting time depends on the number of items</p><p>6. The file upload will start automatically as soon as the file is ready</p>","version":"0.0.1","changelog":[{"version":"0.0.1","text":"<p>The basic functionality of exporting product inventory in XLSX or CSV format for a specific date in the past has been implemented.</p>","creationDate":{"date":"2023-06-26 16:13:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Skif541778499283","redirectToStore":true,"lowestPriceValue":35}