{"id":17282,"name":"WduOrderRepeater","code":"wdu9562632230152","lastChange":{"date":"2023-07-25 17:10:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGX1Aar","examplePageUrl":"","moduleKey":"WduOrderRepeater","creationDate":{"date":"2023-07-06 13:13:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2023-07-25 17:10:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2023-07-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-07-24 11:39:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":872,"prefix":"wdu","name":"WIRDUZEN","website":"//wirduzen.digital","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod872_WIRDUZEN_Partner-Logo_Shopware-Account_128px.png"},"infos":[{"id":30154,"name":"Single product reorder - Customer Account","description":"<p>With \"Single product reorder\"&nbsp; your customers can specifically repurchase individual products from their order history. With just one click the desired product is immediately in the shopping cart and can be purchased again. Reordering couldn't be easier or more convenient. By saving customers time the shopping experience is optimized and increases customer satisfaction.</p>","installationManual":"<p>You can easily install and activate the extension via the Plugin Manager. And that's it.</p><p>To reorder a product you bought before you can just choose it from your order-history now. All you need to do is to click on \"Buy again\", which puts&nbsp; the product directly in the shopping cart. You can immediately finish the checkout then.&nbsp; It really couldn't be easier.</p>","shortDescription":"Customers can repurchase single products from the order history with just one click. This simple and convenient reordering accelarates the checkout and increases customer satisfaction.","highlights":"Products from the order history can be ordered again.\nSaving customers’ time.\nOptimize shopping experience.\nIncrease customer satisfaction. \nBoost your shop sales.","features":"Quick Reordering: Customers can easily repurchase specific products from their order history with just one click, saving time and streamlining the shopping process.\nSeamless Shopping Experience: The plugin enhances the overall shopping experience by providing a hassle-free way for customers to reorder their favorite products, increasing customer satisfaction and loyalty.\nIncreased Customer Convenience: With the ability to reorder products effortlessly, customers can conveniently access their desired items, making the repurchase process smoother and more efficient."},{"id":30155,"name":"Einzelprodukte Nachbestellen - Kundenkonto","description":"<p>Mit \"Einzelprodukt Nachbestellen\" können Ihre Kunden gezielt einzelne Produkte aus ihrer Bestellhistorie erneut kaufen. Mit nur einem Klick ist das gewünschte Produkt sofort im Warenkorb und kann erneut gekauft werden. Einfacher und komfortabler kann ein Nachbestellen nicht sein. Das Einkaufserlebnis wird optimiert und die Kundenzufriedenheit durch Zeitersparnis gesteigert.&nbsp;</p><p><br></p>","installationManual":"<p>Du installierst die Erweiterung ganz einfach über den Plugin Manager und aktivierst diese anschließend. Und das wars auch schon.</p><p>Jetzt kannst Du ein Produkt, das Du noch einmal kaufen möchtest einfach unter Deinen bisherigen Bestellungen auswählen. Indem Du dort nun auf den Button \"Erneut kaufen\" klickst, gelangt das gewünschte Einzelprodukt direkt in den Warenkorb. Jetzt nur noch zur Kasse gehen und zahlen. Einfacher geht es wirklich nicht mehr.&nbsp;</p>","shortDescription":"Kunden können mit nur einem Klick einzelne Produkte aus der Bestellhistorie erneut kaufen. Das einfache und komfortable Nachbestellen optimiert den Checkout und die Kundenzufriedenheit.","highlights":"Produkte aus der Bestellhistorie können erneut bestellt werden.\nKunden sparen sich Zeit.\nEinkaufserlebnis wird gesteigert.\nKundenzufriedenheit wird erhöht.\nZusätzlicher Boost für Verkäufe.","features":"Schnelle Nachbestellung: Kunden können mit nur einem Klick einzelne Produkte aus ihrer Bestellhistorie unkompliziert erneut kaufen und dadurch Zeit sparen und den Einkaufsprozess optimieren.\nNahtloses Einkaufserlebnis: Das Plugin verbessert das gesamte Einkaufserlebnis, indem es Kunden eine mühelose Möglichkeit bietet, ihre Lieblingsprodukte erneut zu bestellen, was die Kundenzufriedenheit und -treue steigert.\nErhöhte Kundenbequemlichkeit: Durch die Möglichkeit, Produkte mühelos nachzubestellen, können Kunden bequem auf ihre gewünschten Artikel zugreifen und den Nachbestellvorgang reibungsloser und effizienter gestalten."}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":172562,"bookingKey":"wdu9562632230152_M","bookingText":"Single product reorder - Customer Account","price":1,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":172563,"bookingKey":"wdu9562632230152_M12","bookingText":"Single product reorder - Customer Account","price":9,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php377HIt","preview":true,"priority":0,"id":120377},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxLvTOy","preview":false,"priority":4,"id":121019},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpp5n28N","preview":false,"priority":3,"id":121021},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpd6p8mC","preview":false,"priority":2,"id":121020}],"comments":[],"ratingAverage":0,"label":"Single product reorder - Customer Account","description":"<p>With \"Single product reorder\"  your customers can specifically repurchase individual products from their order history. With just one click the desired product is immediately in the shopping cart and can be purchased again. Reordering couldn't be easier or more convenient. By saving customers time the shopping experience is optimized and increases customer satisfaction.</p>","installationManual":"<p>You can easily install and activate the extension via the Plugin Manager. And that's it.</p><p>To reorder a product you bought before you can just choose it from your order-history now. All you need to do is to click on \"Buy again\", which puts  the product directly in the shopping cart. You can immediately finish the checkout then.  It really couldn't be easier.</p>","version":"1.0.0","changelog":[{"version":"1.0.0","text":"<p># 1.0.0</p><p>- working launch version\n</p>","creationDate":{"date":"2023-07-20 11:03:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=wdu9562632230152","redirectToStore":true,"lowestPriceValue":1}