{"id":8623,"name":"DvsnSetConfigurator","code":"dvsn895115432267","lastChange":{"date":"2023-07-25 08:00:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBVvVdd","examplePageUrl":"","moduleKey":"DvsnSetConfigurator","creationDate":{"date":"2019-05-02 13:47:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-07-03 07:25:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-09-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-04-30 16:31:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":13429,"name":"Produkt Konfigurator für Sets / Bundles","description":"\n\n\n\n\n\n\n<h2>\n    Artikel Konfigurator für wählbare Sets und Bundles\n</h2><p>\n\nLegen Sie mit diesem Plugin eigene Konfigurationen für Sets und Bundles an.\nIhr Kunde kann sich dann diese Sets und Bundles selber konfigurieren und passende\nZusammenstellungen wählen.\nSie können einzelne Produkte gruppieren und den Kunden aus diesen Streams (\"Gruppen\")\neinen oder mehrere Produkte wählen lassen. Dabei kann jeder Stream ein oder mehrere verpflichtenden\nProdukte beinhalten.\n\n</p><h4>Streams</h4><p>\n\n\n\nAlle Produkte innerhalb des Konfigurators sind in einzelne Streams unterteilt.\nSo können Sie ihre Konfiguration inhaltlich und logisch trennen. Am Beispiel\neines Geschenkkorbs können Sie die Streams \"Wein\", \"Nudeln\" und \"Sonstiges\" anzeigen lassen.\nInnerhalb der Streams \"Wein\" und \"Nudeln\" kann der Kunde jeweils ein entsprechendes Produkt\nwählen und innerhalb des Streams \"Sonstiges\" kann der Kunde weitere Optionen, wie z.B.\n\"als Geschenk verpacken\" oder \"rote Schleife\", wählen.\n\n\n\n\n</p><h4>Streams - Auswahl und Optik</h4><p>\n\nSie können Ihre Produkte innerhalb der Streams in drei optisch unterschiedlichen Varianten\npräsentieren: als Slider, als Galerie oder als Liste. Die Ansicht als Slider\noder Galerie eignet sich insbesondere, wenn man Produktbild für die Auswahl relevant ist\nund man dieses hervorheben möchte - z.B. der Wein oder die Nudeln. Eine Liste eignet sich bei einer großen Auswahl\nvon Produkten, dessen Produktbilder für die Auswahl weniger interessant sind - z.B.\ndie sonstigen Optionen.\n\n\n\n</p><h4>Auswahl der Produkte</h4><p>\n\n\nDie zur Auswahl stehenden Produte der Streams können wahlweise über eine dynamische\nProduktgruppe oder eine Liste gepflegt werden. Eine dynamische Produktgruppe hilft\ninsbesondere, wenn Sie die Produkte über individuelle Filter definieren können -\nz.B. alle lieferbare Produkte der Kategorie \"Wein\", die über 10,- EUR kosten.\n\nGerade für eine kleinere Auswahl würde sich die Pflege der\nProdukte über eine Liste empfehlen. Hier können Sie einzelne Produkte aufnehmen\nund manuell sortieren.\n\n\n\n</p><h4>Position</h4><p>\n\nSie können den Konfiguratior wahlweise in der \"buy-box\" auf der rechten Seite\n(zwischen Preis und Warenkorb-Button) oder unterhalb der Produktbilder in\nvoller Breite anzeigen lassen. Bitte beachten Sie, dass Sie in der rechten Spalte\nnur wenig Platz haben und der Konfigurator in dieser Optik eher schlank gehalten\nwerden sollte.\n\n</p><h4>Zusammenfassung</h4><p>\n\nAuf Wunsch kann eine \"Zusammenfassung\" oberhalb des Konfigurators angezeigt werden.\nDie Zusammenfassung enthält dabei eine Übersicht jedes ausgewählten Produkts nach\nStreams sortiert und gruppiert. So hat der Kunde jederzeit den schnellen Überblick\nüber die aktuelle Konfiguration.\n\n</p><h4>Varianten</h4><p>\n\nDer Konfigurator unterstützt die Auswahl von Varianten. Sie können entweder explizit\neinzelne Varianten zur Auswahl stellen oder das übergeordneten Haupt-Produkt anzeigen lassen.\nEin Klick auf das Haupt-Produkt öffnet ein modales Fenster in dem man die gewünschte Variante\nausgewählt werden kann. Sämtliche\nTexte, Preise, Bilder etc. werden entsprechend der tatsächlichen Auswahl angepasst.\n\n\n\n</p><h4>Varianten auffächern</h4><p>\n\n\n\nSie können zudem alle \"Varianten auffächern\", so dass bei der Auswahl eines\nHaupt-Produkts immer alle Varianten angezeigt werden. Die Auswahl einer Variante\nim modalen Fenster würde in diesem Fall entfallen.\n\n\n\n\n</p><h4>Versteckte Produkte</h4><p>\n\nSie können innerhalb des Konfigurators auch Produkte verwenden, die sonst nicht\nim Shop sichtbar sind. So können Sie z.B. Pseudo-Produkte anlegen, die nur im Konfigurator\ngewählt werden können. Denkbar wären Produkte wie \"inkl. Montage\" für 99,- EUR oder eine Auswahl an\nFarben mit entsprechenden Bildern. Dazu müssen Sie in der Administration dieser Produkte\ndie \"Erweiterte Sichtbarkeit konfigurieren\" und diese für die gewünschten Verkaufskanäle\nverstecken. Die Produkte sind dann zwar immer noch direkt aufrufbar (wenn der Kunde\nden Link kennt) - aber sie tauchen nicht in der Suche oder in Kategorien auf.\n\n\n\n</p><h4>Preisgestaltung</h4><p>\nDer Preis der Konfiguration wird im Shop bei der Auswahl der Produkte live berechnet\nund aktualisiert. Dabei kann auf Wunsch festgelegt werden, ob das Vater-Produkt auch\nberechnet werden soll oder kostenlos ist - und ob auf die gesamte Summe ein Rabatt\ngewährt werden soll (z.B. 10%). Somit geben Sie einen weiteren Kaufanreiz alle\nProdukte zusammen in einer Konfiguration zu verkaufen. Zudem können Sie\npro Stream wählen, ob die enthaltenen Produkte kostenlos sein sollen und ob\ndie Preise im Konfigurator überhaupt angezeigt werden sollen.\n</p><h4>Preisgestaltung - erweiterte Preise</h4><p>\n\n\n\nDas Plugin unterstützt zudem erweiterte Preise von Produkten.\nSomit können Sie z.B. abweichende Preise für Händler oder Staffelpreise\nfür die einzelnen Komponenten definieren und im Konfigurator nutzen.\nBitte beachten Sie jedoch, dass sich somit Preise innerhalb der Konfiguration\nmöglicherweise von Preisen im Warenkorb unterscheiden können - sofern\nsich der Kontext (z.B. anderes Land, andere Produkte im Warenkorb etc.)\nändert und Sie für diesen Kontext andere Preise gepflegt haben.\n\n\n\n\n\n</p><h4>Preisgestaltung - relative Preise</h4><p>\nSie können pro Stream die Anzeige von \"relativen Preise\" aktivieren. Damit ändern Sie die Anzeige\nder Preise der einzelnen Produkte, so dass nicht mehr der absolute Preis der Produkte\nangezeigt wird, sondern immer die Differenz zum aktuell ausgewählten Produkt.\nWenn Sie z.B. ein Produkt mit 100,- EUR\nausgewählt haben, dann werden alle anderen Preise des Streams relativ zu diesem ausgewählten Produkt\n(also die Differenz) angezeigt. Das heißt: ein Produkt, das 20,- EUR kostet wird als \"- 80,- EUR\" angezeigt - und\nein Produkt, das 150,- EUR kostet wird als \"+ 50,- EUR\" angezeigt.\n</p><h4>Preisgestaltung - prozentualer Aufschlag</h4><p>\n\n\nIn den Zusatzfeldern von Produkten können Sie diese auch als \"prozentualen Aufschlag\" definieren.\nWenn dieses Produkt innerhalb eines Konfigurators ausgewählt wird, dann ist der Preis\ndes Produkts ein prozentualer Anteil der gesamten Konfiguration. Wenn z.B. die aktuelle Konfiguration\n500,- EUR kostet und das Produkt als \"prozentualer Aufschlag\" mit \"10%\" definiert ist, dann\nsind die Kosten des Produkts 50,- EUR. Der Preis des Produkts ist immer ein prozentualer\nAnteil der aktuellen Konfiguration.\n\n\n</p><h4>Stückzahl</h4><p>\nSie haben freie Auswahl bei der Stückzahl der Produkte eines Streams. Sie können entweder eine\nStückzahl fest vorgeben, die nicht geändert werden kann - oder lassen den Kunden selber frei\nwählen. Je nach Plugin Konfiguration wird der Abverkauf Haken bzw. der Lagerbestand beachtet.\n</p><h4>Vorauswahl</h4><p>\nSie können definieren welche Produkte in welchem Stream vorausgewählt werden sollen. So können Sie\nmehrere Zusammenstellungen bereits im Vorfeld definieren - z.B. eine niedrigpreisige und eine\nhochpreisige Zusammenstellung. Ihre Kunden können dann davon ausgehend weiter konfigurieren.\nZudem können Sie auswählen welcher Preis im Listing angezeigt werden soll - entweder\nder günstigste Preis aller möglichen Kombinationen (z.B. \"ab 35,99\") oder der Preis\nder Vorauswahl (z.B. \"199,50\").\n</p><h4>Sets</h4><p>\n\n\nSie können pro Stream festlegen, ob die Produkte innerhalb dieses Streams als \"Set\" zusammen\ngestellt werden sollen. Ein Set entspricht einer Zusammenstellung \"Wähle x Produkte\" - also\nz.B. \"Wähle 3 Produkte dieses Streams\". Der Kunde kann also nicht beliebig viele Produkte dieses\nStreams wählen, sondern muss eine Wahl von x Produkten treffen. Sie können dabei definieren,\nwie viele von x Produkten ausgewählt werden sollen. So kann der Kunde entweder optional bis zu\nx Produkten wählen (0 bis x Stück), mindestens ein Produkt aber maximal x Stück (1 bis x Stück)\noder muss genau x Produkte wählen (x Stück).\n</p><h4>Bedingungen</h4><p>\n\n\nStreams können Abhängigkeiten zu anderen Streams und deren ausgewählten Produkten haben.\nEin Stream kann solange ausgeblendet oder deaktiviert sein bis eine definierbare Bedingung\n(z.B. Produkt A in Stream B ausgewählt) erfüllt ist. Erst sobald mindestens eine der definierten\nBedingungen erfüllt ist, wird der Stream sichtbar und aktiv.\n\n<br /><br />\n\nBeispiele für Bedingungen:\n\n<ul><li>Beliebiger Streams - enthält - mindestens ein beliebiges Produkt</li><li>Stream A - enthält - mindestens ein beliebiges Produkt</li><li>Stream B - enthält - mindestens entweder Produkt A, B oder C</li><li>Stream C - enthält nicht - eines der Produkte A, B oder C</li></ul></p><h4>Speichern und Laden</h4><p>\nIhr Kunde kann jede Konfiguration und speichern und zu einem späteren Zeitpunkt laden.\nSo kann er z.B. eine Konfiguration an Freunde oder an den Shopbetreiber senden.\nSie können zudem selber individuelle Konfigurationen für Ihre Kunden anlegen und\ndiese per Link versenden.\n</p><h4>Bestellvorgang</h4><p>\nSie können in der Plugin Konfiguration wählen, wie ein konfiguriertes Produkt im\nWarenkorb aufgeführt werden soll. So kann das konfigurierte Produkt entweder\nalleine im Warenkorb stehen oder unterhalb sind alle einzelnen Komponenten aufgeführt.\nZusätzlich können Sie bei der zweiten Variante noch auswählen, ob die Einzelpreise\nder Komponenten angezeigt werden sollen oder nicht.\nBeim Bestellabschluss wird\ndie gesamte Konfiguration in die einzelnen Elemente aufgeteilt. So haben Sie auf\nsämtlichen Listen, in sämtlichen Statistiken etc. alle Produkte einzeln betrachtet.\nDas Vater-Produkt hat dabei den Wert der gesamten Konfiguration und alle ausgewählten\nProdukt sind mit 0,- Euro hinterlegt.\n</p><h4>Definition von Konfiguratoren</h4><p>\n\n\n\n\n\nEine Konfiguration wird immer anhand eines Vater-Produkts (z.B. \"Meine PC Konfiguration\")\nund beliebig viele dazugehörigen Streams von Produkten (z.B. \"CPU\", \"Grafikakrte\", \"Zubehör\" etc)\ngebildet. Das Vater-Produkt ist dabei ein Standard Shopware Produkt, das als Hülle\nfür die Konfiguration dient und ebenfalls in der Administration zu pflegen\nist.\n\n</p><p>\n\n\n\n\nDas Plugin bringt einen eigenen Menüpunkt mit, mit dem Sie Konfigurationen zusammen\nstellen können. Neben den Stammdaten (Name, Position etc.)\ndefinieren Sie hier die Streams (die optisch und logisch getrennten Gruppen)\ndes Konfiguratos. Die eigentlichen auswählbaren Produkte der jeweiligen Streams\nbestimmen Sie über die Auswahl einer dynamischen Produktegruppe oder durch\ndie Pflege einer Liste von Produkten. So können Sie die komplette Flexibilität\nvon dynamischen Produktgruppen nutzen, um die Produkte eines Streams\nautomatisch nach bestimmten Kriterien zu filtern (z.B. alle grünen Produkte ab 100,- EUR).\n\n\n\n\n\n</p><h4>Hinweis zum Rule Builder</h4><p>\n\n\n\nWenn Sie den Rule Builder mit dem Einsatz von \"Tags\" nutzen, um z.B. verschiedene\nVersandkostendienstleister je nach Podukten im Warenkorb anzubieten, dann beachten\nSie bitte folgenden Hinweis.\n\n\n\n</p><p>\n\n\n\nWenn Sie eine Regel nutzen, die sich auf \"ALLE\" Artikel im Warenkorb bezieht (statt \"MIND. EINE\"),\ndann prüft Shopware immer nur alle Shopware Standard Produkte und ignoriert andere Typen\n(wie z.B. Konfigurator Produkte) vollständig. Bei einem Warenkorb, der NUR einen Konfigurator\nbeinhaltet, gibt die Regel \"falsch\" zurück, da der Warenkorb quasi leer ist\n(da KEINE Shopware Standard Produkte enthalten sind). Wenn der Warenkorb einen Konfigurator\nUND ein Shopware Standard Produkt enthält, dann würde die Regel \"wahr\" zurück geben, wenn\ndas Shopware Standard Produkt der Regel entspricht (der Konfigurator wird komplett ignoriert).\n\n\n</p><p>\n\nFür diesen Fall müssten Sie daher auf Abfrage nach \"Alle\" verzichten und durch\n\"Mindestens eine\" ersetzen.<br />\nVorher: \"Position mit Tag\" -> \"Alle\" -> \"Sind eine von\" -> \"...\"<br />\nNachher: \"Position mit Tag\" -> \"Mind. eine\" -> \"Ist eine von\" -> \"...\"<br />\nDieser Workflow bzw. Workaround wurde in Zusammenarbeit mit Shopware konzipiert und\nsollte mögliche Probleme beheben.\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Konfigurator\"</li><li>legen Sie einen neuen Konfigurator an und speichern Sie ihn</li><li>nach dem Neuladen des Konfigurators können Sie \"Streams\" anlegen</li><li>klicken Sie auf den Button \"Neuen Stream anlegen\"</li><li>es öffnet sich ein modales Fenster, in dem Sie den Stream definieren können</li><li>wählen Sie zwingend einen Namen und die Quelle der Produkte (dynamische Produktgruppe oder Liste)</li><li>prüfen Sie die verfügbaren Optionen, um den Stream nach Ihren Wünschen anpassen zu können</li><li>optional können Sie vorausgewählte Produkte wählen</li><li>speichern Sie den Konfigurator</li><li>legen Sie ein neues Vater-Produkt (Shopware Standard Produkt) als Kopf/Hülle der Konfiguration an</li><li>in den Zusatzfeldern im Reiter \"Konfigurator\" aktivieren Sie die Option \"Ist Konfigurator\" und wählen den soeben angelegten Konfigurator aus</li><li>rufen Sie das Vater-Produkt im Shop auf und der Konfigurator wird angezeigt</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Kontakt</h4><ul><li><strong>Anschrift</strong><br />\nHevener Straße 65<br />\n44797 Bochum\n</li><li><strong>Telefon</strong><br />\n(+49) 234 97354482\n</li><li><strong>Internet</strong><br />\ninfo@digitvision.de<br />\nhttps://www.digitvision.de\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"\n\n<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Konfigurator\"</li><li>legen Sie einen neuen Konfigurator an und speichern Sie ihn</li><li>nach dem Neuladen des Konfigurators können Sie \"Streams\" anlegen</li><li>klicken Sie auf den Button \"Neuen Stream anlegen\"</li><li>es öffnet sich ein modales Fenster, in dem Sie den Stream definieren können</li><li>wählen Sie zwingend einen Namen und die Quelle der Produkte (dynamische Produktgruppe oder Liste)</li><li>prüfen Sie die verfügbaren Optionen, um den Stream nach Ihren Wünschen anpassen zu können</li><li>optional können Sie vorausgewählte Produkte wählen</li><li>speichern Sie den Konfigurator</li><li>legen Sie ein neues Vater-Produkt (Shopware Standard Produkt) als Kopf/Hülle der Konfiguration an</li><li>in den Zusatzfeldern im Reiter \"Konfigurator\" aktivieren Sie die Option \"Ist Konfigurator\" und wählen den soeben angelegten Konfigurator aus</li><li>rufen Sie das Vater-Produkt im Shop auf und der Konfigurator wird angezeigt</li></ul>\n\n\n","shortDescription":"PLUGIN DES MONATS - Lassen Sie Ihre Kunden mit diesem Konfigurator eigene Sets und Bundles konfigurieren. Sie geben eine Vielzahl von wählbaren Kombinationen vor - und Ihr Kunde wählt","highlights":"","features":""},{"id":13736,"name":"Article configurator for selectable sets and bundles","description":"<h2>\nArticle configurator for selectable sets and bundles\n</h2><p>\n\nCreate your own configurations for sets and bundles with this plugin.\nYour customer can then configure these sets and bundles himself and create suitable\nSelect compositions.\n\n\n</p><p>\n\nYou can group individual articles and select the customer from these groups\nselect one or more articles. Each group can choose a mandatory\nArticles include. If this group has a mandatory field, then at least\nan article must be selected - otherwise the configuration cannot be\ncan be put into the shopping cart.\n\n</p><p>\n\nYou have several possibilities to decide the appearance of the group - you have\nthe choice between a simple list or a slider.\n\nFor simplification and for a better look you can use a graphical\nShow check mark when an item is selected.\n\n\n</p><h4>Position</h4><p>\n\nYou can select the configurator in the \"buy-box\" on the right side of the screen.\n(between price and shopping cart button) or below the article pictures in\nfull width display. Please note that in the right column\nhave only little space and the configurator in this look is kept rather slim\nshould be.\n\n</p><h4>Variants</h4><p>\n\nThe configurator supports the selection of variants. When opening the configurator\nthe main variant is always displayed and as soon as this is selected, the\na modal window in which you have to select the desired variant All\nTexts, prices, pictures etc. will be adjusted according to the actual choice.\n</p><h4>Prices</h4><p>\nThe price of the configuration is calculated live in the shop when selecting the items\nand updated. If desired, it can be determined whether the father article is also\nto be calculated or is free of charge - and whether a discount is granted on the total amount\nshould be granted (e.g. 10%). In this way you give a further incentive to buy all\nArticles to be sold together in one configuration. All article prices\nare of course based on the stored price scales. Depending on how often\nthe configuration is in the shopping cart or how many pieces of an article are part of the\nconfiguration, the \"from-to\" prices are used. You can also\nper group, you can choose whether the included articles should be free and whether\nthe prices should be displayed in the configurator at all.\n\n\n</p><h4>Prices - Note</h4><p>\nPlease note, however, that you cannot use \"fancy\" pricing rules (\"extended prices\") for\nselect individual components. For example, if you select prices from the current shopping cart\ndependent, then the price of the configurator can change as soon as\nthis is in the shopping cart.\n</p><h4>Relative prices</h4><p>\nYou can activate the option \"relative prices\" per group. This changes the display\nthe prices of the individual articles, so that the absolute price of the article is no longer\nis displayed, but always the difference to the currently selected article.\nIf you have not activated the option of multiple selection and have selected an article with 100,- EUR\nthen all other prices in the group will be displayed relative to this selected item.\n(i.e. the difference) is displayed. That means: an article that costs 20,- EUR is displayed as \"- 80,- EUR\" - and\nan article that costs 150,- EUR will be displayed as \"+ 50,- EUR\n\n\n</p><h4>Quantity</h4><p>\nYou are free to choose the number of articles in a group. You can either create a\nSpecify a fixed number of pieces that cannot be changed - or leave the customer free to do so\nselect. Depending on the plugin configuration, the sales hook or the stock is taken into account.\n</p><h4>Pre-selection</h4><p>\nYou can define which articles are to be preselected in which group. This way you can\ndefine several compilations in advance - e.g. a low-priced and a\nhigh-priced composition. Your customers can then use this as a basis for further configuration.\nYou can also choose which price should be displayed in the listing - either\nthe most favourable price of all possible combinations (e.g. \"from 35.99 EUR\") or the price\nthe preselection (e.g. \"199.50 EUR\").\n\n\n</p><h4>Saving and loading</h4><p>\nYour customer can save any configuration and load it at a later time.\nFor example, he can send a configuration to friends or to the shop owner.\nYou can also create individual configurations for your customers and\nsend them via link.\n</p><h4>Order process</h4><p>\nIn the plugin configuration you can choose how a configured article is to be displayed in the\nshopping cart should be listed. So the configured article can either\nstand alone in the shopping cart or below all individual components are listed.\nIn addition, you can also choose in the second variant whether the unit prices\nof the components are to be displayed or not.\nDuring order completion\nthe entire configuration is divided into the individual elements. You can access\nall lists, in all statistics etc. all articles are considered individually.\nThe parent article has the value of the entire configuration and all selected\nArticles are deposited with 0,- EUR.\n</p><h4>Creating configurators</h4><p>\nA configuration is always created using a parent article (e.g. \"My PC Configuration\").\nand any number of associated groups of articles (e.g. \"CPU\", \"Graphics cards\", \"Accessories\" etc)\neducated. The parent article is a standard shopware article that can be maintained in the administration\nThe plugin has its own menu item that allows you to create configurations.\nHere you may define e.g. that a configuration consists of \"CPU\", \"Graphics card\", \"Graphics card\", \"Graphics\nand \"accessories\". You then assign this configuration to the parent article\nin the additional fields. The actual articles, the defined groups, determine\nyou via dynamic product groups. You can therefore use the complete flexibility of\nuse these dynamic product groups (e.g. all green articles from 100,- EUR).\nFrequently used groups can appear in several configurations and can\ncan be easily adapted or are automatically extended, if new articles are\nmeet the desired criteria.\n\n\n</p><h4>Instructions</h4><ul><li>install the plugin</li><li>in the administration under \"Catalogues\" you will find the new menu item \"Configurator\"</li><li>create a new configurator (name is mandatory) and save it</li><li>after reloading the configurator you can create \"streams\"</li><li>click on the button \"Create new stream\"</li><li>a new window will open, in which you can define the stream (= \"group\") </li><li>you must select a dynamic product group (the articles in this group)</li><li>optionally you can select pre-selected products</li><li>save the configurator</li><li>create a new Vater article in the products. This forms the \"header\" of the configuration </li><li>in the additional fields in the tab \"Configurator\" please select the configurator and activate the option \"Is configurator\"</li><li>if you now call up this article in the shop, you will see the configurator</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"<h4>Instructions</h4><ul><li>install the plugin</li><li>in the administration under \"Catalogues\" you will find the new menu item \"Configurator\"</li><li>create a new configurator (name is mandatory) and save it</li><li>after reloading the configurator you can create \"streams\"</li><li>click on the button \"Create new stream\"</li><li>a new window will open, in which you can define the stream (= \"group\") </li><li>you must select a dynamic product group (the articles in this group)</li><li>optionally you can select pre-selected products</li><li>save the configurator</li><li>create a new Vater article in the products. This forms the \"header\" of the configuration </li><li>in the additional fields in the tab \"Configurator\" please select the configurator and activate the option \"Is configurator\"</li><li>if you now call up this article in the shop, you will see the configurator</li></ul>","shortDescription":"Let your customers configure their own sets and bundles with this configurator. You specify a large number of selectable combinations - and your customer configures individually","highlights":"","features":""}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160456,"bookingKey":"dvsn895115432267","bookingText":"Article configurator for selectable sets and bundles","price":449.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":160455,"bookingKey":"dvsn895115432267_M","bookingText":"Article configurator for selectable sets and bundles","price":69,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppEUVIp","preview":true,"priority":9900,"id":103187},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRyax6r","preview":false,"priority":9850,"id":103188},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppdFhDF","preview":false,"priority":9825,"id":103189},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5ncZuP","preview":false,"priority":9800,"id":103190},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpx6qSos","preview":false,"priority":9700,"id":103191},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkywyjZ","preview":false,"priority":9600,"id":103192},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7F0QNC","preview":false,"priority":9501,"id":103224},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7A1rbY","preview":false,"priority":9400,"id":103223},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMlfzm1","preview":false,"priority":9300,"id":103222},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDNsTD3","preview":false,"priority":8900,"id":103225},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjXpbaN","preview":false,"priority":8800,"id":103226},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9axz9Q","preview":false,"priority":8700,"id":103198},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7umZf3","preview":false,"priority":7900,"id":103199},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZutFK8","preview":false,"priority":7800,"id":103200},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxyrxZQ","preview":false,"priority":7700,"id":103201},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8zLiwV","preview":false,"priority":7600,"id":103202},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpi1cVvQ","preview":false,"priority":6900,"id":103203},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeZJbay","preview":false,"priority":6800,"id":103204},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVjsJFQ","preview":false,"priority":5900,"id":103205},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpva3CqI","preview":false,"priority":5800,"id":103206},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpm59qor","preview":false,"priority":4900,"id":103207},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgrLjgT","preview":false,"priority":4800,"id":103208},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpa9fUH2","preview":false,"priority":4700,"id":103209},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5smtcZ","preview":false,"priority":4600,"id":103210},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmNvWQQ","preview":false,"priority":4500,"id":103211},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphwFZlP","preview":false,"priority":4400,"id":103212},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuyYEcR","preview":false,"priority":4300,"id":103213},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVB9mIo","preview":false,"priority":4200,"id":103214},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZkn4dC","preview":false,"priority":4100,"id":103215},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbdwm4q","preview":false,"priority":4000,"id":103216},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpY614Ip","preview":false,"priority":3900,"id":103217},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplGA30z","preview":false,"priority":2900,"id":103218},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2E60si","preview":false,"priority":2800,"id":103219},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRYsjNz","preview":false,"priority":1900,"id":103220},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjM93L0","preview":false,"priority":1800,"id":103221}],"comments":[{"authorName":"Frank Wille","text":"Das Plugin ist eine sehr gute Art, den Kunden die Möglichkeit der eigenen Produktgestaltung zu bieten. Der Support reagiert sehr schnell auf Fragen.\nSchade, das das Plugin nur bedingt B2B tauglich ist, da die erweiterten Preise nicht direkt unterstützt werden.","headline":"gute und einfache Lösung","creationDate":{"date":"2022-07-17 23:05:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Julian Fleischmann","text":"Erstmal super Plugin!\nEs funktioniert wirklich gut in der Bedienung und haben wir für unseren Kunden im Einsatz.\nDer Support antwortet innerhalb von wenigen Minuten. Top!\nAllerdings haben wir noch zwei konkrete Verbesserungsvorschläge. Daher noch zwei Sterne nach Luft nach oben ;)\n\n1. Die Templates lassen sich nicht super gut ableiten. Hier würde ich mir mehr Block-Bausteine wünschen um davon besser ableiten zu können. Hier haben wir nun immer das komplette Template dupliziert.\n2. Ausschlüsse funktionieren nicht so super wie in Shopware selbst (Variantenkonfiguration)\n\nAlles in Allem aber Dinge, die sicher noch in der Zukunft kommen werden. Das Plugin funktioniert ja trotzdem super.\n\nDanke und beste Grüße\nJulian Fleischmann\nmr. pixel KG","headline":"Super Konfigurator-Plugin mit zwei kleinen Verbesserungsvorschlägen","creationDate":{"date":"2022-07-15 13:56:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Joshua Behrens [HEPTACOM]","text":"Wir setzen das Plugin in mehreren Projekten ein. In einem Szenario auch in Kombination mit dem Pseudovariantenplugin von SWK Web und einem Zenit Theme. Und es funktionierte einfach. Keine Kompatibilitätsprobleme. Für Entwickler gibt es super viele gute Einstiegspunkte und viel Konfiguration. Konstruktive Kritik und Änderungsvorschläge werden gerne Entgegengenommen. \n\nFazit: Mega","headline":"Super integrierbares Plugin","creationDate":{"date":"2022-06-10 16:19:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Marco Kadlubski","text":"","headline":"Top Plugin mit vielen Funktionen und extrem schneller und freundlicher Support","creationDate":{"date":"2022-05-25 09:26:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Lucas","text":"Wir sind sehr glücklich mit dem Konfigurator, er lässt viele Anpassungen zu und noch wichtiger er hat sich reibungslos den anderen Plugins und den Theme angepasst. So muss das sein!","headline":"Super Service und Top Konfigurator","creationDate":{"date":"2021-11-08 18:02:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Kai Becker","text":"","headline":"Sehr gutes Plugin und extrem zuverlässiger und schneller Support!","creationDate":{"date":"2021-05-25 20:21:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Martin Lummertzheim","text":"Besser kann man sich einen Support nicht vorstellen !!!","headline":"Sehr gutes Plugin und perfekter Support","creationDate":{"date":"2021-05-21 10:43:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Roland Unger","text":"Super Plugin, einfach zu bedienen, macht genau was es soll. Schön, dass die Templates gut aufgeteilt sind, so dass man diese einfach anpassen kann, falls man möchte.\n@Patrick Brandt: vielen Dank für den guten Support!","headline":"So macht Arbeiten Spaß!","creationDate":{"date":"2021-01-20 17:53:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Manuel Reindl","text":"Dies ist das beste Plugin für Set-Artikel bzw. Bundles. Funktion und Usability des Plugins sind super, auch bei Mobilview.  Nur zu empfehlen. Zum Support kann man nur sagen besser geht nicht :-) Reagiert auch am Sonntag auf Anfragen. Kleinere Bugs werden binnen Minuten gefixt. Auch Verbesserungen bzw. Wünsche werden mit auf die To-Do List genommen und je nach Relevanz zeitnah umgesetzt. Alles in Allem TOP!!!","headline":"Bestes Plugin für Sets bzw. Bundles - TOP Support","creationDate":{"date":"2020-12-20 08:30:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"media-genius UG (haftungsbeschränkt)","text":"Es wird schnell eine Lösung gefunden und einem viel Arbeit abgenommen ohne jegliches Murren :) Alles in Allem, Plugins und Service top und sehr zu empfehlen! Thumbs up!","headline":"Einfach spitze","creationDate":{"date":"2020-12-18 09:05:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Michael F Kraus","text":"Perfekte Erweiterung für unseren Shop und ein exzellenter Service dazu. Auch an Wochenenden oder gar Sonntags wurde auf meine Anfrage reagiert. Das ist in der Tat außergewöhnlich! Weiter so und vielen Dank!","headline":"Großartiger Support","creationDate":{"date":"2020-11-02 17:49:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Fabian K.","text":"Wir sind extrem zufrieden mit dem Plugin und den Funktionen. Wir haben bereits das Plugin für ShopWare5 und starten jetzt einen neuen ShopWare6 Shop. Dieser Nachfolger ist mindestens genaus so gut wie die alte Version - einfach TOP!","headline":"Super Konfigurator, besser als ShopWare5","creationDate":{"date":"2020-08-26 07:31:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Produkt Konfigurator für Sets / Bundles","description":"<h2>\n    Artikel Konfigurator für wählbare Sets und Bundles\n</h2><p>\n\nLegen Sie mit diesem Plugin eigene Konfigurationen für Sets und Bundles an.\nIhr Kunde kann sich dann diese Sets und Bundles selber konfigurieren und passende\nZusammenstellungen wählen.\nSie können einzelne Produkte gruppieren und den Kunden aus diesen Streams (\"Gruppen\")\neinen oder mehrere Produkte wählen lassen. Dabei kann jeder Stream ein oder mehrere verpflichtenden\nProdukte beinhalten.\n\n</p><h4>Streams</h4><p>\n\n\n\nAlle Produkte innerhalb des Konfigurators sind in einzelne Streams unterteilt.\nSo können Sie ihre Konfiguration inhaltlich und logisch trennen. Am Beispiel\neines Geschenkkorbs können Sie die Streams \"Wein\", \"Nudeln\" und \"Sonstiges\" anzeigen lassen.\nInnerhalb der Streams \"Wein\" und \"Nudeln\" kann der Kunde jeweils ein entsprechendes Produkt\nwählen und innerhalb des Streams \"Sonstiges\" kann der Kunde weitere Optionen, wie z.B.\n\"als Geschenk verpacken\" oder \"rote Schleife\", wählen.\n\n\n\n\n</p><h4>Streams - Auswahl und Optik</h4><p>\n\nSie können Ihre Produkte innerhalb der Streams in drei optisch unterschiedlichen Varianten\npräsentieren: als Slider, als Galerie oder als Liste. Die Ansicht als Slider\noder Galerie eignet sich insbesondere, wenn man Produktbild für die Auswahl relevant ist\nund man dieses hervorheben möchte - z.B. der Wein oder die Nudeln. Eine Liste eignet sich bei einer großen Auswahl\nvon Produkten, dessen Produktbilder für die Auswahl weniger interessant sind - z.B.\ndie sonstigen Optionen.\n\n\n\n</p><h4>Auswahl der Produkte</h4><p>\n\n\nDie zur Auswahl stehenden Produte der Streams können wahlweise über eine dynamische\nProduktgruppe oder eine Liste gepflegt werden. Eine dynamische Produktgruppe hilft\ninsbesondere, wenn Sie die Produkte über individuelle Filter definieren können -\nz.B. alle lieferbare Produkte der Kategorie \"Wein\", die über 10,- EUR kosten.\n\nGerade für eine kleinere Auswahl würde sich die Pflege der\nProdukte über eine Liste empfehlen. Hier können Sie einzelne Produkte aufnehmen\nund manuell sortieren.\n\n\n\n</p><h4>Position</h4><p>\n\nSie können den Konfiguratior wahlweise in der \"buy-box\" auf der rechten Seite\n(zwischen Preis und Warenkorb-Button) oder unterhalb der Produktbilder in\nvoller Breite anzeigen lassen. Bitte beachten Sie, dass Sie in der rechten Spalte\nnur wenig Platz haben und der Konfigurator in dieser Optik eher schlank gehalten\nwerden sollte.\n\n</p><h4>Zusammenfassung</h4><p>\n\nAuf Wunsch kann eine \"Zusammenfassung\" oberhalb des Konfigurators angezeigt werden.\nDie Zusammenfassung enthält dabei eine Übersicht jedes ausgewählten Produkts nach\nStreams sortiert und gruppiert. So hat der Kunde jederzeit den schnellen Überblick\nüber die aktuelle Konfiguration.\n\n</p><h4>Varianten</h4><p>\n\nDer Konfigurator unterstützt die Auswahl von Varianten. Sie können entweder explizit\neinzelne Varianten zur Auswahl stellen oder das übergeordneten Haupt-Produkt anzeigen lassen.\nEin Klick auf das Haupt-Produkt öffnet ein modales Fenster in dem man die gewünschte Variante\nausgewählt werden kann. Sämtliche\nTexte, Preise, Bilder etc. werden entsprechend der tatsächlichen Auswahl angepasst.\n\n\n\n</p><h4>Varianten auffächern</h4><p>\n\n\n\nSie können zudem alle \"Varianten auffächern\", so dass bei der Auswahl eines\nHaupt-Produkts immer alle Varianten angezeigt werden. Die Auswahl einer Variante\nim modalen Fenster würde in diesem Fall entfallen.\n\n\n\n\n</p><h4>Versteckte Produkte</h4><p>\n\nSie können innerhalb des Konfigurators auch Produkte verwenden, die sonst nicht\nim Shop sichtbar sind. So können Sie z.B. Pseudo-Produkte anlegen, die nur im Konfigurator\ngewählt werden können. Denkbar wären Produkte wie \"inkl. Montage\" für 99,- EUR oder eine Auswahl an\nFarben mit entsprechenden Bildern. Dazu müssen Sie in der Administration dieser Produkte\ndie \"Erweiterte Sichtbarkeit konfigurieren\" und diese für die gewünschten Verkaufskanäle\nverstecken. Die Produkte sind dann zwar immer noch direkt aufrufbar (wenn der Kunde\nden Link kennt) - aber sie tauchen nicht in der Suche oder in Kategorien auf.\n\n\n\n</p><h4>Preisgestaltung</h4><p>\nDer Preis der Konfiguration wird im Shop bei der Auswahl der Produkte live berechnet\nund aktualisiert. Dabei kann auf Wunsch festgelegt werden, ob das Vater-Produkt auch\nberechnet werden soll oder kostenlos ist - und ob auf die gesamte Summe ein Rabatt\ngewährt werden soll (z.B. 10%). Somit geben Sie einen weiteren Kaufanreiz alle\nProdukte zusammen in einer Konfiguration zu verkaufen. Zudem können Sie\npro Stream wählen, ob die enthaltenen Produkte kostenlos sein sollen und ob\ndie Preise im Konfigurator überhaupt angezeigt werden sollen.\n</p><h4>Preisgestaltung - erweiterte Preise</h4><p>\n\n\n\nDas Plugin unterstützt zudem erweiterte Preise von Produkten.\nSomit können Sie z.B. abweichende Preise für Händler oder Staffelpreise\nfür die einzelnen Komponenten definieren und im Konfigurator nutzen.\nBitte beachten Sie jedoch, dass sich somit Preise innerhalb der Konfiguration\nmöglicherweise von Preisen im Warenkorb unterscheiden können - sofern\nsich der Kontext (z.B. anderes Land, andere Produkte im Warenkorb etc.)\nändert und Sie für diesen Kontext andere Preise gepflegt haben.\n\n\n\n\n\n</p><h4>Preisgestaltung - relative Preise</h4><p>\nSie können pro Stream die Anzeige von \"relativen Preise\" aktivieren. Damit ändern Sie die Anzeige\nder Preise der einzelnen Produkte, so dass nicht mehr der absolute Preis der Produkte\nangezeigt wird, sondern immer die Differenz zum aktuell ausgewählten Produkt.\nWenn Sie z.B. ein Produkt mit 100,- EUR\nausgewählt haben, dann werden alle anderen Preise des Streams relativ zu diesem ausgewählten Produkt\n(also die Differenz) angezeigt. Das heißt: ein Produkt, das 20,- EUR kostet wird als \"- 80,- EUR\" angezeigt - und\nein Produkt, das 150,- EUR kostet wird als \"+ 50,- EUR\" angezeigt.\n</p><h4>Preisgestaltung - prozentualer Aufschlag</h4><p>\n\n\nIn den Zusatzfeldern von Produkten können Sie diese auch als \"prozentualen Aufschlag\" definieren.\nWenn dieses Produkt innerhalb eines Konfigurators ausgewählt wird, dann ist der Preis\ndes Produkts ein prozentualer Anteil der gesamten Konfiguration. Wenn z.B. die aktuelle Konfiguration\n500,- EUR kostet und das Produkt als \"prozentualer Aufschlag\" mit \"10%\" definiert ist, dann\nsind die Kosten des Produkts 50,- EUR. Der Preis des Produkts ist immer ein prozentualer\nAnteil der aktuellen Konfiguration.\n\n\n</p><h4>Stückzahl</h4><p>\nSie haben freie Auswahl bei der Stückzahl der Produkte eines Streams. Sie können entweder eine\nStückzahl fest vorgeben, die nicht geändert werden kann - oder lassen den Kunden selber frei\nwählen. Je nach Plugin Konfiguration wird der Abverkauf Haken bzw. der Lagerbestand beachtet.\n</p><h4>Vorauswahl</h4><p>\nSie können definieren welche Produkte in welchem Stream vorausgewählt werden sollen. So können Sie\nmehrere Zusammenstellungen bereits im Vorfeld definieren - z.B. eine niedrigpreisige und eine\nhochpreisige Zusammenstellung. Ihre Kunden können dann davon ausgehend weiter konfigurieren.\nZudem können Sie auswählen welcher Preis im Listing angezeigt werden soll - entweder\nder günstigste Preis aller möglichen Kombinationen (z.B. \"ab 35,99\") oder der Preis\nder Vorauswahl (z.B. \"199,50\").\n</p><h4>Sets</h4><p>\n\n\nSie können pro Stream festlegen, ob die Produkte innerhalb dieses Streams als \"Set\" zusammen\ngestellt werden sollen. Ein Set entspricht einer Zusammenstellung \"Wähle x Produkte\" - also\nz.B. \"Wähle 3 Produkte dieses Streams\". Der Kunde kann also nicht beliebig viele Produkte dieses\nStreams wählen, sondern muss eine Wahl von x Produkten treffen. Sie können dabei definieren,\nwie viele von x Produkten ausgewählt werden sollen. So kann der Kunde entweder optional bis zu\nx Produkten wählen (0 bis x Stück), mindestens ein Produkt aber maximal x Stück (1 bis x Stück)\noder muss genau x Produkte wählen (x Stück).\n</p><h4>Bedingungen</h4><p>\n\n\nStreams können Abhängigkeiten zu anderen Streams und deren ausgewählten Produkten haben.\nEin Stream kann solange ausgeblendet oder deaktiviert sein bis eine definierbare Bedingung\n(z.B. Produkt A in Stream B ausgewählt) erfüllt ist. Erst sobald mindestens eine der definierten\nBedingungen erfüllt ist, wird der Stream sichtbar und aktiv.\n\n<br /><br />\n\nBeispiele für Bedingungen:\n\n</p><ul><li>Beliebiger Streams - enthält - mindestens ein beliebiges Produkt</li><li>Stream A - enthält - mindestens ein beliebiges Produkt</li><li>Stream B - enthält - mindestens entweder Produkt A, B oder C</li><li>Stream C - enthält nicht - eines der Produkte A, B oder C</li></ul><h4>Speichern und Laden</h4><p>\nIhr Kunde kann jede Konfiguration und speichern und zu einem späteren Zeitpunkt laden.\nSo kann er z.B. eine Konfiguration an Freunde oder an den Shopbetreiber senden.\nSie können zudem selber individuelle Konfigurationen für Ihre Kunden anlegen und\ndiese per Link versenden.\n</p><h4>Bestellvorgang</h4><p>\nSie können in der Plugin Konfiguration wählen, wie ein konfiguriertes Produkt im\nWarenkorb aufgeführt werden soll. So kann das konfigurierte Produkt entweder\nalleine im Warenkorb stehen oder unterhalb sind alle einzelnen Komponenten aufgeführt.\nZusätzlich können Sie bei der zweiten Variante noch auswählen, ob die Einzelpreise\nder Komponenten angezeigt werden sollen oder nicht.\nBeim Bestellabschluss wird\ndie gesamte Konfiguration in die einzelnen Elemente aufgeteilt. So haben Sie auf\nsämtlichen Listen, in sämtlichen Statistiken etc. alle Produkte einzeln betrachtet.\nDas Vater-Produkt hat dabei den Wert der gesamten Konfiguration und alle ausgewählten\nProdukt sind mit 0,- Euro hinterlegt.\n</p><h4>Definition von Konfiguratoren</h4><p>\n\n\n\n\n\nEine Konfiguration wird immer anhand eines Vater-Produkts (z.B. \"Meine PC Konfiguration\")\nund beliebig viele dazugehörigen Streams von Produkten (z.B. \"CPU\", \"Grafikakrte\", \"Zubehör\" etc)\ngebildet. Das Vater-Produkt ist dabei ein Standard Shopware Produkt, das als Hülle\nfür die Konfiguration dient und ebenfalls in der Administration zu pflegen\nist.\n\n</p><p>\n\n\n\n\nDas Plugin bringt einen eigenen Menüpunkt mit, mit dem Sie Konfigurationen zusammen\nstellen können. Neben den Stammdaten (Name, Position etc.)\ndefinieren Sie hier die Streams (die optisch und logisch getrennten Gruppen)\ndes Konfiguratos. Die eigentlichen auswählbaren Produkte der jeweiligen Streams\nbestimmen Sie über die Auswahl einer dynamischen Produktegruppe oder durch\ndie Pflege einer Liste von Produkten. So können Sie die komplette Flexibilität\nvon dynamischen Produktgruppen nutzen, um die Produkte eines Streams\nautomatisch nach bestimmten Kriterien zu filtern (z.B. alle grünen Produkte ab 100,- EUR).\n\n\n\n\n\n</p><h4>Hinweis zum Rule Builder</h4><p>\n\n\n\nWenn Sie den Rule Builder mit dem Einsatz von \"Tags\" nutzen, um z.B. verschiedene\nVersandkostendienstleister je nach Podukten im Warenkorb anzubieten, dann beachten\nSie bitte folgenden Hinweis.\n\n\n\n</p><p>\n\n\n\nWenn Sie eine Regel nutzen, die sich auf \"ALLE\" Artikel im Warenkorb bezieht (statt \"MIND. EINE\"),\ndann prüft Shopware immer nur alle Shopware Standard Produkte und ignoriert andere Typen\n(wie z.B. Konfigurator Produkte) vollständig. Bei einem Warenkorb, der NUR einen Konfigurator\nbeinhaltet, gibt die Regel \"falsch\" zurück, da der Warenkorb quasi leer ist\n(da KEINE Shopware Standard Produkte enthalten sind). Wenn der Warenkorb einen Konfigurator\nUND ein Shopware Standard Produkt enthält, dann würde die Regel \"wahr\" zurück geben, wenn\ndas Shopware Standard Produkt der Regel entspricht (der Konfigurator wird komplett ignoriert).\n\n\n</p><p>\n\nFür diesen Fall müssten Sie daher auf Abfrage nach \"Alle\" verzichten und durch\n\"Mindestens eine\" ersetzen.<br />\nVorher: \"Position mit Tag\" -&gt; \"Alle\" -&gt; \"Sind eine von\" -&gt; \"...\"<br />\nNachher: \"Position mit Tag\" -&gt; \"Mind. eine\" -&gt; \"Ist eine von\" -&gt; \"...\"<br />\nDieser Workflow bzw. Workaround wurde in Zusammenarbeit mit Shopware konzipiert und\nsollte mögliche Probleme beheben.\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Konfigurator\"</li><li>legen Sie einen neuen Konfigurator an und speichern Sie ihn</li><li>nach dem Neuladen des Konfigurators können Sie \"Streams\" anlegen</li><li>klicken Sie auf den Button \"Neuen Stream anlegen\"</li><li>es öffnet sich ein modales Fenster, in dem Sie den Stream definieren können</li><li>wählen Sie zwingend einen Namen und die Quelle der Produkte (dynamische Produktgruppe oder Liste)</li><li>prüfen Sie die verfügbaren Optionen, um den Stream nach Ihren Wünschen anpassen zu können</li><li>optional können Sie vorausgewählte Produkte wählen</li><li>speichern Sie den Konfigurator</li><li>legen Sie ein neues Vater-Produkt (Shopware Standard Produkt) als Kopf/Hülle der Konfiguration an</li><li>in den Zusatzfeldern im Reiter \"Konfigurator\" aktivieren Sie die Option \"Ist Konfigurator\" und wählen den soeben angelegten Konfigurator aus</li><li>rufen Sie das Vater-Produkt im Shop auf und der Konfigurator wird angezeigt</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Kontakt</h4><ul><li><strong>Anschrift</strong><br />\nHevener Straße 65<br />\n44797 Bochum\n</li><li><strong>Telefon</strong><br />\n(+49) 234 97354482\n</li><li><strong>Internet</strong><br />\ninfo@digitvision.de<br />\nhttps://www.digitvision.de\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>in der Administration unter \"Kataloge\" finden Sie den neuen Menüpunkt \"Konfigurator\"</li><li>legen Sie einen neuen Konfigurator an und speichern Sie ihn</li><li>nach dem Neuladen des Konfigurators können Sie \"Streams\" anlegen</li><li>klicken Sie auf den Button \"Neuen Stream anlegen\"</li><li>es öffnet sich ein modales Fenster, in dem Sie den Stream definieren können</li><li>wählen Sie zwingend einen Namen und die Quelle der Produkte (dynamische Produktgruppe oder Liste)</li><li>prüfen Sie die verfügbaren Optionen, um den Stream nach Ihren Wünschen anpassen zu können</li><li>optional können Sie vorausgewählte Produkte wählen</li><li>speichern Sie den Konfigurator</li><li>legen Sie ein neues Vater-Produkt (Shopware Standard Produkt) als Kopf/Hülle der Konfiguration an</li><li>in den Zusatzfeldern im Reiter \"Konfigurator\" aktivieren Sie die Option \"Ist Konfigurator\" und wählen den soeben angelegten Konfigurator aus</li><li>rufen Sie das Vater-Produkt im Shop auf und der Konfigurator wird angezeigt</li></ul>","version":"4.0.6","changelog":[{"version":"4.0.6","text":"- fixed memory leak<br />\n- changed maximum of fanned out variants to 30<br />\n- changed maximum of available variants within variant selection modal to 300","creationDate":{"date":"2023-07-22 19:41:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.5","text":"- fixed faulty custom field translations","creationDate":{"date":"2023-06-28 19:56:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.4","text":"- fixed faulty doubled template block for compatibility","creationDate":{"date":"2023-06-26 12:40:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.3","text":"- fixed faulty template blocks for custom layouts","creationDate":{"date":"2023-06-23 16:34:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"- fixed missing english translations","creationDate":{"date":"2023-06-19 14:06:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"- added shopware 6.5 compatibility<br />\n- fixed custom product prices for preselected variants\n\n<br />\n\n- fixed cheapest price within listing for streams with a defined product quantity (instead of quantity selection)","creationDate":{"date":"2023-04-27 15:37:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.2","text":"- fixed memory leak<br />\n- changed maximum of fanned out variants to 30","creationDate":{"date":"2023-07-21 18:26:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.1","text":"- fixed compatibility with lower shopware versions","creationDate":{"date":"2023-06-15 21:46:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"- moved editing streams within administration out of a modal window and into first layer<br />\n- added custom prices for selected products within a stream<br />\n- replaced every faulty occurrence of dvsnConfigurator with dvsnSetConfigurator (payload keys, variable names etc)","creationDate":{"date":"2023-04-26 14:16:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.2","text":"- fixed invalidation for on-sale-products with pre-selected quantity<br />\n- fixed stock indicator for products with different stock and available stock information<br />\n- fixed hidden stock indicator for list template with relative prices<br />\n- fixed cheapest price within listing for configurators with sets<br />\n- refactored selection service and split it into multiple services","creationDate":{"date":"2023-03-15 20:33:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.1","text":"- fixed faulty advanced prices for parent product","creationDate":{"date":"2023-03-07 13:47:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"- added app configuration to treat parent products without configuration as default shopware products<br />\n- added app configuration to show buy-button within listing for configurators without mandatory fields","creationDate":{"date":"2023-02-17 13:34:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.5","text":"- added product states (physical, download) to configurator products and their children","creationDate":{"date":"2023-02-15 18:53:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.4","text":"- fixed from price for variants with configurators within product listing","creationDate":{"date":"2023-02-13 14:03:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.3","text":"- fixed display prices for variants<br />\n- fixed default from-price for variant products without selection<br />\n- added variant prices within variant selection modal","creationDate":{"date":"2023-02-11 11:14:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.2","text":"- fixed creating streams within administration","creationDate":{"date":"2023-01-09 15:01:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.1","text":"- removed incompatible amazon pay button from product detail page for products with configurator","creationDate":{"date":"2023-01-09 12:11:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"- added stream option to disable default product name for variants and show only the variant properties<br />\n- added stream option to set products without charge but show their prices anyway<br />\n- added app configuration to remove quantity selection from sticky buy-form<br />\n- replaced plain text stream description with html capable wysiwyg editor<br />\n- replaced every occurence of \"article\" with \"product\" within app configuration","creationDate":{"date":"2023-01-04 11:47:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.2","text":"- updated plugin name<br />\n- fixed product cache invalidation when updating an assigned configurator","creationDate":{"date":"2022-12-08 14:54:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.1","text":"- fixed disabled product selection for fixed and pre-selected sets/bundles","creationDate":{"date":"2022-11-27 15:18:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"- added configurator option to disable parent product tabs on product detail page<br />\n- added configurator option to show product images and prices in summary<br />\n- added stream display option to use a compact mode and minimize margins in gallery template<br />\n- added stream display option to show the cover image in list template<br />\n- added different description flags for number input fields within administration<br />\n- beautified product selection elements and switch fields within administration<br />\n- split configurator details into general and options card within administration<br />\n- moved stream display options into separate tab within administration<br />\n- fixed responsive stream headers<br />\n- fixed responsive stream with list template<br />\n- removed whitespace and beautified stream with list template in buybox","creationDate":{"date":"2022-11-27 10:52:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.1","text":"- fixed hidden product sliders<br />\n- fixed duplicating configurators","creationDate":{"date":"2022-11-14 15:25:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"- added stream option to disable product selection to enable fixed and pre-selected sets/bundles","creationDate":{"date":"2022-11-12 10:38:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"- added dependencies and conditions for streams<br />\n- dropped inactive-products flag from streams","creationDate":{"date":"2022-10-24 15:28:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"- split stream tabs into seperate components within the administration<br />\n- changed info messages to default shopware alerts within the administration<br />\n- increased the maximum width of the steam modal within the administration<br />\n- fixed faulty product names and variant information within the administration<br />\n\n\n\n- fixed scheduled task","creationDate":{"date":"2022-10-21 13:22:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.17","text":"- fixed overlapping stream name and mandatory/set notice<br />\n- added app configuration to disable save-configuration button","creationDate":{"date":"2022-09-05 09:20:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.16","text":"- fixed invalid js selectors for empty-choice","creationDate":{"date":"2022-08-11 12:39:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.15","text":"- fixed quantity for delivery information of configurator products","creationDate":{"date":"2022-08-09 08:54:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.14","text":"- added custom css class to save-selection button for custom product layouts","creationDate":{"date":"2022-08-05 10:13:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.13","text":"- added custom css class to save-selection button","creationDate":{"date":"2022-07-30 08:24:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.12","text":"- added caching to list price calculator","creationDate":{"date":"2022-07-28 10:28:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.11","text":"- fixed shopware 6.4.13 compatibility","creationDate":{"date":"2022-07-16 11:37:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.10","text":"- fixed pre-selecting multiple variants","creationDate":{"date":"2022-07-12 08:49:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.9","text":"- removed jquery<br />\n- dropped unavailable products from streams<br />\n- dropped unavailable variants from variant selection modal","creationDate":{"date":"2022-07-11 15:04:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.8","text":"- renamed custom blocks to avoid multiple block names","creationDate":{"date":"2022-07-03 15:53:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.7","text":"- added custom blocks to every template","creationDate":{"date":"2022-07-01 15:43:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.6","text":"- added default product tags to configurator children","creationDate":{"date":"2022-06-30 14:19:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"- fixed faulty configurator price when editing an order within the administration<br />\n- fixed faulty configurator price when an order is created and when the app configuration \"components without price\" is disabled","creationDate":{"date":"2022-06-26 18:57:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"- fixed width, height and length of configurator product (with selected components) for rule builder conditions","creationDate":{"date":"2022-06-11 13:42:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"- removed validation for stream quantity","creationDate":{"date":"2022-06-09 16:23:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"- fixed modal popup for product information for shopware 6.4.11 and higher","creationDate":{"date":"2022-05-30 17:07:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"- fixed modal popup for product information for shopware 6.4.10 and lower","creationDate":{"date":"2022-05-30 17:05:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"- added support for context prices","creationDate":{"date":"2022-05-29 17:17:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.16","text":"- fixed invalid division by zero for some edge cases","creationDate":{"date":"2022-05-24 11:54:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.15","text":"- fixed removing invalid configurators (invalid parent or children) from cart","creationDate":{"date":"2022-05-13 15:44:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.14","text":"- fixed missing translations<br />\n- fixed strict types for listing price calculator","creationDate":{"date":"2022-05-11 14:14:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.13","text":"- fixed shopware 6.4.11 compatibility","creationDate":{"date":"2022-05-04 21:52:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.12","text":"- fixed delivery date for configurator products within the cart","creationDate":{"date":"2022-04-26 11:07:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.11","text":"- fixed price container in listing","creationDate":{"date":"2022-04-14 19:49:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.10","text":"- fixed missing snippets","creationDate":{"date":"2022-03-17 18:25:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"- beautified product selection for configurator streams\n<br />\n\n- fixed duplicating configurators","creationDate":{"date":"2022-03-01 09:47:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"- fixed product image and children product quantity on checkout finish page","creationDate":{"date":"2022-02-10 12:25:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"- added compatibility to acris plugin \"quantity input with +/-\"","creationDate":{"date":"2022-02-09 09:44:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"- fixed percental surcharges for multiple quantities\n\n<br />\n- added children product quantity to sidebar and offcanvas cart","creationDate":{"date":"2022-02-05 09:25:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"- added additional payload data to configurator cart line items","creationDate":{"date":"2022-01-28 14:45:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"- fixed uninstallation of db tables\n\n<br />\n- fixed doubled configurator parent within checkout sidebar","creationDate":{"date":"2022-01-25 16:50:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"- added selectable product list for configurator streams instead of selecting a single product-stream<br />\n- added support for min purchase, max purchase and purchase steps for components<br />\n- removed app configuration \"ignore variants within dynamic product groups\"<br />\n- redesigned configurator stream administration<br /><br />\nWICHTIGER HINWEIS - bitte bei einem Update beachten!<br /><br />\n- die Plugin Konfiguration \"Varianten innerhalb von dynamischen Produktgruppen ignorieren\" wurde entfernt. Wenn Ihre dynamischen Produktgruppen einzelne Varianten enthalten und Sie die gelöschte Plugin Konfiguration aktiviert haben, dann kann die Auswahl der Produkte nach dem Update abweichen. Bitte prüfen Sie Ihre dynamischen Produktgruppen und Ihre Einstellungen","creationDate":{"date":"2022-01-24 11:03:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.12.1","text":"- added app configuration to enable default product custom fields within a configurator line item<br />\n- changed priority of cart converter event listener","creationDate":{"date":"2022-01-22 17:36:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.12.0","text":"- added app configuration to automatically inherit a configurator which is defined in the main-product to all its variants<br />\n- added app configuration to show unit prices instead of sum prices with the selected quantity<br />\n- added app configuration to disable quantity select element when the product itself is not selected<br />\n- added app configuration to enable product information modal window when clicking on the product name even when in fully selectable mode<br />\n- added app configuration to remove \"to product\" link for hidden products within the product information modal window<br />\n- fixed copying streams with translations","creationDate":{"date":"2022-01-04 10:34:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.7","text":"- fixed max-purchase of configurators<br />\n- added plugin configuration to check limited stock for products within configurations in the cart to automatically reduce the quantity of configurator or drop them","creationDate":{"date":"2021-12-23 11:42:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.6","text":"- fixed weight of configurators","creationDate":{"date":"2021-12-08 20:47:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.5","text":"- changed custom field type of configurator selection from json to string","creationDate":{"date":"2021-10-23 10:11:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.4","text":"- added product custom field to output optional description on top of the configruator","creationDate":{"date":"2021-10-21 10:19:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.3","text":"- fixed check for invalid custom fields","creationDate":{"date":"2021-10-12 10:41:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.2","text":"- fixed invalid variants in variant selection","creationDate":{"date":"2021-10-07 14:40:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.1","text":"- added product sorting by product number<br />\n- added app configuration to enable specific variants within dynamic product groups<br />\n- added live preview of currently selected variant image when changing a variant in the selection modal popup","creationDate":{"date":"2021-10-04 19:26:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.2","text":"- added variant options for configurator children to the product-name within the cart","creationDate":{"date":"2021-08-24 16:45:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.1","text":"- added custom store-api endpoints","creationDate":{"date":"2021-08-09 07:22:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.0","text":"- added support for shopware 6.4.2<br />\n- added plugin configuration to dissolve the father-child relationship when saving an order","creationDate":{"date":"2021-07-12 10:02:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.7","text":"- fixed missing unit price\n\n<br />\n\n- added support for custom product layouts","creationDate":{"date":"2021-07-06 18:34:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.5","text":"- changed line item types of configurator parent and children to default product while saving an order<br />- added plugin configuration to disable changing of line item types while saving an order","creationDate":{"date":"2021-06-03 12:09:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.4","text":"- fixed configurator prices for search suggest","creationDate":{"date":"2021-06-02 13:26:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.3","text":"- improved performance on product detail page","creationDate":{"date":"2021-06-02 09:52:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.2","text":"- fixed duplicating configurators\n\n<br />\n- fixed multiple currencies","creationDate":{"date":"2021-05-27 18:22:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.0","text":"- added shopware 6.4 compatibility","creationDate":{"date":"2021-05-12 18:20:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.2","text":"- fixed stream-service","creationDate":{"date":"2021-05-25 17:48:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.1","text":"- added stream option to fan out variants\n<br />\n\n- added product and variant blacklist filter for streams\n<br />\n- added plugin configuration to replace products with its variant if the product only has one variant\n<br />\n- restructured stream tabs in administration","creationDate":{"date":"2021-05-12 14:41:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"- added option to duplicate configurators<br />\n- added sorting by price for streams","creationDate":{"date":"2021-03-19 09:22:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.3","text":"- fixed compatibility with third party plugins","creationDate":{"date":"2021-02-09 17:26:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"- fixed php warnings for lower php versions","creationDate":{"date":"2021-02-09 17:16:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"- added sorting by position for order line items in administration view (fixed shopware bug)<br />\n- fixed third party plugin compatibility","creationDate":{"date":"2021-02-02 07:53:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"- refactored modal stream details and split it into multiple tabs","creationDate":{"date":"2020-12-20 11:37:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"- fixed percental surcharge for gallery and slider template","creationDate":{"date":"2020-12-20 07:57:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"- added percental surcharge for components<br />\n- added plugin configuration to remove \"no choice\" (deselect product) for mandatory streams<br />\n- fixed stock indicator when changing component variant<br />\n- fixed loading configurations from cart<br />\n- fixed hiding prices in list template when \"show prices\" is inactive","creationDate":{"date":"2020-12-10 18:30:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"- fixed variant prices for configurator parent","creationDate":{"date":"2020-11-17 13:29:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"- added from-price to variant products<br />\n- fixed saving configurator selections","creationDate":{"date":"2020-11-17 10:23:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"- added plugin configuration to drop doubled configurator parent for an order\n- fixed the order of line items for an order","creationDate":{"date":"2020-11-16 21:02:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"- fixed changing quantity of a configuration within the cart","creationDate":{"date":"2020-11-04 10:55:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"- added collapsible streams option to configurator<br />\n- added gallery template to streams<br />\n- added available stock icon<br />\n- added plugin configuration to hide stock icon<br />\n- fixed quantity info for slider template<br />\n- fixed quantity css for slider template","creationDate":{"date":"2020-10-26 14:33:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.6","text":"- fixed processing invalid product weight","creationDate":{"date":"2020-10-06 10:14:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.5","text":"- added a third position option to show the configurator on top of the buybox button","creationDate":{"date":"2020-10-06 08:43:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.4","text":"- fixed compatibility to custom products","creationDate":{"date":"2020-10-05 16:30:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"- fixed quantity information for nullable values","creationDate":{"date":"2020-09-21 14:31:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"- fixed configuration option to show/hide summary<br />\n- fixed set quantity after selecting a variant<br />\n- fixed min and max purchase<br />\n- fixed configurator weight<br />\n- fixed html in product info modal<br />\n- added max width and height for the product image in modal popups","creationDate":{"date":"2020-09-19 10:06:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"- removed streams when creating a new configurator","creationDate":{"date":"2020-08-28 15:02:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"- fixed compatibility with shopware b2b suite<br />- added support for sets to select between x and y articles per product stream","creationDate":{"date":"2020-08-20 09:32:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- fixed shopware 6.3 compatibility<br />\n- dropped shopware 6.2 compatibility","creationDate":{"date":"2020-08-07 19:01:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- added shopware 6.3 compatibility","creationDate":{"date":"2020-08-06 10:36:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"- removed add-to-cart button from listing for configurator products<br />\n- fixed unit-price for configurator products<br />\n- fixed cart collector and processor priority<br />\n- fixed percental promotion discount for configurator products","creationDate":{"date":"2020-08-05 08:40:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- added plugin configuration to show the no-selection choice before or after every other product<br />\n- fixed product image after loading a variant with a different cover","creationDate":{"date":"2020-07-15 15:52:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- fixed validators<br />\n- fixed scheduled task<br />\n- fixed usage of config service for specific sales channels","creationDate":{"date":"2020-07-04 14:49:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2020-07-01 10:00:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn895115432267","redirectToStore":false,"lowestPriceValue":69}