{"id":8665,"name":"DreiscSeoPro","code":"Dreis43878114545","lastChange":{"date":"2023-07-18 11:16:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIoZHsR","examplePageUrl":"","moduleKey":"DreiscSeoPro","creationDate":{"date":"2019-05-09 10:02:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-03-30 08:53:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-03-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-08-14 16:51:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":159,"prefix":"Dreisc","name":"Dreischild GmbH","website":"//de.dreischild.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod159_dreischild.png"},"infos":[{"id":13497,"name":"SEO Professional","description":"<p>Das Plugin \"SEO Professional\" vereint eine große Anzahl an SEO Einstellungen / Optimierung in nur einem Plugin. Hierbei setzt das Plugin da an, wo Shopware aufhört und unterstützt Sie dabei Ihr Ranging bei den Suchmaschinen zu optimieren.&nbsp;&nbsp;</p><h2>Hilfe / Dokumentation</h2><p>Eine ausführliche Dokumentation zu dem Plugin findest du unter:<br><a href=\"https://de.dreischild.com/docs/seo-professional\">https://de.dreischild.com/docs/seo-professional</a></p><h2>Meta Tags</h2><p>Die bereits im Shopware Standard vorhandenen Meta Felder werden durch SEO Professional erweitert und aufbereitet. So wird bei dem Meta Titel die bereits erreichte Pixellänge und bei der Meta Beschreibung sowie den Keywords die Zeichenlänge dargestellt. Zur visuellen Hilfe für die optimale Länge der Felder werden des Weiteren farbige Balken unterhalb der Meta Angaben eingebunden.</p><p>Neben den Shopware Standard Meta-Tags kann auch der Robots-Tag der jeweiligen Kategorie bzw. des jeweiligen Produkts frei definiert werden. Bei allen SEO Einstellungen, die über die Bulk Generatoren erstellt werden können, wird die Information, ob für die jeweilige Einstellung ein Bulk Template definiert ist, direkt unterhalb des Feldes angezeigt.</p><h2>SERP Vorschau</h2><p>Die SERP Vorschau ermöglicht es dir, bereits bei der Erstellung der Meta Angaben, möglichst genau zu erfahren, wie das resultierende Google Suchergebnis anschließend aussehen wird.</p><h2>Canonical Links</h2><p>Standardmäßig wird als Canonical Link&nbsp; der SEO Pfad ausgegeben. In manchen Fällen ist es jedoch erforderlich, einen abweichenden Canonical Link zu definieren. Über SEO Professional kann der Canonical Link daher auf ein anderes Produkt, Kategorie bzw. eine externe URL umgestellt werden.</p><h2>Social Media</h2><p>Du möchtest Einfluss auf die Darstellung geteilter Produkte und Seiten auf Facebook und Twitter nehmen? Über SEO Professional kannst du den Titel, die Beschreibung sowie das anzuzeigende Bild für beide Social Media Plattformen konfigurieren.</p><h2>Produkt- und Kategorie Bulk Generator</h2><p>Über die Bulk Generatoren für Produkte und Kategorien bist du in der Lage den Meta Titel, die Meta Beschreibung, die URL, den Robots-Tag sowie jeweils den Titel und die Beschreibungen für Facebook und Twitter per Template automatisch zu generieren. Die Templates zum generieren der SEO Einstellungen können hierbei pro Kategorie definiert werden.</p><p>Neben bereits vorbereiteten Beispiel-Templates, können eigene individuelle Templates über die Einstellungen des jeweiligen Moduls erstellt werden. Über die Template Vorschau Funktion können diese während der Erstellung direkt getestet werden, um die Funktionsfähigkeit sicherzustellen.</p><p>Die Generierung der o.g. SEO Einstellungen anhand der hinterlegten Templates erfolgt hierbei automatisch bei der Erstellung neuer bzw. der Aktualisierung bestehender Produkte und Kategorien. Alternativ können die Bulk Generatoren über die Administration bzw. per Shopware CLI gestartet werden, sodass Sie für alle Elemente generiert werden.</p><h2>Rich Snippets (JSON-LD)</h2><p>Im Shopware Standard werden die Rich Snippets durch sogenannte Mikrodaten im Quellcode übertragen. Über SEO Professional hast du die Möglichkeit diese Mikrodaten aus dem Quellcode zu entfernen und durch die von Google empfohlenen JSON-LD Rich Snippets zu ersetzen.</p><p>Hierbei werden neben den Standardfeldern aus dem Shopware Standard auch noch weitere Rich Snippets Felder übertragen, die über dieses Modul entsprechend konfiguriert werden können. Für diese Felder ist es nun möglich in der Administration entsprechende Standardwerte bzw. -verhalten zu konfigurieren.</p><p>Für individuelle Einstellungen pro Produkt, ist es möglich in den Details der Produkte abweichende Rich Snippet Werte zu definieren. So kann bspw. für ein Produkt ein individueller Produktzustand oder aber ein spezieller SKU Wert definiert werden.</p><h2>301 und 302 URL Weiterleitungen</h2><p>Über die 301 und 302 URL Weiterleitungen können über die Administration URL Weiterleitungen eingerichtet werden. Hierbei kann&nbsp; eine Url an eine andere URL, einen Artikel oder eine Kategorie weitergeleitet werden.</p><p>Auch können bspw. Artikel an andere Artikel weitergeleitet werden, um so einen Nachfolge-Artikel zu hinterlegen.</p><p>Über den HTTP Status Code kann definiert werden, ob es sich um eine dauerhafte (301) oder temporäre (302) Weiterleitung handelt.</p><p>In den Details der Produkte und Kategorien kann darüber hinaus direkt eingesehen werden, ob eine Weiterleitung für das jeweilige Produkt bzw. Kategorie hinterlegt wurde. Ist noch keine Weiterleitung hinterlegt, so kann von dieser Stelle aus entsprechend eine neue Weiterleitung hinterlegt werden.</p><p>Die Weiterleitungen können per CSV Datei importiert sowie exportiert werden.</p><h2>Aktueller Pluginstand und Weiterentwicklungen</h2><p>Zum aktuellen Zeitpunkt stehen noch nicht alle Funktionen bereit die unter Shopware 5 bei SEO Professional möglich waren. Diese und noch weitere Funktionen werden im Laufe der kommenden Wochen / Monate nach und nach erweitert. Angedacht sind hierbei aktuell monatliche Updates.</p><p>Eine ausführliche Übersicht der Anpassungen der einzelnen Versionen findest du unter:&nbsp;<br><a href=\"https://de.dreischild.com/docs/seo-professional/changelog\">https://de.dreischild.com/docs/seo-professional/changelog</a></p><p><i>Haftungsausschluss:</i>&nbsp;<br>Wir entwickeln, testen und supporten unsere Plugins immer gegen den Shopware Standard. D.h., dass die Kompatibilität zu anderen Shopware Plugins, die im gleichen System genutzt werden sollen, durch den Shopbetreiber selbst oder aber durch seine Agentur getestet/sichergestellt werden muss.<br></p>","installationManual":"","shortDescription":"Effektive Suchmaschinenoptimierung für Shopware 6 mit SEO Professional durch viele SEO Funktionen die den Shopware Standard entsprechend erweitern. Jetzt testen!","highlights":"SERP Vorschau\nProdukt Bulk Generator\nKategorie Bulk Generator\n301 und 302 URL Weiterleitungen\nJSON-LD Rich Snippets","features":""},{"id":17676,"name":"SEO Professional","description":"<p>The \"SEO Professional\" plugin combines a large number of SEO settings / optimization in just one plugin. The plugin starts where shopware ends and supports you in optimizing your search engine rankings.</p><h2>Help / documentation</h2><p>You can find detailed documentation on the plugin at:<br><a href=\"https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional\" target=\"_blank\" rel=\"noreferrer noopener\">https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional</a><br></p><h2>Meta Tags</h2><p>The meta fields already in the Shopware standard are expanded and edited by SEO Professional. For example, the meta title shows the pixel length already achieved and the meta description and keywords show the character length. Colored bars are also included below the meta information to provide visual help for the optimal length of the fields.</p><p>In addition to the Shopware standard meta tags, the robots tag of the respective category or product can also be freely defined. For all SEO settings that can be created using the bulk generators, the information as to whether a bulk template is defined for the respective setting is displayed directly below the field.</p><h2>SERP Preview</h2><p>The SERP preview enables you to find out as exactly as possible what the resulting Google search results will look like when creating the meta information.</p><h2>Product and category bulk generator</h2><p>With the bulk generators for products and categories you are able to automatically generate the meta title, the meta description, the URL and the robots tag using a template. The templates for generating the SEO settings can be defined for each category.</p><p>In addition to already prepared sample templates, you can create your own individual templates using the settings of the respective module. Using the template preview function, these can be tested directly during creation to ensure functionality.</p><p>The generation of the above SEO settings based on the stored templates are made automatically when creating new or updating existing products and categories. Alternatively, the bulk generators can be started via the administration or via Shopware CLI so that they are generated for all elements.</p><h2>301 and 302 URL redirects</h2><p>Via the 301 and 302 URL redirects, URL redirects can be set up via the administration. Here, a url can be forwarded to another URL, an article or a category.</p><p>Articles can also be forwarded to other articles, for example to store a successor article.</p><p>The HTTP status code can be used to define whether it is a permanent (301) or temporary (302) forwarding.</p><p>In the details of the products and categories, you can also see directly whether a forwarding has been stored for the respective product or category. If no forwarding has been stored, a new forwarding can be created from this point.</p><h2>Current plugin status and further developments</h2><p>At the moment, not all functions are available that were possible under Shopware 5 at SEO Professional. These and other functions will be gradually expanded over the coming weeks / months. Monthly updates are currently being considered.</p><p>You can find a detailed overview of the adjustments to the individual versions at:</p><p><a href=\"https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fchangelog\" target=\"_blank\" rel=\"noreferrer noopener\">https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fchangelog</a><br></p><p>Disclaimer:</p><p>We always develop, test and support our plugins against the Shopware standard. This means that compatibility with other Shopware plugins that are to be used in the same system must be tested/ensured by the shop operator himself or by his agency.</p>","installationManual":"","shortDescription":"Effective search engine optimization for Shopware 6 with SEO Professional through many SEO functions that expand the Shopware standard accordingly. Test now!","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":170229,"bookingKey":"Dreis43878114545","bookingText":"SEO Professional","price":249,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":170228,"bookingKey":"Dreis43878114545_M","bookingText":"SEO Professional","price":30,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcrHsNn","preview":true,"priority":500,"id":43634},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKw53oL","preview":false,"priority":490,"id":41047},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCCZGru","preview":false,"priority":485,"id":44358},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEoJW0Z","preview":false,"priority":480,"id":45844},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCkORNA","preview":false,"priority":470,"id":45848},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpm32Rs9","preview":false,"priority":460,"id":45849},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQsoS7n","preview":false,"priority":400,"id":41520},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpk2DKPk","preview":false,"priority":375,"id":41521},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz6MpgL","preview":false,"priority":350,"id":41048},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEX10nL","preview":false,"priority":330,"id":41046},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php80rW7K","preview":false,"priority":329,"id":41045},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJE8nuM","preview":false,"priority":325,"id":41050},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEim2wp","preview":false,"priority":320,"id":45853},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSSr3G8","preview":false,"priority":300,"id":43443},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqrWV2K","preview":false,"priority":299,"id":43444},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2l0HIg","preview":false,"priority":298,"id":43445},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpas6R9E","preview":false,"priority":297,"id":43446},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpip8ryU","preview":false,"priority":296,"id":43447},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpSeFs2a","preview":false,"priority":295,"id":43448},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7EnOxm","preview":false,"priority":290,"id":43449},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmmSGn5","preview":false,"priority":289,"id":43450},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpj24YGb","preview":false,"priority":288,"id":43451},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbJpyIh","preview":false,"priority":200,"id":43635},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcqr1EB","preview":false,"priority":199,"id":43636},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpV9iJuJ","preview":false,"priority":198,"id":45854}],"comments":[{"authorName":"Innomall Gmbh","text":"Wir sind rundum zufrieden empfehlen aber auch sich diese Plugins immer von einem kompetenten Partner einrichten zu lassen. https://www.pixupmedia.com/ in Berlin hat für uns wunderbar dieses Plugin auf www.laserstar.rocks integriert und all unsere Wünsche an den Shop restlos zufrieden stellend erfüllt.","headline":"Zufrieden","creationDate":{"date":"2023-04-24 08:36:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Mark A.","text":"danke für dieses Tolle Plugin","headline":"TOP","creationDate":{"date":"2023-03-15 16:15:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Patrick","text":"Ich habe das Plugin im Einsatz um massenweise Seitentitel und SEO URLs zu generieren. Das hat auch eine lange Zeit für funktioniert. Jedoch mit umfangreichen Artikeln kommt dann selbst ein Server mit freigegebenen 32 GB mit der Erstellung nicht mehr nach. Beim Starten der Generierung werden immer alle Artikel generiert. Man kann leider nicht eingrenzen dass nur einzelne Artikel generiert werden. Der Support hat immer schnell auf meiner Fragen reagiert, aber jetzt habe ich das Problem, dass ich ein Plugin im Einsatz habe, welches nicht mehr vollständig funktioniert. Und einfach abschalten geht auch nicht, da es ja einen großen Teil der Artikel beeinflusst. Dabei würde ein riesiges Datenchaos entstehen. Deshalb ist die Funktionalität für mich nicht mehr gegeben.\n\nSollte es mal bei der Generierung eine Einstellung geben um nur einen Teil der Artikel per Bulk zu generieren, dann kann ich auch die volle Anzahl an Sternen vergeben.","headline":"Die Möglichkeiten zur Einstellung sind gut, jedoch bringt eine große Artikelanzahl den Server zu Abbrüchen","creationDate":{"date":"2023-03-15 03:18:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Ulrike T.","text":"Wir nutzen das Plugin für SW5 bereits seit 6 Jahren. Für SW6 wurde es noch mal um einiges besser und bietet endlose Möglichkeiten. Wir können damit u.a. alle URLs von die alten Shops 1:1 übernehmen und vieles mehr. Probleme bei bestimmten Kombinationen wurden innerhalb kürzester Zeit ausgebessert. Bei Fragen gibt es innerhalb weniger Stunden eine Antwort - und das seit Jahren! Weiter so!","headline":"Super Plugin und top Service!","creationDate":{"date":"2023-03-06 09:46:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Rafael","text":"Viel zu Kompliziert und diverse Sachen sollten bei dem Preis einfach von Plugin her Standard eingestellt sein.. zu komplex und zu aufwendig seitens Anbieter.","headline":"Leider Unbrauchbar","creationDate":{"date":"2023-03-01 14:13:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"M.L.","text":"Habe meine Bewertung korrigiert. Hatte Probleme mit anghängten Produkt-ID's.","headline":"geht jetzt","creationDate":{"date":"2023-02-26 10:10:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Simon Goritschnig","text":"Das Plug-In ist für unser SEO Ranking ein sehr wichtiges Element. Bei Problemen wurde uns schnell und freundlich weitergeholfen.","headline":"Super Service, umfangreiche Funktionen","creationDate":{"date":"2023-02-20 23:14:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Bodo Gewinner","text":"Extrem schneller, freundlicher und kompetenter Support! Ein Fehler im Plugin wurde sozusagen in Echtzeit behoben. Dickes Lob","headline":"Dickes Lob, vorbildlicher Support!","creationDate":{"date":"2023-01-09 15:46:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Johannes Lerchner","text":"Leider konnte ich nach einem Update nicht mehr auf das System zugreifen, auch das Melden beim Support hat leider nicht geholfen. Daher musste ich die App löschen.","headline":"Nicht zufrieden","creationDate":{"date":"2023-01-06 16:28:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Patrick Barth","text":"Dieses Tool ist eine klasse Erweiterung für unseren Onlineshop. Alle wichtigen Einstellungen können somit seo-freundlich eingebaut werden. Großen Dank auch an den Support. Auf meine Fragen wurde sehr zeitnah und lösungsorientiert eingegangen. Rundum eine klare Empfehlung!","headline":"SEO Professional - klare Empfehlung","creationDate":{"date":"2022-06-24 18:05:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christian Hohenester","text":"Das Plugin bietet nützliche erweiterte Funktionen für Meta-Daten inkl. Massenbearbeitung. Wir hatten eine Frage zum Plugin, wurden super schnell beraten und das Problem ist nun gelöst. Danke!","headline":"Nützliches Plugin mit tollem Support","creationDate":{"date":"2022-06-23 10:44:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Soheil Hosseini","text":"Ich kann diesen Plugin Hersteller nur empfehlen! Wenn etwas nicht läuft wird sich sofort drum gekümmert! Der Service ist 1. Klasse! Das Plugin tut was es soll, wenn die Entwickler von Shopware nur ansatzweise so gut wären wie der Plugin Entwickler.","headline":"EXTREM GUTER SUPPORT","creationDate":{"date":"2021-12-04 17:09:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Friedrich Helmreich","text":"Nützliches plugin","headline":"Alles Bestens","creationDate":{"date":"2021-10-03 20:19:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"BurgWerk GmbH","text":"Das Plugin tut genau das, was der Shopware Standard vermissen lässt. Saubere URIs, die Möglichkeit Seiten auf noIndex zu stellen, etc. \nFehler wurden innerhalb eines halben Tages behoben - der Support ist schnell und super!\n\nFive Stars!","headline":"Perfektes SEO Plugin - schneller Support!","creationDate":{"date":"2021-02-25 15:45:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Georg Schuffenhauer","text":"guter support. regelmäßige updates.","headline":"funktioniert wie beschrieben","creationDate":{"date":"2020-08-30 21:05:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christian G.","text":"Das Plugin verstümmelt ein paar Meta-Felder auf der Produktdetailsseite. Zudem wird die Performance stellenweise recht stark reduziert. Besonders der Importer wird durch dieses Plugin extrem langsam.\n\nAuf Supportanfragen wurde selbst nach 2 Wochen nicht reagiert.\n\nNachtrag: Es wurde inzwischen auf die Anfrage reagiert, wie ja auch in der Antwort des Herstellers erkennbar ist. Habe entsprechend die Wertung angepasst.","headline":"Kein Support","creationDate":{"date":"2020-08-13 09:32:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Rebecca Röder","text":"Wir sind extrem zufrieden mit dem Plugin und den Funktionen - jedoch hat uns der 1a Support am meisten beeindruckt! Schnelle Reaktion und individuelle Bugfixes etc - einfach TOP!","headline":"Super Tool, extrem guter Support","creationDate":{"date":"2020-05-25 18:17:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Tim","text":"","headline":"Guter Support","creationDate":{"date":"2020-05-11 10:55:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8}],"ratingAverage":9,"label":"SEO Professional","description":"<p>Das Plugin \"SEO Professional\" vereint eine große Anzahl an SEO Einstellungen / Optimierung in nur einem Plugin. Hierbei setzt das Plugin da an, wo Shopware aufhört und unterstützt Sie dabei Ihr Ranging bei den Suchmaschinen zu optimieren.  </p><h2>Hilfe / Dokumentation</h2><p>Eine ausführliche Dokumentation zu dem Plugin findest du unter:<br /><a href=\"https://de.dreischild.com/docs/seo-professional\">https://de.dreischild.com/docs/seo-professional</a></p><h2>Meta Tags</h2><p>Die bereits im Shopware Standard vorhandenen Meta Felder werden durch SEO Professional erweitert und aufbereitet. So wird bei dem Meta Titel die bereits erreichte Pixellänge und bei der Meta Beschreibung sowie den Keywords die Zeichenlänge dargestellt. Zur visuellen Hilfe für die optimale Länge der Felder werden des Weiteren farbige Balken unterhalb der Meta Angaben eingebunden.</p><p>Neben den Shopware Standard Meta-Tags kann auch der Robots-Tag der jeweiligen Kategorie bzw. des jeweiligen Produkts frei definiert werden. Bei allen SEO Einstellungen, die über die Bulk Generatoren erstellt werden können, wird die Information, ob für die jeweilige Einstellung ein Bulk Template definiert ist, direkt unterhalb des Feldes angezeigt.</p><h2>SERP Vorschau</h2><p>Die SERP Vorschau ermöglicht es dir, bereits bei der Erstellung der Meta Angaben, möglichst genau zu erfahren, wie das resultierende Google Suchergebnis anschließend aussehen wird.</p><h2>Canonical Links</h2><p>Standardmäßig wird als Canonical Link  der SEO Pfad ausgegeben. In manchen Fällen ist es jedoch erforderlich, einen abweichenden Canonical Link zu definieren. Über SEO Professional kann der Canonical Link daher auf ein anderes Produkt, Kategorie bzw. eine externe URL umgestellt werden.</p><h2>Social Media</h2><p>Du möchtest Einfluss auf die Darstellung geteilter Produkte und Seiten auf Facebook und Twitter nehmen? Über SEO Professional kannst du den Titel, die Beschreibung sowie das anzuzeigende Bild für beide Social Media Plattformen konfigurieren.</p><h2>Produkt- und Kategorie Bulk Generator</h2><p>Über die Bulk Generatoren für Produkte und Kategorien bist du in der Lage den Meta Titel, die Meta Beschreibung, die URL, den Robots-Tag sowie jeweils den Titel und die Beschreibungen für Facebook und Twitter per Template automatisch zu generieren. Die Templates zum generieren der SEO Einstellungen können hierbei pro Kategorie definiert werden.</p><p>Neben bereits vorbereiteten Beispiel-Templates, können eigene individuelle Templates über die Einstellungen des jeweiligen Moduls erstellt werden. Über die Template Vorschau Funktion können diese während der Erstellung direkt getestet werden, um die Funktionsfähigkeit sicherzustellen.</p><p>Die Generierung der o.g. SEO Einstellungen anhand der hinterlegten Templates erfolgt hierbei automatisch bei der Erstellung neuer bzw. der Aktualisierung bestehender Produkte und Kategorien. Alternativ können die Bulk Generatoren über die Administration bzw. per Shopware CLI gestartet werden, sodass Sie für alle Elemente generiert werden.</p><h2>Rich Snippets (JSON-LD)</h2><p>Im Shopware Standard werden die Rich Snippets durch sogenannte Mikrodaten im Quellcode übertragen. Über SEO Professional hast du die Möglichkeit diese Mikrodaten aus dem Quellcode zu entfernen und durch die von Google empfohlenen JSON-LD Rich Snippets zu ersetzen.</p><p>Hierbei werden neben den Standardfeldern aus dem Shopware Standard auch noch weitere Rich Snippets Felder übertragen, die über dieses Modul entsprechend konfiguriert werden können. Für diese Felder ist es nun möglich in der Administration entsprechende Standardwerte bzw. -verhalten zu konfigurieren.</p><p>Für individuelle Einstellungen pro Produkt, ist es möglich in den Details der Produkte abweichende Rich Snippet Werte zu definieren. So kann bspw. für ein Produkt ein individueller Produktzustand oder aber ein spezieller SKU Wert definiert werden.</p><h2>301 und 302 URL Weiterleitungen</h2><p>Über die 301 und 302 URL Weiterleitungen können über die Administration URL Weiterleitungen eingerichtet werden. Hierbei kann  eine Url an eine andere URL, einen Artikel oder eine Kategorie weitergeleitet werden.</p><p>Auch können bspw. Artikel an andere Artikel weitergeleitet werden, um so einen Nachfolge-Artikel zu hinterlegen.</p><p>Über den HTTP Status Code kann definiert werden, ob es sich um eine dauerhafte (301) oder temporäre (302) Weiterleitung handelt.</p><p>In den Details der Produkte und Kategorien kann darüber hinaus direkt eingesehen werden, ob eine Weiterleitung für das jeweilige Produkt bzw. Kategorie hinterlegt wurde. Ist noch keine Weiterleitung hinterlegt, so kann von dieser Stelle aus entsprechend eine neue Weiterleitung hinterlegt werden.</p><p>Die Weiterleitungen können per CSV Datei importiert sowie exportiert werden.</p><h2>Aktueller Pluginstand und Weiterentwicklungen</h2><p>Zum aktuellen Zeitpunkt stehen noch nicht alle Funktionen bereit die unter Shopware 5 bei SEO Professional möglich waren. Diese und noch weitere Funktionen werden im Laufe der kommenden Wochen / Monate nach und nach erweitert. Angedacht sind hierbei aktuell monatliche Updates.</p><p>Eine ausführliche Übersicht der Anpassungen der einzelnen Versionen findest du unter: <br /><a href=\"https://de.dreischild.com/docs/seo-professional/changelog\">https://de.dreischild.com/docs/seo-professional/changelog</a></p><p><i>Haftungsausschluss:</i> <br />Wir entwickeln, testen und supporten unsere Plugins immer gegen den Shopware Standard. D.h., dass die Kompatibilität zu anderen Shopware Plugins, die im gleichen System genutzt werden sollen, durch den Shopbetreiber selbst oder aber durch seine Agentur getestet/sichergestellt werden muss.<br /></p>","installationManual":"","version":"6.10.6","changelog":[{"version":"6.10.6","text":"<p></p><ul><li>Bugfix of the last update</li></ul>","creationDate":{"date":"2023-07-10 13:19:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.10.5","text":"<ul><li>Remove the html tags from the product description<br /></li></ul>","creationDate":{"date":"2023-07-05 11:31:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.10.4","text":"<ul><li>Fixed memory issues with the rich snippets</li></ul>","creationDate":{"date":"2023-06-12 12:33:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.10.3","text":"<p>- Fixed debug output when generating bulk templates</p>","creationDate":{"date":"2023-05-16 12:09:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.10.2","text":"<p></p><ul><li>Compatibility with Shopware 6.5 established</li></ul>","creationDate":{"date":"2023-03-30 09:36:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.10.1","text":"<ul><li>Customization when saving the URLs<br /></li></ul>","creationDate":{"date":"2023-03-15 09:46:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.10.0","text":"<ul><li>Kompatibilität zu Shopware 6.5.0 hergestellt</li></ul>","creationDate":{"date":"2023-03-01 17:43:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.19","text":"<ul><li>Bugfix: strip_tags must be of type string</li></ul>","creationDate":{"date":"2023-07-12 08:19:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.18","text":"<ul><li>Remove the html tags from the product description<br /></li></ul>","creationDate":{"date":"2023-07-05 11:39:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.17","text":"<ul><li>Missing output of the og:url meta tag fixed</li></ul>","creationDate":{"date":"2023-05-08 08:55:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.16","text":"<ul><li>Customization when saving the URLs<br /></li></ul>","creationDate":{"date":"2023-03-15 08:39:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.15","text":"<ul><li>The option \"Product page as own breadcrumb element\" = \"Output only in the store\" was not correctly applied to subshops.<br /></li></ul>","creationDate":{"date":"2023-03-02 11:04:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.13","text":"<p></p><ul><li>Fix the rich snippet breadcrumbs on the product page.</li><li>Variant redirects</li></ul>","creationDate":{"date":"2023-02-15 09:30:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.12","text":"<p></p><ul><li>Field product_review.external_user as fallback for customer names in product reviews</li></ul>","creationDate":{"date":"2023-01-16 11:43:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.11","text":"<p></p><ul><li>Bugfix: Error with JSON Encode fixed</li></ul>","creationDate":{"date":"2023-01-09 12:32:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.10","text":"<p><b>Debouncer on the SEO inputs of the products</b></p><p><br /></p><p>When entering SEO data, there were performance problems in the administration. (Long storage times)</p><p><br /></p><p>This behavior was corrected by deferred updating of the character length of the SEO data.</p>","creationDate":{"date":"2023-01-05 12:25:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.7","text":"<ul><li>Consideration of the extended prices in the rich snippets<br /></li></ul>","creationDate":{"date":"2022-11-09 08:54:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.6","text":"<ul><li>Fixed bug with rich snippet breadcrumb submission<br /></li></ul>","creationDate":{"date":"2022-10-24 11:49:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.5","text":"<p></p><ul><li>Rich snippet product reviews adapted to the new Google structure</li></ul>","creationDate":{"date":"2022-06-28 07:58:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.4","text":"<p></p><ul><li>Output of the shop name with the meta tag twitter:site ensured</li><li>Product image defined as a fallback for the twitter:image meta tag.</li></ul>","creationDate":{"date":"2022-04-27 09:53:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.3","text":"<ul><li>Compatibility with Shopware 6.4.10<br /></li></ul>","creationDate":{"date":"2022-04-07 09:18:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.2","text":"<ul><li>Removed debug output from 6.9.1 that prevented the bulk generator from running.<br /></li></ul>","creationDate":{"date":"2022-01-10 15:17:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.1","text":"<ul><li>Bugfix-Update for 6.9.0</li></ul>","creationDate":{"date":"2021-12-08 19:09:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.9.0","text":"<p></p><ul><li>Refactoring / performance optimization of the bulk generator</li></ul>","creationDate":{"date":"2021-12-08 18:32:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.12","text":"<ul><li></li><li>RequestTransformerInterface instead of RequestTransformer in the decorator (overwriting by other plugins possible)</li><li>theme_config instead of shopware.theme on Twitter and FB images</li></ul>","creationDate":{"date":"2021-12-06 10:48:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.11","text":"<ul><li>Old Shopware Utils integration removed (dreisc-seo-redirect/page/dreisc-seo-redirect-create/index.js)<br /></li></ul>","creationDate":{"date":"2021-10-28 09:09:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.10","text":"<ul><li>Make sure that the live template variable ## productPrice ## also works with translated meta information.<br /></li><li>Shopware Utils integration adapted to the current Shopware structure.<br /></li></ul>","creationDate":{"date":"2021-10-26 10:33:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.9","text":"<ul><li>Organization URL is now also output as a LocalBusiness image.<br /></li></ul>","creationDate":{"date":"2021-10-04 14:20:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.8","text":"<p>In the event of errors in bulk templates, the new TemplateGeneratorException is now thrown to determine the template, area and seo option.</p>","creationDate":{"date":"2021-09-20 12:12:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.7","text":"<p>The SEO Professional menu entry can now be found under Marketing</p>","creationDate":{"date":"2021-09-06 11:01:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.6","text":"<ul><li>Plugin bug in connection with detail pages experience worlds fixed (getReviews () must be an instance of Shopware \\ Storefront \\ Page \\ Product \\ Review \\ ReviewLoaderResult, null returned)<br /></li></ul>","creationDate":{"date":"2021-06-21 12:29:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.5","text":"<ul><li>Missing file for update to version 6.8.4 added.</li></ul>","creationDate":{"date":"2021-06-07 12:43:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.4","text":"<p></p><ul><li>The automatic execution of the bulk generators when saving an entity can now be switched off via the setting under SEO Professional »Additional Settings» SEO Settings.</li><li>From now on, the bulk generators are no longer executed when indexing in the handle method.</li></ul>","creationDate":{"date":"2021-06-07 12:11:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.3","text":"<ul><li>Under certain conditions the live template variable ##shopName## was no longer resolved.<br /></li></ul>","creationDate":{"date":"2021-06-02 14:03:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.2","text":"<ul><li>setContainer added to DreiscSeoRedirectController.<br /></li></ul>","creationDate":{"date":"2021-06-01 17:35:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.1","text":"<p>PHP 8.0 Support / str_replace</p>","creationDate":{"date":"2021-05-25 10:51:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.8.0","text":"<p>Compatibility with Shopware 6.4</p>","creationDate":{"date":"2021-05-20 17:19:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.19","text":"<p></p><ul><li>Fixed malfunction of version 6.7.19</li></ul>","creationDate":{"date":"2021-05-06 15:15:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.18","text":"<p></p><ul><li>Changeover from executeQuery to executeStatement</li></ul>","creationDate":{"date":"2021-05-03 12:45:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.17","text":"<p></p><ul><li> In the case of variants, the data of the main article could not be used for the bulk templates. Inheritance has now been activated. </li></ul><p><br /></p>","creationDate":{"date":"2021-02-25 14:42:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.16","text":"<p></p><ul><li> Under certain circumstances the isModified flag was not set when generating the urls via the bulk generator. As a result, these URLs were finally overwritten again by the Shopware standard URL generator. </li><li> In the canonical settings, the External URL (Canonical Link) field was adapted from the Url type to the Text type, as otherwise the external URL was not possible. </li></ul>","creationDate":{"date":"2021-02-24 13:30:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.15","text":"<ul><li>The performance of the bulk generators could be optimized via internal caching of the SEO bulk settings.<br /></li></ul>","creationDate":{"date":"2021-02-16 20:44:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.14","text":"<ul><li> Support of the live template ## shopName ## for categories. </li><li> Adaptation of the code elements marked as @deprecated for future versions. </li></ul>","creationDate":{"date":"2021-02-16 11:23:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.12","text":"In certain constellations the live variable ## shopName ## was not correctly replaced by the shop name. This behavior has been corrected in this version.","creationDate":{"date":"2021-02-02 12:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.11","text":"<p> An incorrect URL was created when exporting redirects, which led to the following error: <i> Requested api version v1 not available, available versions are v2, v3. </i>. This malfunction has been corrected with this version. </p>","creationDate":{"date":"2021-02-02 12:01:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.10","text":"<p>When generating variants, there was an error in the bulk generator under certain circumstances (Call getCategories on null). This malfunction has been corrected with this version.</p>","creationDate":{"date":"2021-01-14 11:20:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.9","text":"<p>Fixed bug when generating the canonical link.</p>","creationDate":{"date":"2021-01-11 12:07:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.8","text":"<ul><li>With the inactive option \"Activate Rich Snippets via JSON-LD\", no speaking URLs were displayed in the storefront. This malfunction has been corrected with this version.<br /></li></ul>","creationDate":{"date":"2020-11-10 09:45:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.7","text":"<ul><li>Due to the performance problems with the Shopware DAL, the bulk generators were converted to plain SQL. This enables faster data storage.</li><li>In some cases the meta description was not displayed correctly. This problem has now been resolved.</li></ul>","creationDate":{"date":"2020-10-12 16:58:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.6","text":"<ul><li>Performance update of the bulk generators</li><li>Template variables were not included in the form when the bulk templates were created / edited. This behavior has been corrected.</li></ul>","creationDate":{"date":"2020-09-28 12:42:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.5","text":"<p></p><ul><li>Conversion of the product and category indexers to the new EntityIndexer structure.</li><li>Fixed a bug in the display of the canonical URL settings.</li></ul>","creationDate":{"date":"2020-09-03 13:53:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.4","text":"<ul><li>An error message occurred when another plugin defined a decorator for the Shopware router component. This malfunction has been corrected with this version.<br /></li></ul>","creationDate":{"date":"2020-08-31 11:17:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.3","text":"<ul><li>Compatibility with Shopware 6.3.0 established.<br /></li></ul>","creationDate":{"date":"2020-08-19 08:40:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.2","text":"<ul><li>When JSON-LD was active, parts of the Rich Snippets Tags were still output. This malfunction has been corrected with this version.<br /></li></ul>","creationDate":{"date":"2020-08-17 15:35:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.1","text":"<ul><li>Special characters such as the period and the \"~\" character can now be used in the URls that are created using the Bulk Generator.</li><li>In general, special characters were automatically escaped by the bulk generator. This was caused by the Twig Renderer. The configuration has now been adjusted so that the special characters are also displayed as such.</li></ul>","creationDate":{"date":"2020-07-15 12:12:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.7.0","text":"<ul><li>Für Facebook und Twitter können ab dieser Version der Titel, die Beschreibungen sowie die Bilder definiert werden, die beim Teilen des Produkts / der Seite ausgegeben werden. Weitere Informationen hierzu findest du unter: https://de.dreischild.com/docs/seo-professional/seo-settings/social-media</li><li>Der Titel sowie die Beschreibung für Facebook und Twitter können per Bulk Template erstellt werden. Die empfohlene Länge sowie die Maximallänge der Facebook und Twitter Titel sowie Beschreibungen können in den Einstellungen selbst definiert werden.</li><li>Die Weiterleitungen können nun als CSV Datei importiert sowie exportiert werden. Weitere Informationen hierzu findest du unter: https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Fredirect%2Fredirect-import-export</li><li>Es können nun auch Weiterleitungen an die Startseite konfiguriert werden.</li></ul>","creationDate":{"date":"2020-07-01 15:23:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.6.0","text":"<ul><li>As a canonical link, the SEO path of the respective page is always passed in the Shopware standard. From this version it is possible to store different canonical links for products and categories. Here, a fixed external URL can be stored or a product or category can be selected whose SEO path is to be used as a canonical link. You can find more information about the new setting at: https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fseo-settings%2Fcanonical-urls</li></ul>","creationDate":{"date":"2020-06-02 15:00:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.5.2","text":"<ul><li>In the Shopware Standard, the Canonical Links Tag is not displayed on the start page or the category pages (as of Shopware 6.2). Until this is guaranteed via the Shopware standard, the output from this version is ensured via SEO Professional. You can find more information at: https://issues.shopware.com/issues/NEXT-8662 </li><li> The complete category tree is now available for selection in the Bulk Generator for URLs. Accordingly, this is no longer broken down into the categories of the selected sales channel in order to guarantee a selection of the service and footer pages.</li></ul>","creationDate":{"date":"2020-05-25 16:05:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.5.1","text":"<p></p><ul><li>In version 6.5.0 the error message <i>ltrim () expects parameter 1 to be string, boolean given</i> occurred when a sales channel with a virtual domain was used. For example: <i>http://www.shop.de/at</i>. This behavior has been corrected with this version.</li></ul>","creationDate":{"date":"2020-05-19 13:45:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.5.0","text":"<ul><li>For the products and the categories, the meta-tags administration were expanded by the configuration of the robots tag. It can now be defined for the pages whether they should be indexed and links on these pages should be followed. You can find detailed information on this new setting at: https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fseo-settings%2Fmeta-tags%23robots-tag</li><li>A standard robots tag can also be defined in the SEO settings, which is used if no robots tag has been explicitly specified for a category or product. The new option `Noindex Request Parameter Query` can also be defined, which can be used to configure conditions that ensure that a robots tag is switched to` noindex`. You can find more information on this at: https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Fsettings%2Fseo-settings</li><li>The settings for the robots tag can now be defined via the `Product` and the` Category Bulk Generator`.</li><li>If you want to watch the SERP preview for a product or a category or edit the Canonical Url, you must first select the sales channel you want to edit. To simplify the workflows here, you can now define a sales channel as a pre-selection. You can find more information on this at: https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdev%2Fdocs%2Fseo-professional%2Fmodules%2Fsettings%2Fseo-settings</li></ul>","creationDate":{"date":"2020-05-14 18:45:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.4.2","text":"<ul><li>In the case of migrations, the return values of the getCreationTimestamp method are now explicitly converted to the int data type, because otherwise the plugin could not be installed under certain server conditions.<br /></li><li>The changes in version 6.0.2 regarding deleting the forwarding in administration have not yet worked in production systems with an active cache. As of this version, the cache tag of the respective forwarding is cleared.</li></ul>","creationDate":{"date":"2020-05-11 15:00:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.4.1","text":"<p></p><ul><li>The method <i>extractInheritableAttributes</i> of the class <i>DreiscSeoPro \\ Decorator \\ Shopware \\ Storefront \\ Routing \\ RequestTransformerDecorator</i> had no return value. This led to an error message sometimes being registered. This misbehavior has been fixed.</li></ul><p></p>","creationDate":{"date":"2020-05-11 11:25:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.4.0","text":"<ul><li>The Rich Snippets configuration has been expanded to include Logo and Local Business. You can find more information on this at https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Frich-snippets-json-ld%2Forganization<br /></li><li>The configurations of the rich snippets settings can now be saved for each sales channel.<br /></li><li>With the deviating values for the rich snippets, which can be configured under SEO Professional »SEO Settings» Rich Snippets (https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fseo-settings%2Frich-snippet), the Inheritance implemented for variants.<br /></li></ul>","creationDate":{"date":"2020-05-08 14:33:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.3.0","text":"<p></p><ul><li>It is now possible to output rich snippets in the areas of product and breadcrumb via SEO Professional. The standard rich snippet micro data is removed from the source code and replaced by JSON-LD data. You can find information on the setting options at: <a href=\"https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Frich-snippets-json-ld\">https://translate.google.com/translate?sl=de&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Frich-snippets-json-ld</a></li></ul>","creationDate":{"date":"2020-04-24 10:00:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.2.0","text":"<p></p><ul><li>The recommended and the maximum character or pixel length of the meta tags can now be configured. You can find more information on this at: <a href=\"https://translate.google.com/translate?sl=auto&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Fsettings%2Fmeta-tags\">https://translate.google.com/translate?sl=auto&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Fsettings%2Fmeta-tags</a></li></ul>","creationDate":{"date":"2020-04-02 13:50:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.1.0","text":"<p>The bulk generators can now also be started directly via the administration. Further information can be found at: https://translate.google.com/translate?sl=auto&amp;tl=en&amp;u=https%3A%2F%2Fde.dreischild.com%2Fdocs%2Fseo-professional%2Fmodules%2Fbulk-generators%2Fexecute-bulk-generator%232-moeglichkeit-bulk-generatoren-ueber-die-administration-starten</p>","creationDate":{"date":"2020-03-30 11:26:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.0.2","text":"<ul><li>The redirects were not taken over directly when the HTTP cache was active. This behavior has been adjusted accordingly.<br /></li><li>Deleting the redirects no longer worked with the current version because the Shopware DAL could not delete them. The deletion of the redirects was therefore switched to plain SQL and a ticket was opened at shopware AG. (https://issues.shopware.com/issues/NEXT-7866)<br /></li></ul>","creationDate":{"date":"2020-03-26 18:29:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.0.0","text":"<p></p><ul><li>First Shopware 6 version</li></ul>","creationDate":{"date":"2020-03-19 16:05:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Dreis43878114545","redirectToStore":false,"lowestPriceValue":30}