{"id":8738,"name":"SwagPayPal","code":"Swag588949310744","lastChange":{"date":"2023-07-24 18:44:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpK3DxI0","examplePageUrl":"","moduleKey":"SwagPayPal","creationDate":{"date":"2019-05-13 11:29:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-05-23 10:08:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-06-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":null,"pluginTestingInstanceDisabled":false,"producer":{"id":1,"prefix":"Swag","name":"shopware AG","website":"//www.shopware.com/de","fixed":true,"iconPath":"https://s3-eu-west-1.amazonaws.com/sbp-plugin-images/prod1_sw-logo.jpg"},"infos":[{"id":13588,"name":"PayPal für Shopware 6","description":"<p></p><p>Mit der in Shopware 6 integrierten Komplettlösung PayPal Checkout profitierst du von mehr Zahlarten, optimierter Nutzerfreundlichkeit und zukunftsicherer Technologie.</p><p><strong><br></strong></p><p><b>Integriere eine Vielfalt an PayPal-Produkten mit nur einem Modul in deinen Shopware 6 Shop:&nbsp;</b><strong><br></strong></p><ol><li>PayPal Checkout</li><li>PayPal Express Button</li><li>PayPal Ratenzahlung und Bezahlung nach 30 Tagen</li></ol><p><strong><br></strong></p><p>Nutze die gängigsten und beliebtesten PayPal-Produkte aus einer Hand: Den PayPal Checkout, den PayPal Express Button und dynamische Banner für die neue PayPal Ratenzahlung. Das Beste daran: Mit diesem Modul kannst du alle Produkte einzeln oder gleichzeitig in deinem Online-Shop nutzen.\n\n<br></p><p><br></p><h2>Die Bestandteile des Multiproduct-Moduls:<br></h2><h3>1. PayPal Checkout</h3><p>Optimiere deine Geschäftsabläufe mit einer einfachen, aber leistungsstarken Lösung. Mit dem neuen PayPal Checkout können deine Kunden mit PayPal, „Später bezahlen“-Optionen*, Rechnungskauf* oder Kredit- bzw. Debitkarte bezahlen.&nbsp; Zudem bietet PayPal Checkout mehr als neun weitere lokale Zahlarten: Während Kunden hierzulande beispielsweise mit Giropay oder Sofort bezahlen, können Kunden aus den Niederlanden wie gewohnt iDeal nutzen.</p><p><br></p><p><b>PayPal Checkout mit neuem Rechnungskauf</b><b>:</b></p><p>Du bietest deinen Kunden den Kauf auf Rechnung mit PayPal PLUS an? Der derzeitige Kauf auf Rechnung als Teil von PayPal PLUS wird am 30. September 2022 eingestellt.&nbsp;</p><p>Um deinen Kunden auch weiterhin den Rechnungskauf anbieten zu können, kannst du in nur wenigen Schritten zum neuen PayPal Checkout wechseln. Wie schon beim Kauf auf Rechnung bei PayPal PLUS zahlen deine Kunden auch beim Rechnungskauf als Teil von PayPal Checkout erst nach 30 Tagen, du erhälst dein Geld von PayPal jedoch sofort.</p><p>PayPal Checkout ermöglicht deinen Kunden auch den beliebten Rechnungskauf. Viele Menschen schätzen diese Zahlart, denn die Eingabe sensibler Zahlungsdaten entfällt und die Ware kann in Ruhe geprüft werden. Der Rechnungskauf ist eine bequeme Lösung für alle: Deine Kunden zahlen erst nach 30 Tagen, aber du erhälst dein Geld von PayPal sofort. Hierfür brauchen deine Kunden nicht mal ein PayPal-Konto*.</p><p><a href=\"https://www.shopware.com/de/news/paypal-launcht-neues-produkt/\" target=\"_blank\" rel=\"noreferrer noopener\">Jetzt zu PayPal Checkout wechseln!</a><br></p><p><br></p><h3>2. PayPal Express Button</h3><p>Mit dem PayPal Express Button gestaltest du den Bezahlweg für deine Kunden schneller, bequemer und reibungsloser: Mit nur einem Klick gelangen deine Kunden zur PayPal-Bezahlseite. Zusätzlich kannst du den Bezahlvorgang mit dem PayPal Express Button verkürzen, damit deine Kundne ohne Umwege direkt von der Produktansicht zur Bezahlung mit PayPal gelangen. So kannst du problem- und kostenlos mehr Kaufabschlüsse generieren – natürlich optimiert für mobiles Bezahlen auf Smartphones und Tablets.</p><p><b>Mehr Informationen gibt es <a href=\"https://www.paypal.com/de/webapps/mpp/merchant\" target=\"_blank\" rel=\"noreferrer noopener\">hier</a>.</b></p><p><b><br></b></p><h3>3. PayPal Ratenzahlung und Bezahlung nach 30 Tagen</h3><p>Die PayPal Ratenzahlung und Bezahlung nach 30 Tagen sind in PayPal Checkout bereits enthalten*.&nbsp; Für dich als Händler entstehen dabei keine zusätzlichen Kosten. Steigere deine Umsatzchancen und gleichzeitig die Kaufkraft deiner Kunden, indem du flexible Zahlungsoptionen anbietest. DeineKunden können für ihre Einkäufe bequem in 3–24 monatlichen Raten bezahlen und Du erhältst dein Geld sofort.</p><p>Für dich als Händler entstehen dabei keine zusätzlichen Kosten. Steigere deine Umsatzchancen und gleichzeitig die Kaufkraft deiner Kunden, indem du flexible Zahlungsoptionen anbietest. Deine Kunden können für ihre Einkäufe bequem in 3–24 monatlichen Raten bezahlen und Du erhältst dein Geld sofort.<br></p><p><br></p><p><b>PayPal Ratenzahlung</b>*<br>Mit der PayPal Ratenzahlung haben deine Kunden jetzt die Auswahl zwischen 3, 6, 12 und 24 Monatsraten. Zusätzliche Kaufanreize schaffst du mit der optionalen 0%-Finanzierung. Das bietet deinen Kunden finanzielle Flexibilität – und dir die Chance auf größere Umsätze.</p><p><b>Bezahlung nach 30 Tagen</b>*</p><p>PayPal ermöglicht deinen Kunden beim Kauf die Bezahlung nach 30 Tagen, damit die bestellte Ware in Ruhe geprüft werden kann. Dir entstehen dabei nur die üblichen Kosten für die Nutzung der Zahlungs-Dienstleistungen von PayPal – Dein Geld erhälst du unmittelbar nach Eingang der Bestellung.</p><h3><br></h3><h3>Steigere deine Conversion mit dynamischen Bannern</h3><p>Mit PayPal Checkout kannst du deine Kunden mit Bannern auf deinen Produktseiten über die Verfügbarkeit von „Später bezahlen“-Optionen informieren. 51% der Käufer nutzen “Später bezahlen”-Optionen, wenn sie im Einkaufsprozess frühzeitig darauf aufmerksam gemacht werden.**</p><p>---&nbsp;</p><p>* Qualifikation und Verfügbarkeit abhängig von Händlerstatus, Branche und Integration. Kundenverfügbarkeit vorbehaltlich Kreditwürdigkeit.</p><p>** TRC Online-Studie, beauftragt von PayPal, April 2021 (mit 1.000 Verbrauchern ab 18 Jahren in ganz DE; n=342)</p><br><p></p><p><strong></strong></p>","installationManual":"<p>Hier finden Sie Hilfe zur Einrichtung: <a href=\"https://docs.shopware.com/de/shopware-6-de/plugins/paypal\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/plugins/paypal</a></p><p>Die PayPal-Ratenzahlungsoption wird Ihren Kunden automatisch mit Bannern in Ihrem Online-Shop angezeigt. Sie können diese Zahlungsmöglichkeit aktivieren oder deaktivieren. </p>","shortDescription":"Biete deinen Kunden Deutschlands gängigste Bezahlmöglichkeiten mit nur einer Integration: Das neue PayPal Modul bietet Checkout, Ratenzahlung & Expressbutton","highlights":"Mehr als 9 lokale Zahlarten\n\"Später Bezahlen\"-Optionen\nNeue Rechnugskauflösung\nOptimierte Nutzerfreundlichkeit\nZukunftssichere Technologie","features":"PayPal Checkout\nPayPal Express-Button\nPayPal \"Später bezahlen\"-Optionen\nRechnungskauf\nZettle – ein Service von PayPal"},{"id":13589,"name":"PayPal for Shopware 6","description":"<p><strong>PayPal Checkout is already integrated into Shopware&nbsp;6. With our latest solution you can provide your customers many payment types in one seamless checkout experience. Whether your business is online, in-store, or on-the-go, PayPal helps you connect with customers and expand the reach of your business.</strong></p><p>With PayPal Checkout you integrate a variety of PayPal products into your Shopware 6 shop with just one module:</p><ol><li>PayPal Checkout</li><li>PayPal Express Button</li><li>PayPal Pay Later</li></ol><p><br></p><h2>The components of the Multiproduct module:</h2><h3>1. PayPal Checkout</h3><p>PayPal's latest, all-in-one checkout solution. Securely accept PayPal Digital Payments, credit/debit cards and local payment methods. It also let’s you offer Venmo (US only), Pay Later options and more — all designed to help you maximize conversion.<br></p><p><b>PayPal Checkout with new Payment upon Invoice (Germany)</b></p><p>You are offering Payment Upon Invoice (PUI) as part of PayPal PLUS (Germany)? As PUI as part of PayPal PLUS is being deprecated on 30/09/2022, you can now migrate to Pay Pal Checkout to keep offering PUI.<br></p><p><br></p><h3>2. PayPal Express Button</h3><p>With PayPal Express Button, you can make the payment method for your customers faster, more convenient, and smoother: Your customers can get to the PayPal payment page with just one click. In addition, you can shorten the payment process with the PayPal Express button to get directly from the product view to pay with PayPal without detours. This allows you to generate more purchases free of charge –optimized for mobile payment on smartphones and tablets.</p><p><b>More information can be found <a href=\"https://www.paypal.com/de/webapps/mpp/merchant\" target=\"_blank\">here.</a></b></p><h3><br></h3><h3>3. PayPal Pay Later</h3><p>PayPal Pay Later allows customers to pay over time while you get paid up front — at no additional cost to your business. And since 81% of younger consumers who use buy now, pay later decide which payment method to use before they get to checkout*, showing Pay Later messaging on your site lets customers know they have flexible options to pay over time while they are browsing — helping convert your browsers into buyers.</p><p>Available in these countries: USA, Australia, France, UK, Germany, Italy, Spain</p><p><br></p><p>Find out more about country availability:<b>&nbsp;<a href=\"https://developer.paypal.com/docs/checkout/pay-later/de/\" target=\"_blank\">Pay Later offers (DE) (paypal.com).</a></b>&nbsp;</p><p><br></p><p><br></p><p>---&nbsp;</p><p>*&nbsp;TRC online survey commissioned by PayPal in April 2021 involving 5,000 consumers ages 18+ across US, UK, DE, FR, AU (among Millennial &amp; Gen Z BNPL users (ages 18-40), US (n=222), UK (n=269), DE (n=275), AU (n=344), FR (n=150).</p><p></p>","installationManual":"<p>Here you can find help on how to set it up:&nbsp;<a href=\"https://docs.shopware.com/en/shopware-6-en/extensions/paypal\" target=\"_blank\" rel=\"noreferrer\">https://docs.shopware.com/en/shopware-6-en/extensions/paypal</a></p><p><br></p><p>The PayPal instalment payment option is automatically displayed to your customers with banners in your online shop. You can activate or deactivate this payment option.</p>","shortDescription":"Get access to over 100 currencies and 200 markets worldwide with the payment module PayPal for your Shopware shop. Experience an easy and comfortable way of payment.","highlights":"More than 9 country-specific payment methods \nPay Later\nNew „Payment Upon Invoice“ (Germany)\nSeamless checkout experience\nEasy integration into your Shopware shop","features":"PayPal Checkout\nPayPal Express-Button\nPayPal Pay Later\nPayment Upon Invoice (Germany)\nVenmo (US)\nPayPal Zettle"}],"addons":["SW6_integrated"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":156273,"bookingKey":"Swag588949310744","bookingText":"PayPal","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcYuk7q","preview":true,"priority":0,"id":90498},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phplUwjq2","preview":false,"priority":1,"id":90499},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptLnAjg","preview":false,"priority":1,"id":90500},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuppA7D","preview":false,"priority":1,"id":90501},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZ0dOzM","preview":false,"priority":0,"id":45653},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEC7VBO","preview":false,"priority":0,"id":45654},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKluCBO","preview":false,"priority":0,"id":45655},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDnGpDO","preview":false,"priority":0,"id":45656},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqRjKLO","preview":false,"priority":0,"id":45657},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpa3X4JO","preview":false,"priority":0,"id":45658},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJAz7PI","preview":false,"priority":0,"id":45659},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWVLvyQ","preview":false,"priority":0,"id":45660}],"comments":[{"authorName":"Andreas Brus","text":"Schon vor dem Update auf 6.5 kommt der Hinweis, daß diese Erweiterung womöglich nicht mit der Version 6.5 kompatibel ist?\nWarum sowas bei einem beworbenen Basis-Bestandteil von Shopware?\n\"Mit der in Shopware 6 integrierten Komplettlösung PayPal\"","headline":"Kann nicht geprüft werden ob 6.5 kompatibel?","creationDate":{"date":"2023-07-13 13:38:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"xxl","text":"Das Paypal Plugin kommt mit einem Java-Script Code, der unnötig Ressourcen verbraucht und laut Google als Hauptursache für lange Seitenladezeiten bei mir ist. Warum funktioniert das Plugin nicht so, dass das dazugehörende Java Script nur auf den Checkout Seiten ausgespielt wird?","headline":"Plugin Java Script konsumiert unnötig Ressourcen","creationDate":{"date":"2023-07-10 22:54:53.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":3},{"authorName":"Bettina","text":"leider ist es nicht mehr möglich seit Update auf 6.5 Rückerstattungen aus dem Dashboard raus zu machen. Man muss tatsächlich sich direkt bei Paypal einwählen und die Bestellung manuell raussuchen um Rückzuerstatten - bitte unbedingt nachbessern!","headline":"Seit 6.5 schwierig","creationDate":{"date":"2023-07-06 12:18:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Marco Flasdick","text":"Liebes Shopware Team,\nauch wenn ihr keinen Support hierfür bietet, verstehe ich nicht warum nicht reagiert wird.\nDieses Problem ist seit der Shopware Version 6.5 vorhanden und scheint sich nicht zu lösen.\nWir bauen unseren Shop zwar gerade erst auf, aber mit solch Problemen die von einer Erweiterung von Shopware selbst kommt, muss man das sicherlich in Frage stellen, die richtige Entscheidung getroffen zu haben.\nSchade","headline":"You have requested a non-existent service \"monolog.logger.paypal\".","creationDate":{"date":"2023-06-19 17:32:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Schildersysteme Siedenburg","text":"Mit 7.2.0 : You have requested a non-existent service \"monolog.logger.paypal\".\nIch sehe ein Update, in der Hoffnung, dass es behoben wurde, aber leider:\nMit 7.2.1 : You have requested a non-existent service \"monolog.logger.paypal\".\n\nWir haben die alten Plugins komplett entfernt, vom Server gelöscht und die Datenbankeinträge entfernt, aber auch dann hilft es nicht, es bleibt beim nicht existierenden Service monolog.logger.paypal.\nDowngrade auf 7.1.0 behebt das Problem, aber das kann auf Dauer keine Lösung sein, spätestens wenn PayPal etwas an seiner API ändert muss man updaten und dann muss das bitte klappen!\n\nIch schreibe wohl nicht zuviel, wenn ich hier schreibe , dass PayPal heutzutage für die meisten Shops essentiell ist. \nWarum macht euch gerade das Paypal Plugin soviele Probleme?\n\nSchade, dass Shopware mit der Version 6.5 soviele Probleme bereitet, wo doch SW5 und bis SW6.4 (fast alles) wunderbar lief.","headline":"7.2.1 -Immer noch You have requested a non-existent service \"monolog.logger.paypal\".","creationDate":{"date":"2023-06-12 14:49:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Eckard Horn","text":"Unser Shop ist nach dem Update auf Version 7.1.0 auch nicht erreichbar. Nach dem Downgrade funktioniert es wieder. Wie kann es sein, dass PayPal innerhalb von nun ca. zwei Wochen nicht nachbessert und ein funktionierendes Update bereitstellt?","headline":"Shop nicht erreichbar - Error 500","creationDate":{"date":"2023-06-01 20:36:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"SCR Robby","text":"Es werden bei jeder Shop-Seite Requests an Paypal ausgeführt. Egal ob ein Paypal-Button auf der Seite eingebunden ist oder nicht, was man auch einstellt und/oder bez. Cookie-Einstellungen aktiviert.\nDas verlangsamt nicht nur die Seite erheblich (Stichwort Startseite oder Landingpages) sondern ist auch bez. Datenschutz fragwürdig.","headline":"Tracking bei Installation immer aktiv","creationDate":{"date":"2023-05-28 20:11:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":5},{"authorName":"Stefan Graf","text":"","headline":"Seemüller Computer-Vertriebs GmbH","creationDate":{"date":"2023-05-25 23:26:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dirk","text":"Da ich (Community-Edition) keine Support-Anfragen stellen kann, kommt hierüber die Info, dass das Plugin  V 7.1.0 meinen Shop gekillt hat. 500er Meldung. Wenn ich das Plugin deaktiviere, ist der Shop wieder erreichbar - aber keiner kann bezahlen. Bitte um schnelle Abhilfe!","headline":"Shop nicht mehr erreichbar - 500er Fehler","creationDate":{"date":"2023-05-25 20:50:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Torsten Kunoth","text":"Version: 7.1.0: The server returned a \"500 Internal Server Error\"\nWie kann das sein, dass PayPal so eine Version freigibt????\nUpdate installiert, ab dann läuft der Shop immer auf einen 500er-Fehler!\nDowngrade nzur lauffähigen Version nicht möglich. \nAbsolute Katastrophe.","headline":"Shop offline ! 500 Internat Server error","creationDate":{"date":"2023-05-25 13:38:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Innomall GmbH","text":"Bei uns läuft immer alles einwandfrei. Ich glaube diejenigen die hier schlecht Rezensieren sollten sich eine oder eine bessere Agentur suchen um Ihren Shop einzurichten. Unsere Empfehlung: https://www.pixupmedia.com/ diese haben sehr gut www.laserstar.rocks eingerichtet. Darüber hinaus geben wir den Typ im Shop die Anredetitel zu kontrollieren und die Telefonnummer verpflichtend zu machen. Die Daten der Shopkunden sollten sich mit dem Paypal Account decken.","headline":"Verstehen die Rezensionen hier nicht","creationDate":{"date":"2023-04-24 08:24:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Torsten Ibs","text":"Seit 6.01 nur noch Müll, 6.02, 6.03 ohne Änderungen. Angeblich gibt es laut Änderungsprotokoll auch eine 7.01, aber die ist wohl so buggy, daß man sie doch nicht ausrollt. Bei uns funktioniert zwar vieles, aber der Sofort-Kaufen Button ist weg. -30% Umsatz auf Paypal, +10% auf AmazonPay = immer noch 10% Miese.\nPraktikanten sollten zu Hause bleiben? Nee, lieber die Chefs. Wie kann man nur so viel Müll nacheinander produzieren.\nSehr geil auch, daß Paypal anscheinend keinen eigenen Rechnungskauf mehr macht. Da wirst du von Kunden gefragt, wer oder was Ratepay ist, und dann weißt du nicht mal, daß du sowas anbietest, weil heimlich geändert. Sieht so aus, als neige sich die Ära Paypal dem Ende. Was macht eigentlich Elon Musk? Kann der nicht mal wieder was neues erfinden? Das funktioniert doch eigentlich immer - bis er es verkauft.","headline":"Nur noch Katastrophe - öffentlicher Alpha-Test?","creationDate":{"date":"2023-04-06 10:56:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Felix Ringhut","text":"Wie kann es das das wichtigste Plugin im Shop nicht funktioniert. Immer wieder Abbrüche, Fehlermeldungen und das konstant seit über einem Jahr. Jedes Update macht die Sache noch schlimmer. Kunden beschweren sich am laufenden Band. Ich glaube es ist für uns Zeit über ein anderes Shopsystem nachzudenken.","headline":"Was soll ich sagen. Eine Katastrophe","creationDate":{"date":"2023-03-29 11:34:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Albert Michael Sauter","text":"Erweiterung hat Fehler und fkt. nicht richtig. Leider habe ich die Kommentare zu spät gelesen und auf 6.0.2 aktualisiert. :):):)","headline":"6.0.2 hat Fehler und fkt. nicht richtig","creationDate":{"date":"2023-03-24 10:44:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"User","text":"Was soll man da noch sagen, Shopware schafft es in 2 Tagen 3 Versionen zu veröffentlichen die alle das Frontend mit 504 Fehler unbenutzbar machen. Als Lösungsvorschlag soll man PayPal komplett deinstallieren inkl. aller Einstellungen und Daten und muss die 5.4.6 komplett neu integrieren. Da kommt Freude auf.\nFinger weg! \nViele Grüße an den Shopware Praktikanten","headline":"Ach die dritte Vertion innerhalb von 2 Tagen ist fehlerhaft","creationDate":{"date":"2023-03-22 18:33:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"C B","text":"Wie kann ein \"Shopware-Standard-Plugin\" anscheinend ungetestet im Store veröffentlicht werden wenn große Themes und viele andere Plugins danach nicht mehr funktionieren. Auch ist die Funktionsweise des Plugins aus meiner Sicht nicht korrekt dokumentiert. Wer Fragen zum Plugin dazu hat, benötigt eine Shopware-Subscription. Das hätte man besser lösen können.","headline":"Ich schließe mich meinen Vorrednern an.","creationDate":{"date":"2023-03-21 14:30:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Markus Völk","text":"Die Seite wird vom neuen PayPal Update komplett zerschossen. Individuelle Styles werden nicht mehr geladen und die PayPal Funktionen sind auch nicht verfügbar","headline":"Vorsicht beim Update auf 6.01","creationDate":{"date":"2023-03-21 12:38:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Helmut Müller","text":"Wir haben Themeware Modern im Einsatz: Sobald man das Paypal-Plugin aktiviert, werden keine individuellen CSS Styles (aus Datei und Experteneinstellungen) mehr geladen. Leider bietet Shopware keinen Support für das hauseigene Plugin. Darum hier auf diesem Wege! Bitte sofort beheben!","headline":"Nicht auf Version 6.0 bzw. 6.01 updaten! Individuelle CSS-Styles werden nicht mehr geladen.","creationDate":{"date":"2023-03-21 10:42:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Andreas Bernauer","text":"Uns hat es beim Update die Seite zerschossen... Sehr ärgerlich.","headline":"Vorsicht bei Update auf 6.0.1","creationDate":{"date":"2023-03-21 10:18:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Marc","text":"Die Zahlungsmethode: \"Kredit- oder Debitkarte\" ist aktiviert, funktioniert jedoch nicht, die Felder sind leer und können nicht ausgefüllt werden. Die restlichen Zahlungsmethoden funktionieren, es ist jedoch sehr ärgerlich, dass man den Support nicht wirklich einfach erreichen kann, um den Fehler zu melden.","headline":"Leider nicht zufriedenstellend","creationDate":{"date":"2023-02-10 19:14:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Florian Grobe","text":"Es wird eine Aktualisierung im Shop-Backend angezeigt.\nAktualisierung aus dem Backend -&gt; Keine Funktion\nAktualisierung per ZIP Upload -&gt; \"Das hat nicht funktioniert\"\nErweiterung deaktivieren -&gt; Keine Funktion\nErweiterung deinstallieren -&gt; Keine Funktion\n\nAbsoluter Mist!","headline":"Katastrophale (Nicht-)installation","creationDate":{"date":"2023-01-31 19:30:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Admin a","text":"","headline":"Bricht immer wieder die Verbindung ab","creationDate":{"date":"2023-01-07 10:13:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Mathias Wortmann","text":"Beim einrichten kommen immer Javascript Fehler \"Uncaught Error: Validation \"hasOnlyNumber\" is not included in bundle.\" Daher ist es nicht funktionsfähig.","headline":"Leider nicht funktionsfähig","creationDate":{"date":"2022-11-28 12:07:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Josua Sievers","text":"","headline":"Viele Zahlungen bleiben auf \"unbestätigt\" stehen, z.B. SOFORT klappt nur bei wenigen Kunden.","creationDate":{"date":"2022-10-30 13:28:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":3},{"authorName":"Chanel Lipski","text":"However, I updated the plugin and now the performance is really bad. I hope that here quickly a new updated is delivered. The fix should be pretty simple, because it's just the order of javascript execution. The javascript code is executed before other content is loaded and thus does not render the page for seconds. Instead of rendering the buttons externally via the paypal servers, you could also just store them on the local server. Please fix it, otherwise this is a great plugin.","headline":"Good, simple, but ...","creationDate":{"date":"2022-10-22 20:34:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":7},{"authorName":"Rafael Schröder","text":"Super Arbeit währe aber sehr schön wen man im Admin Bereich noch zusätzliche Werbebanner auswählen könnte für Ratenzahlung oder andere Werbung für paypal","headline":"Super Arbeit","creationDate":{"date":"2022-10-18 10:45:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Andreas Bendel","text":"Bekommen nur diese Fehlermeldung: Call to a member function is() on null","headline":"lässt sich nicht installieren","creationDate":{"date":"2022-10-09 14:53:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Patrick Jäger","text":"Nach der Installation lädt unser Shop extrem langsam. Das Plugin scheint nicht kompatibel.","headline":"Funktioniert bei uns nicht","creationDate":{"date":"2022-09-27 20:40:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Johannes","text":"Leider wird die Telefonnummer beim Express-Checkout nicht vom PayPal-Account in den Shop übertragen und es kommt zur Fehlermeldung auf der Checkout-Seite. Dies betrifft Shops die eine Telefonnummer als Pflichtfeld gesetzt haben, da diese benötigt wird.\n\nBitte bald möglich beheben.\nDanke!","headline":"Fehler bei Übertragung der Telefonnummer","creationDate":{"date":"2022-09-06 09:13:08.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"frank eichner","text":"Nichts funktioniert mehr richtig","headline":"KATASTROPHE","creationDate":{"date":"2022-08-23 10:12:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"S. Hauke","text":"Das Paypal-Plugin für SW6 funktoniert bei uns plötzlich auch nicht mehr, trotz des aktuellsten Updates und dem zusätzlichen Überprüfen der gängigen Einstellungen (Plugin aktiv, Zahlart aktiv, usw.). Folge: Bezahlungen mit PayPal aus unerfindlichen Gründen unmöglich. Support - reagiert auch nicht. Bitte schnell beheben, trotz SOMMERLOCH!","headline":"Euerer Plugin funktoniert nicht mehr !!!","creationDate":{"date":"2022-08-09 10:53:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Marcel Roeder","text":"Ich kann Paypal Plus nicht nutzen und das macht Shopware nutzlos.","headline":"ABSOLUTE KATASTROPHE","creationDate":{"date":"2022-07-28 13:19:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Jay Dee","text":"funktioniert nicht mehr seit der neuen Version.","headline":"Nur noch Probleme","creationDate":{"date":"2022-07-18 15:40:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Prontomed Vertrieb","text":"Das Onboarding funktioniert mal so gar nicht. Die neue Erweiterung ist ein Desaster!","headline":"Keine Funktion!","creationDate":{"date":"2022-07-06 12:22:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Steffi","text":"Ich habe die App aktualisiert um auf das  neue Paypal Checkout zugreifen zu können. Nun funktionieren nur noch 3 Zahlungsarten. Alle weiteren werden auch nach mehrmaligen Onboarding nicht freigeschaltet, obwohl alle Einstellungen bei Paypal korrekt durchgeführt wurden.","headline":"Nachdem letzten Update auf Checkout nicht mehr funktionell","creationDate":{"date":"2022-07-06 10:43:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Kriol Store","text":"","headline":"Great","creationDate":{"date":"2022-07-05 16:47:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Web Labels","text":"geht nicht mehr","headline":"PP Express funktioniert nicht","creationDate":{"date":"2022-06-17 15:23:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Nico Ostermueller","text":"Wie bereits mehrmals von anderen erwähnt, auch hier in der aktuellen Version von dem Plugin werden Fehler erzeugt:\nNo route found  POST api/v3/_action/paypal/webhook/execute\n\nDabei sieht man, dass auf die nicht mehr aktuelle v3 API zugegriffen wird!","headline":"No route found Exception!","creationDate":{"date":"2022-06-10 15:33:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Kilian Schwiebacher","text":"","headline":"nice","creationDate":{"date":"2022-03-09 13:38:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Wecotec","text":"Seit ein paar Wochen werden gefühlt 50% der Bestellungen abgebrochen. Laut PP werden auch veraltete API-Aufrufe verwendet :-(","headline":"Plugin sorgt für Bestellabbrüche","creationDate":{"date":"2021-12-15 15:03:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Erik Herbert","text":"Ebenso hier… inkl. Bestellabbrüchen – Webhook Fehler trotz Version 4 und SW 6.4.5.1\nTrotz der neuesten Version erhalten wir pro Minute mehrere Webhook Fehler in der Logfile, welche selbst im inaktiven Zustand des Plugins: No routes found for \\\"/api/_action/paypal/webhook/execute\\\"","headline":"LOG: No route found for \"POST …/PaypalUnifiedWebhook/execute","creationDate":{"date":"2021-11-26 07:30:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Anas Al-Malki","text":"Trotz der neuesten Version erhalten wir pro Minute mehrere Webhook Fehler in der Logfile, welche selbst im inaktiven Zustand des Plugins:\nNo routes found for \\\"/api/_action/paypal/webhook/execute\\\"","headline":"Webhook Fehler trotz Version 4 und SW 6.4.5.1","creationDate":{"date":"2021-10-22 12:28:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Holger","text":"Wie gewohnt, Qualitätsarbeit von Shopware.\nPayPal mit all seinen Variaten an Zahlungsmöglichkeiten wird in einem Plugin umgesetzt.\nEs findet auch eine stetige Weiterentwicklung und Anpassung statt,\n\nVorbildlich","headline":"Zuverlässige Umsetzung","creationDate":{"date":"2021-09-28 12:20:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"F.M.","text":"Dieses Plugin zieht die Pagespeed nach unten - ein wichtiges SEO Kriterium. Selbst auf Seiten, die gar kein PayPal benötigen (bspw. die Startseite) kann das Laden der Skripte nicht unterbunden werden. Schade.","headline":"Schlecht für Pagespeed","creationDate":{"date":"2021-05-27 19:55:40.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Ch. Becker","text":"Versucht man mit PayPal Express zu zahlen, landet man nach dem PayPal Login, im Anschluss auf der Registrierungsseite für ein neues Kundenkonto im Shop. \nIch habe das Plug-In auch schon einmal neu installiert. Half leider nicht. Im Forum gibt es weitere Benutzer die gleiches Problem haben.","headline":"Paypal Express funktioniert leider nicht :-(","creationDate":{"date":"2020-12-08 09:31:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Patrick Lehr","text":"Macht was es soll und das stellt einen doch immer wieder zufrieden. Auch die Updates bei neuen Versionen kommen zügig und sind einwandfrei! DANKE","headline":"Top Plugin","creationDate":{"date":"2020-08-26 17:24:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Aiyana","text":"Paypal ist eine gute Zahlungsmöglichkeit.\nDass es im Shopware 6 integriert ist, ist perfekt und erst noch Gratis, vielen Dank.","headline":"Danke für das PlugIn","creationDate":{"date":"2020-08-02 12:57:17.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":4,"label":"PayPal für Shopware 6","description":"<p></p><p>Mit der in Shopware 6 integrierten Komplettlösung PayPal Checkout profitierst du von mehr Zahlarten, optimierter Nutzerfreundlichkeit und zukunftsicherer Technologie.</p><p><strong><br /></strong></p><p><b>Integriere eine Vielfalt an PayPal-Produkten mit nur einem Modul in deinen Shopware 6 Shop: </b><strong><br /></strong></p><ol><li>PayPal Checkout</li><li>PayPal Express Button</li><li>PayPal Ratenzahlung und Bezahlung nach 30 Tagen</li></ol><p><strong><br /></strong></p><p>Nutze die gängigsten und beliebtesten PayPal-Produkte aus einer Hand: Den PayPal Checkout, den PayPal Express Button und dynamische Banner für die neue PayPal Ratenzahlung. Das Beste daran: Mit diesem Modul kannst du alle Produkte einzeln oder gleichzeitig in deinem Online-Shop nutzen.\n\n<br /></p><p><br /></p><h2>Die Bestandteile des Multiproduct-Moduls:<br /></h2><h3>1. PayPal Checkout</h3><p>Optimiere deine Geschäftsabläufe mit einer einfachen, aber leistungsstarken Lösung. Mit dem neuen PayPal Checkout können deine Kunden mit PayPal, „Später bezahlen“-Optionen*, Rechnungskauf* oder Kredit- bzw. Debitkarte bezahlen.  Zudem bietet PayPal Checkout mehr als neun weitere lokale Zahlarten: Während Kunden hierzulande beispielsweise mit Giropay oder Sofort bezahlen, können Kunden aus den Niederlanden wie gewohnt iDeal nutzen.</p><p><br /></p><p><b>PayPal Checkout mit neuem Rechnungskauf</b><b>:</b></p><p>Du bietest deinen Kunden den Kauf auf Rechnung mit PayPal PLUS an? Der derzeitige Kauf auf Rechnung als Teil von PayPal PLUS wird am 30. September 2022 eingestellt. </p><p>Um deinen Kunden auch weiterhin den Rechnungskauf anbieten zu können, kannst du in nur wenigen Schritten zum neuen PayPal Checkout wechseln. Wie schon beim Kauf auf Rechnung bei PayPal PLUS zahlen deine Kunden auch beim Rechnungskauf als Teil von PayPal Checkout erst nach 30 Tagen, du erhälst dein Geld von PayPal jedoch sofort.</p><p>PayPal Checkout ermöglicht deinen Kunden auch den beliebten Rechnungskauf. Viele Menschen schätzen diese Zahlart, denn die Eingabe sensibler Zahlungsdaten entfällt und die Ware kann in Ruhe geprüft werden. Der Rechnungskauf ist eine bequeme Lösung für alle: Deine Kunden zahlen erst nach 30 Tagen, aber du erhälst dein Geld von PayPal sofort. Hierfür brauchen deine Kunden nicht mal ein PayPal-Konto*.</p><p><a href=\"https://www.shopware.com/de/news/paypal-launcht-neues-produkt/\" target=\"_blank\" rel=\"noreferrer noopener\">Jetzt zu PayPal Checkout wechseln!</a><br /></p><p><br /></p><h3>2. PayPal Express Button</h3><p>Mit dem PayPal Express Button gestaltest du den Bezahlweg für deine Kunden schneller, bequemer und reibungsloser: Mit nur einem Klick gelangen deine Kunden zur PayPal-Bezahlseite. Zusätzlich kannst du den Bezahlvorgang mit dem PayPal Express Button verkürzen, damit deine Kundne ohne Umwege direkt von der Produktansicht zur Bezahlung mit PayPal gelangen. So kannst du problem- und kostenlos mehr Kaufabschlüsse generieren – natürlich optimiert für mobiles Bezahlen auf Smartphones und Tablets.</p><p><b>Mehr Informationen gibt es <a href=\"https://www.paypal.com/de/webapps/mpp/merchant\" target=\"_blank\" rel=\"noreferrer noopener\">hier</a>.</b></p><p><b><br /></b></p><h3>3. PayPal Ratenzahlung und Bezahlung nach 30 Tagen</h3><p>Die PayPal Ratenzahlung und Bezahlung nach 30 Tagen sind in PayPal Checkout bereits enthalten*.  Für dich als Händler entstehen dabei keine zusätzlichen Kosten. Steigere deine Umsatzchancen und gleichzeitig die Kaufkraft deiner Kunden, indem du flexible Zahlungsoptionen anbietest. DeineKunden können für ihre Einkäufe bequem in 3–24 monatlichen Raten bezahlen und Du erhältst dein Geld sofort.</p><p>Für dich als Händler entstehen dabei keine zusätzlichen Kosten. Steigere deine Umsatzchancen und gleichzeitig die Kaufkraft deiner Kunden, indem du flexible Zahlungsoptionen anbietest. Deine Kunden können für ihre Einkäufe bequem in 3–24 monatlichen Raten bezahlen und Du erhältst dein Geld sofort.<br /></p><p><br /></p><p><b>PayPal Ratenzahlung</b>*<br />Mit der PayPal Ratenzahlung haben deine Kunden jetzt die Auswahl zwischen 3, 6, 12 und 24 Monatsraten. Zusätzliche Kaufanreize schaffst du mit der optionalen 0%-Finanzierung. Das bietet deinen Kunden finanzielle Flexibilität – und dir die Chance auf größere Umsätze.</p><p><b>Bezahlung nach 30 Tagen</b>*</p><p>PayPal ermöglicht deinen Kunden beim Kauf die Bezahlung nach 30 Tagen, damit die bestellte Ware in Ruhe geprüft werden kann. Dir entstehen dabei nur die üblichen Kosten für die Nutzung der Zahlungs-Dienstleistungen von PayPal – Dein Geld erhälst du unmittelbar nach Eingang der Bestellung.</p><h3><br /></h3><h3>Steigere deine Conversion mit dynamischen Bannern</h3><p>Mit PayPal Checkout kannst du deine Kunden mit Bannern auf deinen Produktseiten über die Verfügbarkeit von „Später bezahlen“-Optionen informieren. 51% der Käufer nutzen “Später bezahlen”-Optionen, wenn sie im Einkaufsprozess frühzeitig darauf aufmerksam gemacht werden.**</p><p>--- </p><p>* Qualifikation und Verfügbarkeit abhängig von Händlerstatus, Branche und Integration. Kundenverfügbarkeit vorbehaltlich Kreditwürdigkeit.</p><p>** TRC Online-Studie, beauftragt von PayPal, April 2021 (mit 1.000 Verbrauchern ab 18 Jahren in ganz DE; n=342)</p><br /><p></p><p><strong></strong></p>","installationManual":"<p>Hier finden Sie Hilfe zur Einrichtung: <a href=\"https://docs.shopware.com/de/shopware-6-de/plugins/paypal\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/plugins/paypal</a></p><p>Die PayPal-Ratenzahlungsoption wird Ihren Kunden automatisch mit Bannern in Ihrem Online-Shop angezeigt. Sie können diese Zahlungsmöglichkeit aktivieren oder deaktivieren. </p>","version":"7.2.1","changelog":[{"version":"7.2.1","text":"<ul><li>PPI-797 - Fixes an issue, where Zettle product sync could fail due to failing image sync</li></ul>","creationDate":{"date":"2023-07-17 14:31:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"7.2.0","text":"<ul><li>PPI-769 - Add Pay Later button to Express checkout shortcut</li><li>PPI-773 - The settings page is now structured in tabs</li><li>PPI-788 - Move logging to default Symfony logging to improve in larger environments</li></ul>","creationDate":{"date":"2023-06-12 14:39:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"7.1.0","text":"PPI-679 - Pay upon invoice payment details are now shown in the order details<br />\nPPI-762 - Several payment methods are now available in non-PPCP markets<br />PPI-767 - Added additional plugin information to transaction details","creationDate":{"date":"2023-05-25 09:47:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"7.0.1","text":"PPI-757 - Fixes an issue, where payments of APM payment methods could be created as duplicates","creationDate":{"date":"2023-04-06 09:34:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"7.0.0","text":"PPI-755 - Add Shopware 6.5 compatibility again","creationDate":{"date":"2023-03-24 09:08:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.2.0","text":"PPI-769 - Add Pay Later button to Express checkout shortcut<br />\n\nPPI-773 - The settings page is now structured in tabs<br />","creationDate":{"date":"2023-06-14 15:19:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.1.0","text":"PPI-679 - Pay upon invoice payment details are now shown in the order details<br />\n\nPPI-762 - Several payment methods are now available in non-PPCP markets<br />\n\nPPI-767 - Added additional plugin information to transaction details<br />","creationDate":{"date":"2023-05-25 10:10:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.0.3","text":"PPI-757 - Fixes an issue, where payments of APM payment methods could be created as duplicates<br />\n\nPPI-761 - Fixes an issue, where PayPal PLUS payments could not be created<br />","creationDate":{"date":"2023-04-06 08:58:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.0.2","text":"PPI-430 - Improved processing of Zettle synchronisation<br />\n\nPPI-659 - Added custom Storefront routes to adjust for missing Store API Client in Storefront in 6.5<br />\n\nPPI-685, PPI-701, PPI-725 - Removed auto-hide for Smart Payment Buttons configuration in Administration<br />\n\nPPI-751 - Fixes an issue with incompatibility with other plugins such as B2B suite and Customized Products<br />\n\nPPI-753 - Fixes an issue, where template extensions were not possible in the meta block<br />\n\nPPI-754 - Fixes an issue, where Storefront assets were not working with Shopware 6.4 (Shopware 6.5 supported has been temporarily dropped)<br />","creationDate":{"date":"2023-03-22 10:48:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.6","text":"PPI-748 - Disable Trustly for now since PayPal has dropped API support<br />\n\nPPI-749 - Fixes an issue, where the fallback button for credit card payments was not processed correctly<br />","creationDate":{"date":"2023-03-20 09:10:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.5","text":"PPI-734 - Fixes an issue, where some payment methods were not displayed in after order process<br />\n\nPPI-720, PPI-741, PPI-743 - Fixes an issue, where the total tax amount was calculated incorrectly for net customers<br />","creationDate":{"date":"2023-02-20 10:54:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.4","text":"PPI-734 - Fixes an issue, where some payment methods were not displayed in after order process<br />\n\nPPI-735 - Fixes an issue, where payment details were not shown on orders, where PayPal was not the first chosen payment method<br />\n\nPPI-737 - Fixes an issue, where the order / payment details were not correctly transferred to PayPal<br />","creationDate":{"date":"2023-02-02 10:46:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.3","text":"PPI-654 - Fixes an issue, where Zettle sync errors were not displayed<br />\n\nPPI-661 - Small performance improvements<br />\n\nPPI-718 - Fixes an issue, where onboarding for specific Sales Channel configurations could not be completed<br />\n\nPPI-733 - Fixes an issue, where the Sandbox flag was not correctly respected in specific Sales Channel configurations<br />","creationDate":{"date":"2023-01-18 08:45:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.2","text":"PPI-723 - Fixes an issue, where some APM payment methods did not work sometimes due to unannounced PayPal API changes<br />\n\nPPI-724 - Fixes an issue, where the payment could fail if PayPal did not send full capture / authorization details<br />","creationDate":{"date":"2022-12-13 13:26:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.1","text":"PPI-716 - Fixes an error during the update if availability rules are still in use<br />","creationDate":{"date":"2022-10-18 09:35:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.4.0","text":"PPI-707 - Fixed issue where checking out with \"Pay Later\", \"SEPA\" and \"Venmo\" result in an error<br />\n\nPPI-712 - Improved handling of payment method availability, removed availability rules<br />\n\nPPI-713 - Improved 3D Secure handling in credit card payments<br />","creationDate":{"date":"2022-10-11 14:28:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.3.2","text":"PPI-709 - Fixed issue where PayPal was not installable, if the default language was neither English nor German<br />","creationDate":{"date":"2022-09-27 13:11:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.3.1","text":"PPI-672 - Fixed issue where captures could not always set transactions to paid<br />\n\nPPI-681 - Fixed issue where Pay Later was not available for British and Australian customers<br />\n\nPPI-681 - Fixed issue where Oxxo was not available for Mexican customers<br />\n\nPPI-682 - Fixed issue with missing German translations in the administration<br />\n\nPPI-684 - Improved spelling in the Administration<br />\n\nPPI-688 - Fixed issue where the default carrier field in shipping methods was not always shown<br />\n\nPPI-694 - Fixed issue where the default carrier field was shown in non-PayPal orders<br />\n\nPPI-695 - Fixed issue ignoring excluded products per sales channel<br />\n\nPPI-700 - Changed API URL to PayPal from `api.paypal.com` to `api-m.paypal.com` to increase performance<br />\n\nPPI-702 - Fixed issue where payment details of non-PayPal-wallet payments were not always visible<br />","creationDate":{"date":"2022-09-26 12:02:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.3.0","text":"PPI-627 - Added new payment methods \"Pay Later\" and \"Venmo\"<br />\n\nPPI-673 - Added automatic transmission of shipping tracking numbers to PayPal<br />\n\nPPI-677 - Improved availability of payment methods in Administration<br />\n\nPPI-678 - Fixed issue with Zettle Media URL field in the Administration<br />","creationDate":{"date":"2022-08-22 10:28:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.2.0","text":"PPI-625 - Added compatibility for new payment method overview of Shopware 6.4.14.0<br />\n\nPPI-663 - Fix issue where taxes were not correctly calculated for net orders<br />","creationDate":{"date":"2022-07-25 12:06:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.2","text":"PPI-664 - Improved 3D Secure handling in credit card payments<br />\n\nPPI-670 - Improved display of onboarding status in Administration<br />","creationDate":{"date":"2022-07-14 13:25:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.1","text":"PPI-657 - Cleaned up template `buy-widget-form`<br />","creationDate":{"date":"2022-05-30 11:33:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.1.0","text":"PPI-611 - Added possibility to exclude products and dynamic product groups from PayPal &amp; Express Checkout<br />\n\nPPI-617 - Fix issue where payment method authorizations were not correctly shown for Sales Channel specific settings<br />\n\nPPI-620 - Fix issue showing an incorrect webhook error message on saving settings without credentials<br />\n\nPPI-634 - Fix issue with shipping tax calculation for net customer groups<br />\n\nPPI-635 - Fix issue with incorrent Pay Upon Invoice data display in invoices<br />\n\nPPI-639 - The Sales Channel selection in the PayPal settings can now display more than 25 Sales Channels<br />\n\nPPI-648 - Improved handling of Smart Payment Buttons, when the JS is not loaded fast enough<br />\n\nPPI-649 - Fix issue where a partially refunded PayPal Plus payment was set to refunded in Shopware via Webhooks<br />\n\nPPI-650 - Increase compatibility to Shopware 6.4.3.0<br />","creationDate":{"date":"2022-05-25 14:54:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.4","text":"PPI-642 - Fix issue where payment status was not correctly fetched with credit card payments<br />","creationDate":{"date":"2022-05-05 09:01:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.3","text":"PPI-624 - Improved error handling in after order process<br />\n\nPPI-628 - Improves payment method choice if PayPal deems the buyer ineligible for certain methods<br />\n\nPPI-629 - Fix issue with payment details not showing for APIv1 payments such as PayPal Plus<br />","creationDate":{"date":"2022-04-19 11:26:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.2","text":"PPI-621 - Fix issue with the payment method overview missing in Shopware 6.4.7.0 or lower<br />\n\nPPI-623 - Fix an issue where a PayPal order cannot be created with discounts<br />","creationDate":{"date":"2022-04-04 10:47:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.1","text":"PPI-615 - Fix issue with missing German translations in the administration<br />","creationDate":{"date":"2022-03-31 14:13:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.0","text":"PPI-317 - Add separate credit card payment method<br />\n\nPPI-385 - Add new Pay Upon Invoice payment method<br />\n\nPPI-410 - Add separate APM payment methods<br />\n\nPPI-418 - Add compatibility for PHP 8.1<br />","creationDate":{"date":"2022-03-30 10:15:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.1","text":"PPI-395 - Removed snippets for deprecated PayPal products<br />","creationDate":{"date":"2022-01-12 08:19:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.1.0","text":"PPI-344 - Fix issue with invalid phone numbers with API v1 payments<br />\n\nPPI-346 - Fix rounding issues in payment capture modal in Administration<br />\n\nPPI-350 - Enable after order process for unconfirmed payments with Shopware 6.4.4.0 or greater<br />\n\nPPI-356 - Improved plugin extensibility<br />\n\nPPI-366 - Improved payment error handling<br />\n\nPPI-367 - Change wording of Sales Channel footer link text<br />","creationDate":{"date":"2021-11-23 08:07:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"PPI-252 - Improved error handling for Webhooks<br />\n\nPPI-327 - Improved data type structure<br />\n\nPPI-343 - Fixes error when the customer account name differs from the shipping address name<br />\n\nPPI-352 - Fixes issue with failing Zettle webhooks on POS sale<br />","creationDate":{"date":"2021-10-06 15:31:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"PPI-5 - Implement Set PayPal as default payment method in First Run Wizard<br />\n\nPPI-77 - Replaced snippets in administration by `global.defaults`<br />\n\nPPI-126 - Improved error messaging for authorization errors in Zettle<br />\n\nPPI-270 - Express Checkout does not create duplicate guest customers anymore<br />\n\nPPI-293 - Improved PayPal script loading in Storefront<br />\n\nPPI-330 - Improve Zettle decimal precision behavior<br />\n\nPPI-334 - Fixes error on delayed capture in Administration<br />\n\nPPI-339 - Fixes duplicate external link symbols in Administration<br />","creationDate":{"date":"2021-08-18 15:37:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"PPI-228 - Added color white as choice for ECS and SPB buttons<br />\n\nPPI-321 - Improve Zettle synchronisation behaviour<br />\n\nPPI-322 - Improve removal of PayPal from available payment methods if credentials are invalid<br />\n\nPPI-323 - Fix issues with loading spinner with Smart Payment Buttons<br />\n\nPPI-329 - Fix rounding issues in PayPal API v2 requests<br />","creationDate":{"date":"2021-07-22 14:18:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.1","text":"PPI-316 - Fix issue when changing default language after plugin install<br />","creationDate":{"date":"2021-06-30 10:38:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"PPI-219 - Disable PayPal on Carts with total price of 0<br />\n\nPPI-227 - Add possibility to add a suffix to the order number sent to PayPal<br />\n\nPPI-281 - Improved storefront behaviour of Express Checkout &amp; Smart Payment Button cancellations and errors<br />\n\nPPI-287 - Fix issue where Express button was not shown in CMS buy box elements after variant switching<br />\n\nPPI-289 - Fix issue where the Express Checkout button could be visible to logged in customers<br />\n\nPPI-304 - Fix Smart Payment Buttons being visible with cart errors<br />","creationDate":{"date":"2021-06-22 14:22:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.1","text":"PPI-279, PPI-297 - Extends the partner referral API<br />\n\nPPI-290 - Improved extensibility<br />\n\nPPI-295 - Fix order details in administration not showing complete page<br />\n\nPPI-296 - Improved display of APMs in Footer<br />\n\nPPI-298 - Fix issues with loading spinner with Smart Payment Buttons<br />\n\nPPI-300 - It is no longer possible to select other payment methods on Express Checkout<br />","creationDate":{"date":"2021-06-16 13:18:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"PPI-262 - Fix issue where Express button was not shown in CMS buy box elements<br />\n\nPPI-271 - Fix an issue where updated settings did not correctly invalidate cache<br />\n\nPPI-277 - Fix issue where Express checkout failed on changes on confirm page<br />\n\nPPI-273 - Order number prefix is now always sent correctly<br />\n\nPPI-282 - Fix incompatibility with the Sendcloud plugin<br />\n\nPPI-283 - Removed extra confirm step with Smart Payment Buttons which correctly enables Alternative Payment Methods<br />","creationDate":{"date":"2021-06-10 15:27:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"PPI-246 - Added option for advanced logging<br />\n\nPPI-251 - Fix authorized transaction state on delayed payment collection<br />\n\nPPI-276 - Fix multiple unnecessary requests in the background with PayPal Plus<br />","creationDate":{"date":"2021-05-26 16:08:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"PPI-20 - Fix Webhooks when payment status is already set identically<br />\n\nPPI-235 - Fix Webhooks not correctly registered for separate Sales Channel credentials<br />\n\nPPI-238 - Fix issue with order not being linked in disputes of Plus payments<br />\n\nPPI-243 - Added more PayPal-specific transaction data to custom fields<br />\n\nPPI-265 - Fix encoding on shortened Zettle product descriptions<br />","creationDate":{"date":"2021-05-10 16:17:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"NEXT-15014 - Improve ACL handling<br />","creationDate":{"date":"2021-04-29 15:31:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"PPI-65 - Improved compatibility for Shopware 6.4 with Zettle<br />\n\nPPI-255 - Fix Express checkout if data protection checkbox is required<br />\n\nPPI-263 - Das Plugin ist jetzt valide für den Konsolenbefehl `dal:validate`<br />","creationDate":{"date":"2021-04-29 11:05:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"PPI-65 - Added compatibility for Shopware 6.4<br />\n\nPPI-239 - Rebranded iZettle to Zettle<br />","creationDate":{"date":"2021-04-16 13:49:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.6","text":"PPI-273 - Order number prefix is now always sent correctly<br />","creationDate":{"date":"2021-06-04 15:20:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.5","text":"PPI-20 - Fix Webhooks when payment status is already set identically<br />\n\nPPI-235 - Fix Webhooks not correctly registered for separate Sales Channel credentials<br />\n\nPPI-238 - Fix issue with order not being linked in disputes of Plus payments<br />\n\nPPI-265 - Fix encoding on shortened Zettle product descriptions<br />","creationDate":{"date":"2021-05-10 16:16:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.4","text":"NEXT-15014 - Improve ACL handling<br />\n\nPPI-239 - Rebranding von iZettle auf Zettle<br />","creationDate":{"date":"2021-04-29 15:54:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.3","text":"PPI-256 - Fix canceling of finalized orders by using the browser history<br />","creationDate":{"date":"2021-04-13 10:43:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"PPI-244 - Fix issue on API authentication<br />\n\nPPI-221 - Fix issue with oversized product descriptions in Zettle<br />","creationDate":{"date":"2021-02-22 13:31:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"PPI-241 - Improve cancelling order transactions with the ScheduledTask<br />","creationDate":{"date":"2021-02-11 10:46:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"PPI-191 - Introduce PayPal disputes overview<br />","creationDate":{"date":"2021-02-09 14:02:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"PPI-211 - Fix sending of shipping address name to PayPal<br />\n\nPPI-222 - Add Express Checkout button to search page and wish list page<br />\n\nPPI-229 - Order transactions with a stale PayPal payment will be cancelled with a ScheduledTask<br />\n\nPPI-231 - Fix deletion of rule for payment upon invoice during uninstall<br />\n\nPPI-234 - Improve entity definition<br />","creationDate":{"date":"2021-02-08 17:07:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"PPI-208 - Fix redirect of cancelled Plus payment on Shopware 6.3.3.x<br />\n\nPPI-210 - Improve handling of promotions during Express Checkout<br />\n\nPPI-220 - Fix saving of customer telephone number on Express Checkout<br />\n\nPPI-223 - Solves an issue with Express Checkout button state<br />\n\nPPI-224 - Fix Express Checkout for Shopware versions prior 6.3.2.0<br />","creationDate":{"date":"2021-01-26 09:50:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"PPI-174 - Cart and order line items are now sent with their SKU<br />\n\nPPI-174 - Added events to adjust line items which are sent to PayPal<br />\n\nPPI-202 - Fix PayPal checkout for customers with net prices<br />","creationDate":{"date":"2020-12-09 15:16:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"PPI-199 - Improve webhook log messages<br />\n\nPPI-200 - Fix submitting of carts with discounts<br />","creationDate":{"date":"2020-11-26 14:09:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"PPI-171 - Message queue is now only used if there are iZettle Sales Channels<br />\n\nPPI-172 - Improve capturing and refunding process<br />\n\nPPI-177 - Fix PayPal Express Checkout buttons in product listings<br />\n\nPPI-185 - Improve error handling of the PayPal tab in the order module<br />\n\nPPI-194 - Fix deregister of webhooks on Sales Channel deletion<br />\n\nPPI-196 - Improve PayPal Plus checkout process<br />\n\nPPI-197 - Fix \"Submit cart\" functionality<br />","creationDate":{"date":"2020-11-26 10:40:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"PPI-182 - Improve webhook registration<br />\n\nPT-11875 - Migration to PayPal API v2 for the following features: PayPal, Express Checkout and Smart Payment Buttons<br />","creationDate":{"date":"2020-11-18 16:53:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.0","text":"PPI-159 - Added ACL privileges to the PayPal modules<br />\n\nPPI-161 - Fix credentials form in first run wizard<br />","creationDate":{"date":"2020-11-02 13:50:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.3","text":"PPI-67 - Reimplemented activation of webhooks<br />\n\nPPI-110 - Added restrictions set by PayPal for Alternative Payment Methods<br />\n\nPPI-114 - Minor onboarding process improvements<br />\n\nPPI-145 - Minor adjustments to settings page<br />\n\nPPI-151 - Fixes error with payments with already existing order numbers<br />\n\nPPI-158 - Fixes error during update to versions 1.7.0 or higher, if no configuration is available<br />","creationDate":{"date":"2020-10-27 10:19:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.2","text":"PPI-149 - Fixes error during communication with iZettle<br />","creationDate":{"date":"2020-10-15 14:23:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.1","text":"PPI-141 - Improve performance of API to PayPal<br />","creationDate":{"date":"2020-10-14 10:38:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.0","text":"PPI-1 - Fixes the mobile layout of checkout finish page for \"Pay Upon Invoice\"<br />\n\nPPI-68, PPI-118, PPI-136 - Improved API struct usage for third party extensions<br />\n\nPPI-69 - The Express button is now hidden, when the PayPal payment method is disabled.<br />\n\nPPI-97 - Fixes error during Express Checkout, if required fields are not sent by PayPal<br />\n\nPPI-124 - Fixes error display during communication with PayPal<br />\n\nPPI-128 - Fixes issue during Express Checkout, if changes are made on confirm page<br />\n\nPPI-130 - Adds new event, which is emitted when the Plus iFrame is loaded<br />\n\nPT-11048 - Introduce iZettle integration (Point of Sales)<br />","creationDate":{"date":"2020-10-07 10:37:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.4","text":"PPI-125 - Shopware 6.3.2.0 compatibility<br />","creationDate":{"date":"2020-09-24 15:14:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.3","text":"PPI-70 - Order number is now correctly submitted to PayPal for payments with Express Checkout, PLUS and Smart Payment Buttons<br />","creationDate":{"date":"2020-08-24 10:22:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.2","text":"PPI-46 - Fixes issue on refund without amount<br />\n\nPPI-47, PPI-48 - Enhancement of the PayPal API elements<br />","creationDate":{"date":"2020-08-17 14:04:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.1","text":"PPI-32, PPI-35 - Improve extensibility for third party plugins<br />\n\nPPI-36 - Add new PayPal API elements<br />","creationDate":{"date":"2020-08-10 15:02:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.0","text":"PT-11912 - Storefront snippets now get auto registered<br />\n\nPT-11920 - Shopware 6.3 compatibility","creationDate":{"date":"2020-07-24 09:57:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.3","text":"PT-11946 - Fix update with deactivated plugin<br />\n\nPT-11949 - Fix setting paypal as the default payment method in the settings menu for all Sales Channels<br />","creationDate":{"date":"2020-07-21 14:03:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.2","text":"PT-10491 - Removed internally used custom field entity for transaction IDs<br />\n\nPT-11627 - Order transactions now have the state \"In Progress\" when the payment process has been started<br />\n\nPT-11680 - Removed unknown Sales Channel types from selection in settings<br />\n\nPT-11681 - Fix order details header in Administration, if accessing payment details directly<br />\n\nPT-11860 - Fix order confirmation email language with PayPal Plus<br />\n\nPT-11888 - Minor performance improvement when creating a payment<br />\n\nPT-11903 - Fix failed transaction status for user-canceled PayPal Plus payments<br />\n\nPT-11928 - Limited length of text input fields in administration according to PayPal API<br />","creationDate":{"date":"2020-07-20 12:55:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.1","text":"PT-11884 - If PayPal is not available, Plus and Smart Payment Buttons are no longer loaded<br />","creationDate":{"date":"2020-07-08 09:00:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"PT-11669 - Add compatibility with the after order payment process<br />\n\nPT-11707 - Custom form parameter of the order confirm page are no longer ignored<br />\n\nPT-11748 - Fix redirect URL for PayPal Plus and Express Checkout. Changed webhook URL to be independent of a storefront<br />\n\nPT-11773 - Fix buying of Custom Products with PayPal<br />\n\nPT-11813 - Error handling for Express Checkout button<br />\n\nPT-11858 - Improved handling of multiple transactions per order<br />\n\nPT-11869 - Improved handling of payments which were cancelled by customers<br />","creationDate":{"date":"2020-07-06 11:07:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"PT-11519 - Registers webhooks with HTTPS<br />\n\nPT-11593 - Adds hint for \"Payment acquisition\" option to clarify usage with PayPal PLUS<br />\n\nPT-11704 - Fix displaying of Express Checkout Button on paginated product listing pages<br />\n\nPT-11706 - Country states are now saved on Express Checkout<br />\n\nPT-11717 - Adds PayPal cookies to the cookie manager<br />","creationDate":{"date":"2020-06-03 08:39:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"PT-10502 - Canceling the payment on the PayPal site no longer leads to errors<br />\n\nPT-11710 - Fix installation of plugin in environments where the default language is not de-DE or en-GB<br />","creationDate":{"date":"2020-05-20 15:45:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"PT-10640 - Fix SalesChannel api routes<br />\n\nPT-10897 - Locale code validation for Smart Payment Buttons and Express Checkout<br />\n\nPT-11294 - Error handling for Smart Payment Buttons<br />\n\nPT-11582 - Fix webhook registration<br />\n\nPT-11637 - Improve capture and refund workflow<br />","creationDate":{"date":"2020-05-18 17:25:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"NEXT-8322 - Shopware 6.2 compatibility<br />\n\nPT-10654 - Activate and set PayPal as default for the selected Saleschannel in the settings module<br />\n\nPT-11599 - Fixes a bug where PayPal Plus could not be configured individually per Saleschannel<br />","creationDate":{"date":"2020-05-11 11:55:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"PT-11540 - Corrects remaining amount for multiple partial refunds<br />\n\nPT-11541 - Improved behaviour of multiple partial refunds &amp; captures<br />\n\nPT-11606 - Shopware 6.2 compatibility","creationDate":{"date":"2020-04-28 09:17:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"PT-11710 - Fix installation of plugin in environments where the default language is not de-DE or en-GB<br />","creationDate":{"date":"2020-05-20 15:54:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"PT-10448 - Adds onboarding to get API credentials with PayPal login in settings module<br />\n\nPT-11292 - Adds possibility to enter separate credentials for sandbox mode in first run wizard<br />\n\nPT-11498 - Adds PayPal Express Button to QuickView from CMS Extensions plugin<br />\n\nPT-11550 - Fix usage of sandbox credentials after an update<br />","creationDate":{"date":"2020-03-18 16:33:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"PT-11233 - Do not show PayPal Express Button on the product detail page, if the product is in clearance<br />\n\nPT-11292 - Add possibility to enter separate credentials for sandbox mode<br />","creationDate":{"date":"2020-03-10 11:19:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"PT-11443 - Solves an issue with the error handling with the paypal credentials<br />\n\nPT-11475 - Improved processing of vouchers during checkout<br />","creationDate":{"date":"2020-03-02 13:03:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"PT-11276 - Add banner for advertising installments<br />","creationDate":{"date":"2020-02-11 11:32:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"PT-11181, PT-11275 - Add PayPal PLUS integration<br />\n\nPT-11277 - The cart and order number submitting is now active by default<br />","creationDate":{"date":"2020-01-28 11:18:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.13.0","text":"Shopware 6.1 compatibility","creationDate":{"date":"2019-12-10 13:22:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.12.0","text":"<ul><li>PT-10287 - Adds possibility to add the invoice number, description or reason while refunding an order</li><li>PT-10705 - The PayPal settings are now in an own administration module</li><li>PT-10771 - Improves displaying of Smart Payment Buttons</li><li>PT-10775 - Improves order transaction state handling</li><li>PT-10809 - Smart Payment Buttons can now be styled separately from Express Checkout Button</li><li>PT-10821 - Fixes error on sale complete webhook execution</li><li>NEXT-4282 - Reinstall of plugin does not duplicate configuration entries anymore</li></ul>","creationDate":{"date":"2019-10-09 16:56:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.11.2","text":"PT-10733 - Fixed problem when automatically fetching API credentials in first run wizard","creationDate":{"date":"2019-09-10 14:08:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.11.1","text":"<p>Several bugfixes for EA 1.1</p>","creationDate":{"date":"2019-08-22 15:27:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.11.0","text":"<ul><li>PT-10391 - Implement pay upon invoice</li><li>PT-10695 - Add error logging for API calls</li><li>PT-10702 - Changed URL for Smart Payment Buttons javascript</li><li>PT-10715 - Paypal is selected correctly again as payment method for Express Checkout</li><li>PT-10723 - Smart Payment Buttons now no longer complete the order directly</li><li>PT-10729 - The PayPal payment description now shows available payments with icons</li></ul>","creationDate":{"date":"2019-08-12 14:53:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.10.1","text":"<p>Improved link generation for Javascript API calls</p>","creationDate":{"date":"2019-07-17 17:22:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.10.0","text":"<p>Added onboarding for the first run wizard</p>","creationDate":{"date":"2019-07-15 16:45:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.9.0","text":"<p>First version of the PayPal integrations for Shopware 6</p>","creationDate":{"date":"2019-05-21 16:59:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Swag588949310744","redirectToStore":false,"lowestPriceValue":0}