{"id":8757,"name":"EmzPlatformStagingEnvironment","code":"Emz2686169189745","lastChange":{"date":"2023-07-18 11:16:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiCsDFy","examplePageUrl":"","moduleKey":"EmzPlatformStagingEnvironment","creationDate":{"date":"2019-05-13 17:23:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-08-27 14:23:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-08-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-01-04 15:08:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":579,"prefix":"Emz","name":"8mylez","website":"//8mylez.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod579_8mylez-logo-shopware.jpg"},"infos":[{"id":13621,"name":"Staging / Testumgebung (1 Klick Einrichtung)","description":"<b></b><i><b>Hinweis in eigener Sache</b><br>Wir stecken viel Knowhow, Leidenschaft und Arbeit in unsere Apps und sind stolz darauf Dir diese Erweiterung kostenlos anbieten zu können. Leider ist bei dieser App kein kostenloser Support enthalten. Wir bitten Dich das zu beachten, damit uns mehr Zeit bleibt, die wir für die Entwicklung von neuen, tollen Erweiterungen nutzen können.</i><h2><br>Schnelles Einrichten | Sicheres Testen | Risikofreies Arbeiten | Ohne Gefahr für Deinen Umsatz</h2><p></p><p>Mit der Staging / Testumgebung von 8mylez erstellst Du künftig Deine eigene Testumgebung mit nur wenigen Klicks. So kannst Du ohne viel Aufwand neue Apps, Themes oder Updates in Zukunft eigenständig testen.&nbsp;</p><p></p><h2>Funktionen und Eigenschaften im Überblick</h2><p></p><p>✔ <b>Einfache Einrichtung</b> | mit nur wenigen Klicks eine neue Testumgebung erstellen lassen</p><p>✔ <b>Automatisierte 1:1 Shop-Kopie</b> | vollständige Kopie des Livesystems inkl. Datenbank</p><p>✔ <b>Alte Staging mit einem Klick löschen</b> | schnelles entfernen alter Testumgebungen</p><p>✔ <b>Keine extra Appkosten</b> | Apps funktionieren ohne Zusatzlizenz auch auf der Staging</p><p>✔ <b>Ordner ausschließen</b> | Daten ausblenden die nicht benötigt werden, um Zeit &amp; Ressourcen zu sparen</p><p>✔ <b>Beliebig viele Testumgebungen</b> | Testen auf mehreren Umgebungen mit unterschiedlichen Datenbeständen</p><p>✔ <b>Notification in der Topbar</b> | so siehst Du, wo Du Dich befindest</p><p>✔ <b>Apache und nginx geeignet</b> | idealer Einsatz unabhängig vom verwendeten Webserver</p><p>✔ <b>Fokus auf das Wesentliche</b> | eine Testumgebung die funktioniert, ohne viel Schnick Schnack</p><p><b><br></b></p><h2>Vorteile der App</h2><ul><li><p><b>Risikofreies Arbeiten</b> - Egal welche Veränderung Du an Deinem Shop vornehmen möchtest, durch die Verlagerung der Arbeiten auf die Testumgebung gefährdest Du Dein Livesystem nicht.</p></li></ul><ul><li><p><b>Keine bösen Überraschungen</b> - Du möchtest ein neues Theme, Apps oder Updates in Deinen Shop einspielen? Teste es zuerst auf der Staging und prüfe dadurch vorher, ob es den Shop im schlimmsten Fall lahmlegt.</p></li></ul><ul><li><p><b>Keine Beeinträchtigung für Deine Kunden</b> - Durch das Arbeiten auf einer 1:1 Kopie Deines Shops, läuft der Betrieb in Deinem Livesystem selbst bei aufwändigen Tests ganz normal weiter.</p></li></ul><ul><li><p><b>Ausreichend Zeit für Fehlersuche &amp; Behebung</b> - Löse von nun an ganz entspannt Fehler, die Dir bei der Installation eines Themes, einer App oder eines Updates passiert sind. Dein Livesystem mach trotzdem weiterhin seinen Umsatz.</p></li></ul><ul><li><p><b>Keine überhasteten Backup-Einspielungen nötig</b> - Wenn Du auf einer Staging testest brauchst Du kein Backup, wenn etwas kaputt gegangen ist. Einfach mit wenigen Klicks die alte Staging löschen und eine neue erstellen lassen.</p></li></ul><p><br></p><h3>Zur Dokumentation:&nbsp;<a href=\"https://8my.io/nepNye\" target=\"_blank\" rel=\"noreferrer\" style=\"font-size: 14px; font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://8my.io/nepNye</a></h3><p></p><h2>Support</h2><p><b>✉ E-Mail: support@8mylez.com&nbsp;</b></p><p><b>✆ Telefon:&nbsp;</b><b>+49 (0) 5251 284 710</b></p><p><b><br></b></p><h2>Über 8mylez</h2><p>Wir glauben, dass Shopware DAS E-Commerce System der Zukunft ist. Aber wir glauben auch, dass ein gutes System ohne die richtige Betreuung nur noch halb so gut ist. Aus diesem Grund gibt es 8mylez. Wir möchten Dir den besten Service für Deinen Shopware Shop bieten und deshalb haben sich alle unsere 20 Mitarbeiter komplett auf dieses System spezialisiert.&nbsp;</p><p></p><p>Das heißt für Dich: Wir wollen Dich mit unseren Lösungen nachhaltig erfolgreich machen und Dir als starker Partner proaktiv zur Seite stehen. Egal ob es dabei um die Entwicklung von Apps &amp; Themes oder um die Optimierung Deines Shops im Sales Bereich geht. Um unsere hohe Qualität zu sichern arbeiten wir ausschließlich mit Entwicklern an den Standorten Paderborn &amp; Leipzig und verzichten auf jegliches Outsourcing.<br><i><a href=\"https://8mylez.com/\">www.8mylez.com</a></i><br></p><p></p>","installationManual":"<ol><li>Die App muss im Backend hochgeladen werden und kann direkt installiert werden</li><li>App aktivieren</li><li>Bei Ihrem Hoster eine Staging Datenbank anlegen</li><li>Neue Staging Umgebung unter \"Kataloge\" erstellen</li><li>Synchronisierung starten</li></ol><p><br></p>Die Staging ist nun unter der normalen Shop Url mit einem zusätzlichen \"/staging\", bzw. Ihrem gewählten Verzeichnisnamen erreichbar. Beispiel: www.meinshop.de/staging<br><br><strong>Sie können sich dann mit den normalen Daten unter <i>www.meinshop.de/staging/admin</i> anmelden und loslegen!</strong><br><br>Sollte dies nicht möglich sein kann es daran liegen, dass..<br><br>- Sie bei Nginx Servern eine entsprechende Shopware Konfiguration für die Staging hinterlegen müssen<br>- eine Modifikation der .htaccess Datei bei Apache Servern für Fehler sorgen kann<p><b>Weitere Informationen</b></p><ul><li>Wenn Sie eine zweite Staging Umgebung einrichten, bitte darauf achten, dass Sie die erste Staging Umgebung in der Konfiguration ausschließen</li><li>Sie können die Staging Umgebung vor fremden Zuschauen schützen, in dem Sie das Verzeichnis mit einem sogenannten htaccess Schutz versehen, wenn Sie einen Apache Webserver nutzen</li><li>Für Nginx Webserver gibt es einen ähnlichen Schutz, dieser muss in der Konfiguration gespeichert werden. Hierbei kann Ihnen Ihr Hoster helfen.</li><li>Wenn der Staging Shop nur von Suchmaschinen nicht erkannt werden soll, können Sie eine robots.txt Datei anlegen oder eine bereits bestehende bearbeiten</li><li>Sollte das Plugin nach einer Minute keine Erfolgsmeldung ausgeben, liegt das wahrscheinlich an Ihrem Timeout des PHP Skripts. Sie müssen den Timeout in der php.ini Datei erhöhen.</li></ul><br><p></p><p>Eine Staging Umgebung kann nur gelöscht werden, wenn die entsprechende Datenbank und der dazugehörige Ordner leer sind. Dies kann auf der Detailansicht einer Staging durchgeführt werden.&nbsp;</p>","shortDescription":"Unsere Staging App ermöglicht risikofreies arbeiten mit beliebig vielen Testumgebungen. Die App erstellt auf Knopfdruck 1:1 Spiegelungen des Live-Shops.","highlights":"Kostenlos\nAutomatische Einrichtung einer Testumgebung auf Knopfdruck\nApps, Themes &amp; Updates risikofrei testen\nBeliebig viele Testumgebungen einrichten\nUnterstützt von nginx und Apache Webservern","features":""},{"id":19191,"name":"Test environment (1 click install)","description":"<h2>Save Staging Environment | Saved Liveshop | Videotutorial | Support</h2><p><br /></p><p>With the Staging Environment from 8mylez are you and your Shopware Shop save!</p><p><br /></p><h3>Why should you use a staging environment?</h3><p>No matter if new updates, plugins or changes at your theme are necessary - sometime happens what has to happen. A bug creeps in, a little inattention, an incompatibility and the whole shop says goodbye.</p><p>In order to keep the pulse where it belongs, we have developed this plugin. It reflects your shop and provides a kind of test environment where you can test everything calmed before you do an open-heart surgery.</p><p><br /></p><h3>Advantages of a staging environment?</h3><ol><li>No harm to your customers</li><li>Working risk-free on themes, plugins, updates</li><li>No nasty surprises in the live shop after installing new plugins</li><li>Sufficient time for troubleshooting</li><li>No hasty backup recordings needed</li></ol><p></p><p></p><p><br /></p><h3>What if the staging stops working or is outdated?</h3><p>You can simply delete the old test environment in the plugin configuration with a click and create a new one.</p><p><br /></p><h3>How exactly is the new staging environment built?</h3><p>An accurate reflection of the Live Shop is created. This applies to the files as well as the database. The staging shop is completely separated from the live shop.</p><p>The files are copied to a subdirectory of the shop. By default we use 'staging', you can of course change the name in the plugin configuration.<br /></p><p>All installed and licensed plugins continue to work because the shop is located in a subfolder and the license domain is valid. So also new plugins can be bought and tested easily.</p><b>Note: If the plugin does not show a message after about 30 seconds, please increase the runtime of PHP in the php.ini file.</b><br /><br /><h3></h3><p><br /></p><h3>FAQ</h3><p>You have any Questions? Maybe others had this Questions too. So have a look at our FAQ Section: <a href=\"https://community.8mylez.com/shopware/testumgebung-1-klick-einrichtung-staging-faq-helpdesk/\">https://community.8mylez.com/shopware/testumgebung-1-klick-einrichtung-staging-faq-helpdesk/</a></p><p>Maybe the answer ist to find there :-)</p><p><br /></p><h3>You have Questions? Please contact us. Our Support will be there for you!</h3><p>We would be happy to help you out if you need help to install the Staging Plugin or have any other Questions about our Plugin.<br />E-Mail: support@8mylez.com</p><p>Phone: +49 5251 777 66 30</p><p><br /></p><p></p><h3>You want to know who we are?</h3>Take a look on our Website: <a href=\"https://8mylez.com/\" target=\"_blank\" rel=\"noreferrer noopener\">https://8mylez.com/</a><p></p><p></p><p><br /></p><p></p>","installationManual":"- The plugin must be uploaded in the backend and can be installed directly. <p></p><p></p><p>- Activate the plugin</p><p></p><p></p><p>- Create a staging database at your hosting</p><p></p><p></p><p>- Add new staging environment in \"Catalogues\"</p><p></p><p></p><p>- Synchronize files and database</p><p></p><p></p><p>- The staging environment is now accessible under the normal shop URL with a '/staging' appended or your chosen directory name.<br />Example www.myshop.de/staging</p><p><br /></p><p>- Log in at www.myshop.de/staging/admin with your liveshop backend data und get started.</p><p><br /></p><p>- If this is not possible, it may be that you have to deposit a corresponding Shopware configuration for staging on Nginx servers.</p><p><br /></p><p>- If you are setting up a second staging environment, be sure to exclude the first staging environment in the configuration.</p><p>- You can protect the staging environment from outside viewers by providing the directory with a htaccess protection when using an Apache web server. There is a similar protection for the Nginx web server. This must be saved in the configuration. Your hoster can certainly help you here. If the staging shop should not get recognized by the search engines, you can create a robots.txt or edit an existing one.</p><p>- If the plugin does not give a success message after a minute, it is probably due to your PHP script timeout. You need to increase the timeout in the php.ini file. If you have questions about this topic, your hoster can certainly help you.</p><p><br /></p><p>- A staging environment can only be deleted if the database and folder are empty</p>","shortDescription":"Risk-free working with a test environment. Our plugin creates a reflection of your live shop. You can create as many test environments as you want to.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166998,"bookingKey":"Emz2686169189745","bookingText":"Test environment (1 click install)","price":249,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":166997,"bookingKey":"Emz2686169189745_T","bookingText":"Test environment (1 click install)","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBFdxQw","preview":true,"priority":100,"id":46932},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2U5UZg","preview":false,"priority":90,"id":46931},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPnEJno","preview":false,"priority":80,"id":46933},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdkwYan","preview":false,"priority":70,"id":46935},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCxUnrH","preview":false,"priority":60,"id":46937},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCzZ2AV","preview":false,"priority":50,"id":46938},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfXhN6b","preview":false,"priority":40,"id":46939},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6svuZl","preview":false,"priority":30,"id":46940},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwaIVkx","preview":false,"priority":20,"id":46936},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpY8d5oT","preview":false,"priority":10,"id":46869},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxUxpDS","preview":false,"priority":5,"id":47808},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpt8tabp","preview":false,"priority":0,"id":46934}],"comments":[{"authorName":"HN","text":"","headline":"Leider nicht optimal","creationDate":{"date":"2023-06-06 12:10:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Innomall Gmbh","text":"Wir sind rundum zufrieden empfehlen aber auch sich diese Plugins immer von einem kompetenten Partner einrichten zu lassen. https://www.pixupmedia.com/ in Berlin hat für uns wunderbar dieses Plugin auf www.laserstar.rocks integriert und all unsere Wünsche an den Shop restlos zufrieden stellend erfüllt.","headline":"Zufrieden","creationDate":{"date":"2023-04-24 08:32:16.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Stefan Schulz","text":"Funktioniert bei mir nicht ggf. wegen Pickware Erweiterung","headline":"Geht nicht","creationDate":{"date":"2023-03-01 17:05:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Lukas Brandl","text":"","headline":"Gutes Plugin","creationDate":{"date":"2022-05-18 15:52:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"Patrik","text":"Ich habe mich sehr gefreut, als ich diese Erweiterung gefunden habe. Die Installation klappte problemlos, sämtliche Dateien wurden in meinen den angelegten Ordner ../staging gepackt. Auch die Datenbank wurde fehlerfrei angelegt. Nur wenn ich dann auf die https://meine-website.ch/staging/ zugreifen möchte, erhalte ich lediglich eine 404 Fehlermeldung. Ich habe alles mögliche schon ausprobiert und auch den Tipp erhalten, ich solle einen Systemlink erstellen, der auf den Ordner verweist. Leider habe ich keine Ahnung wie ich einen solchen Systemlink erstellen kann, da ich Windows und nicht Linux User bin. :-( Schade das man nicht gegen Gebühr Support erhält, ich hätte die Erweiterung sehr gut verwenden können.","headline":"Stundenlanges Testen und dann nur ein 404 Fehler :-(","creationDate":{"date":"2022-02-23 10:22:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Peter","text":"So einfach kann es sein eine Staging Umgebung aufzusetzen. Wir testen jetzt jede Kleinigkeit erstmal im Staging. Die Dokumentation auf der Webseite ist sehr gut (Link in der Installationsanleitung). Wir hatten zunächst einen Fehler 404 in der Erreichbarkeit der Staging Umgebung aber eine Einstellungsänderung beim Server hat das Problem gelöst. \nSuper Plugin und mal wieder liefert 8mylez echten Wert für die Community.","headline":"Essenzielles Plugin für jeden Test","creationDate":{"date":"2022-01-25 16:22:27.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"ANTEGIS","text":"Die Installation und Bedienung des Plugins ist wirklich einfach und Benutzerfreundlich. Auf wenn die einzelnen Installationsschritte beim ersten mal nicht reibungslos durchlaufen. Das kopieren der Dateien hat 3 Anläufe gebraucht. Beim klonen der Datenbank hängt sich das Plugin auf. Die derzeit aktuelle Version (1.21) lässt sich so nicht benutzen. Das eingestellte PHP MemoryLimit liegt bei 1,5GB! und das Plugin stürzt dennoch ab weil es beim klonen der Datenbank nicht mehr Speicher bekommt. Eine Dokumentation ist nicht vorhanden, weder auf der Herstellerseite noch irgendwo im Plugin selbst.","headline":"Version 1.21 Out Of Memory Error","creationDate":{"date":"2021-05-28 12:28:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"Birgit","text":"das Plugin  hängt sich jedes Mal beim Klonen der Datenbank auf... es passiert einfach nichts. HTTP Error 500.\nLeider bietet der Pluginhersteller keinen Support an.","headline":"Leider funktioniert es nicht","creationDate":{"date":"2021-05-27 12:34:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Oliver","text":"Sehr gutes Plugin, \n\nich wünschte mir, dass man per CLI noch mehr Befehle hätte wie:\n\n- bin/console emzpse:list // Auflistung der hinterlegten Umgebungen\n- bin/console emzpse:start-sync-process  // mit Parameter, sodass man den Prozess mit nur einem Befehl starten kann\n\nWas noch gut wäre, dass automatisch eine Domain im Saleschannel hinterlegt wird. (Wir nutzen nicht den Unterordner, sondern eine Subdomain, die muss man händisch dann eintragen)\n\nIch hoffe, das Plugin wird immer weiter entwickelt :) \n\nViele Grüße","headline":"Tolles Plugin","creationDate":{"date":"2021-05-03 18:18:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Stephan Franck","text":"In Shopware 5 war es noch mühsam oder teuer eine Staging Umgebung zu erzeugen. Die ändert das Plugin nun komplett. Die Oberfläche ist sehr intuitiv und eine oder mehrere Staging Umgebungen können einfach per Klick erzeugt werden. Der Kontakt mit dem Hersteller war problemlos schnell und sehr hilfsbereit. Ich bin gespannt auf die Geplanten Neuerungen.","headline":"Staging made it simple","creationDate":{"date":"2020-12-22 09:04:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Jan-Philipp Georg","text":"Bin mit dem Plugin sehr zufrieden, sollte meiner Meinung nach nicht gratis sein :)\nAls Verbesserungsvorschlag habe ich noch:\n- Datenbank Klonen dauert sehr lang -&gt; vllt. hier eine Übersicht wie der Fortschritt ist\n- Wenn eine Datenbanktabelle größer ist, als der Arbeitsspeicher bricht die Migration ab\n- Automatisches setzen eines Symlinks im public Ordner des Live Systems\n- Automatisches Erstellen und Verwalten vom Verzeichnisschutz\nViele Grüße aus Paderborn!","headline":"Top Plugin für faule Webentwickler","creationDate":{"date":"2020-10-09 11:43:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Michael Schmidt","text":"Erlaubt schnell, eine (unverzichtbare!) Stagingumgebung zu erstellen.","headline":"Nützliches Plugin - erleichtert die Shoperstellung sehr!","creationDate":{"date":"2020-09-28 08:09:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":7,"label":"Staging / Testumgebung (1 Klick Einrichtung)","description":"<b></b><i><b>Hinweis in eigener Sache</b><br />Wir stecken viel Knowhow, Leidenschaft und Arbeit in unsere Apps und sind stolz darauf Dir diese Erweiterung kostenlos anbieten zu können. Leider ist bei dieser App kein kostenloser Support enthalten. Wir bitten Dich das zu beachten, damit uns mehr Zeit bleibt, die wir für die Entwicklung von neuen, tollen Erweiterungen nutzen können.</i><h2><br />Schnelles Einrichten | Sicheres Testen | Risikofreies Arbeiten | Ohne Gefahr für Deinen Umsatz</h2><p></p><p>Mit der Staging / Testumgebung von 8mylez erstellst Du künftig Deine eigene Testumgebung mit nur wenigen Klicks. So kannst Du ohne viel Aufwand neue Apps, Themes oder Updates in Zukunft eigenständig testen. </p><p></p><h2>Funktionen und Eigenschaften im Überblick</h2><p></p><p>✔ <b>Einfache Einrichtung</b> | mit nur wenigen Klicks eine neue Testumgebung erstellen lassen</p><p>✔ <b>Automatisierte 1:1 Shop-Kopie</b> | vollständige Kopie des Livesystems inkl. Datenbank</p><p>✔ <b>Alte Staging mit einem Klick löschen</b> | schnelles entfernen alter Testumgebungen</p><p>✔ <b>Keine extra Appkosten</b> | Apps funktionieren ohne Zusatzlizenz auch auf der Staging</p><p>✔ <b>Ordner ausschließen</b> | Daten ausblenden die nicht benötigt werden, um Zeit &amp; Ressourcen zu sparen</p><p>✔ <b>Beliebig viele Testumgebungen</b> | Testen auf mehreren Umgebungen mit unterschiedlichen Datenbeständen</p><p>✔ <b>Notification in der Topbar</b> | so siehst Du, wo Du Dich befindest</p><p>✔ <b>Apache und nginx geeignet</b> | idealer Einsatz unabhängig vom verwendeten Webserver</p><p>✔ <b>Fokus auf das Wesentliche</b> | eine Testumgebung die funktioniert, ohne viel Schnick Schnack</p><p><b><br /></b></p><h2>Vorteile der App</h2><ul><li><p><b>Risikofreies Arbeiten</b> - Egal welche Veränderung Du an Deinem Shop vornehmen möchtest, durch die Verlagerung der Arbeiten auf die Testumgebung gefährdest Du Dein Livesystem nicht.</p></li></ul><ul><li><p><b>Keine bösen Überraschungen</b> - Du möchtest ein neues Theme, Apps oder Updates in Deinen Shop einspielen? Teste es zuerst auf der Staging und prüfe dadurch vorher, ob es den Shop im schlimmsten Fall lahmlegt.</p></li></ul><ul><li><p><b>Keine Beeinträchtigung für Deine Kunden</b> - Durch das Arbeiten auf einer 1:1 Kopie Deines Shops, läuft der Betrieb in Deinem Livesystem selbst bei aufwändigen Tests ganz normal weiter.</p></li></ul><ul><li><p><b>Ausreichend Zeit für Fehlersuche &amp; Behebung</b> - Löse von nun an ganz entspannt Fehler, die Dir bei der Installation eines Themes, einer App oder eines Updates passiert sind. Dein Livesystem mach trotzdem weiterhin seinen Umsatz.</p></li></ul><ul><li><p><b>Keine überhasteten Backup-Einspielungen nötig</b> - Wenn Du auf einer Staging testest brauchst Du kein Backup, wenn etwas kaputt gegangen ist. Einfach mit wenigen Klicks die alte Staging löschen und eine neue erstellen lassen.</p></li></ul><p><br /></p><h3>Zur Dokumentation: <a href=\"https://8my.io/nepNye\" target=\"_blank\" rel=\"noreferrer noopener\">https://8my.io/nepNye</a></h3><p></p><h2>Support</h2><p><b>✉ E-Mail: support@8mylez.com </b></p><p><b>✆ Telefon: </b><b>+49 (0) 5251 284 710</b></p><p><b><br /></b></p><h2>Über 8mylez</h2><p>Wir glauben, dass Shopware DAS E-Commerce System der Zukunft ist. Aber wir glauben auch, dass ein gutes System ohne die richtige Betreuung nur noch halb so gut ist. Aus diesem Grund gibt es 8mylez. Wir möchten Dir den besten Service für Deinen Shopware Shop bieten und deshalb haben sich alle unsere 20 Mitarbeiter komplett auf dieses System spezialisiert. </p><p></p><p>Das heißt für Dich: Wir wollen Dich mit unseren Lösungen nachhaltig erfolgreich machen und Dir als starker Partner proaktiv zur Seite stehen. Egal ob es dabei um die Entwicklung von Apps &amp; Themes oder um die Optimierung Deines Shops im Sales Bereich geht. Um unsere hohe Qualität zu sichern arbeiten wir ausschließlich mit Entwicklern an den Standorten Paderborn &amp; Leipzig und verzichten auf jegliches Outsourcing.<br /><i><a href=\"https://8mylez.com/\">www.8mylez.com</a></i><br /></p><p></p>","installationManual":"<ol><li>Die App muss im Backend hochgeladen werden und kann direkt installiert werden</li><li>App aktivieren</li><li>Bei Ihrem Hoster eine Staging Datenbank anlegen</li><li>Neue Staging Umgebung unter \"Kataloge\" erstellen</li><li>Synchronisierung starten</li></ol><p><br /></p>Die Staging ist nun unter der normalen Shop Url mit einem zusätzlichen \"/staging\", bzw. Ihrem gewählten Verzeichnisnamen erreichbar. Beispiel: www.meinshop.de/staging<br /><br /><strong>Sie können sich dann mit den normalen Daten unter <i>www.meinshop.de/staging/admin</i> anmelden und loslegen!</strong><br /><br />Sollte dies nicht möglich sein kann es daran liegen, dass..<br /><br />- Sie bei Nginx Servern eine entsprechende Shopware Konfiguration für die Staging hinterlegen müssen<br />- eine Modifikation der .htaccess Datei bei Apache Servern für Fehler sorgen kann<p><b>Weitere Informationen</b></p><ul><li>Wenn Sie eine zweite Staging Umgebung einrichten, bitte darauf achten, dass Sie die erste Staging Umgebung in der Konfiguration ausschließen</li><li>Sie können die Staging Umgebung vor fremden Zuschauen schützen, in dem Sie das Verzeichnis mit einem sogenannten htaccess Schutz versehen, wenn Sie einen Apache Webserver nutzen</li><li>Für Nginx Webserver gibt es einen ähnlichen Schutz, dieser muss in der Konfiguration gespeichert werden. Hierbei kann Ihnen Ihr Hoster helfen.</li><li>Wenn der Staging Shop nur von Suchmaschinen nicht erkannt werden soll, können Sie eine robots.txt Datei anlegen oder eine bereits bestehende bearbeiten</li><li>Sollte das Plugin nach einer Minute keine Erfolgsmeldung ausgeben, liegt das wahrscheinlich an Ihrem Timeout des PHP Skripts. Sie müssen den Timeout in der php.ini Datei erhöhen.</li></ul><br /><p></p><p>Eine Staging Umgebung kann nur gelöscht werden, wenn die entsprechende Datenbank und der dazugehörige Ordner leer sind. Dies kann auf der Detailansicht einer Staging durchgeführt werden. </p>","version":"1.4.3","changelog":[{"version":"1.4.3","text":"<p>Compatibilty with 6.5</p>","creationDate":{"date":"2023-07-12 10:29:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>- Fix database synchronization error</p>","creationDate":{"date":"2022-06-21 10:29:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"- Fix for 6.4.7<p>- Change menu position to extensions subnavigation</p>","creationDate":{"date":"2022-01-12 11:20:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>- Compatibility for Shopware 6.4</p>","creationDate":{"date":"2021-06-04 14:18:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<p>- Split the console commands, to run them individually</p>","creationDate":{"date":"2021-02-12 02:28:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- Added console commands to sync existing staging environments</p>","creationDate":{"date":"2021-01-31 23:12:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>- A staging environment can only be deleted if the database and folder are empty</p>","creationDate":{"date":"2020-08-24 00:54:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- First release in store</p>","creationDate":{"date":"2020-07-30 03:20:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Emz2686169189745","redirectToStore":false,"lowestPriceValue":249}