{"id":8860,"name":"DvsnAffiliate","code":"dvsn756651919352","lastChange":{"date":"2023-07-25 08:00:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpk5UXe4","examplePageUrl":"","moduleKey":"DvsnAffiliate","creationDate":{"date":"2019-05-16 16:21:25.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-07-15 09:48:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-09-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-04-30 16:29:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":13739,"name":"Partnerprogramm / Provisionen für Kunden (Kunden werben Kunden / Affiliate)","description":"\n\n\n\n\n\n\n<h2>\nPartnerprogramm / Provisionen für Kunden\n</h2><p>\n\nMachen Sie Ihre Kunden zu wertvollen Werbepartnern!\n</p><p>\n\n\nDieses Plugin bringt Ihnen für Shopware 6 ein Partnerprogramm, das Sie eventuell\nnoch von Shopware 5 kennen. Zusätzlich wird das Partnerprogramm\njedoch erweitert, damit sich Ihre Kunden selber registrieren\nkönnen und für eine Provision für Sie bei Freunden, in Foren etc. werben. Dazu können sich Ihre\nKunden in ihrem Kundenkonto für das Partnerprogramm anmelden. Danach haben sie die Möglichkeit\nLinks zu generieren, die ihren Partnercode enthalten. Bestellungen, die über diesen Partnercode\ngeneriert werden, tauchen in der Statistik des Kunden auf. Je nach Einstellung wird dann eine\nProvision berechnet. Diese Provision können sich Ihre Kunden direkt als Gutschein einlösen und\nmit diesem Gutschein in Ihrem Shop einkaufen. Alternativ können Sie Auszahlungen in der Plugin\nKonfiguration aktivieren.\n\n</p><p>\nWer wird noch die Konkurrenz empfehlen, wenn er bei Ihnen ganz einfach eine Provision\nerhalten kann? Haben Sie evtl. sogar eine große Community, die z.B. in Foren aktiv\nist? Die Mitglieder dieser Community werden gezielt auf Ihren Shop verlinken und eine\nKaufempfehlung aussprechen. Eine bessere Werbung gibt es nicht!\n\n\n\n</p><p>\n\nEigene Links (inkl. eigenem Partnercode) können im Kundenkonto unter \"Partnerprogramm\"\ngeneriert werden. Ihr Partner kann einen beliebigen Link aus dem Shop nehmen\nund durch einen Button den eigenen Partner-Code einfach anhängen.\nDer Link kann nun einfach kopiert und verteilt werden.\n\n</p><p>\n\nAußerdem können Sie aktivieren, dass für den Partner automatisch ein\nPartner-Gutschein generiert wird.\nIhr Partner kann dann mit diesem Gutschein - z.B. 10 % Rabatt - weitere Kunden werben und locken.\nJeder Kunde, der diesen Gutschein verwendet, wird automatisch dem Partner zugewiesen.\n\n\n</p><h4>Zuordnung von Kunden zu Partnern</h4><p>\n\n\nDie Zuordnung von einem Partner zu einem angemeldeten / registrierten Kunden ist permanent.\nDas heißt, dass jede zukünftige Bestellung dem Partner zugewiesen und für den Partner\nprovisioniert wird. Wenn ein Neukunde den Shop über einen Partner-Link betritt, dann wird\nder Partner-Code in den Cookies des Kunden gespeichert (falls über Cookie Consent Manager\nbestätigt). Wenn sich der Neukunde anmeldet oder registriert, wird die Zuordnung\nzum Partner permanent gespeichert.\n\n\n\n</p><p>\n\n\nAlternativ können Sie auch die Plugin Konfiguration \"Zugewiesene Kunden dürfen von anderen Partnern abgeworben werden\"\naktivieren. In diesem Fall können andere Partner einen bereits zugewiesen Kunden\nabwerben - z.B. durch einen Partner-Link oder Partner-Gutschein - so dass zukünftige\nBestellungen für den neuen Partner provisioniert werden.\n\n\n\n</p><h4>Provision</h4><p>\n\n\nJedem Partner kann eine individuelle Provision zugewiesen werden. Diese kann entweder prozentual\n(z.B. 5%) oder absolut (z.B. 5,- EUR) sein. Zudem können Sie pro Produkt und Kategorie\nindividuelle Provisionen definieren. Sollte für ein Produkt und einer der zugewiesenen\nKategorien eine individuelle Provision definiert sein, dann hat die Provision am Produkt\ndie höchste, die Provision der Kategorie die zweithöchste und die Provision\ndes Partners die niedrigste Priorität. Sollte ein Abschlag, ein Gutschein, ein Rabatt o.ä. mit einem\nnegativen Betrag die Summe der Bestellung reduzieren, dann wird dieser Abzug immer auf\nalle Positionen der Bestellung verteilt - und die Provision pro Produkt\nwird auf Basis des reduzierten Preises kalkuliert.\n\n</p><p>\n\n\nZusätzlich können Sie definieren, ob und in welcher Höhe Folgebestellungen provisioniert werden\nsollen. So können nur die erste Bestellung eines geworbenen Neukunden provisionieren oder Sie\nreduzieren die Provision auf einen geringeren Satz für weitere Bestellungen.\n\n</p><p>\n\nDie Provision wird immer anhand der Netto-Verkaufspreise berechnet - ohne Versandkosten.\n\n</p><p>\n\nEigene Bestellungen eines Partners werden üblicherweise ebenfalls provisioniert, falls\nder Partner (z.B. für einen Test) den eigenen Partner-Link nutzt, um sich selber\nzu werben. In der Plugin Konfiguration können Sie die Provision für eigene Bestellungen\ndeaktivieren. Beachten Sie jedoch, dass ein Partner z.B. über Gast-Konten\noder Freunde/Verwandte bestellen kann. Hier empfehlen wir, dass Sie den Partner\nin den AGB darauf hinweisen, dass er sich nicht selber werben darf.\n\n</p><h4>Partner-Code und Gutscheine</h4><p>\n\nJe nach Plugin Konfiguration kann der Partner seinen Partner-Code und sogar den Gutschein-Code\nfrei wählen oder ändern. Es ist jedoch zu empfehlen, dass diese Änderungen immer erst\nin der Administration freigeschaltet werden müssen. So kann der Partner jedoch z.B. seinen\neigenen Namen oder sein Instagram Profil als Partner-Code oder als Gutschein wählt.\n\n</p><h4>Teilnahme am Partnerprogramm</h4><p>\n\nSie können die Voraussetzungen für die Anmeldung am Partnerprogramm definieren. So können\nSie z.B. Kundengruppen ausschließen oder einen Mindest-Umsatz voraussetzen.\nZudem können Sie definieren, ob sich jeder Kunde vollautomatisch anmelden darf\noder ob ein Kunde eine Art \"Bewertung\" schreiben soll. Dazu kann er einen beliebigen Partner-Code\nangeben und einen freien Kommentar schreiben. Jede Bewerbung muss dann manuell\nin der Administration freigeschaltet werden.\n\n</p><h4>Provisionsfähige Bestellungen</h4><p>\n\nDamit eine Bestellung eine Provision für einen Partner generiert, muss diese\nbestimmte Voraussetzungen erfüllen. So können Sie z.B. angeben, dass eine Bestellung\nmindestens 14 Tage alt sein muss, die Bestellung den Status \"Abgeschlossen\" haben soll und Händler ausgeschlossen sind.\n</p><h4>Auszahlung der Provision</h4><p>\n\nSie können in der Plugin Konfiguration definieren, wie Sie Ihre Kunden belohnen möchten.\nEntweder können Ihre Kunden Gutscheine selber generieren und einlösen - oder sie können eine\nAuszahlung anfordern, die Sie wiederum manuell überweisen müssen. Sie geben vor welche\nGutscheine zur Verfügung stehen oder in welcher Höhe Auszahlungen angefordert werden dürfen.\nSo können Sie selbstständig bis zu fünf Staffeln anlegen - z.B. 10,- Euro, 50,- Euro usw.\n</p><p>\nWenn Sie als Art der Vergütung Gutscheine wählen, dann können Ihre Kunden selbstständig\nGutscheine generieren und einlösen. Sie haben keinerlei Mehraufwand! Außerdem können\nSie sämtliche Regeln der Gutscheine definieren - z.B. Beschränkung auf Shop, Hersteller etc.\n\n</p><p>\nEine Auszahlung der Provision ist insbesondere im B2B Bereich sinnvoll.\nIhre Kunden können in bis zu fünf frei wählbaren Staffelungen Auszahlungen anfordern.\nDazu geben Ihre Kunden zusätzlich ihre Kontoverbindung an.\nDie beantragten Auszahlungen sehen Sie ebenfalls in der Administration im Menüpunkt\n\"Auszahlungen\". Jede überwiesene Auszahlung müssen Sie als \"Ausgezahlt\" markieren.\nNeben einer festen Staffelung können Sie zudem aktivieren, dass sich jeder Partner\ndie komplett verfügbare Provision direkt auszahlen lassen kann.\n\n</p><h4>Influencer</h4><p>\n\nAuf Wunsch können Sie Ihren Kunden innerhalb des Bestellprozesses auch Informationen\nzum eigenen Partner liefern. Zusätzlich können Ihre Kunden über ein Eingabefeld\nden Partner-Code manuell eingeben. So können z.B. Influencer Ihren Partner-Code\nvia Instagram o.ä. teilen und die Kunden können diesen manuell eingeben.\n\n</p><h4>Email Benachrichtigungen</h4><p>\n\nSie können in der Plugin Konfiguration zahlreiche Email Benachrichtigungen\naktivieren. So können Sie z.B. per Email informiert werden, sobald sich ein\nneuer Partner registriert oder eine Auszahlung beantragt wurde.\n\n</p><h4>Administration</h4><p>\n\nDas Plugin liefert einen neuen Menüpunkt für die Administration.\nSo können Sie nicht nur jederzeit sehen, welche Kunden für Sie werben oder wie hoch die Umsätze\nsind - sondern Sie können z.B. auch die Provision für besonders erfolgreiche Partner erhöhen.\nZudem haben Sie jederzeit ausführliche Statistiken für jeden Partner zur Verfügung.\n\n</p><h4>Partnerprogramm für Preisvergleiche</h4><p>\n\nDa Shopware 6 ein Partnerprogramm fehlt, können Sie das Plugin natürlich auch\nnutzen, um Erfolge anderer Portale (z.B. Google Shopping oder Idealo) zu messen.\nSie können Partner manuell anlegen (z.B. Google) und den Partner-Code\nan die Links hängen, die Sie in den Portalen verteilen. Das Partnerprogramm\nzeigt Ihnen dann sämtliche Statistiken übersichtlich und detailliert an.\n\n</p><h4>Ablauf für einen Partner</h4><ul><li>Ihre Kunden können sich selber am Partnerprogramm im Kundenkonto anmelden</li><li>das Plugin erzeugt für diesen Kunden im Partnerprogramm einen neuen Partner</li><li>dieser Partner wird mit der, in der Plugin Konfiguration festgesetzten Provision (z.B. 5%) geführt</li><li>je nach Plugin Konfiguration ist ein Partner direkt freigeschaltet oder muss manuell geprüft werden</li><li>Ihr Partner kann nun Partnerlinks generieren und an seine Freunde, auf Facebook etc. verteilen</li><li>falls aktiviert kann Ihr Partner auch Gutscheine verteilen, um den Kaufanreiz für geworbene Kunden zu erhöhen</li><li>seine Provision kann er jederzeit selber einsehen und in Gutscheine eintauschen oder eine Auszahlung anfordern</li></ul><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin erzeugt bei der Installation direkt drei Partner-Gutscheine</li><li>Sie können weitere Gutscheine anlegen oder die erzeugten Gutscheine nach Ihren Wünschen anpassen</li><li>bitte beachten Sie, dass Gutscheine einen absoluten Rabatt haben und dass Sie \"individuelle Gutscheincodes verwenden\" aktiviert haben</li><li>bitte generieren Sie keine Gutscheincodes und verwenden Sie keine mehrfachen Rabatte oder Rabatte mit unterschiedlichen Währungen</li><li>in der Plugin Konfiguration wählen Sie neu angelegte Gutscheine aus</li><li>prüfen Sie gültige Kundengruppen für Partner in der Plugin Konfiguration</li><li>prüfen Sie die Bedingungen für provisionsfähige Bestellungen in der Plugin Konfiguration</li><li>das Alter der Bestellung gibt die Tage seit der Bestellung an - und nicht seit dem Versand. Achten Sie also auf einen ausreichend großen Puffer (z.B. wegen Rücksendungen)</li></ul><br /><br /><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>\n\n\n","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin erzeugt bei der Installation direkt drei Partner-Gutscheine</li><li>Sie können weitere Gutscheine anlegen oder die erzeugten Gutscheine nach Ihren Wünschen anpassen</li><li>bitte beachten Sie, dass Gutscheine einen absoluten Rabatt haben und dass Sie \"individuelle Gutscheincodes verwenden\" aktiviert haben</li><li>bitte generieren Sie keine Gutscheincodes und verwenden Sie keine mehrfachen Rabatte oder Rabatte mit unterschiedlichen Währungen</li><li>in der Plugin Konfiguration wählen Sie neu angelegte Gutscheine aus</li><li>definieren Sie gültige Kundengruppen für Partner in der Plugin Konfiguration</li><li>definieren Sie gültige Bestellungen für Kunden in der Plugin Konfiguration</li><li>das Alter der Bestellung gibt die Tage seit der Bestellung an - und nicht seit dem Versand. Achten Sie also auf einen ausreichend großen Puffer (z.B. wegen Rücksendungen)</li></ul>","shortDescription":"Machen Sie Ihre Kunden zu wertvollen Werbepartnern - Kunden werben Kunden. Ihre Werber können entweder direkt Gutscheine für Ihren Shop bekommen oder ausgezahlt werden.","highlights":"","features":""},{"id":19065,"name":"Partner program / affiliate / commissions for customers","description":"<h2>\nPartner program / affiliate / commissions for customers\n</h2><p>\n\nTurn your customers into valuable advertising partners!\n</p><p>\n\n\nThis plugin brings you an affiliate program for Shopware 6, which you may\nstill know from Shopware 5. Additionally the partner program\nbut extended, so that your customers register themselves\nand can advertise for a commission for you with friends, in forums etc. For this purpose your\nRegister customers in their customer account for the partner program. Afterwards they have the possibility\ngenerate links that contain your partner code. Orders placed via this partner code\nare generated, appear in the statistics of the customer. Depending on the setting, a\ncommission will be charged. Your customers can redeem this commission directly as a voucher and\nbuy with this coupon in your shop. Alternatively you can make withdrawals in the plugin\nActivate configuration.\n\n\n\n</p><p>\nWho will still recommend the competition, if he can easily get a commission\ncan get? Do you possibly even have a large community that is active in forums, for example\nis? The members of this community will specifically link to your shop and create a\nMake a buy recommendation. There is no better advertising!\n\n\n\n</p><p>\n\nOwn links (incl. own partner code) can be created in the customer account under \"Partner program\".\ncan be generated. Your partner can take any link from the shop\nand simply attach your own partner code with a button.\nThe link can now be easily copied and distributed.\n\n</p><p>\n\nYou can also activate that a\npartner voucher is generated.\nYour partner can then use this voucher - e.g. 10% discount - to attract and attract further customers.\nEvery customer who uses this voucher is automatically assigned to the partner.\n\n\n</p><p>\n\n\nThe assignment of a partner to a logged on / registered customer is permanent.\nThis means that every future order is assigned to the partner and\nis being provisioned. If a new customer enters the shop via a partner link, then\nthe partner code is stored in the customer's cookies (if the customer has been registered via Cookie Consent Manager\nconfirmed). When the new customer logs on or registers, the assignment\nto the partner permanently saved.\n\n\n\n\n\n</p><p>\n\nSince Shopware 6 lacks an affiliate program, you can of course use the plugin\nto measure the success of other portals (e.g. Google Shopping or Idealo).\nYou can create partners manually (e.g. Google) and enter the partner code\nto the links that you distribute in the portals. The Partner Program\nthen shows you all statistics in a clear and detailed way.\n\n</p><h4>You have various options for configuration</h4><ul><li>enable / disable the partner program per sales channel</li><li>Type of remuneration: by voucher or by payment</li><li>activate the partner program only for certain customer groups (e.g. only end customers)</li><li>what is the minimum turnover a customer must have made in order to be allowed to participate?</li><li>what is the percentage commission?</li><li>which orders count towards the commission? Age (in days), status and customer group of the order</li></ul><p>\n\nThe commission is always calculated on the basis of net sales prices - excluding shipping costs.\n\n</p><p>\n\nThe plugin provides a new menu item for the administration.\nSo you can not only see at any time which customers advertise for you or how much the sales\nbut you can also increase the commission for particularly successful partners, for example.\nIn addition, you have detailed statistics available for each partner at any time.\n\n</p><p>\n\nYou can define in the plugin configuration how you want to reward your customers.\nEither your customers can generate and redeem vouchers themselves - or they can use a\nrequest a payout, which you must then transfer manually. You specify which\nvouchers are available or in what amount withdrawals may be requested.\nSo you can independently create up to five scales - e.g. 10,- Euro, 50,- Euro etc.\n</p><p>\nIf you choose vouchers as the type of remuneration, your customers can\nGenerate and redeem vouchers. You do not have any additional expenses! Furthermore you can\nYou define all rules of the vouchers - e.g. restriction to shop, manufacturer etc.\n\n</p><p>\nPayment of the commission is particularly useful in the B2B sector.\nYour customers can request payouts in up to five freely selectable scales.\nYour customers also enter their bank account details.\nYou can also see the requested payouts in the administration under the menu item\n\"Payouts.\" You must mark every transferred payout as \"Paid out\".\n\n</p><h4>Procedure for a partner</h4><ul><li>your customers can log in to the partner program in the customer account themselves</li><li>the plugin creates a new entry / partner for this customer in the partner program</li><li>this partner is managed with the commission (e.g. 5%) set in the plugin configuration</li><li>if you want to change the commission for this partner, you can do this directly in the partner program individually per partner</li><li>your partner can now generate partner links and distribute them to his friends, on Facebook etc.</li><li>if activated, your partner can also distribute vouchers to increase the purchase incentive for referred customers</li><li>he can view his commission at any time and exchange it for vouchers or request a payout</li></ul><h4>Instructions</h4><ul><li>install the plugin</li><li>the plugin generates three partner vouchers directly during installation</li><li>you can create further vouchers or adapt the generated vouchers according to your wishes</li><li>please note that vouchers have an absolute discount and that you have activated \"use individual voucher codes\"</li><li>please do not generate coupon codes and do not use multiple discounts or discounts with different currencies</li><li>in the plugin configuration select newly created vouchers</li><li>define valid customer groups for partners in the plugin configuration</li><li>define valid orders for customers in the plugin configuration</li><li>the age of the order indicates the days since the order was placed - and not since the shipment. So make sure you have a sufficiently large buffer (e.g. because of returns)</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"<h4>Instructions</h4><ul><li>install the plugin</li><li>the plugin generates three partner vouchers directly during installation</li><li>you can create further vouchers or adapt the generated vouchers according to your wishes</li><li>please note that vouchers have an absolute discount and that you have activated \"use individual voucher codes\"</li><li>please do not generate coupon codes and do not use multiple discounts or discounts with different currencies</li><li>in the plugin configuration select newly created vouchers</li><li>define valid customer groups for partners in the plugin configuration</li><li>define valid orders for customers in the plugin configuration</li><li>the age of the order indicates the days since the order was placed - and not since the shipment. So make sure you have a sufficiently large buffer (e.g. because of returns).\n\n\n</li></ul>","shortDescription":"Turn your customers into valuable advertising partners - customers attract customers. Your advertisers can either receive vouchers for your shop directly or be paid out.","highlights":"","features":""}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160583,"bookingKey":"dvsn756651919352","bookingText":"Partner program / affiliate / commissions for customers","price":449.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":160582,"bookingKey":"dvsn756651919352_M","bookingText":"Partner program / affiliate / commissions for customers","price":69,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvlK6um","preview":true,"priority":9900,"id":80524},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpanqnuB","preview":false,"priority":9800,"id":90382},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGSGHrb","preview":false,"priority":9700,"id":90383},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpds2MbF","preview":false,"priority":9600,"id":90381},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaRHI3E","preview":false,"priority":8900,"id":90389},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRXCgu7","preview":false,"priority":8800,"id":90387},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFSrT1m","preview":false,"priority":8700,"id":90385},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdJMeHV","preview":false,"priority":8600,"id":90386},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoqwUTB","preview":false,"priority":8500,"id":90388},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0gC7Mo","preview":false,"priority":8400,"id":90384},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLMXq8Z","preview":false,"priority":7900,"id":90392},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUpTibC","preview":false,"priority":7800,"id":90393},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfyNzSo","preview":false,"priority":7700,"id":90394},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBzSVFi","preview":false,"priority":7600,"id":90391},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpsiLvF6","preview":false,"priority":7500,"id":90390},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpp0V9oN","preview":false,"priority":6900,"id":90380},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpRGZmqE","preview":false,"priority":6800,"id":90379},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMtFDdv","preview":false,"priority":5900,"id":80543},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYXggwR","preview":false,"priority":5800,"id":80540},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTmOfxG","preview":false,"priority":5700,"id":80542},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptbbFrE","preview":false,"priority":5600,"id":80541},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoNVLHi","preview":false,"priority":5500,"id":80539},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpk21xWD","preview":false,"priority":4900,"id":80547},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAuHwc6","preview":false,"priority":4800,"id":80549},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeBrioM","preview":false,"priority":4700,"id":80548},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnAwKJe","preview":false,"priority":4600,"id":80546},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPMhofH","preview":false,"priority":3900,"id":80545},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQmYV3q","preview":false,"priority":3800,"id":80544},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptGDwHN","preview":false,"priority":2900,"id":80551},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMcQAcc","preview":false,"priority":2800,"id":80550},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfSlJv4","preview":false,"priority":1900,"id":90378},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phps3eVxa","preview":false,"priority":1800,"id":80555},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpf1MZfe","preview":false,"priority":1700,"id":80554},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpysG56p","preview":false,"priority":1600,"id":80553},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVmfFaJ","preview":false,"priority":1500,"id":80552},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3yS6jQ","preview":false,"priority":1400,"id":80558},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqdheTP","preview":false,"priority":1300,"id":80559},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqkEbfZ","preview":false,"priority":1200,"id":80560},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8mwif4","preview":false,"priority":1100,"id":90377}],"comments":[{"authorName":"Frank Wille","text":"Das Plugin funkioniert sehr gut, mit gutem Funktionsumfang. Wie bei allen plugins von digitvision: erstklassiger support und schnelle Antworten/Lösungsansätze bei Fragen.","headline":"Partnerprogramm einfach gemacht","creationDate":{"date":"2023-04-01 21:40:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Alex Sklarow","text":"Das Plugin lässt sich einfach installieren und ziemlich schnell konfigurieren. Der Support agiert sehr schnell und kompetent.","headline":"Gutes Plugin und schneller Support.","creationDate":{"date":"2023-03-10 10:06:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Pia  Lottes","text":"Im Prinzip  ist dieses Plugin recht hilfreich. \nLeider  sind einige Funktionen in  der mobilen Version defekt.\n\nIch habe selbst versucht das temporär  zu fixen nur ist hier  leider ist im Code  einiges durcheinander. Meine Vermutung liegt nahe, dass dies mit Version 2.3.5 passiert, wo nach Changelog  die  jQuery Abhängigkeit aufgelöst wurde.  \n\nButtons  wie  \"Partner Link generieren\" funktionieren in der mobil  Version nicht, da diese Buttons nur auf \"click\" reagieren  und nicht auf  das Event \"touchstart\". Darüber sind alle  Elemente doppelt  vorhanden.  Einmal für  Desktop  und für Mobil. Wie der Code jedoch aufgebaut ist wird immer nur das zuerst vorkommende mit der Klasse selektiert und manipuliert und das ist  die Desktop  Version. Sprich, dass selbst wenn man den Bug  mit den  Events behebt es nichts nützt.","headline":"Mobil Version defekt","creationDate":{"date":"2022-09-09 15:54:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Adib Galai","text":"Genau sowas hat in shopware 6 gefehlt. Gut umgesetzt und sehr guter Service. Ein Unternehmen das nicht einfach etwas Codet und es links liegen lässt. Weiter so .-)","headline":"Super Service und ein tolles Plugin","creationDate":{"date":"2022-04-21 09:54:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Daniel Bürgi","text":"Das Plugin bietet viele Möglichkeiten, um die Provisionen zu definieren und individualisieren. Super ist auch die Auszahlung mit Gutscheinen oder auf Bankkonto. Der Anbieter ist offen für Wünsche/Anregungen und ist sehr schnell im Support!","headline":"Top Erweiterung für \"Kunden werben Kunden\"","creationDate":{"date":"2022-02-02 11:00:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sufian Abu-Rab","text":"Weiter so! Alles Top!","headline":"Super tool. Support antwortet sehr schnell.","creationDate":{"date":"2022-01-04 16:46:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Markus Helmer","text":"Klar Empfehlung, sehr positiv überrascht!","headline":"Tolles Plugin, funktioniert reibungslos und intuitiv!","creationDate":{"date":"2020-12-17 13:50:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Annemarie Storcher","text":"Wir finden die Idee, dass jeder unserer Kunden (bzw. nur unsere Stammkunden) neue Kunden werben können einfach super. So \"arbeiten\" unsere Stammkunden quasi für Gutscheine für uns. Wir haben das Plugin nun einen Monat im Einsatz und können anhand der Provisionen schon erkennen, wie gut es funktioniert. Besten Dank!","headline":"Alles funktioniert und der Support ist Super!","creationDate":{"date":"2020-11-13 15:25:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":9,"label":"Partnerprogramm / Provisionen für Kunden (Kunden werben Kunden / Affiliate)","description":"<h2>\nPartnerprogramm / Provisionen für Kunden\n</h2><p>\n\nMachen Sie Ihre Kunden zu wertvollen Werbepartnern!\n</p><p>\n\n\nDieses Plugin bringt Ihnen für Shopware 6 ein Partnerprogramm, das Sie eventuell\nnoch von Shopware 5 kennen. Zusätzlich wird das Partnerprogramm\njedoch erweitert, damit sich Ihre Kunden selber registrieren\nkönnen und für eine Provision für Sie bei Freunden, in Foren etc. werben. Dazu können sich Ihre\nKunden in ihrem Kundenkonto für das Partnerprogramm anmelden. Danach haben sie die Möglichkeit\nLinks zu generieren, die ihren Partnercode enthalten. Bestellungen, die über diesen Partnercode\ngeneriert werden, tauchen in der Statistik des Kunden auf. Je nach Einstellung wird dann eine\nProvision berechnet. Diese Provision können sich Ihre Kunden direkt als Gutschein einlösen und\nmit diesem Gutschein in Ihrem Shop einkaufen. Alternativ können Sie Auszahlungen in der Plugin\nKonfiguration aktivieren.\n\n</p><p>\nWer wird noch die Konkurrenz empfehlen, wenn er bei Ihnen ganz einfach eine Provision\nerhalten kann? Haben Sie evtl. sogar eine große Community, die z.B. in Foren aktiv\nist? Die Mitglieder dieser Community werden gezielt auf Ihren Shop verlinken und eine\nKaufempfehlung aussprechen. Eine bessere Werbung gibt es nicht!\n\n\n\n</p><p>\n\nEigene Links (inkl. eigenem Partnercode) können im Kundenkonto unter \"Partnerprogramm\"\ngeneriert werden. Ihr Partner kann einen beliebigen Link aus dem Shop nehmen\nund durch einen Button den eigenen Partner-Code einfach anhängen.\nDer Link kann nun einfach kopiert und verteilt werden.\n\n</p><p>\n\nAußerdem können Sie aktivieren, dass für den Partner automatisch ein\nPartner-Gutschein generiert wird.\nIhr Partner kann dann mit diesem Gutschein - z.B. 10 % Rabatt - weitere Kunden werben und locken.\nJeder Kunde, der diesen Gutschein verwendet, wird automatisch dem Partner zugewiesen.\n\n\n</p><h4>Zuordnung von Kunden zu Partnern</h4><p>\n\n\nDie Zuordnung von einem Partner zu einem angemeldeten / registrierten Kunden ist permanent.\nDas heißt, dass jede zukünftige Bestellung dem Partner zugewiesen und für den Partner\nprovisioniert wird. Wenn ein Neukunde den Shop über einen Partner-Link betritt, dann wird\nder Partner-Code in den Cookies des Kunden gespeichert (falls über Cookie Consent Manager\nbestätigt). Wenn sich der Neukunde anmeldet oder registriert, wird die Zuordnung\nzum Partner permanent gespeichert.\n\n\n\n</p><p>\n\n\nAlternativ können Sie auch die Plugin Konfiguration \"Zugewiesene Kunden dürfen von anderen Partnern abgeworben werden\"\naktivieren. In diesem Fall können andere Partner einen bereits zugewiesen Kunden\nabwerben - z.B. durch einen Partner-Link oder Partner-Gutschein - so dass zukünftige\nBestellungen für den neuen Partner provisioniert werden.\n\n\n\n</p><h4>Provision</h4><p>\n\n\nJedem Partner kann eine individuelle Provision zugewiesen werden. Diese kann entweder prozentual\n(z.B. 5%) oder absolut (z.B. 5,- EUR) sein. Zudem können Sie pro Produkt und Kategorie\nindividuelle Provisionen definieren. Sollte für ein Produkt und einer der zugewiesenen\nKategorien eine individuelle Provision definiert sein, dann hat die Provision am Produkt\ndie höchste, die Provision der Kategorie die zweithöchste und die Provision\ndes Partners die niedrigste Priorität. Sollte ein Abschlag, ein Gutschein, ein Rabatt o.ä. mit einem\nnegativen Betrag die Summe der Bestellung reduzieren, dann wird dieser Abzug immer auf\nalle Positionen der Bestellung verteilt - und die Provision pro Produkt\nwird auf Basis des reduzierten Preises kalkuliert.\n\n</p><p>\n\n\nZusätzlich können Sie definieren, ob und in welcher Höhe Folgebestellungen provisioniert werden\nsollen. So können nur die erste Bestellung eines geworbenen Neukunden provisionieren oder Sie\nreduzieren die Provision auf einen geringeren Satz für weitere Bestellungen.\n\n</p><p>\n\nDie Provision wird immer anhand der Netto-Verkaufspreise berechnet - ohne Versandkosten.\n\n</p><p>\n\nEigene Bestellungen eines Partners werden üblicherweise ebenfalls provisioniert, falls\nder Partner (z.B. für einen Test) den eigenen Partner-Link nutzt, um sich selber\nzu werben. In der Plugin Konfiguration können Sie die Provision für eigene Bestellungen\ndeaktivieren. Beachten Sie jedoch, dass ein Partner z.B. über Gast-Konten\noder Freunde/Verwandte bestellen kann. Hier empfehlen wir, dass Sie den Partner\nin den AGB darauf hinweisen, dass er sich nicht selber werben darf.\n\n</p><h4>Partner-Code und Gutscheine</h4><p>\n\nJe nach Plugin Konfiguration kann der Partner seinen Partner-Code und sogar den Gutschein-Code\nfrei wählen oder ändern. Es ist jedoch zu empfehlen, dass diese Änderungen immer erst\nin der Administration freigeschaltet werden müssen. So kann der Partner jedoch z.B. seinen\neigenen Namen oder sein Instagram Profil als Partner-Code oder als Gutschein wählt.\n\n</p><h4>Teilnahme am Partnerprogramm</h4><p>\n\nSie können die Voraussetzungen für die Anmeldung am Partnerprogramm definieren. So können\nSie z.B. Kundengruppen ausschließen oder einen Mindest-Umsatz voraussetzen.\nZudem können Sie definieren, ob sich jeder Kunde vollautomatisch anmelden darf\noder ob ein Kunde eine Art \"Bewertung\" schreiben soll. Dazu kann er einen beliebigen Partner-Code\nangeben und einen freien Kommentar schreiben. Jede Bewerbung muss dann manuell\nin der Administration freigeschaltet werden.\n\n</p><h4>Provisionsfähige Bestellungen</h4><p>\n\nDamit eine Bestellung eine Provision für einen Partner generiert, muss diese\nbestimmte Voraussetzungen erfüllen. So können Sie z.B. angeben, dass eine Bestellung\nmindestens 14 Tage alt sein muss, die Bestellung den Status \"Abgeschlossen\" haben soll und Händler ausgeschlossen sind.\n</p><h4>Auszahlung der Provision</h4><p>\n\nSie können in der Plugin Konfiguration definieren, wie Sie Ihre Kunden belohnen möchten.\nEntweder können Ihre Kunden Gutscheine selber generieren und einlösen - oder sie können eine\nAuszahlung anfordern, die Sie wiederum manuell überweisen müssen. Sie geben vor welche\nGutscheine zur Verfügung stehen oder in welcher Höhe Auszahlungen angefordert werden dürfen.\nSo können Sie selbstständig bis zu fünf Staffeln anlegen - z.B. 10,- Euro, 50,- Euro usw.\n</p><p>\nWenn Sie als Art der Vergütung Gutscheine wählen, dann können Ihre Kunden selbstständig\nGutscheine generieren und einlösen. Sie haben keinerlei Mehraufwand! Außerdem können\nSie sämtliche Regeln der Gutscheine definieren - z.B. Beschränkung auf Shop, Hersteller etc.\n\n</p><p>\nEine Auszahlung der Provision ist insbesondere im B2B Bereich sinnvoll.\nIhre Kunden können in bis zu fünf frei wählbaren Staffelungen Auszahlungen anfordern.\nDazu geben Ihre Kunden zusätzlich ihre Kontoverbindung an.\nDie beantragten Auszahlungen sehen Sie ebenfalls in der Administration im Menüpunkt\n\"Auszahlungen\". Jede überwiesene Auszahlung müssen Sie als \"Ausgezahlt\" markieren.\nNeben einer festen Staffelung können Sie zudem aktivieren, dass sich jeder Partner\ndie komplett verfügbare Provision direkt auszahlen lassen kann.\n\n</p><h4>Influencer</h4><p>\n\nAuf Wunsch können Sie Ihren Kunden innerhalb des Bestellprozesses auch Informationen\nzum eigenen Partner liefern. Zusätzlich können Ihre Kunden über ein Eingabefeld\nden Partner-Code manuell eingeben. So können z.B. Influencer Ihren Partner-Code\nvia Instagram o.ä. teilen und die Kunden können diesen manuell eingeben.\n\n</p><h4>Email Benachrichtigungen</h4><p>\n\nSie können in der Plugin Konfiguration zahlreiche Email Benachrichtigungen\naktivieren. So können Sie z.B. per Email informiert werden, sobald sich ein\nneuer Partner registriert oder eine Auszahlung beantragt wurde.\n\n</p><h4>Administration</h4><p>\n\nDas Plugin liefert einen neuen Menüpunkt für die Administration.\nSo können Sie nicht nur jederzeit sehen, welche Kunden für Sie werben oder wie hoch die Umsätze\nsind - sondern Sie können z.B. auch die Provision für besonders erfolgreiche Partner erhöhen.\nZudem haben Sie jederzeit ausführliche Statistiken für jeden Partner zur Verfügung.\n\n</p><h4>Partnerprogramm für Preisvergleiche</h4><p>\n\nDa Shopware 6 ein Partnerprogramm fehlt, können Sie das Plugin natürlich auch\nnutzen, um Erfolge anderer Portale (z.B. Google Shopping oder Idealo) zu messen.\nSie können Partner manuell anlegen (z.B. Google) und den Partner-Code\nan die Links hängen, die Sie in den Portalen verteilen. Das Partnerprogramm\nzeigt Ihnen dann sämtliche Statistiken übersichtlich und detailliert an.\n\n</p><h4>Ablauf für einen Partner</h4><ul><li>Ihre Kunden können sich selber am Partnerprogramm im Kundenkonto anmelden</li><li>das Plugin erzeugt für diesen Kunden im Partnerprogramm einen neuen Partner</li><li>dieser Partner wird mit der, in der Plugin Konfiguration festgesetzten Provision (z.B. 5%) geführt</li><li>je nach Plugin Konfiguration ist ein Partner direkt freigeschaltet oder muss manuell geprüft werden</li><li>Ihr Partner kann nun Partnerlinks generieren und an seine Freunde, auf Facebook etc. verteilen</li><li>falls aktiviert kann Ihr Partner auch Gutscheine verteilen, um den Kaufanreiz für geworbene Kunden zu erhöhen</li><li>seine Provision kann er jederzeit selber einsehen und in Gutscheine eintauschen oder eine Auszahlung anfordern</li></ul><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin erzeugt bei der Installation direkt drei Partner-Gutscheine</li><li>Sie können weitere Gutscheine anlegen oder die erzeugten Gutscheine nach Ihren Wünschen anpassen</li><li>bitte beachten Sie, dass Gutscheine einen absoluten Rabatt haben und dass Sie \"individuelle Gutscheincodes verwenden\" aktiviert haben</li><li>bitte generieren Sie keine Gutscheincodes und verwenden Sie keine mehrfachen Rabatte oder Rabatte mit unterschiedlichen Währungen</li><li>in der Plugin Konfiguration wählen Sie neu angelegte Gutscheine aus</li><li>prüfen Sie gültige Kundengruppen für Partner in der Plugin Konfiguration</li><li>prüfen Sie die Bedingungen für provisionsfähige Bestellungen in der Plugin Konfiguration</li><li>das Alter der Bestellung gibt die Tage seit der Bestellung an - und nicht seit dem Versand. Achten Sie also auf einen ausreichend großen Puffer (z.B. wegen Rücksendungen)</li></ul><br /><br /><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin erzeugt bei der Installation direkt drei Partner-Gutscheine</li><li>Sie können weitere Gutscheine anlegen oder die erzeugten Gutscheine nach Ihren Wünschen anpassen</li><li>bitte beachten Sie, dass Gutscheine einen absoluten Rabatt haben und dass Sie \"individuelle Gutscheincodes verwenden\" aktiviert haben</li><li>bitte generieren Sie keine Gutscheincodes und verwenden Sie keine mehrfachen Rabatte oder Rabatte mit unterschiedlichen Währungen</li><li>in der Plugin Konfiguration wählen Sie neu angelegte Gutscheine aus</li><li>definieren Sie gültige Kundengruppen für Partner in der Plugin Konfiguration</li><li>definieren Sie gültige Bestellungen für Kunden in der Plugin Konfiguration</li><li>das Alter der Bestellung gibt die Tage seit der Bestellung an - und nicht seit dem Versand. Achten Sie also auf einen ausreichend großen Puffer (z.B. wegen Rücksendungen)</li></ul>","version":"4.0.7","changelog":[{"version":"4.0.7","text":"- added compatibility to 3rd party cookie content manager","creationDate":{"date":"2023-07-06 15:53:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.6","text":"- fixed calculating commission for orders outside the given timeframe set in the app configuration\n\n<br />\n\n- added new custom commission-calculator event which is fired whenever a commission is calculated","creationDate":{"date":"2023-06-14 13:40:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.4","text":"- fixed search and sorting within administration affiliate list","creationDate":{"date":"2023-05-05 09:01:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.3","text":"- changed affiliate registration methods within administration\n\n\n\n\n<br />\n\n\n\n\n- added new affiliate-assignment event and deprecated the old affiliate-assignment event","creationDate":{"date":"2023-04-23 11:31:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"- added associated customer to affiliate list within administration","creationDate":{"date":"2023-04-23 09:19:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"- prepared and partially refactored the app for multi-level-marketing (mlm) app<br />\n- fixed sales channel context for some app configuration values<br />\n- added console command to update commission for every partner","creationDate":{"date":"2023-04-22 16:33:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.4","text":"- fixed missing default header and footer within emails","creationDate":{"date":"2023-04-08 17:46:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.3","text":"- added app configuration for extended statistics for recruited orders within the storefront partner account","creationDate":{"date":"2023-04-07 19:46:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"- fixed statistics for net customers","creationDate":{"date":"2023-04-07 11:24:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"- removed loading additional statistical affiliate data within the the storefront<br />\n- added more statistical affiliate data to the administration","creationDate":{"date":"2023-04-07 09:52:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"- added shopware 6.5 compatibility","creationDate":{"date":"2023-03-29 21:37:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.2","text":"- added app configuration for extended statistics for recruited orders within the storefront partner account","creationDate":{"date":"2023-04-07 22:09:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.6.1","text":"- added tabs to administration of a partner<br />\n- refactored creating partners within administration<br />\n\n\n- fixed faulty state key for detailed recruited orders","creationDate":{"date":"2023-03-29 10:33:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.3","text":"- changed default customer and order administration to make the affiliate code editable","creationDate":{"date":"2023-03-25 18:33:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.2","text":"- fixed reducing commission for customers with vat id","creationDate":{"date":"2023-03-09 16:22:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.1","text":"- added exception handling for invalid twig patterns within configuration","creationDate":{"date":"2023-03-08 16:00:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.0","text":"- added custom parent menu item within administration<br />\n- added app configuration to customize the number or date range of the displayed last recruited orders<br />\n- added customer name to the last recruited orders whenever the customer is also assigned as seller-customer (DvsnSeller plugin version =&gt; 1.2.0)<br />\n- added custom event which is thrown whenever an affiliate assignment is persisted<br />\n- added app configuration to automatically create an order whenever an affiliate redeems their commission<br />\n- added app configuration to reduce commission only by its net value for german customers with ust id<br />\n- removed ust id from affiliate settings within the storefront. use the default customer ust id if you need it","creationDate":{"date":"2023-03-04 13:24:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.4","text":"- fixed scheduled task for invalid customers","creationDate":{"date":"2023-02-13 19:20:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.3","text":"- fixed compatibility for shopware 6.4.5.x to 6.4.7.x","creationDate":{"date":"2022-12-21 10:07:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.2","text":"- fixed partner link button for mobile viewports","creationDate":{"date":"2022-12-02 10:38:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.1","text":"- added app configuration to enable/disable \"prevent combination\" flag for auto generated partner promotions. note: this option is enabled by default","creationDate":{"date":"2022-10-05 18:23:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"- added optional vat id input field when requesting a payout<br />\n- added optional mandatory checkbox during registration which could be used for accepting the terms and conditions<br />\n- added optional minimum amount for requesting a full payout","creationDate":{"date":"2022-09-25 08:51:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.6","text":"- fixed missing translations","creationDate":{"date":"2022-08-02 09:02:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.5","text":"- removed jquery dependency","creationDate":{"date":"2022-07-14 16:04:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.4","text":"- fixed checkout finish subscriber for lower shopware versions","creationDate":{"date":"2022-07-11 09:36:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.3","text":"- fixed affiliate entity within order extension on checkout finish page","creationDate":{"date":"2022-07-09 09:36:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.2","text":"- added note to order custom field set","creationDate":{"date":"2022-06-29 21:05:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.1","text":"- fixed check for available partner and promotion codes when changing the code in the customer account","creationDate":{"date":"2022-06-27 15:20:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"- partially redesigned administration of affiliates for commission values\n<br />- changed commission values from integer to float to allow percental and absolute commission values with decimal places\n<br />- added commission type \"absolute per piece\" to pay a fixed commission for every piece of every product sold\n<br />- added individuell commission for customers\n<br />- redesigned affiliate overview in customer account and added tabs to split the available information\n<br />- restructed template files and snippets\n<br />- added app configuration to enable automatic affiliate registration during checkout \n<br />- added affiliate entity to order extensions during checkout","creationDate":{"date":"2022-06-27 12:21:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"- replaced paid flag with status for payouts and added canceled as status\n<br />\n- added app configuration to disable permanent assignment to partner and allow partners to poach customers assigned to other partners<br />\n- added app configuration to disable commission for orders which the partner ordered himself<br />\n- added app configuration to enable input fields during checkout to use a partner-code manually<br />\n- added app configuration to enable multiple email notifications for the shop owner and the partner","creationDate":{"date":"2022-05-19 17:03:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"- added error handler for invalid affiliate details","creationDate":{"date":"2022-05-11 21:31:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"- fixed cookie for sales channels with deactivated plugin","creationDate":{"date":"2022-02-24 12:52:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"- fixed cookie lifetime","creationDate":{"date":"2022-02-11 09:12:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"- fixed missing snippets\n\n<br />\n\n- fixed cookie lifetime","creationDate":{"date":"2022-02-09 15:48:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"- added check for non-unique partner codes<br />\n- added app configuration to enable custom partner code patterns","creationDate":{"date":"2022-02-02 15:20:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"- fixed app installation for de-ch locale","creationDate":{"date":"2022-01-27 10:32:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"- added app configuration to enable complete payout of current commission instead of pre-defined staggered amounts\n<br />\n- added app configuration to enable partner application which has to be manually accepted instead of instant registration without any verification<br />\n- added app configuration to enable custom partner codes which can be requested by the partner himself<br />\n- added app configuration to enable custom partner voucher codes which can be requested by the partner himself<br />\n- added the affiliate variable to the code pattern of auto generated voucher code to generate the voucher code based on the partner code by default<br />\n- redesigned affiliate account overview<br />\n- restructured controllers and services<br />\n- changed default values and behaviour of entity selection entities within the app configuration<br /><br />\nWICHTIGER HINWEIS - bitte bei einem Update beachten!<br />\n- die Auswahl des Bestellstatus für provisionsfähige Bestellungen wurde innerhalb der Plugin Konfiguration geändert. Bitte prüfen Sie die entsprechende Plugin Konfiguration, falls Sie einen individuellen Bestellstatus für provisionsfähige Bestellungen wünschen.","creationDate":{"date":"2022-01-19 13:50:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.4","text":"- fixed faulty mysql type conversion","creationDate":{"date":"2021-11-26 12:22:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.3","text":"- changed namespace of loaded templates","creationDate":{"date":"2021-11-18 07:51:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"- fixed type hints to increase compatibility with third party plugins","creationDate":{"date":"2021-11-03 11:08:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"- fixed type hints to increase compatibility with third party plugins","creationDate":{"date":"2021-10-27 13:26:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"- added option for different commission fees for the first or any subsequent order of a recruited customer","creationDate":{"date":"2021-10-21 09:54:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"- fixed update routine for early versions","creationDate":{"date":"2021-09-09 18:59:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"- added additional information about every recruited order in the administration of a partner\n\n<br />\n- added plugin configuration to switch between absolute or percental partner promotion<br />\n- added plugin configuration to add cart rules to partner promotion","creationDate":{"date":"2021-08-31 15:26:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"- fixed faulty scheduled task","creationDate":{"date":"2021-06-25 08:33:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"- added shopware 6.4 compatibility","creationDate":{"date":"2021-05-06 07:59:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"- fixed creating new affiliates","creationDate":{"date":"2021-04-16 18:21:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"- added option to notify shop owner when an affiliate redeems their commission<br />\n- added option to notify affiliate when he can redeem their commission","creationDate":{"date":"2021-04-13 07:59:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"- added individual commission per product and category","creationDate":{"date":"2020-12-12 15:43:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- added partner options to switch between absolute or percental provision<br />\n- added plugin configuration to enable/disable permanent provision","creationDate":{"date":"2020-11-20 13:23:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"- added button in administration list to create partner &amp; customer","creationDate":{"date":"2020-10-28 10:10:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"- fixed creating affiliates for shopware 6.3.1.x","creationDate":{"date":"2020-10-02 14:01:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- fixed missing configuration value for dev mode<br />\n- added internal customer assignment method","creationDate":{"date":"2020-09-23 13:35:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"- fixed missing configuration value for dev mode<br />\n- fixed label for customer selection<br />\n- added service methods","creationDate":{"date":"2020-09-21 09:17:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- added shopware 6.3 compatibility","creationDate":{"date":"2020-08-06 10:24:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2020-07-14 11:51:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn756651919352","redirectToStore":false,"lowestPriceValue":69}