{"id":8866,"name":"DvsnReturnShipment","code":"dvsn392787929131","lastChange":{"date":"2023-07-25 08:00:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1kDg9D","examplePageUrl":"","moduleKey":"DvsnReturnShipment","creationDate":{"date":"2019-05-16 16:35:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-05-20 17:05:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-09-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-04-24 12:46:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":13745,"name":"Rücksendungen / Reklamationen / Retouren anlegen im Kundenkonto (inkl. DHL / UPS Label + QR Code)","description":"\n<h2>\nRücksendungen / Reklamationen / Retouren anlegen im Kundenkonto\n</h2><p>\nBieten Sie Ihren Kunden die Möglichkeit Rücksendungen direkt aus ihrem Kundenkonto anzulegen.\nDazu können die Kunden die Anzahl der Artikel, einen Grund, eine gewünschte Vorgehensweise und optionale Kommentare angeben.\nDie Gründe (z.B. FAG, Artikel defekt etc.) und Vorgehensweisen (z.B. Gutschrift, Auszahlung etc.) können dabei\ninnerhalb eines eigenen Moduls in den Shopware Einstellungen administriert werden.\n\nZudem können Sie Rücksendungen nur für bestimmte Kundengruppen oder für definierbare\nBestellstatus aktivieren.\n\n\n</p><p>\nDer Kunde kann pro Bestellung beliebig viele Rücksendungen anlegen. Bei jeder neu angelegten Rücksendung\nkann er jedoch lediglich die Artikel auswählen, die bisher noch in keiner früheren Rücksendung\nreklamiert wurden. Somit kann er die gleichen Artikel nicht mehrfach zurück senden.\nIn der Plugin Konfiguration finden Sie eine Option, um mehrere Rücksendungen pro Bestellungen zu\naktivieren bzw. zu deaktivieren.\n</p><p>\nDer Kunde wird mit einer Schritt-für-Schritt Anleitung durch den Prozess einer\nRücksendung geführt. Innerhalb der Liste seiner Bestellungen kommt er direkt mit einem\nLink auf die Liste der Rücksendungen einer Bestellung oder zum Formular zum Anlegen neuer Rücksendungen.\nDazu kann er sich auch ein Rücksende-Dokument als PDF\nherunterladen und dem Paket beilegen. Sie erhalten als Shopbetreiber auf Wunsch\neine Email, sobald eine Rücksendung angelegt wurde.\n</p><p>\nZudem haben Ihre Kunden - unter Beachtung von verschiedenen Bedingungen (z.B. Kundengruppe) - die Möglichkeit direkt ein DHL\noder UPS Retouren Label zu erstellen und auszudrucken.\n</p><p>\nInnerhalb der Administration finden Sie unter dem Reiter \"Bestellungen\" den neuen Menüpunkt \"Rücksendungen\".\nHier können Sie jede eingegangene Rücksendung einsehen und bearbeiten. Um den Vorgang besser in\nIhre eigenen Prozesse zu integrieren, können sie auch alle Status selber definieren - vorhandene Status löschen und editieren\noder neue Status anlegen (z.B. \"Rücksendung wartet auf Rückmeldung durch Hersteller\").\n</p><h4>Gäste und SEO Url</h4><p>\n\nSie können eine SEO Url angeben, die Sie (z.B. für Gäste) direkt verlinken können. So kann das\nFormular zum Anlegen einer Rücksendung z.B. unter https://www.domain.de/ruecksendung erreichbar\nsein. Bitte tragen Sie dazu in der Plugin Konfiguration die gewünschte SEO Url ohne (!) die\nDomain ein - also z.B. \"ruecksendung\".\n\n</p><p>\n\nIn diesem Formular kann sich jeder Kunde unter Angabe der Bestellnummer und zugehörigen Email Adresse anmelden\nund seine vorhandenen Rücksendungen einsehen oder eine neue Rücksendung anlegen.\nSollte der Kunde die Bestellnummer und/oder die Email Adresse vergessen haben, dann kann er auch\nnach dem Nachnamen und einer passenden Postleitzahl nach vergangenen Bestellungen suchen.\n\n</p><h4>Produkte in Bestände buchen</h4><p>\n\nInnerhalb der Administration einer Rücksendung haben Sie die Möglichkeit ausgewählte Produkte\ndirekt zurück in den Bestand zu buchen. So können Produkte, die tatsächlich (z.B. als FAG Rücksendung) zurück gesendet wurden\nund wieder in den Verkauf können, direkt eingebucht werden.\n\n</p><h4>Fristen</h4><p>\n\nSie können in der Plugin Konfiguration definieren, ob eine Rücksendung nur für einen bestimmten Zeitraum (ab\nVersand) angelegt werden darf. So können Sie z.B. das Erstellen einer Rücksendung nur bis zu 21 Tage nach Versand\nermöglichen. Parallel dazu können Sie eine Frist für das Erstellen von Retouren-Labels (DHL und UPS) definieren.\nSo können Sie z.B. einen kostenfreien Rückversand (via Retouren-Label) nur maximal 14 Tage nach Versand anbieten.\n\n</p><h4>Produkte von Rücksendungen ausschließen</h4><p>\n\nDas Plugin gibt standardmäßig nur \"normale\" Shopware Produkte für eine Rücksendung frei. So können\nz.B. Gutscheine und/oder Rabatte bei einer Rücksendung nicht ausgewählt werden. Sie haben zudem die Möglichkeit\nin den Freitextfeldern von Produkten diese spezifisch von Rücksendungen auszuschließen.\n\n</p><h4>DHL Retouren Label</h4><p>\n\nSie können Ihren Kunden anbieten, dass diese direkt ein DHL Retouren Label für ihre Bestellung\nerzeugen und ausdrucken können. Zudem können sich Ihre Kunden auch ein QR Code speichern,\num damit bei der DHL Filiale ein Label drucken lassen zu können.\n\n</p><p>\nSie können das Erstellen von Labels aktivieren / deaktivieren und können sämtliche Protokolle\nmitschreiben lassen. Meistens reicht ein Blick in die Protokolle, um mögliche Fehler zu erkennen.\nDie Logs Protokolle im Standard Verzeichnis für Logs innerhalb von Shopware.\nAusgehend vom Stammverzeichnis wäre das \"/var/log\".\n\n</p><p>\nBitte achten Sie darauf die Gewichte der Artikel im backend korrekt zu pflegen.\nDas Gewicht auf dem Label berechnet sich automatisch nach den ausgewählten Artikeln.\n\n\n\n\n</p><p>\n\nSie können mit der Schnittstelle zum DHL Geschäftskundenportal ein\nRetouren Label erzeugen lassen. Das Label enthält dabei automatisch Sie als Empfänger\nund den Kunden als Absender.\n\n\n</p><p>\n\nUm DHL Labels erzeugen zu können, benötigen Sie einen Zugang zum DHL Geschäftskundenportal.\nZudem müssen Sie für die Versandabwicklung über das Geschäftskundenportal berechtigt sein.\nFür eine Freischaltung wenden Sie sich bitte an Ihren DHL Kundenberater.\n\n\n\n</p><h4>DHL Retouren Label via DHL Geschäftskundenportal - Live Einstellungen</h4><p><b>Kunden-/EKP-Nummer:</b><br />\nIhre 10-stellige DHL Kundennummer.<br /><br /><b>Verfahrens-Nummer:</b><br />\nDie Verfahrens-Nummer für den DHL Versand. Beispiel: 07 für Deutschland, 53 für Österreich.<br /><br /><b>Teilnahme-Nummer:</b><br />\nEine 2-stellige Nummer zur Untergliederung von Abrechnungen nach Standorten, Saisongeschäft oder\nunterschiedlichen Konditionen. Die Teilnahmenummern der verschiedenen DHL Produkte entsprechen\njeweils den letzten zwei Stellen der zugehörigen Abrechnungsnummern.<br /><br /><b>Retourenempfänger:</b><br />\nIm DHL Geschäftskundenportal im Menü \"Retoure\" im Untermenü \"Einstellungen\" werden Ihnen alle\nRetourenempfängernamen (=ReceiverIds) aufgelistet. Bitte geben Sie hier die gewünschte\n\"Receiver Id\" an.<br /><br /><b>DHL Geschäftskundenportal Benutzer:</b><br />\nDer Benutzer aus dem DHL Geschäftskundenportal. Der Benutzer muss für Retoure berechtigt sein!\nIdealerweise legen Sie einen weiteren Benutzer für die Erstellung der Labels an.\n<br /><br /><b>DHL Geschäftskundenportal Passwort:</b><br />\nDas Passwort des oben genannten Benutzers. Die Passwortgültigkeit eines \"Benutzers\" beträgt 90 Tage.\nDie Passwortgültigkeit eines \"Systembenutzers\" beträgt 365 Tage. Mit einem \"Systembenutzer\" ist eine\nAnmeldung am DHL Geschäftskundenportal nicht möglich.\n\n\n\n\n\n\n\n</p><h4>DHL Retouren Label via DHL Geschäftskundenportal - Sandbox Einstellungen</h4><p><b>Entwicker ID und Entwicklerportal Passwort:</b><br />\nDie Entwickler ID finden Sie im DHL Entwicklerportal unter \"Mein Konto\" (einfach Ihren Namen oben rechts\nanklicken). Als Passwort verwenden Sie das Passwort mit dem Sie sich am Entwicklerportal angemeldet haben.\n\n\n\n\n</p><h4>DHL Retouren Label im Ausland</h4><p>\n\n\nSie können pro Land und/oder Verkaufskanal unterschiedliche DHL Zugangsdaten hinterlegen.\nDazu finden Sie - neben der Plugin Konfiguration - innerhalb der Shopware Konfiguration\nden Menüpunkt \"DHL Zugangsdaten für Rücksendungen\". Wenn Sie hier für das Land Österreich\neinen eigenen Datensatz hinterlegen, dann wird für sämtliche Kunden aus Österreich ein\nDHL Label mit diesen Zugangsdaten erzeugt.\n\n\n\n</p><h4>UPS Retouren Label</h4><p>\n\nSie können auch - zusätzlich zum DHL Label oder statt des DHL Labels - Ihren Kunden ein\nUPS Retouren Label zur Verfügung stellen. Dazu müssen Sie die entsprechende Option\nin der Plugin Konfiguration aktivieren und sämtliche Zugangsdaten hinterlegen.\n\n\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>prüfen Sie die Plugin Konfiguration, ob diese Ihren Wünschen entspricht</li><li>definieren Sie insbesondere gültige Bestellstatus und/oder Kundengruppen</li><li>definieren Sie Ihre gewünschten Gründe und Vorgehensweisen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.domain.de/dvsn/return-shipment</li><li>das Formular finden Sie alternativ unter https://www.domain.de/ruecksendung</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL und/oder UPS Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die Plugin Beschreibung</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Kontakt</h4><ul><li><strong>Anschrift</strong><br />\nHevener Straße 65<br />\n44797 Bochum\n</li><li><strong>Telefon</strong><br />\n(+49) 234 97354482\n</li><li><strong>Internet</strong><br />\ninfo@digitvision.de<br />\nhttps://www.digitvision.de\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>konfigurieren Sie das Plugin nach Ihren Wünschen</li><li>definieren Sie Ihre gewünschten Gründe für Rücksendungen</li><li>definieren Sie gültige Bestellstatus oder Kundengruppen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.domain.de/dvsn/return-shipment</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die Plugin Beschreibung</li></ul>","shortDescription":"PLUGIN DES MONATS - Kunden können direkt und bequem aus einer Bestellung eine Rücksendung anlegen (inkl. DHL Label). Abwicklung von Retouren einfach gemacht! Reklamationen mit DHL Label","highlights":"","features":""},{"id":18312,"name":"Return shipments (incl. DHL / UPS label)","description":"\n<h2>\nCreate returns / complaints / returns in the customer account\n</h2><p>\nOffer your customers the possibility to create returns directly from their customer account. To do this, customers can specify the number of items, a reason, a desired procedure and optional comments. The reasons (e.g. FAG, article defective etc.) and procedures (e.g. credit note, payment etc.) can be administered within a separate module in the Shopware settings.\n\nIn addition, you can activate returns only for certain customer groups or for definable order statuses.\n\n\n</p><p>\nThe customer can create any number of returns per order. However, for each new return, the customer can only select the items that have not yet been claimed in a previous return. Thus, he cannot return the same items more than once. In the plugin configuration you will find an option to enable or disable multiple returns per orders.\n</p><p>\nThe customer is guided through the process of a return with a step-by-step guide. Within the list of his orders he comes directly with a link to the list of returns of an order or to the form for creating new returns. He can also download a return document as a PDF and enclose it with the package. As a store operator, you will receive an email on request as soon as a return has been created.\n</p><p>\nIn addition, your customers - taking into account various conditions (e.g. customer group) - have the option to directly create and print a DHL or UPS returns label.\n</p><p>\nWithin the administration you will find the new menu item \"Returns\" under the tab \"Orders\". Here you can view and edit every received return. In order to better integrate the process into your own processes, you can also define all statuses yourself - delete and edit existing statuses or create new statuses (e.g. \"Return awaiting feedback from manufacturer\").\n</p><h4>Guests and SEO Url</h4><p>\n\nYou can specify an SEO url that you can link directly (e.g. for guests). For example, the form for creating a return can be accessed at https://www.domain.de/ruecksendung. Please enter the desired SEO url without (!) the domain in the plugin configuration - e.g. \"ruecksendung\".\n\n</p><p>\n\nIn this form, each customer can log in by entering the order number and associated email address and view their existing returns or create a new return. If the customer has forgotten the order number and/or the email address, then he can also search for past orders by last name and a matching zip code.\n\n</p><h4>Post products to inventories</h4><p>\n\nWithin the administration of a return you have the possibility to book selected products directly back into the stock. In this way, products that have actually been returned (e.g. as FAG returns) and can be put back on sale can be posted directly.\n\n</p><h4>Deadlines</h4><p>\n\nYou can define in the plugin configuration whether a return can only be created for a certain period of time (from shipment). For example, you can allow the creation of a return only up to 21 days after shipment. In parallel, you can define a time limit for creating return labels (DHL and UPS). For example, you can offer free return shipping (via return label) only up to a maximum of 14 days after shipment.\n\n\n</p><h4>Exclude products from returns</h4><p>\n\nBy default, the plugin only enables \"normal\" Shopware products for a return. Thus, for example, coupons and / or discounts can not be selected for a return. You also have the option in the free text fields of products to specifically exclude them from returns.\n\n</p><h4>DHL Returns Label</h4><p>\n\nYou can offer your customers that they can directly create and print a DHL return label for their order. In addition, your customers can also save a QR code so that they can print a label at the DHL branch.\n\n</p><p>\nYou can activate / deactivate the creation of labels and can have all logs recorded. Most of the time, a look at the logs is enough to detect possible errors. The logs logs in the default directory for logs within Shopware. Starting from the root directory this would be \"/var/log\".\n\n</p><p>\nPlease make sure to maintain the weights of the items correctly in the backend. The weight on the label is calculated automatically according to the selected items.\n\n\n\n\n</p><p>\n\nYou can generate a returns label with the interface to the DHL business customer portal. The label automatically contains you as the recipient and the customer as the sender.\n\n\n</p><p>\n\nTo be able to generate DHL Labels, you need access to the DHL Business Customer Portal. In addition, you must be authorized for shipping processing via the business customer portal. For activation, please contact your DHL customer advisor.\n\n\n\n</p><h4>DHL Returns Label via DHL Business Customer Portal - Live Settings</h4><p><b>Customer/EKP number:</b><br />\nYour 10-digit DHL customer number.<br /><br /><b>Procedure number:</b><br />\nThe procedure number for DHL shipping. Example: 07 for Germany, 53 for Austria.<br /><br /><b>Participation number:</b><br />\nA 2-digit number for subdividing settlements by location, seasonal business or different conditions. The participation numbers of the various DHL products each correspond to the last two digits of the associated billing numbers.\n\n<br /><br /><b>Return recipient:</b><br />\nIn the DHL Business Customer Portal in the menu \"Returns\" in the submenu \"Settings\" all return recipient names (=ReceiverIds) are listed. Please enter the desired \"Receiver Id\" here.\n\n<br /><br /><b>DHL Business Customer Portal User:</b><br />\nThe user from the DHL Business Customer Portal. The user must be authorized for returns! Ideally, you create another user for the creation of the labels.\n<br /><br /><b>DHL Business Customer Portal Password:</b><br />\nThe password of the above user. The password validity of a \"user\" is 90 days. The password validity of a \"system user\" is 365 days. It is not possible to log in to the DHL Business Customer Portal with a \"system user\".\n\n\n\n\n\n\n\n</p><h4>DHL Returns Label via DHL Business Customer Portal - Sandbox Settings</h4><p><b>Developer ID and Developer Portal Password:</b><br />\nYou can find the developer ID in the DHL developer portal under \"My account\" (simply click on your name in the top right-hand corner). For the password, use the password you used to log in to the developer portal.\n\n\n\n\n</p><h4>DHL returns label abroad</h4><p>\n\n\nYou can store different DHL access data per country and/or sales channel. For this purpose, you will find - next to the plugin configuration - the menu item \"DHL access data for returns\" within the Shopware configuration. If you store a separate data set for the country Austria, then a DHL label with this access data will be generated for all customers from Austria.\n\n\n\n</p><h4>UPS Returns Label</h4><p>\n\nYou can also - in addition to the DHL label or instead of the DHL label - provide your customers with a UPS returns label. To do this, you must activate the corresponding option in the plugin configuration and store all access data.\n\n\n\n\n</p><h4>Instructions</h4><ul><li>install the extension</li><li>check the plugin configuration if it meets your requirements</li><li>define in particular valid order statuses and/or customer groups</li><li>define your desired reasons and procedures</li><li>link anywhere in your store (e.g. category, store page etc) to the form for creating a return (e.g. for guests)</li><li>you can find the form at https://www.domain.de/dvsn/return-shipment</li><li>you can find the form alternatively at https://www.domain.de/ruecksendung</li><li>registered customers can additionally always create returns directly from their customer account</li><li>for the creation of a DHL and/or UPS return label you need appropriate access data. Please note the plugin description</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8.x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"<h4>Instructions</h4><ul><li>install the plugin</li><li>configure the plugin according to your wishes</li><li>define your desired reasons for returns</li><li>define valid order status or customer groups</li><li>link on any place of your shop (e.g. category, shop page etc) to the form for creating a return (e.g. for guests)</li><li>the form can be found at https://www.domain.de/dvsn/return-shipment</li><li>registered customers can also always create returns directly from their customer account</li><li>for the creation of a DHL Returns Label you need the corresponding access data. Please note the plugin description </li></ul>","shortDescription":"PLUGIN OF THE MONTH - Customers can create a return shipment directly and conveniently from an order (incl. DHL label) Handling of returns made easy! Complaints with DHL Label!","highlights":"","features":""}],"addons":["enterpriseCertified"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":159883,"bookingKey":"dvsn392787929131","bookingText":"Return shipments","price":359.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":159882,"bookingKey":"dvsn392787929131_M","bookingText":"Return shipments","price":49,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqo1CPC","preview":true,"priority":9900,"id":80131},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJklfla","preview":false,"priority":9800,"id":80130},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPN1iR0","preview":false,"priority":9700,"id":93129},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpT2ifMD","preview":false,"priority":9600,"id":80128},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpj5UPVH","preview":false,"priority":8900,"id":93130},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phputmPnI","preview":false,"priority":8800,"id":79717},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprFab1R","preview":false,"priority":8700,"id":93131},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpElzOHW","preview":false,"priority":8600,"id":79720},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9cEEFY","preview":false,"priority":8500,"id":93132},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phps8n6p1","preview":false,"priority":7900,"id":93133},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMEGIxR","preview":false,"priority":7800,"id":93134},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpfEGI9Z","preview":false,"priority":7700,"id":93135},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpct3TBR","preview":false,"priority":7600,"id":93136},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php0XzPzX","preview":false,"priority":6900,"id":93137},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNzfWj0","preview":false,"priority":6800,"id":93138},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcg8MYy","preview":false,"priority":6700,"id":93139},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php902hJS","preview":false,"priority":5900,"id":93140},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpu89U8Q","preview":false,"priority":4900,"id":93141},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOPh9uf","preview":false,"priority":4800,"id":79736},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLmFnxT","preview":false,"priority":4700,"id":93142},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9UEMme","preview":false,"priority":4650,"id":80127},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKBxI2F","preview":false,"priority":4600,"id":80125},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpENuhda","preview":false,"priority":3900,"id":79740},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4xI35I","preview":false,"priority":3800,"id":93143},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpN6uDGx","preview":false,"priority":3700,"id":93144},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2GbmpX","preview":false,"priority":3600,"id":93145},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFYe2JV","preview":false,"priority":3500,"id":93146},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKFJd1G","preview":false,"priority":3100,"id":80114},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYaDyls","preview":false,"priority":2900,"id":79747},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCX5TFL","preview":false,"priority":2800,"id":79745},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyH2Ux7","preview":false,"priority":2750,"id":80113},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpG5C1fy","preview":false,"priority":2700,"id":79744},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVCtHOF","preview":false,"priority":2600,"id":79748},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqnT3U8","preview":false,"priority":2500,"id":79749},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptyENHe","preview":false,"priority":2400,"id":79746}],"comments":[{"authorName":"Marc-Stephan Müller","text":"Dem Plugin fehlt es leider an einer Grundfunktionalität, denn es funktioniert nicht mit Teilweise versendeten Bestellungen. Dies ist allerdings für wohl jeden Shop eine Grundfunktion, welche andere Plugins abdecken. Dies ist sehr schade, da das Plugin sonst gut aufgebaut ist. Der Support reagiert schnell, verlangt aber für die Funktion eines zweiten Lieferstatus zu setzten (um eine Grundfunktionalität zu ergänzen) 1.000€ plus Mwst. Dies steht für uns in keinem Verhältnis zum Aufwand. Andere gleichwertige Pluginhersteller haben uns bereits weitaus umfangreichere Erweiterungen (welche keine Grundfunktionalität darstellten) für andere nachvollziehbarere Kurse entwickelt. Schade, da es sonst ein gutes Plugin ist.","headline":"Fehlende Grundfunktionalität","creationDate":{"date":"2023-03-16 22:24:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":5},{"authorName":"Maite Kocher","text":"Die Installation war einfach und das Plugin bietet die Möglichkeit jedes Element anpassen zu können (Anleitung für die Retoure, Admin Mail) was sehr hilfreich ist. \nDer Support antwortet sehr schnell, Plus Punkt dafür!","headline":"Einfaches Plugin","creationDate":{"date":"2022-03-28 13:33:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"SHB","text":"Das PlugIn ist intuitiv bedienbar, auch bei der Konfiguration kommt man schnell zum richtigen Ergebnis.\nEs bietet viele Konfigurationsmöglichkeiten für den Shopbetreiber.\nHerausragend ist der Support, wenn es mal aneiner Stelle hakt. Innerhalb kürzester Zeit, zum Schluss sogar beihnahe in Chat-Geschwindigkeit, erhielt ich hochkompetente Hilfe. Einfach nur Daumen hoch!","headline":"Super-PlugIn und noch besserer Support","creationDate":{"date":"2022-02-25 09:13:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Oleksyi Hornytskyi","text":"fast support communication, great functionality","headline":"great plugin","creationDate":{"date":"2022-01-20 17:04:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christine H.","text":"Macht genau das, was es verspricht! Klare Empfehlung von uns!","headline":"Alles super!","creationDate":{"date":"2020-12-22 10:02:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Olivier","text":"vom Kunden einfach zu bedienen, einfache &amp; logische Umsetzung, toller Support. Ich hoffe auf weitere Feature-Erweiterungen. ;-)","headline":"Starkes Plugin","creationDate":{"date":"2020-06-23 17:03:41.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":9,"label":"Rücksendungen / Reklamationen / Retouren anlegen im Kundenkonto (inkl. DHL / UPS Label + QR Code)","description":"<h2>\nRücksendungen / Reklamationen / Retouren anlegen im Kundenkonto\n</h2><p>\nBieten Sie Ihren Kunden die Möglichkeit Rücksendungen direkt aus ihrem Kundenkonto anzulegen.\nDazu können die Kunden die Anzahl der Artikel, einen Grund, eine gewünschte Vorgehensweise und optionale Kommentare angeben.\nDie Gründe (z.B. FAG, Artikel defekt etc.) und Vorgehensweisen (z.B. Gutschrift, Auszahlung etc.) können dabei\ninnerhalb eines eigenen Moduls in den Shopware Einstellungen administriert werden.\n\nZudem können Sie Rücksendungen nur für bestimmte Kundengruppen oder für definierbare\nBestellstatus aktivieren.\n\n\n</p><p>\nDer Kunde kann pro Bestellung beliebig viele Rücksendungen anlegen. Bei jeder neu angelegten Rücksendung\nkann er jedoch lediglich die Artikel auswählen, die bisher noch in keiner früheren Rücksendung\nreklamiert wurden. Somit kann er die gleichen Artikel nicht mehrfach zurück senden.\nIn der Plugin Konfiguration finden Sie eine Option, um mehrere Rücksendungen pro Bestellungen zu\naktivieren bzw. zu deaktivieren.\n</p><p>\nDer Kunde wird mit einer Schritt-für-Schritt Anleitung durch den Prozess einer\nRücksendung geführt. Innerhalb der Liste seiner Bestellungen kommt er direkt mit einem\nLink auf die Liste der Rücksendungen einer Bestellung oder zum Formular zum Anlegen neuer Rücksendungen.\nDazu kann er sich auch ein Rücksende-Dokument als PDF\nherunterladen und dem Paket beilegen. Sie erhalten als Shopbetreiber auf Wunsch\neine Email, sobald eine Rücksendung angelegt wurde.\n</p><p>\nZudem haben Ihre Kunden - unter Beachtung von verschiedenen Bedingungen (z.B. Kundengruppe) - die Möglichkeit direkt ein DHL\noder UPS Retouren Label zu erstellen und auszudrucken.\n</p><p>\nInnerhalb der Administration finden Sie unter dem Reiter \"Bestellungen\" den neuen Menüpunkt \"Rücksendungen\".\nHier können Sie jede eingegangene Rücksendung einsehen und bearbeiten. Um den Vorgang besser in\nIhre eigenen Prozesse zu integrieren, können sie auch alle Status selber definieren - vorhandene Status löschen und editieren\noder neue Status anlegen (z.B. \"Rücksendung wartet auf Rückmeldung durch Hersteller\").\n</p><h4>Gäste und SEO Url</h4><p>\n\nSie können eine SEO Url angeben, die Sie (z.B. für Gäste) direkt verlinken können. So kann das\nFormular zum Anlegen einer Rücksendung z.B. unter https://www.domain.de/ruecksendung erreichbar\nsein. Bitte tragen Sie dazu in der Plugin Konfiguration die gewünschte SEO Url ohne (!) die\nDomain ein - also z.B. \"ruecksendung\".\n\n</p><p>\n\nIn diesem Formular kann sich jeder Kunde unter Angabe der Bestellnummer und zugehörigen Email Adresse anmelden\nund seine vorhandenen Rücksendungen einsehen oder eine neue Rücksendung anlegen.\nSollte der Kunde die Bestellnummer und/oder die Email Adresse vergessen haben, dann kann er auch\nnach dem Nachnamen und einer passenden Postleitzahl nach vergangenen Bestellungen suchen.\n\n</p><h4>Produkte in Bestände buchen</h4><p>\n\nInnerhalb der Administration einer Rücksendung haben Sie die Möglichkeit ausgewählte Produkte\ndirekt zurück in den Bestand zu buchen. So können Produkte, die tatsächlich (z.B. als FAG Rücksendung) zurück gesendet wurden\nund wieder in den Verkauf können, direkt eingebucht werden.\n\n</p><h4>Fristen</h4><p>\n\nSie können in der Plugin Konfiguration definieren, ob eine Rücksendung nur für einen bestimmten Zeitraum (ab\nVersand) angelegt werden darf. So können Sie z.B. das Erstellen einer Rücksendung nur bis zu 21 Tage nach Versand\nermöglichen. Parallel dazu können Sie eine Frist für das Erstellen von Retouren-Labels (DHL und UPS) definieren.\nSo können Sie z.B. einen kostenfreien Rückversand (via Retouren-Label) nur maximal 14 Tage nach Versand anbieten.\n\n</p><h4>Produkte von Rücksendungen ausschließen</h4><p>\n\nDas Plugin gibt standardmäßig nur \"normale\" Shopware Produkte für eine Rücksendung frei. So können\nz.B. Gutscheine und/oder Rabatte bei einer Rücksendung nicht ausgewählt werden. Sie haben zudem die Möglichkeit\nin den Freitextfeldern von Produkten diese spezifisch von Rücksendungen auszuschließen.\n\n</p><h4>DHL Retouren Label</h4><p>\n\nSie können Ihren Kunden anbieten, dass diese direkt ein DHL Retouren Label für ihre Bestellung\nerzeugen und ausdrucken können. Zudem können sich Ihre Kunden auch ein QR Code speichern,\num damit bei der DHL Filiale ein Label drucken lassen zu können.\n\n</p><p>\nSie können das Erstellen von Labels aktivieren / deaktivieren und können sämtliche Protokolle\nmitschreiben lassen. Meistens reicht ein Blick in die Protokolle, um mögliche Fehler zu erkennen.\nDie Logs Protokolle im Standard Verzeichnis für Logs innerhalb von Shopware.\nAusgehend vom Stammverzeichnis wäre das \"/var/log\".\n\n</p><p>\nBitte achten Sie darauf die Gewichte der Artikel im backend korrekt zu pflegen.\nDas Gewicht auf dem Label berechnet sich automatisch nach den ausgewählten Artikeln.\n\n\n\n\n</p><p>\n\nSie können mit der Schnittstelle zum DHL Geschäftskundenportal ein\nRetouren Label erzeugen lassen. Das Label enthält dabei automatisch Sie als Empfänger\nund den Kunden als Absender.\n\n\n</p><p>\n\nUm DHL Labels erzeugen zu können, benötigen Sie einen Zugang zum DHL Geschäftskundenportal.\nZudem müssen Sie für die Versandabwicklung über das Geschäftskundenportal berechtigt sein.\nFür eine Freischaltung wenden Sie sich bitte an Ihren DHL Kundenberater.\n\n\n\n</p><h4>DHL Retouren Label via DHL Geschäftskundenportal - Live Einstellungen</h4><p><b>Kunden-/EKP-Nummer:</b><br />\nIhre 10-stellige DHL Kundennummer.<br /><br /><b>Verfahrens-Nummer:</b><br />\nDie Verfahrens-Nummer für den DHL Versand. Beispiel: 07 für Deutschland, 53 für Österreich.<br /><br /><b>Teilnahme-Nummer:</b><br />\nEine 2-stellige Nummer zur Untergliederung von Abrechnungen nach Standorten, Saisongeschäft oder\nunterschiedlichen Konditionen. Die Teilnahmenummern der verschiedenen DHL Produkte entsprechen\njeweils den letzten zwei Stellen der zugehörigen Abrechnungsnummern.<br /><br /><b>Retourenempfänger:</b><br />\nIm DHL Geschäftskundenportal im Menü \"Retoure\" im Untermenü \"Einstellungen\" werden Ihnen alle\nRetourenempfängernamen (=ReceiverIds) aufgelistet. Bitte geben Sie hier die gewünschte\n\"Receiver Id\" an.<br /><br /><b>DHL Geschäftskundenportal Benutzer:</b><br />\nDer Benutzer aus dem DHL Geschäftskundenportal. Der Benutzer muss für Retoure berechtigt sein!\nIdealerweise legen Sie einen weiteren Benutzer für die Erstellung der Labels an.\n<br /><br /><b>DHL Geschäftskundenportal Passwort:</b><br />\nDas Passwort des oben genannten Benutzers. Die Passwortgültigkeit eines \"Benutzers\" beträgt 90 Tage.\nDie Passwortgültigkeit eines \"Systembenutzers\" beträgt 365 Tage. Mit einem \"Systembenutzer\" ist eine\nAnmeldung am DHL Geschäftskundenportal nicht möglich.\n\n\n\n\n\n\n\n</p><h4>DHL Retouren Label via DHL Geschäftskundenportal - Sandbox Einstellungen</h4><p><b>Entwicker ID und Entwicklerportal Passwort:</b><br />\nDie Entwickler ID finden Sie im DHL Entwicklerportal unter \"Mein Konto\" (einfach Ihren Namen oben rechts\nanklicken). Als Passwort verwenden Sie das Passwort mit dem Sie sich am Entwicklerportal angemeldet haben.\n\n\n\n\n</p><h4>DHL Retouren Label im Ausland</h4><p>\n\n\nSie können pro Land und/oder Verkaufskanal unterschiedliche DHL Zugangsdaten hinterlegen.\nDazu finden Sie - neben der Plugin Konfiguration - innerhalb der Shopware Konfiguration\nden Menüpunkt \"DHL Zugangsdaten für Rücksendungen\". Wenn Sie hier für das Land Österreich\neinen eigenen Datensatz hinterlegen, dann wird für sämtliche Kunden aus Österreich ein\nDHL Label mit diesen Zugangsdaten erzeugt.\n\n\n\n</p><h4>UPS Retouren Label</h4><p>\n\nSie können auch - zusätzlich zum DHL Label oder statt des DHL Labels - Ihren Kunden ein\nUPS Retouren Label zur Verfügung stellen. Dazu müssen Sie die entsprechende Option\nin der Plugin Konfiguration aktivieren und sämtliche Zugangsdaten hinterlegen.\n\n\n\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>prüfen Sie die Plugin Konfiguration, ob diese Ihren Wünschen entspricht</li><li>definieren Sie insbesondere gültige Bestellstatus und/oder Kundengruppen</li><li>definieren Sie Ihre gewünschten Gründe und Vorgehensweisen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.domain.de/dvsn/return-shipment</li><li>das Formular finden Sie alternativ unter https://www.domain.de/ruecksendung</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL und/oder UPS Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die Plugin Beschreibung</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>PHP 7 und PHP 8 kompatibel</strong><br />\nDie Erweiterung ist vollständig zu PHP 7.x und PHP 8.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDie Erweiterung verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend bzw. in der Administration in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Subshop bzw. pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDie Erweiterung ist stets zur aktuellen Shopware Version und zum Shopware Standard Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Erweiterungen von Drittanbietern nutzen, dann sollten Sie die Erweiterung vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - die Erweiterung ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\ndie Erweiterung kann kostenlos und unverbindlich 30 Tage lang getestet werden (siehe kostenfreien Probe-Monat der Miet-Lizenz)\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Hersteller dieser Erweiterung haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung der Erweiterung entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Kontakt</h4><ul><li><strong>Anschrift</strong><br />\nHevener Straße 65<br />\n44797 Bochum\n</li><li><strong>Telefon</strong><br />\n(+49) 234 97354482\n</li><li><strong>Internet</strong><br />\ninfo@digitvision.de<br />\nhttps://www.digitvision.de\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Erweiterungen entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Erweiterungen ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>konfigurieren Sie das Plugin nach Ihren Wünschen</li><li>definieren Sie Ihre gewünschten Gründe für Rücksendungen</li><li>definieren Sie gültige Bestellstatus oder Kundengruppen</li><li>verlinken Sie auf einer beliebigen Stelle Ihres Shops (z.B. Kategorie, Shopseite etc) auf das Formular zum Anlegen einer Rücksendung (z.B. für Gäste)</li><li>das Formular finden Sie unter https://www.domain.de/dvsn/return-shipment</li><li>registrierte Kunden können Rücksendungen zusätzlich immer direkt aus ihrem Kundenkonto anlegen</li><li>für die Erstellung eines DHL Retouren Labels benötigen Sie entsprechende Zugangsdaten. Bitte beachten Sie die Plugin Beschreibung</li></ul>","version":"3.0.2","changelog":[{"version":"3.0.2","text":"- fixed setup components\n\n<br />\n- added check for multiple form submit to create a return shipment","creationDate":{"date":"2023-07-05 13:11:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"- added shopware 6.5 compatibility","creationDate":{"date":"2023-03-29 10:04:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.12","text":"- fixed check for invalid customer in administration list","creationDate":{"date":"2022-12-14 16:51:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.11","text":"- fixed creation date within return dashboard","creationDate":{"date":"2022-09-08 16:25:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.10","text":"- added custom page structs for every controller action","creationDate":{"date":"2022-09-06 10:05:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.9","text":"- fixed missing translations","creationDate":{"date":"2022-08-06 12:02:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.8","text":"- fixed shopware 6.4.13 compatibility","creationDate":{"date":"2022-07-16 11:49:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.7","text":"- removed jquery<br />\n- fixed return shipment list for invalid elements with deleted order or customer","creationDate":{"date":"2022-07-12 13:10:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.6","text":"- added custom blocks to administration template","creationDate":{"date":"2022-06-27 15:31:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"- changed behaviour of splitting invalid customer address of street and number","creationDate":{"date":"2022-06-13 17:41:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"- fixed shopware 6.4.11 compatibility","creationDate":{"date":"2022-05-05 08:52:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"- fixed app installation for de-ch locale\n\n<br />\n\n- added check for deadline order delivery state\n\n<br />\n\n- fixed dhl label sandbox api test","creationDate":{"date":"2022-02-24 21:07:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"- added app configuration to enable mandatory checklist for creating a return shipment<br />\n- added app configuration to enable multiple labels per return shipment<br />\n- added modal popup when clicking on the label before clicking on the document<br />\n- redesigned return shipments details<br />\n- renamed label and qrcode columns to dhl_label and dhl_qrcode","creationDate":{"date":"2022-01-22 08:41:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"- fixed faulty operators within twig templates","creationDate":{"date":"2022-01-20 16:52:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"- added support for multiple return shipments per order\n<br />\n- added app module for selectable procedures for every return shipment line item<br />\n- moved administration of return shipment line item reasons from app configuration to app module within shopware settings<br />\n- added app configuration to select a valid period/date for shipped orders for creating a new return shipment<br />\n- added app configuration to select only valid countries for dhl label<br />\n- added app configuration to select a procedure-number for dhl label credentials<br />\n- added app module to use different dhl label credentials for different countries<br />\n- added shipment number to return shipment when creating a dhl label<br />\n- added app configuration to define minimum value of return shipment items to create a dhl label<br />\n- added product custom field to ban a product from being added to any return shipment<br />\n- added ups return shipment labels<br />\n- added app configuration to select a valid period/date for shipped orders for creating return labels<br />\n- added app module to add configurable return shipment status<br />\n- added possibility to search for lost order numbers and/or email addresses<br />\n- added notice to return shipment details if a voucher was redeemed in the associated order<br />\n- added clickable order number and customer number to return shipment list<br />\n- added filter and improved search for return shipment list<br />\n- added possibility to increase the stock for returned products directly within the administration of the return shipment<br />\n- fixed customer messages on return shipment detail page<br />\n- added current status to return shipment detail page<br />\n- redesigned creating return shipments<br />\n- restructured subscriber, controllers and services<br />\n- changed the sender of the notification email to the default shop email address<br /><br />\nWICHTIGER HINWEIS - bitte bei einem Update beachten!<br />\n- mehrere Rücksendungen pro Bestellung sind nach dem Update automatisch aktiviert. Wenn Sie weiterhin nur eine Rücksendung pro Bestellung erlauben möchten, dann müssen Sie die Plugin Konfiguration entsprechend anpassen<br />\n- die Angabe einer gewünschten Vorgehensweise für die einzelnen Produkte von Rücksendungen ist nach dem Update automatisch aktiviert. Wenn Sie die Angabe von Vorgehensweisen deaktivieren möchten, dann müssen Sie die Plugin Konfiguration entsprechend anpassen<br />\n- die Gründe wurden aus der Plugin Konfiguration entfernt und können nun im Menüpunkt \"Gründe für Rücksendungen\" unter \"Einstellungen\" gepflegt werden. Wenn Sie eigene, individuelle Gründe in der Plugin Konfiguration gepflegt hatten, dann müssen Sie diese erneut im neuen Menüpunkt hinterlegen. Individuelle Gründe aus der Plugin Konfiguration wurden nicht automatisch übernommen","creationDate":{"date":"2022-01-14 18:18:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"- fixed configuration for different sales channels","creationDate":{"date":"2021-09-15 09:52:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"- added check for invalid order status when creating return shipments as a guest","creationDate":{"date":"2021-09-11 11:35:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"- fixed invalid whitespace","creationDate":{"date":"2021-08-20 15:34:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"- fixed product list in administration","creationDate":{"date":"2021-06-02 09:43:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- fixed installation for invalid languages\n\n<br />\n\n- fixed missing footer payment and shipping logos\n\n\n<br />\n\n- added optional dhl label as qr code\n<br />\n- added shopware 6.4 compatibility","creationDate":{"date":"2021-05-13 12:11:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"- added compatibility to \"Article configurator for selectable sets and bundles\" plugin","creationDate":{"date":"2021-01-10 11:25:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"- removed custom meta.html.twig","creationDate":{"date":"2021-01-04 08:39:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"- fixed pdf generation for renamed documents","creationDate":{"date":"2020-12-18 15:41:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"- added link to the number within the administration return list","creationDate":{"date":"2020-10-04 09:01:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"- fixed creating return shipments for guests","creationDate":{"date":"2020-08-13 07:41:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- added shopware 6.3 compatibility","creationDate":{"date":"2020-08-06 10:34:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"- added twig parser to the internal mail subject to accept and parse variables","creationDate":{"date":"2020-07-23 11:58:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- added custom seo url to plugin configuration","creationDate":{"date":"2020-07-07 08:56:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- fixed invalid plugin configuration<br />\n- fixed display of customer name<br />\n- fixed missing translations","creationDate":{"date":"2020-06-19 18:40:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2020-05-15 13:29:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn392787929131","redirectToStore":false,"lowestPriceValue":49}