{"id":8978,"name":"LenzPlatformVatIdValidation","code":"lenz698198643790","lastChange":{"date":"2023-07-18 11:16:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmMAkcA","examplePageUrl":"","moduleKey":"LenzPlatformVatIdValidation","creationDate":{"date":"2019-05-24 08:54:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-03-17 15:53:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-03-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-05-09 13:27:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":245,"prefix":"lenz","name":"LENZ eBusiness GmbH","website":"//lenz-ebusiness.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod245_scs-hersteller-logo.png"},"infos":[{"id":13886,"name":"Umsatzsteuer-(USTID)-Validierung PRO für B2B","description":"<p>Mit unserer App USTID Validierung PRO für B2B kannst Du USTIDs in Deinem Shop prüfen und dem Kunden eine steuerfreie Lieferung (ab v1.0.6) ermöglichen. Die App bietet zahlreiche Funktionen, die für Dich wichtig sind, wenn Du häufig mit EU-Unternehmen handeln. Nachfolgend lernst Du die App kennen:</p><p></p><h2>Funktionen</h2><p></p><ul><li>Prüft USTID von EU-Unternehmen.</li><li>Jede Anfrage an eine Schnittstelle wird geloggt und in der Datenbank gespeichert.&nbsp; So kannst Du nachweisen, dass Du die USTID geprüft hast.&nbsp;</li><li>Die Validierung erfolgt automatisch 1x pro Tag, wenn der Kunde im Onlineshop aktiv ist, oder bei Änderung der Adresse. Bei einer Adressänderung wird die neue Lieferadresse sofort überprüft.</li><li>Eine Validierung der USTID bei der Registrierung ist optional möglich.</li><li>Beim Hinterlegen der USTID im Kundenaccount wird diese validiert und auf ihre Gültigkeit überprüft.&nbsp;</li><li>Deine Kunden bekommen auf der Bestellbestätigungsseite (Checkout) direkt angezeigt, ob die Validierung erfolgreich war und wenn nicht, werden die Validierungsfehler mit Lösungsvorschlägen in einer Übersicht direkt angezeigt.&nbsp;</li><li>Die Validierung der USTID erfolgt für Deine Kunden, die ihren Sitz&nbsp;in Länder haben, die als steuerfrei gekennzeichnet sind, beim Bestellabschluss. Ist die USTID korrekt wird die Bestellung ohne MwSt angezeigt.</li><li>Zu Beachten gilt: Die Länder, die steuerfrei sind, müssen unter Einstellungen -&gt; Shop -&gt; Länder für jedes Land eingestellt werden. Dies war zuvor in der App möglich und ist jetzt in den Shopware Standard gewechselt.&nbsp;</li><li>Zu Beachten gilt: Deutsche USTIDs werden nicht validiert.&nbsp;</li><li>Hinweis: Bei der Registrierung wird unabhängig von den App-Einstellungen immer die Rechnungsadresse geprüft.&nbsp;</li><li>Für die Validierung von Unternehmen aus Nordirland muss Nordirland als eigenes Land angelegt werden und dort Steuerfrei für Unternehmen aktiviert werden. Als Länder-ISO für Nordirland muss GB oder XI hinterlegt werden.</li><li>Ab Version 2.0.22: Im Kundenaccount kann über ein Zusatzfeld der Validierungstype für diesen Kunden individuell angepasst werden.&nbsp;</li></ul><h2>Optionen</h2><p></p><p></p><ul><li><b>Ihre Umsatzsteuer-ID:</b> Gib hier Deine Umsatzsteuer-ID ein, damit unsere App die Umsatzsteuer-IDs Deiner Kunden prüfen kann.</li><li><b>Adresse für Validierung: </b>Du kannst festlegen welche Adresse als Grundlage für die Validierung dienen soll. Zur Auswahl stehen die Rechnungs- oder Lieferadresse. Wir empfehlen stets die Lieferadresse zu verwenden.&nbsp;</li><li><b>Validierung bei Registrierung:</b> Die Validierung der UST-ID erfolgt bei der Registrierung. Unter den Validierungstypen \"Keine\", \"Offline\", \"Einfach\" und \"Erweitert\" kann gewählt werden. Bei \"Offline\" wird nur der Offline-Plausibilitätscheck (mehr als drei Zeichen und weniger als 15 Zeichen) durchgeführt. Bei \"Einfach\" wird geprüft, ob die Umsatzsteuer-ID gültig ist. Bei \"Erweitert\" wird geprüft, ob USTID und Adresse zueinander passen sowie passende Vorschläge zur Korrektur werden angezeigt.&nbsp;</li><li><b>Validierung bei Profil-Update:</b> Die Validierung der UST-ID erfolgt bei der Änderung der USTID im Profil Deines Kunden. Die Validierungstypen \"Keine\", \"Offline\" und \"Einfach\" stehen zur Auswahl. Bei \"Offline\" wird nur der Offline-Plausibilitätscheck (mehr als drei Zeichen und weniger als 15 Zeichen) durchgeführt. Bei \"Einfach\" wird geprüft, ob die Umsatzsteuer-ID gültig ist.</li><li><b>Validierung bei Steuerfreiheit + Bestellabschluss:</b> Du kannst festlegen, welcher Validierungstyp für Deine Kunden gewählt wird, die aufgrund ihres Landes steuerfrei bestellen können. Zur Auswahl stehen die Validierungstypen \"Offline\", \"Einfach\" und \"Erweitert\". Bei \"Offline\" wird nur der Offline-Plausibilitätscheck (mehr als drei Zeichen und weniger als 15 Zeichen) durchgeführt. Bei \"Einfach\" wird geprüft, ob die Umsatzsteuer-ID gültig ist. Bei \"Erweitert\" wird geprüft, ob USTID und Adresse zueinander passen sowie passende Vorschläge zur Korrektur werden angezeigt.</li><li><b>Validierung als \"valide\" durchgehen lassen, wenn von allen APIs ein Fehler zurückgegeben wird:</b> aktiv / inaktiv</li><li><b>Zusätzliche Validierung für steuerfreie Lieferung:</b> Es gibt die Validierungstypen \"Keine\", \"gleiche Adresse\" und \"Gleiches Land bei Rechnungs- und Lieferadresse\". Die App überprüft bei \"Gleiche Adresse\", ob die ausgewählte Adresse mit der Adresse der USTID übereinstimmt. So kannst Du verhindern, dass ausländische Kunden die USTID einer Firma angeben können und dann die Ware steuerfrei an ihre private Adresse geliefert bekommen. Bei \"Gleiches Land bei Rechnungs- und Lieferadresse\" wird überprüft ob das Lieferland von Liefer- und Rechnungsadresse identisch ist.&nbsp;</li><li><b>Hinweis auf /checkout/confirm anzeigen, wenn bei Land mit \"Steuerfreiheit (B2B)\" keine USTID hinterlegt ist</b></li><li><b>Adressvorschläge ins lateinische Alphabet übersetzen?</b></li><li><b>Bestellung blockieren, wenn USTID-Prüfung nicht gültig ist? </b>Mit dieser Funktion kannst Du verhindern, dass Bestellungen abgeschlossen werden können, wenn die USTID-Prüfung nicht gültig ist. Erst wenn die USTID-Prüfung valide ist, kann die Bestellung abgeschlossen werden.</li></ul><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><h2>Hinweise zu APIs</h2><h3>EU-API</h3><ul><li>Estland:&nbsp; Keine Validierung der Stadt über EU-API möglich.</li><li>Irland:&nbsp;Postleitzahl über EU-API nicht validierbar.</li><li>Litauen: Postleitzahl über EU-API nicht validierbar.</li><li>Rumänien:&nbsp;Postleitzahl über EU-API nicht validierbar.</li><li>Spanien:&nbsp;Keine Validierung möglich, daher wird Spanien immer durchgelassen. Bitte prüfe spanische USTIDs manuell.</li></ul><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p><br></p><p>Bitte frage z.B. Deinen Steuerberater wie Du Unterlagen für die Finanzbehörden vorhalten musst. Wir übernehmen dafür keine Haftung.</p><h2><b>Voraussetzungen:</b></h2><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><ul><li>php-soap</li></ul><br><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p>Infos zur innergemeinschaftlichen Lieferung findest Du hier:&nbsp;<a href=\"https://www.frankfurt-main.ihk.de/recht/steuerrecht/umsatzsteuer_international/innergemeinschaftliche_lieferungen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.frankfurt-main.ihk.de/recht/steuerrecht/umsatzsteuer_international/innergemeinschaftliche_lieferungen/</a></p><h2>Weitere Informationen</h2><p><b>Allgemein&nbsp;<br></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der App nicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können.&nbsp;</p><p><b>Kompatibilität&nbsp;<br></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der Appbeschreibung an. <br>Wir können die Kompatibilität unserer Apps zu Apps anderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angebotenen Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support&nbsp;<br></b>Wir prüfen ob der angegebene Fehler von unseren Apps verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unseren Apps vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion&nbsp;<br></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unsere App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicher zu gehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen<br></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unsere App, das in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion?&nbsp;<a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"nooper\">Dann teile uns Deinen Featurewunsch mit.</a></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur&nbsp;<a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"nooper\">Newsletter Anmeldung</a>.<br>Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt.&nbsp;","installationManual":"<p></p><ul><li>Installieren</li><li>aktivieren</li><li>konfigurieren (USTID eintragen UND Validierung bei Adressänderung =&gt; ja UND Validierung bevor Bestellung gespeichert wird =&gt; ja)</li><li>Einstellungen -&gt; Shop -&gt; Login / Registrierung -&gt; Aktiviere \"Auswahl zwischen Firmen- und Kundenkonto anzeigen\"</li><li>Für Länder, die steuerfrei sind (bspw. Frankreich), müssen unter Einstellungen -&gt; Shop -&gt; Länder \"Steuerfrei (B2B)\" aktiviert werden.&nbsp;</li><li>fertig</li></ul><p><br></p><b>Zu Beachten bei einem Update auf 6.4.0.0:</b><br>Nach dem Update ist eine Neukonfiguration der App notwendig. Bitte öffne die Konfiguration der App und stelle die Einstellungen wie gewünscht ein.&nbsp;Unsere Empfehlung:<ul><li>Adresse für Validierung: Lieferadresse</li><li>Validierung bei Registrierung: Erweitert</li><li>Validierung bei Profil-Update: Einfach</li><li>Validierung bei Steuerfreiheit + Bestellabschluss: Erweitert</li><li>Validierung als \"valide\" durchgehen lassen, wenn von allen APIs ein Fehler zurückgegeben wird: aktiv</li><li>Zusätzliche Validierung für steuerfreie Lieferung: Gleiches Land bei Rechnungs- und Lieferadresse</li></ul>Nach dem Update müssen die Länder, die steuerfrei sind, unter Einstellungen -&gt; Shop -&gt; Länder für jedes Land eingestellt werden. Dies war davor in der App möglich und ist jetzt in den Shopware Standard gewechselt.<p></p><p><br></p><p>Konfigurationshinweise:</p><p></p><ul><li>Gib in den Einstellungen Ihre USTID ohne Leerzeichen ein, damit die Validierung funktioniert!<br></li><li>Aktiviere die Validierung bei Adressänderung und bei Bestellabschluss. Sofern es Probleme bei der allgemeinen Adressvalidierung gibt, deaktiviere die Validierung bei Adressänderung. Wir raten davon ab die Validierung bei Bestellabschluss zu deaktivieren!</li><li>Konfiguriere die Länder, für die Du eine steuerfreie Lieferung ermöglichen möchten!</li></ul>","shortDescription":"Validiere die Umsatzsteuer-ID Deiner Kunden einfach mit unserer App mit vielen Optionen, um Deinen Pflichten nach dem EU-Steuerrecht ausreichend nachzukommen.","highlights":"Verbesserungsvorschläge für Adressdaten auf Basis der Daten der Finanzbehörden\nApp bereits für Shopware 5 lange erhältlich\nSchnelle Hilfe bei Problemen mit der Validierung von Kundendaten über unseren Support\nEntwickelt mit B2B-Shopbetreibern","features":"Validiert die EU-Umsatzsteuer-ID / USTID\nDirekte Schnittstellenanbindung an DE- / EU-API\nBei Eingabe falsche Daten werden Vorschläge zur Verbesserung angezeigt\nBestellung auf Steuerfrei stellen, wenn USTID hinterlegt ist\nNettopreis-Bestellungen im Warenkorb für ausgewählte Länder nach Eingabe einer USTID."},{"id":14938,"name":"VATID Validation PRO for B2B","description":"<p>Enchance the vat id validation in your Shopware shop with our app&nbsp;\"VAT-ID Validation PRO\". This app&nbsp;adds many functions that are important for you if you deliver to companies in the European Union. Here are the functions of our app:</p><h2>Functionallity</h2><p></p><ul><li>Checks vat id of companies in the European Union</li><li>Every request to an api is logged in the database, so you can prove, that you checked if the vat is valid.</li><li>Validation takes place automatically 1x per day when the customer is active in the online shop or when the address changes. In the event of a change of address, the new delivery address is checked immediately.</li><li>A validation of the USTID during registration is optionally possible.</li><li>When the USTID is stored in the customer account, it is validated and checked for validity.&nbsp;</li><li>Your customers are shown directly on the order confirmation page (checkout) whether the validation was successful and if not, the validation errors are displayed directly in an overview with suggested solutions.&nbsp;</li><li>The validation of the USTID takes place for your customers who have their registered office in countries that are marked as tax-exempt, at the conclusion of the order.&nbsp;If the USTID is correct, the order will be displayed without VAT.</li><li>Please note: The countries that are tax-free must be set for each country under Settings -&gt; Shop -&gt; Countries. This was previously possible in the app&nbsp;and has now changed to the Shopware standard.&nbsp;</li><li>Please note: German USTIDs are not validated.</li><li>Note: During registration, the billing address is always checked, regardless of the app&nbsp;settings.</li><li>For the validation of companies from Northern Ireland, Northern Ireland must be created as a separate country and activated there \"Tax free for companies\". The country ISO for Northern Ireland must be GB or XI.</li><li>From version 2.0.22: In the customer account, the validation type for this customer can be individually adjusted via an custom field.</li></ul><h2>Options</h2><p></p><ul></ul><p></p><ul><li><b>Your vat id:</b> Enter your vat id here, that the app&nbsp;can validate your customers vat id.</li><li><b>Address for validation:&nbsp;</b>You can specify which address is to serve as the basis for validation. You can choose between the billing address or the delivery address. We recommend that you always use the delivery address.&nbsp;</li><li><b>Validation on registration:</b>&nbsp;The validation of the UST-ID takes place during registration. You can choose between \"None\", \"Offline\", \"Simple\" and&nbsp;\"Extended\". \"Offline\" triggers only offline validation (more than 3 characters and less than 15).&nbsp;\"Simple\" checks if vat is is valid. \"Extended\" checks if vat id is valid and vat id belongs to address&nbsp;and suitable suggestions for correction are displayed.</li><li><b>Validation on profile update:</b>&nbsp;The validation of the UST-ID takes place when the USTID is changed in the profile of your customer. The validation types \"None\", \"Offline\" and \"Simple\" are available for selection. With \"Offline\", only the offline plausibility check (more than three characters and less than 15 characters) is carried out. With \"Simple\" it is checked whether the VAT ID is valid.</li><li><b>Validation on taxfree delivery + checkout:</b> You can determine which validation type is selected for your customers who can order tax-free due to their country. You can choose between the validation types \"Offline\", \"Simple\" and \"Extended\". With \"Offline\", only the offline plausibility check (more than three characters and less than 15 characters) is carried out. With \"Simple\" it is checked whether the VAT ID is valid. With \"Extended\", the system checks whether the VAT ID and the address match each other and displays suitable suggestions for correction.</li><li><b>Accept Validation if all APIs return an error:</b> active/ inactive</li><li><b>Additional validation for taxfree shipping:</b> There are the validation types \"None\", \"Same address\" and \"Same country for billing and shipping\". The app&nbsp;checks whether the selected address matches the address of the USTID for \"Same address\". This way you can prevent foreign customers from entering the USTID of a company and then having the goods delivered tax-free to their private address. With \"Same country for billing and shipping\" it is checked whether the delivery country of the delivery and billing address is identical.&nbsp;</li><li><b>Show notice if empty vat id on /checkout/confirm page and \"Tax-free (B2B)\" for that country enabled.</b></li><li><b>Translate address suggestion to latin alphabet?</b></li><li><b>Block order with invalid vat id check?&nbsp;</b>With this function you can prevent orders from being completed if the USTID check is not valid. Only when the USTID check is valid, the order can be completed.</li></ul><p><br></p><h2>Notices to APIs:</h2><h3>EU-API:</h3><p></p><ul><li>Bulgaria: Api currently not responding. Will marked as validated.</li><li>Estland: No validation of city possible.</li><li>Ireland: Zipcode can not be validated.</li><li>Litauen: Zipcode can not be validated.</li><li>Romania: Zipcode can not be validated.</li><li>Spain: No validation possible. Spain is always marked as valid. Please check spain vat ids manually.</li></ul><p></p><p><br></p><p>Please check with you tax accountant if the app&nbsp;is suitable for you. We cannot take responsibility.</p><p><br></p><p>Requirements:</p><p></p><ul><li>php-soap</li></ul><p></p>","installationManual":"<p></p><ol><li>Install and activate the app</li><li>configure</li><li>Settings -&gt; Shop -&gt; Login / Registration -&gt; Enable \"Show selection between company and customer account\"</li><li>for countries that are tax-exempt, \"Tax-free (B2B)\" must be activated under settings -&gt; shop -&gt; countries&nbsp;</li><li>finished</li></ol><br><p><b>To be noted when updating to 6.4.0.0:<br></b>After the update, a reconfiguration of the plug-in is necessary. Please open the configuration of the app&nbsp;and adjust the settings as desired.&nbsp;Our recommendation:</p><p></p><ul><li>Address for validation: delivery address</li><li>Validation on registration: extended (DE+ EU with suggestions)</li><li>Validation on profile update: simple (DE + EU)</li><li>Validation on taxfree delivery + checkout: Extended (DE + EU with suggestions)</li><li>Accept validation if all APIs return an error: active</li><li>Additional validation for taxfree shipping: same country for billing and shipping</li></ul>After the update, the countries that are tax-exempt must be set under settings -&gt; shop -&gt; countries for each country.<p></p><p><br></p><p><b>Configuration hints:</b></p><p></p><ul><li>Enter your VAT-ID in the settings without spaces so that the validation works!<br></li><li>Activate the validation on change of address and on order completion. If there are problems with the general address validation, deactivate the validation at change of address. We do not recommend deactivating the validation at order completion!<br></li><li>Configure the countries for which you want to enable tax-free delivery!<br></li></ul><p></p>","shortDescription":"Validate your customers vat ids with our vat id validation app. This is needed if you want to send tax free deliveries in other eu countries to be safe.","highlights":"Improvement suggestions for address data based on data from the tax authorities\napp  already available for Shopware 5\nFast help with validation problems of customer data via our support\nDeveloped with B2B shop owners","features":"Validates the EU VAT-ID / USTID\nDirect interface connection to DE- / EU-API\nImprovement suggestions are displayed when incorrect data is entered\nSet order to tax-free if USTID is deposited\nNet price orders in the shopping cart for selected countries after entering a USTID"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":156859,"bookingKey":"lenz698198643790","bookingText":"VATID Validation PRO for B2B (SW6)","price":495,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":159740,"bookingKey":"lenz698198643790_M","bookingText":"VATID Validation PRO for B2B (SW6)","price":49.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLYjZjr","preview":true,"priority":0,"id":119175},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphiMTll","preview":false,"priority":0,"id":77668},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVxzS5d","preview":false,"priority":0,"id":77670},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNrNdNc","preview":false,"priority":0,"id":77672},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2pKCXD","preview":false,"priority":0,"id":77673},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZzyS41","preview":false,"priority":0,"id":77676},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDGSMpZ","preview":false,"priority":0,"id":80742},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpC5OQT8","preview":false,"priority":0,"id":109292}],"comments":[{"authorName":"Frank Schmidt","text":"Ein tolles Plugin, dass uns im Alltag unterstützt und ohne Probleme funktioniert. Treten Fragen auf antwortet der Support schnell und professionell! Anpassungswünsche werden angenommen und zeitnah umgesetzt.","headline":"Plugin mit gutem Support","creationDate":{"date":"2022-03-02 13:47:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Leo","text":"Das Plugin ist eine Riesenerleichterung im B2B Bereich. Es funktioniert sehr zuverlässig mit vielfältigen Einstellungsmöglichkeiten. Der Support ist sehr zuverlässig und professionel.","headline":"sehr nützlich","creationDate":{"date":"2022-01-28 19:58:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Umsatzsteuer-(USTID)-Validierung PRO für B2B","description":"<p>Mit unserer App USTID Validierung PRO für B2B kannst Du USTIDs in Deinem Shop prüfen und dem Kunden eine steuerfreie Lieferung (ab v1.0.6) ermöglichen. Die App bietet zahlreiche Funktionen, die für Dich wichtig sind, wenn Du häufig mit EU-Unternehmen handeln. Nachfolgend lernst Du die App kennen:</p><p></p><h2>Funktionen</h2><p></p><ul><li>Prüft USTID von EU-Unternehmen.</li><li>Jede Anfrage an eine Schnittstelle wird geloggt und in der Datenbank gespeichert.  So kannst Du nachweisen, dass Du die USTID geprüft hast. </li><li>Die Validierung erfolgt automatisch 1x pro Tag, wenn der Kunde im Onlineshop aktiv ist, oder bei Änderung der Adresse. Bei einer Adressänderung wird die neue Lieferadresse sofort überprüft.</li><li>Eine Validierung der USTID bei der Registrierung ist optional möglich.</li><li>Beim Hinterlegen der USTID im Kundenaccount wird diese validiert und auf ihre Gültigkeit überprüft. </li><li>Deine Kunden bekommen auf der Bestellbestätigungsseite (Checkout) direkt angezeigt, ob die Validierung erfolgreich war und wenn nicht, werden die Validierungsfehler mit Lösungsvorschlägen in einer Übersicht direkt angezeigt. </li><li>Die Validierung der USTID erfolgt für Deine Kunden, die ihren Sitz in Länder haben, die als steuerfrei gekennzeichnet sind, beim Bestellabschluss. Ist die USTID korrekt wird die Bestellung ohne MwSt angezeigt.</li><li>Zu Beachten gilt: Die Länder, die steuerfrei sind, müssen unter Einstellungen -&gt; Shop -&gt; Länder für jedes Land eingestellt werden. Dies war zuvor in der App möglich und ist jetzt in den Shopware Standard gewechselt. </li><li>Zu Beachten gilt: Deutsche USTIDs werden nicht validiert. </li><li>Hinweis: Bei der Registrierung wird unabhängig von den App-Einstellungen immer die Rechnungsadresse geprüft. </li><li>Für die Validierung von Unternehmen aus Nordirland muss Nordirland als eigenes Land angelegt werden und dort Steuerfrei für Unternehmen aktiviert werden. Als Länder-ISO für Nordirland muss GB oder XI hinterlegt werden.</li><li>Ab Version 2.0.22: Im Kundenaccount kann über ein Zusatzfeld der Validierungstype für diesen Kunden individuell angepasst werden. </li></ul><h2>Optionen</h2><p></p><p></p><ul><li><b>Ihre Umsatzsteuer-ID:</b> Gib hier Deine Umsatzsteuer-ID ein, damit unsere App die Umsatzsteuer-IDs Deiner Kunden prüfen kann.</li><li><b>Adresse für Validierung: </b>Du kannst festlegen welche Adresse als Grundlage für die Validierung dienen soll. Zur Auswahl stehen die Rechnungs- oder Lieferadresse. Wir empfehlen stets die Lieferadresse zu verwenden. </li><li><b>Validierung bei Registrierung:</b> Die Validierung der UST-ID erfolgt bei der Registrierung. Unter den Validierungstypen \"Keine\", \"Offline\", \"Einfach\" und \"Erweitert\" kann gewählt werden. Bei \"Offline\" wird nur der Offline-Plausibilitätscheck (mehr als drei Zeichen und weniger als 15 Zeichen) durchgeführt. Bei \"Einfach\" wird geprüft, ob die Umsatzsteuer-ID gültig ist. Bei \"Erweitert\" wird geprüft, ob USTID und Adresse zueinander passen sowie passende Vorschläge zur Korrektur werden angezeigt. </li><li><b>Validierung bei Profil-Update:</b> Die Validierung der UST-ID erfolgt bei der Änderung der USTID im Profil Deines Kunden. Die Validierungstypen \"Keine\", \"Offline\" und \"Einfach\" stehen zur Auswahl. Bei \"Offline\" wird nur der Offline-Plausibilitätscheck (mehr als drei Zeichen und weniger als 15 Zeichen) durchgeführt. Bei \"Einfach\" wird geprüft, ob die Umsatzsteuer-ID gültig ist.</li><li><b>Validierung bei Steuerfreiheit + Bestellabschluss:</b> Du kannst festlegen, welcher Validierungstyp für Deine Kunden gewählt wird, die aufgrund ihres Landes steuerfrei bestellen können. Zur Auswahl stehen die Validierungstypen \"Offline\", \"Einfach\" und \"Erweitert\". Bei \"Offline\" wird nur der Offline-Plausibilitätscheck (mehr als drei Zeichen und weniger als 15 Zeichen) durchgeführt. Bei \"Einfach\" wird geprüft, ob die Umsatzsteuer-ID gültig ist. Bei \"Erweitert\" wird geprüft, ob USTID und Adresse zueinander passen sowie passende Vorschläge zur Korrektur werden angezeigt.</li><li><b>Validierung als \"valide\" durchgehen lassen, wenn von allen APIs ein Fehler zurückgegeben wird:</b> aktiv / inaktiv</li><li><b>Zusätzliche Validierung für steuerfreie Lieferung:</b> Es gibt die Validierungstypen \"Keine\", \"gleiche Adresse\" und \"Gleiches Land bei Rechnungs- und Lieferadresse\". Die App überprüft bei \"Gleiche Adresse\", ob die ausgewählte Adresse mit der Adresse der USTID übereinstimmt. So kannst Du verhindern, dass ausländische Kunden die USTID einer Firma angeben können und dann die Ware steuerfrei an ihre private Adresse geliefert bekommen. Bei \"Gleiches Land bei Rechnungs- und Lieferadresse\" wird überprüft ob das Lieferland von Liefer- und Rechnungsadresse identisch ist. </li><li><b>Hinweis auf /checkout/confirm anzeigen, wenn bei Land mit \"Steuerfreiheit (B2B)\" keine USTID hinterlegt ist</b></li><li><b>Adressvorschläge ins lateinische Alphabet übersetzen?</b></li><li><b>Bestellung blockieren, wenn USTID-Prüfung nicht gültig ist? </b>Mit dieser Funktion kannst Du verhindern, dass Bestellungen abgeschlossen werden können, wenn die USTID-Prüfung nicht gültig ist. Erst wenn die USTID-Prüfung valide ist, kann die Bestellung abgeschlossen werden.</li></ul><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><h2>Hinweise zu APIs</h2><h3>EU-API</h3><ul><li>Estland:  Keine Validierung der Stadt über EU-API möglich.</li><li>Irland: Postleitzahl über EU-API nicht validierbar.</li><li>Litauen: Postleitzahl über EU-API nicht validierbar.</li><li>Rumänien: Postleitzahl über EU-API nicht validierbar.</li><li>Spanien: Keine Validierung möglich, daher wird Spanien immer durchgelassen. Bitte prüfe spanische USTIDs manuell.</li></ul><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p><br /></p><p>Bitte frage z.B. Deinen Steuerberater wie Du Unterlagen für die Finanzbehörden vorhalten musst. Wir übernehmen dafür keine Haftung.</p><h2><b>Voraussetzungen:</b></h2><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><ul><li>php-soap</li></ul><br /><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p></p><p>Infos zur innergemeinschaftlichen Lieferung findest Du hier: <a href=\"https://www.frankfurt-main.ihk.de/recht/steuerrecht/umsatzsteuer_international/innergemeinschaftliche_lieferungen/\" target=\"_blank\" rel=\"noreferrer noopener\">https://www.frankfurt-main.ihk.de/recht/steuerrecht/umsatzsteuer_international/innergemeinschaftliche_lieferungen/</a></p><h2>Weitere Informationen</h2><p><b>Allgemein <br /></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der App nicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können. </p><p><b>Kompatibilität <br /></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der Appbeschreibung an. <br />Wir können die Kompatibilität unserer Apps zu Apps anderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angebotenen Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support <br /></b>Wir prüfen ob der angegebene Fehler von unseren Apps verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unseren Apps vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion <br /></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unsere App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicher zu gehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen<br /></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unsere App, das in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion? <a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"noreferrer noopener\">Dann teile uns Deinen Featurewunsch mit.</a></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur <a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter Anmeldung</a>.<br />Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt. ","installationManual":"<p></p><ul><li>Installieren</li><li>aktivieren</li><li>konfigurieren (USTID eintragen UND Validierung bei Adressänderung =&gt; ja UND Validierung bevor Bestellung gespeichert wird =&gt; ja)</li><li>Einstellungen -&gt; Shop -&gt; Login / Registrierung -&gt; Aktiviere \"Auswahl zwischen Firmen- und Kundenkonto anzeigen\"</li><li>Für Länder, die steuerfrei sind (bspw. Frankreich), müssen unter Einstellungen -&gt; Shop -&gt; Länder \"Steuerfrei (B2B)\" aktiviert werden. </li><li>fertig</li></ul><p><br /></p><b>Zu Beachten bei einem Update auf 6.4.0.0:</b><br />Nach dem Update ist eine Neukonfiguration der App notwendig. Bitte öffne die Konfiguration der App und stelle die Einstellungen wie gewünscht ein. Unsere Empfehlung:<ul><li>Adresse für Validierung: Lieferadresse</li><li>Validierung bei Registrierung: Erweitert</li><li>Validierung bei Profil-Update: Einfach</li><li>Validierung bei Steuerfreiheit + Bestellabschluss: Erweitert</li><li>Validierung als \"valide\" durchgehen lassen, wenn von allen APIs ein Fehler zurückgegeben wird: aktiv</li><li>Zusätzliche Validierung für steuerfreie Lieferung: Gleiches Land bei Rechnungs- und Lieferadresse</li></ul>Nach dem Update müssen die Länder, die steuerfrei sind, unter Einstellungen -&gt; Shop -&gt; Länder für jedes Land eingestellt werden. Dies war davor in der App möglich und ist jetzt in den Shopware Standard gewechselt.<p></p><p><br /></p><p>Konfigurationshinweise:</p><p></p><ul><li>Gib in den Einstellungen Ihre USTID ohne Leerzeichen ein, damit die Validierung funktioniert!<br /></li><li>Aktiviere die Validierung bei Adressänderung und bei Bestellabschluss. Sofern es Probleme bei der allgemeinen Adressvalidierung gibt, deaktiviere die Validierung bei Adressänderung. Wir raten davon ab die Validierung bei Bestellabschluss zu deaktivieren!</li><li>Konfiguriere die Länder, für die Du eine steuerfreie Lieferung ermöglichen möchten!</li></ul>","version":"5.0.3","changelog":[{"version":"5.0.3","text":"<p>IMPROVEMENT | Updated HU-Regex.</p>","creationDate":{"date":"2023-06-09 16:14:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.2","text":"<p>TASK | Added nl_NL translation for storefront.</p>","creationDate":{"date":"2023-06-05 14:29:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.1","text":"<p>BUGFIX | Prevent error for not logged in customers.</p>","creationDate":{"date":"2023-05-15 13:29:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"5.0.0","text":"<p>BUGFIX | Order block could be bypassed by changing HTML attribute.<br />IMPROVEMENT | Improved handling for non ascii characters.</p><p>BUGFIX | Shopware 6.5 admin js compatibility.</p>","creationDate":{"date":"2023-05-09 08:34:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.3","text":"<p>IMPROVEMENT | Updated HU-Regex.</p>","creationDate":{"date":"2023-06-09 16:12:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.2","text":"<p>TASK | Added nl_NL translation for storefront.</p>","creationDate":{"date":"2023-06-05 14:28:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.1","text":"<p>BUGFIX | Prevent error for not logged in customers.</p>","creationDate":{"date":"2023-05-15 14:14:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"4.0.0","text":"<p>BUGFIX | Order block could be bypassed by changing HTML attribute.</p><p>IMPROVEMENT | Improved handling for non ascii characters.</p>","creationDate":{"date":"2023-05-09 08:32:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.23","text":"<p>- TASK | Compatibility with Shopware 6.5.</p><p>- FEATURE | Added validation request data to log entity.</p><p><br /></p><p>Requirements:</p><p>- The plugin now requires at least Shopware version 6.5.0.0.</p><p><b>Note: BEFORE UPDATING TO SHOPWARE 6.5.0.0, deactivate the app, then update, then activate.</b></p>","creationDate":{"date":"2023-04-02 12:53:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.22","text":"<p>FEATURE | Added custom field to use different validation type for specific customers.</p><p><br /></p>","creationDate":{"date":"2023-02-28 10:19:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.21","text":"<p>BUGFIX | PL-Vat ids could not alway be validated.</p>","creationDate":{"date":"2022-12-15 08:38:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.20","text":"<p>BUGFIX | Prevent error message on empty vat id.</p>","creationDate":{"date":"2022-10-12 08:59:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.19","text":"<p>BUGFIX | Improved handling for API errors.</p>","creationDate":{"date":"2022-09-20 13:07:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.18","text":"<p>IMPROVEMENT | Added Twig blocks to confirm page.</p>","creationDate":{"date":"2022-08-09 10:28:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.17","text":"<p>FEATURE | Show vat id in order detail (administration).</p>","creationDate":{"date":"2022-07-28 14:02:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.16","text":"<p>BUGFIX | Private customer registration fixed.</p>","creationDate":{"date":"2022-07-12 13:35:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.15","text":"<p>TASK | Added compatibility with Shopware &gt;= 6.4.12.0.</p>","creationDate":{"date":"2022-07-11 12:32:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.14","text":"<p>BUGFIX | Prevent wrong vat id with (, . - (space)) to be valid.</p>","creationDate":{"date":"2022-05-02 13:35:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.13","text":"<p>IMPROVEMENT | Added validation for XI (Northern Ireland).</p><p><b>Notes:</b></p><p>- We recommend to add Northern Ireland as seperate country and only check taxfree for companies there.</p><p>- Country-ISO for Northern Ireland has to be XI or GB.</p>","creationDate":{"date":"2022-03-03 12:17:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.12","text":"<p>TASK | Added missing translations in english snippets.</p>","creationDate":{"date":"2022-02-03 08:16:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.11","text":"<p>BUGFIX | Tax was not calculated correctly with validation setting on billing address. <br />(when billing address was with tax and shipping address was without tax for B2B)<br /></p>","creationDate":{"date":"2022-01-26 11:05:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.10","text":"<p>IMPROVEMENT | Added option to block orders with invalid vat id check.</p>","creationDate":{"date":"2022-01-24 11:09:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p>- IMPROVEMENT | Added option to translate address suggestions to latin alphabet.</p>","creationDate":{"date":"2021-12-06 09:54:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p>- BUGFIX | Better handling for empty vat id.</p><p>- IMPROVEMENT | Added option to show/hide notice on /checkout/confirm page if country is tax free for B2B and no vat id is entered.</p><p>- TASK | Changed snippet text of ``checkout.lenzVatIdValidation.header``.</p>","creationDate":{"date":"2021-12-01 21:03:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p>- IMPROVEMENT | Better compatibility with third party plugins.</p><p>- BUGFIX | Updated detection of SI-address data.</p><p>- IMPROVEMENT | Added event on logging.</p>","creationDate":{"date":"2021-10-29 14:47:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p>IMPROVEMENT | Added option to select address for validation (billing or shipping).</p><p>IMPROVEMENT | Use always billing address for checking vat id on registration.</p><p>TASK | Compatibility with Shopware 6.5.x.x.</p><p>BUGFIX | Tax was in some cases not calculated correctly for private addresses.</p>","creationDate":{"date":"2021-10-14 15:10:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>BUGFIX | Validation box on /checkout/confirm showed even if no validation could be done (e.g. Switzerland).</p><p>TASK | Code cleanup in TaxDetecto</p>","creationDate":{"date":"2021-09-20 08:57:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p>BUGFIX | Fixed a bug (from Shopware), that prevents registering, when wrong validation occurs on registration address</p>","creationDate":{"date":"2021-09-06 08:42:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>IMPROVEMENT | Updated PL regex</p>","creationDate":{"date":"2021-08-30 12:41:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>- IMPROVEMENT | Prevent validation of swiss uid (CHE-XXX.XXX.XXX).</p>","creationDate":{"date":"2021-06-22 18:46:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>BUGFIX | Disabled validation for private customers / private addresses.</p>","creationDate":{"date":"2021-06-04 12:26:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>TASK | New development of the plugin for Shopware 6.4.0.0 because Shopware no longer stores the VAT ID with the addresses, but with the customer account. </p><p>  </p><b>ATTENTION: After the update a reconfiguration of the plugin is necessary. Please open the configuration of the plugin and set the settings as desired.</b><br /><b>\n\nOur recommendation:</b><br /><ul><li><b>Validation on registration: extended</b></li><li><b>Validation on profile update: simple</b></li><li><b>Validation on taxfree delivery + checkout: extended</b></li><li>Accept validation if all APIs return an error: activ</li><li>Additional validation for taxfree shipping: same country for billing and shipping</li></ul><b><br /></b><b>\n\nATTENTION: After the update, the countries that are tax free must be set for each country: Settings -&gt; Shop -&gt; Countries. This was previously possible in the plugin and has now changed to the Shopware standard.</b><p><br /></p><p>New features:</p><p>- Validation is now executed 1x per day automatically when customer is in the store.</p><p>- Validations are now stored and processed in such a way that validation is only performed when the address changes or max. 1x per day when the address data is the same. Exception: Customer changes the delivery address. Then the new delivery address is checked immediately.</p><p>- Customer gets on order confirmation page (/checkout/confirm) an overview displayed whether the validation of the VAT ID has worked. There he can see which validation errors there are directly.</p><p>- Validation at registration can be set.</p><p>- Validation when depositing the VAT ID in the customer account can be checked for validity.</p><p>- Validation before sending the order, with note of intra-community supply.</p><p>- Tax free for companies must now be set under Settings -&gt; Shop -&gt; Countries for each country, before this was possible in the plugin.</p><p>- Information about validation: https://www.frankfurt-main.ihk.de/recht/steuerrecht/umsatzsteuer_international/innergemeinschaftliche_lieferungen/</p>","creationDate":{"date":"2021-05-27 17:25:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.18","text":"<p>- TASK | Updated plugin.png.</p><p>- IMPROVEMENT | Compatibility with Shopware 6.5.3.x.</p>","creationDate":{"date":"2021-04-09 11:55:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.17","text":"<p>- BUGFIX | Registration with wrong validation was broken after form submit.</p><p>- BUGFIX | Error was thrown if api did respond with no response.</p>","creationDate":{"date":"2021-02-03 19:52:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.16","text":"<p>- IMPROVEMENT | Added option to bypass the check if all APIs return with an error.</p><p>- TASK | Code cleanup.</p>","creationDate":{"date":"2021-02-03 12:00:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.15","text":"<p>- IMPROVEMENT | Added new API response to responses, that are marked as API not reachable.</p>","creationDate":{"date":"2021-01-13 10:21:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.14","text":"<p>- BUGFIX | Registration with wrong validation was broken after form submit.</p>","creationDate":{"date":"2021-01-08 11:09:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.13","text":"<p>TASK | Removed GB because of Brefix.</p><p>TASK | Removed option \"Extended + Confirmation\", because it is not allowed anymore.</p><p><b>Please check and set option \"Online validation type\" after updating.</b></p>","creationDate":{"date":"2021-01-07 11:55:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.12","text":"<p>- IMPROVEMENT | Offline validation checks if country fits to vat id.</p><p>- TASK | Disabled vat id check on ajax address editor, because Shopware cannot display validation errors there.</p><p>- IMPROVEMENT | Entered values for street, zipcode and city are now prefilled after errors on validation.</p><p>- TASK | Bugfix for Shopware error is not necessary anymore and therefore removed.</p><p><br /></p><p><b>Always enable \"Validation on before order save enabled\".</b><br /></p>","creationDate":{"date":"2020-12-09 15:09:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p>- TASK | Fixes a bug that comes from Shopware and does not allow to register after wrong validation.</p>","creationDate":{"date":"2020-12-03 09:12:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<p>- IMPROVEMENT | France-EU-API-Validation ignores parts of address that are not relevant.</p>","creationDate":{"date":"2020-11-30 15:40:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>- BUGFIX | Fixes a bug that was introduced in v1.0.8.</p>","creationDate":{"date":"2020-10-20 09:59:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>- TASK | Fixes a bug that comes from Shopware and does not allow to register after wrong validation.</p>","creationDate":{"date":"2020-10-19 18:59:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- BUGFIX | Prevent error on empty config value \"taxFreeCountriesWithVatId\".</p><p>- IMPROVEMENT | Added options to choose where validation should be enabled (address change, order save).</p><p>- TASK | Code cleanup.</p>","creationDate":{"date":"2020-09-24 17:19:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- IMPROVEMENT | Added option to deliver vat free in selected countries with vat id set.</p>","creationDate":{"date":"2020-09-22 21:14:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- BUGFIX | Allow HTML in database fields.</p>","creationDate":{"date":"2020-08-10 17:48:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- TASK | Support for Shopware 6.3.0.0.</p><p>- BUGFIX | Fixed a bug on account-personal page.</p><p>- BUGFIX | Fixed wrong block name from Shopware (component_address_personal_account_type).</p><p>- IMPROVEMENT | Keep company data in form if form validation is not valid.</p>","creationDate":{"date":"2020-08-04 17:40:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- BUGFIX | Fixed a typo in twig template.</p>","creationDate":{"date":"2020-07-31 11:30:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- BUGFIX | Removed debug code.</p>","creationDate":{"date":"2020-07-24 16:40:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- IMPROVEMENT | Fixes a bug in Shopware that prevents \"I am\"-field in registration on validation error.</p>","creationDate":{"date":"2020-07-24 15:53:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>- BUGFIX | Removed bug on register page with different shipping address and vat id.</p>","creationDate":{"date":"2020-07-20 11:37:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.2","text":"<p>BUGFIX | Removed debug output after checkout.</p><p>IMPROVEMENT | Offline validation refactored.</p>","creationDate":{"date":"2020-03-16 10:46:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"0.0.1","text":"<p>Initial plugin release for Shopware 6.</p>","creationDate":{"date":"2020-02-16 19:31:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=lenz698198643790","redirectToStore":false,"lowestPriceValue":49.9}