{"id":9063,"name":"TanmarNgProductReviews","code":"Tanma98360525382","lastChange":{"date":"2023-07-18 11:16:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDpdqcr","examplePageUrl":"","moduleKey":"TanmarNgProductReviews","creationDate":{"date":"2019-05-29 13:58:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-11-19 14:32:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-11-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-30 11:11:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":71,"prefix":"Tanmar","name":"Tanmar Webentwicklung","website":"//www.tanmar.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod71_shopware_icon.png"},"infos":[{"id":13993,"name":"Kundenfreundliche verifizierte Artikel Bewertungen","description":"<h2>Kundenfreundliche Produktbewertungen<br>Nutzen Sie die Kauferfahrungen Ihrer Kunden für eine bessere Conversionrate</h2><h3>Alles auf einen Blick</h3><ul><li>Mehr Produktbewertungen (user generated content) sammeln durch automatisierten Reminder</li><li>Sammeln Sie einfach verifizierte Bewertungen<br></li><li>Steigerung der Kundenbindung</li><li>Erhöhung der SEO-Faktoren&nbsp;ihrer Produktseiten</li><li>Keine laufenden Kosten durch Drittanbieter</li><li>Automatisierter Versand der Emails</li><li>Attraktive und Usability freundliche Bewertungsseite</li><li>Optionaler Gutschein nach erfolgreicher Bewertung<br></li><li>Bewertungsmail als Mailvorlage anpassbar</li><li>Opt-In Funktion im Checkout (DSGVO konform)</li><li>Sie bestimmen, wen Sie anschreiben wollen</li><li>Nur aktive Produkte werden bewertet</li><li>Artikel können von der Bewertung ausgenommen werden<br></li><li>Optionale Benachrichtigung bei neuen Bewertungen z.B ab x Sterne<br><br></li></ul><h3>Mehrwert schaffen &amp; Kaufentscheidung erleichtern</h3><p>Laut einer Bitkom-Studie aus dem Jahr 2017 lesen 65 Prozent der Befragten Produktbewertungen, bevor Sie sich für ein Produkt entscheiden. Mit selbst im Shop gesammelten Bewertungen bieten Sie Ihren Kunden einen echten Mehrwert. Bewertungen bieten zusätzliche Informationen zum Produkt, sie ermöglichen bessere Kaufentscheidungen und helfen Retouren zu vermeiden.</p><h3>Futter für Google &amp; in der Suche auffallen</h3><p>Shopware gibt die Produktbewertungen auf der Produktseite mit sogenannten Rich Snippets strukturiert aus, damit Google sie optimal indizieren kann. Treffer für Produkte mit Bewertungen können so mit den Bewertungssternen angezeigt werden. Dadurch stechen Ihre Produkte in der Suche mehr ins Auge und wirken attraktiver.</p><h3>Macht auch mobil eine gute Figur</h3><p>Mit unserem Plugin können Kunden alle Produkte aus ihrer Bestellung ganz einfach auf einer Seite bewerten. Die Bewertungsseite funktioniert vom Smartphone bis zum 4K Monitor genau so bequem. Der Kunde wählt mit einem Klick die gewünschte Wertung, gibt seinen Kommentar ab und gelangt dann zum nächsten Produkt. </p><h3>Automatisiert, einfach Bewertungen sammeln</h3><p>Sie legen fest wie lange nach der Auslieferung der Ware gewartet werden soll bis die Bewertungsaufforderung an den Kunden versendet wird. Kunden bei denen es zu Problemen bei der Bearbeitung der Bestellung kam können Sie vom Versand ausnehmen. So sammeln Sie ganz einfach fortlaufend Bewertungen. Sie müssen lediglich periodisch die neu eingegangen Bewertungen sichten.</p><h3>Verifizierte Bewertungen<br></h3><p>Gemäß der sogenannten <a href=\"https://www.haendlerbund.de/de/ratgeber/recht/3961-omnibus-richtlinie\" target=\"_blank\" rel=\"noreferrer\">Omnibus Richtlinie</a> sollen Händler gegen gefälschte Kundenbewertungen vorgehen. Mit unserem Plugin sammeln Sie Bewertungen von Kunden die das bewerten, was sie gekauft haben. Im Zusammenspiel mit unserem separaten Plugin für die erweiterte Darstellung von Artikelbewertungen können Sie zudem auf der Detailseite auch bei den Bewertungen anzeigen, dass sie verifiziert sind. Nutzen Sie das Bundle aus beiden Plugins für den vollen Funktionsumfang.<br></p><p><br></p><p><strong>Fragen zum Plugin?</strong></p><p>Auf unserer Webseite finden Sie eine <a target=\"_blank\" href=\"https://www.tanmar.de/shopwareplugins/TanmarProduktbewertungen/doku_shopware6.html\" rel=\"noopener nofollow\">ausführliche Dokumentation der Konfigurationsoptionen</a>. Sollten Sie weitere Fragen haben können Sie sich auch an uns wenden:<br><strong></strong></p><p><strong><br></strong></p><p><strong></strong>Tanmar Webentwicklung<br>+49 (30) 89560861<br>plugin-support@tanmar.de<br><a href=\"https://www.tanmar.de\" target=\"_blank\" rel=\"noreferrer noopener\">www.tanmar.de</a></p>","installationManual":"<p>Nach dem Aktivieren des Plugins prüfen Sie bitte zunächst die Einstellungen.</p><p>So lange die Option \"Mailversand aktiv\" inaktiv ist schickt das Plugin\nkeine Mails. Aktivieren Sie diese Option, wenn Sie bereit sind die\n\nersten Kunden anzuschreiben.</p><p>Legen Sie fest wie lange Sie nach der Bestellung warten möchten, bis der Kunde die Bewertungsaufforderung erhält. Wir empfehlen einen Zeitraum in dem der Kunde die Ware auf jeden Fall erhalten hat und auch die Chance hatte das Produkt ggf zurück zu schicken. So haben Sie die Chance Kunden die unzufrieden waren von der Bewertungsauffoderung auszunehmen.<br></p><p>In der Standardkonfiguration ist der Opt-In aktiv. Kunden werden im Checkout gefragt ob sie bereit sind eine Bewertungserinnerung zu empfangen.</p><p>Mit der Option \"Altkunden anschreiben\" können Sie entscheiden, ob Kunden die gekauft haben bevor das Plugin installiert wurden berücksichtigt werden. Wenn der Opt-In aktiv ist werden Altkunden generell nicht angeschrieben.</p><p>Über die Filter für Kundengruppen, Zahlungsarten und Versandarten haben Sie die Möglichkeit Kunden auszuschließen.<br></p><p>Passen Sie bei Bedarf auch die Email Vorlage nach ihren Bedürfnissen an.</p><p>Aktivieren Sie am Ende die Option \"Mailversand aktiv\".</p><p>Auf unserer Webseite finden Sie eine <a target=\"_blank\" href=\"https://www.tanmar.de/shopwareplugins/TanmarProduktbewertungen/doku_shopware6.html\" rel=\"noopener nofollow\">ausführliche Installationsanleitung und eine Dokumentation der Konfigurationsoptionen</a>.</p>","shortDescription":"Sammeln Sie Produktbewertungen, indem Sie (optional mit Opt-In) Ihre Kunden aktiv einladen, eine Bewertung abzugeben und bieten Sie einen echten Mehrwert durch verifizierte Meinungen","highlights":"Attraktive und benutzerfreundliche Bewertungsseite\nOptionaler Gutschein nach Abgabe der Bewertung\nOptionale Benachrichtigung bei neuen Bewertungen z.B ab x Sterne\nOpt-In Funktion im Checkout (DSGVO konform)","features":"Testmodus für die bequeme Einrichtung\nViele Konfigurationsoptionen\nAutomatisierter Versand der Emails\nOptionale Gutscheine als Belohnung für Bewertungen\nBenachrichtigung bei schlechten Bewertungen\nArtikel können von der Bewertung ausgeschlossen werden"},{"id":15140,"name":"Customer Friendly Product Reviews","description":"<h2>Customer-friendly product reviews - Use the purchase experience of your customers for a better conversion rate</h2><h3>Everything at a glance</h3><ul><li>Collect more product reviews</li><li>No running costs for third party suppliers</li><li>Automated review invitations via email<br></li><li>Attractive and usability friendly rating page</li><li>Customizable rating email with template</li><li>Opt-In function in checkout (DSGVO compliant)</li><li>Only active products are rated</li><li>Products can be excluded from review invitations<br></li></ul><h3>Creating added value &amp; simplify purchase decisions</h3><p>According to a 2017 Bitkom study, 65 percent of the respondents read product reviews before deciding on a product. With product reviews, you can offer additional value to your customers. Reviews provide additional informationabout the product, enable better purchasing decisions and help to avoid returns.</p><h3>Additional value for Google and more Attention For Search results</h3><p>Shopware is using so-called \"rich snippets\" output product reviews&nbsp; in a structured way so that Google can index and \"understand\" them. The result is that rating stars can be shown in organic search results for your shop. This makes your products more eye-catching and attractive.</p><h3>Cut a fine figure - also on mobile devices</h3><p>With our plugin customers can easily rate all their ordered products on one page. The evaluation page works very comfortable no matter if you use a smartphone or a desktop computer with a 4K monitor. The customer selects the desired evaluation with one click, types his comment and then sees the next product in his order.</p><h3>Simply collect reviews</h3><p>After the goods have been delivered, you specify how long the system has to wait until the product review invitation is sent to the customer. You can exclude customers who have had problems with their order. This way, you can easily collect ratings on an ongoing basis. All you have to do is periodically review the newly received comments.</p><p><strong>Any questions?</strong><br>Tanmar Webentwicklung<br>+49 (30) 89560861<br>info@tanmar.de<br><a href=\"https://www.tanmar.de\" target=\"_blank\" rel=\"noreferrer noopener\">www.tanmar.de</a></p>","installationManual":"<p>After the plugin is activated it needs to be configured first.<br /></p><p>As long as the \"Mail sending\" option is inactive the plugin doesn't send any emails. Activate this option when the plugin is fully configured.<br /></p><p>Select the number of days after you would like your customers to receive the review invitation. We recommend to select a time frame that makes sure that the customer has received the products and a buffer that allows customers to return the product.<br /></p>By default the Opt-In option is active. Customers have to opt-in for the review invitation during checkout.<br /><p>The option \"Send mails to old customers\" allows you to send out invitations to customers who placed their orders before the plugin was installed. This only works if the opt-in is inactive.<br /></p><p>The options to exclude customers groups, payment and shipping methods you can be used to exclude orders which are imported from marketplaces or resellers.<br /></p><p>The plugin installs an email template that can be edited in the system settings.<br /></p><p>When configuration is finished please activate the \"Mail sending\" option</p>","shortDescription":"Use the purchase experience of your customers for a better conversion rate. This plugin sends review reminders to your customers and helps you to get more authentic customer reviews","highlights":"User friendly interface for product reviews\nAbility to offer vouchers as incentive for product reviews\nAbility to send notification when customers write negative reviews\nOpt-In feature for GDPR compliance","features":"Testmode for easy setup\nMany options to select which customers are invited\nAutomated review invitations via email"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157080,"bookingKey":"Tanma98360525382","bookingText":"Customer Friendly Product Reviews","price":129,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":157079,"bookingKey":"Tanma98360525382_M","bookingText":"Customer Friendly Product Reviews","price":12.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168368,"bookingKey":"Tanma98360525382_M12","bookingText":"Customer Friendly Product Reviews","price":140,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpd3yyzi","preview":true,"priority":0,"id":103451},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpe3KJTG","preview":false,"priority":2,"id":100681}],"comments":[{"authorName":"Giorgio Migliaccio","text":"Wir sind sehr zufrieden und die Kunden lieben es unsere Produkte zu bewerten da sie dafür belohnt werden (können). Mit diesem Plugin konnten wir die Anzahl an Bewertungen um 1000% erhöhen!\nDas Plugin ist absolut empfehlenswert! Es ist bis ins letzte Detail durchdacht und hat alle möglichen Einstellungsmöglichkeiten. Der Support ist freundlich und kompetent und hilft einem immer weiter. Wenn Du endlich Produktbewertungen sehen willst damit Dein Shop endlich funkelt dann ist dieses Plugin dafür gemacht.","headline":"das beste Plugin im Shop","creationDate":{"date":"2023-07-07 15:31:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Niko Nobes","text":"Wir sind rundum zufrieden empfehlen aber auch sich diese Plugins immer von einem kompetenten Partner einrichten zu lassen. https://www.pixupmedia.com/ in Berlin hat für uns wunderbar dieses Plugin auf www.laserstar.rocks integriert und all unsere Wünsche an den Shop restlos zufrieden stellend erfüllt.","headline":"Direkt zugeschlagen","creationDate":{"date":"2022-11-17 18:03:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Benjamin Katz","text":"","headline":"Plugin funktioniert sehr gut. Einrichtung einfach","creationDate":{"date":"2022-09-18 18:16:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Arnold Maier","text":"Das Plugin ist echt Klasse. Macht einfach alles genau so wie es sein soll.\nBesonders erwähnenswert: Ich hatte ein kleines Problem mit der Konfiguration. Das lag aber weniger am Plugin, sondern eher an mir. Ich habe den Support kontaktiert und nach noch nicht einmal einer Stunde war das Problem vom Tisch.\nWeltklasse, vielen Dank!","headline":"Einfach nur Klasse","creationDate":{"date":"2022-09-08 16:28:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Benjamin Frank","text":"Ich hatte Anfangs ein paar Schwierigkeiten das Plugin zum laufen zu bringen. Der Support hat sich der Sache sofort angenommen und mit mir zusammen eine Lösung gefunden.\nJetzt läuft das Plugin ohne Probleme. Perfekt um die Bewertungen im eigenen Online-Shop anzukurbeln!","headline":"Super Support","creationDate":{"date":"2022-05-11 10:02:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Martina","text":"","headline":"Das Plugin funktioniert wunderbar. TOP Support!","creationDate":{"date":"2022-05-04 08:12:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dennis Heinzmann","text":"Wir nutzen das Plugin in mehreren Shops und konnten seit dem Einsatz des Plugins eine deutlich erhöhte Bewertungshäufigkeit unserer Kunden feststellen. Ganz klare Empfehlung!","headline":"Hervorragendes Plugin","creationDate":{"date":"2021-10-27 08:23:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Anita","text":"Das Plugin kann ich auf jeden Fall empfehlen - es hat alles was man sich wünscht (bis auf 1 Kleinigkeit die ich mir noch persönlich wünsche) sonst alles super - DSGVO konform, Kunden die es wünschen, werden per Email erinnert und können ganz einfach Ihren Artikel (oder mehrere Artikel gleichzeitig) bewerten -  ohne vorherigen Login und lange Wege zur Bewertungsmöglichkeit wie es im Standard ist.\nUnd der Support antwortet nicht nur zügig, sondern ist auch offen und freundlich - also alles TIP TOP","headline":"Tolles Plugin und schneller Support","creationDate":{"date":"2021-10-20 17:05:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Steffen Methling","text":"Kunden denken selten von allen an die Bewertungsabgabe und Login und Verifizierung des Kaufs sind nicht einfach. Diese einfache und sehr umfangreich konfigurierbare Bewertungserweiterung vereinfacht das Sammeln von Artikelbewertungen enorm und ist darüber hinaus sogar datenschutzkonform einsetzbar. Käufer bewerten direkt von ihnen bestellte Artikel nach einer einstellbaren Zeit. Ein Login ist dafür nicht nötig. \n\nBei Fragen reagiert der Support schnell und ist hilfreich und unterstützend. Kann diese Erweiterung uneingeschränkt empfehlen.","headline":"Must-Have Plugin und toller Support","creationDate":{"date":"2021-08-23 12:48:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Oscar van der Laan","text":"Ligt erg prettig","headline":"Top","creationDate":{"date":"2021-05-17 14:05:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Stephanie Siebers","text":"Dieses Plugin funktioniert wie erwartet und auch Gastbestellern ist es hiermit möglich Bewertungen abzugeben. \nDer Support hat sehr schnell reagiert und sich große Mühe gegeben. Bei uns wurde dieses Plugin durch ein anderes Plugin blockiert. Der Support hat sich die ganze Sache angesehen und sogar eine kurze Info gegeben, wo der Fehler bei dem anderen Plugin liegt. Besser geht es kaum.\nLeider gibt es (noch) keine Dokumentation, auf Fragen wird aber direkt und umfassend geantwortet. Auch einige Funktionen fehlen leider noch (die Artikelbeschreibung wurde nun aktuallisiert). Ich bin aber auch so sehr zufrieden und freue mich auf neue Funktionen.","headline":"Sehr gutes Plugin - und noch besserer Support","creationDate":{"date":"2021-03-03 07:57:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Viktor Franz","text":"Sehr zu empfehlen. Ich denke es kommen noch einige tolle Funktionen dazu, aber für den Anfang schon mal Super. Support hat auch schnell reagiert.\nlg\nV.","headline":"Super tolles Plugin","creationDate":{"date":"2020-12-10 17:25:14.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Kundenfreundliche verifizierte Artikel Bewertungen","description":"<h2>Kundenfreundliche Produktbewertungen<br />Nutzen Sie die Kauferfahrungen Ihrer Kunden für eine bessere Conversionrate</h2><h3>Alles auf einen Blick</h3><ul><li>Mehr Produktbewertungen (user generated content) sammeln durch automatisierten Reminder</li><li>Sammeln Sie einfach verifizierte Bewertungen<br /></li><li>Steigerung der Kundenbindung</li><li>Erhöhung der SEO-Faktoren ihrer Produktseiten</li><li>Keine laufenden Kosten durch Drittanbieter</li><li>Automatisierter Versand der Emails</li><li>Attraktive und Usability freundliche Bewertungsseite</li><li>Optionaler Gutschein nach erfolgreicher Bewertung<br /></li><li>Bewertungsmail als Mailvorlage anpassbar</li><li>Opt-In Funktion im Checkout (DSGVO konform)</li><li>Sie bestimmen, wen Sie anschreiben wollen</li><li>Nur aktive Produkte werden bewertet</li><li>Artikel können von der Bewertung ausgenommen werden<br /></li><li>Optionale Benachrichtigung bei neuen Bewertungen z.B ab x Sterne<br /><br /></li></ul><h3>Mehrwert schaffen &amp; Kaufentscheidung erleichtern</h3><p>Laut einer Bitkom-Studie aus dem Jahr 2017 lesen 65 Prozent der Befragten Produktbewertungen, bevor Sie sich für ein Produkt entscheiden. Mit selbst im Shop gesammelten Bewertungen bieten Sie Ihren Kunden einen echten Mehrwert. Bewertungen bieten zusätzliche Informationen zum Produkt, sie ermöglichen bessere Kaufentscheidungen und helfen Retouren zu vermeiden.</p><h3>Futter für Google &amp; in der Suche auffallen</h3><p>Shopware gibt die Produktbewertungen auf der Produktseite mit sogenannten Rich Snippets strukturiert aus, damit Google sie optimal indizieren kann. Treffer für Produkte mit Bewertungen können so mit den Bewertungssternen angezeigt werden. Dadurch stechen Ihre Produkte in der Suche mehr ins Auge und wirken attraktiver.</p><h3>Macht auch mobil eine gute Figur</h3><p>Mit unserem Plugin können Kunden alle Produkte aus ihrer Bestellung ganz einfach auf einer Seite bewerten. Die Bewertungsseite funktioniert vom Smartphone bis zum 4K Monitor genau so bequem. Der Kunde wählt mit einem Klick die gewünschte Wertung, gibt seinen Kommentar ab und gelangt dann zum nächsten Produkt. </p><h3>Automatisiert, einfach Bewertungen sammeln</h3><p>Sie legen fest wie lange nach der Auslieferung der Ware gewartet werden soll bis die Bewertungsaufforderung an den Kunden versendet wird. Kunden bei denen es zu Problemen bei der Bearbeitung der Bestellung kam können Sie vom Versand ausnehmen. So sammeln Sie ganz einfach fortlaufend Bewertungen. Sie müssen lediglich periodisch die neu eingegangen Bewertungen sichten.</p><h3>Verifizierte Bewertungen<br /></h3><p>Gemäß der sogenannten <a href=\"https://www.haendlerbund.de/de/ratgeber/recht/3961-omnibus-richtlinie\" target=\"_blank\" rel=\"noreferrer noopener\">Omnibus Richtlinie</a> sollen Händler gegen gefälschte Kundenbewertungen vorgehen. Mit unserem Plugin sammeln Sie Bewertungen von Kunden die das bewerten, was sie gekauft haben. Im Zusammenspiel mit unserem separaten Plugin für die erweiterte Darstellung von Artikelbewertungen können Sie zudem auf der Detailseite auch bei den Bewertungen anzeigen, dass sie verifiziert sind. Nutzen Sie das Bundle aus beiden Plugins für den vollen Funktionsumfang.<br /></p><p><br /></p><p><strong>Fragen zum Plugin?</strong></p><p>Auf unserer Webseite finden Sie eine <a target=\"_blank\" href=\"https://www.tanmar.de/shopwareplugins/TanmarProduktbewertungen/doku_shopware6.html\" rel=\"noreferrer noopener\">ausführliche Dokumentation der Konfigurationsoptionen</a>. Sollten Sie weitere Fragen haben können Sie sich auch an uns wenden:<br /><strong></strong></p><p><strong><br /></strong></p><p><strong></strong>Tanmar Webentwicklung<br />+49 (30) 89560861<br />plugin-support@tanmar.de<br /><a href=\"https://www.tanmar.de\" target=\"_blank\" rel=\"noreferrer noopener\">www.tanmar.de</a></p>","installationManual":"<p>Nach dem Aktivieren des Plugins prüfen Sie bitte zunächst die Einstellungen.</p><p>So lange die Option \"Mailversand aktiv\" inaktiv ist schickt das Plugin\nkeine Mails. Aktivieren Sie diese Option, wenn Sie bereit sind die\n\nersten Kunden anzuschreiben.</p><p>Legen Sie fest wie lange Sie nach der Bestellung warten möchten, bis der Kunde die Bewertungsaufforderung erhält. Wir empfehlen einen Zeitraum in dem der Kunde die Ware auf jeden Fall erhalten hat und auch die Chance hatte das Produkt ggf zurück zu schicken. So haben Sie die Chance Kunden die unzufrieden waren von der Bewertungsauffoderung auszunehmen.<br /></p><p>In der Standardkonfiguration ist der Opt-In aktiv. Kunden werden im Checkout gefragt ob sie bereit sind eine Bewertungserinnerung zu empfangen.</p><p>Mit der Option \"Altkunden anschreiben\" können Sie entscheiden, ob Kunden die gekauft haben bevor das Plugin installiert wurden berücksichtigt werden. Wenn der Opt-In aktiv ist werden Altkunden generell nicht angeschrieben.</p><p>Über die Filter für Kundengruppen, Zahlungsarten und Versandarten haben Sie die Möglichkeit Kunden auszuschließen.<br /></p><p>Passen Sie bei Bedarf auch die Email Vorlage nach ihren Bedürfnissen an.</p><p>Aktivieren Sie am Ende die Option \"Mailversand aktiv\".</p><p>Auf unserer Webseite finden Sie eine <a target=\"_blank\" href=\"https://www.tanmar.de/shopwareplugins/TanmarProduktbewertungen/doku_shopware6.html\" rel=\"noreferrer noopener\">ausführliche Installationsanleitung und eine Dokumentation der Konfigurationsoptionen</a>.</p>","version":"1.7.2","changelog":[{"version":"1.7.2","text":"<ul><li>Fixed type in config</li></ul>","creationDate":{"date":"2023-07-10 14:23:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.1","text":"shopware 6.5 compatibility<br /><br /><p><b>please deactivate the app before updating to 6.5</b></p>","creationDate":{"date":"2023-04-11 14:42:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<ul><li>Adjustment due to quality assurance of Shopware store extensions</li></ul>","creationDate":{"date":"2022-12-07 11:39:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<ul><li>Show review buttons in account orders</li><li>Added fix for template inheritance</li></ul>","creationDate":{"date":"2022-10-19 08:44:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<ul><li>Bugfix Debug Controller<br /></li></ul>","creationDate":{"date":"2022-08-23 13:53:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<ul><li>Bugfix CheckoutPageSubscriber</li></ul>","creationDate":{"date":"2022-05-18 14:03:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Bugfix email language</li><li>Important techical info: MailHelperInterface was changed</li></ul>","creationDate":{"date":"2022-05-11 07:18:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Exclude products from review emails</li></ul>","creationDate":{"date":"2022-04-13 11:24:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.5","text":"<ul><li>Bugfix voucher hint checkout confirm</li></ul>","creationDate":{"date":"2022-03-15 11:39:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<ul><li>Bugfix MailHelper Decorator</li><li>Fixed missing translation in german administration</li><li>Fixed permission to edit plugin settings</li></ul>","creationDate":{"date":"2022-03-14 10:12:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<ul><li>Improved template installation</li><li>Added missing translation in template</li><li>fixed bug in template</li></ul>","creationDate":{"date":"2021-12-07 07:59:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<ul><li>Removed developer output in debug info</li></ul>","creationDate":{"date":"2021-12-02 13:52:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>Better error logs</li><li>Template fix</li></ul>","creationDate":{"date":"2021-12-01 15:56:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>Bugix: sendInvitationMail - Undefined variable: context</li><li>Config value: Send voucher on</li></ul>","creationDate":{"date":"2021-10-26 08:48:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<ul><li>Fix invitation mails failing when a product was changed</li><li>Fix product rating page when a product was changed or deleted</li><li>Fixed a bug where no coupon mail was sent when a product in an order\n was invalid, deleted or changed and could not be given a rating</li></ul>","creationDate":{"date":"2021-09-28 10:56:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>Changed \"Cron\" text to \"Scheduled task\" to be in line with Shopware Documentation</li><li>Testmails will now be sent regardless of plugin configuration</li><li>Fix invitation mails failing when a product was deleted</li></ul>","creationDate":{"date":"2021-09-23 15:10:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Added option to send voucher mails</li><li>Added test voucher mail buttons in configuration</li><li>Attention: If {{salesChannel.name}} no longer works in your mail templates, then change to: {{salesChannel.translated.name}}</li><li>If the voucher mails are not sent, please check the mail templates and delete the following variable: {{order.orderCustomer.salutation.letterName}}</li></ul>","creationDate":{"date":"2021-07-05 13:33:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>Products that have already been rated are displayed last on the plugin rating page</li></ul>","creationDate":{"date":"2021-06-03 10:17:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Added test mail buttons in configuration</li><li>Added option to recieve blind copies of invitation mails</li><li>Added option to ignore orders before a certain date</li><li>Added mail notification when a customer has completed writing reviews for an order</li></ul>","creationDate":{"date":"2021-05-31 14:45:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<p>Showpare 6.4 compatibility</p>","creationDate":{"date":"2021-05-05 11:11:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<ul><li>Fixed a bug where already rated products are not visible</li></ul>","creationDate":{"date":"2021-03-03 08:46:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<ul><li>Bugfix controller template menu bar was not displayed</li></ul>","creationDate":{"date":"2021-02-15 13:32:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Bugfix Mail Templates</li></ul>","creationDate":{"date":"2021-01-21 11:18:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<ul><li>added \"headline is required\" configuration</li><li>Bugfix order number with prefix or suffix</li></ul>","creationDate":{"date":"2021-01-18 12:51:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>Improved error handling</p>","creationDate":{"date":"2021-01-12 16:07:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>fixed another bug where old customers would not reviece mails</p>","creationDate":{"date":"2020-12-19 11:28:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>fixed a bug where old customers would not reviece mails</p>","creationDate":{"date":"2020-12-16 15:20:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Fixed a bug in the config reader</p>","creationDate":{"date":"2020-12-10 16:26:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<ul><li>Fixed a bug where the rating without stars triggers an error</li></ul>","creationDate":{"date":"2020-12-10 14:39:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First version for shopware 6</p>","creationDate":{"date":"2020-10-22 15:22:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Tanma98360525382","redirectToStore":true,"lowestPriceValue":12.9}