{"id":9105,"name":"MolliePayments","code":"Molli20782621168","lastChange":{"date":"2023-07-20 13:17:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvKMv3d","examplePageUrl":"","moduleKey":"MolliePayments","creationDate":{"date":"2019-06-04 16:00:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2019-10-09 11:02:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2019-10-08 19:53:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1667,"prefix":"Mollie","name":"Mollie","website":"//www.mollie.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1667_Mollie_logo_128x128px.png"},"infos":[{"id":14054,"name":"Mollie Payments Plugin for Shopware 6","description":"<p>Use the official Mollie plugin to give your customers an excellent payment experience in your Shopware-powered store. You can offer all major global and local payment methods in your checkout, including:</p><p>Visa, Mastercard, American Express, PayPal, Klarna, Apple Pay, iDEAL, in3, SOFORT Banking, Giropay, EPS, SEPA bank transfer, KBC payment button, Bancontact, Belfius Pay Button, paysafecard, CartaSi, Cartes Bancaires, and gift cards.</p><p>The plugin comes with a built-in refund manager and an integration with the Shopware 6 flow builder, so that you have the tools you need to manage orders and automate your business processes. It also fully supports Shopware 6 <a href=\"https://github.com/mollie/shopware6/wiki/Headless-setup-in-Shopware-6\">headless solutions</a>, which means you can offer Mollie payment methods in all of your storefronts.</p><p><i>Together with our development partner, <a href=\"https://www.dasistweb.de/\">dasistweb</a>, we strive to create a best-in-class plugin for your shop. Get Mollie Payments for Shopware 6 and join over 130,000 satisfied merchants in receiving payments today.</i></p>","installationManual":"<h4>Set up Mollie Payments for Shopware 6 in a few steps:</h4><p></p><ol><li><a href=\"http://mollie.com/signup\">Create and activate your Mollie account</a>.</li><li>Log in to your Shopware 6 administration.</li><li>Go to <b>Extensions&nbsp;</b>&gt; <b>Store</b> and search “Mollie Payments”.</li><li>Add, install, and activate the plugin.</li><li>Enter your Mollie API keys to connect Shopware 6 to your Mollie account.</li><li><a href=\"https://github.com/mollie/Shopware6/wiki\">Configure the plugin</a> to meet your needs.</li></ol><p></p><p>After your Mollie onboarding process is complete, you can start accepting online payments in your Shopware 6 webshop.</p><p><br></p>","shortDescription":"With Mollie you integrate every major global and local payment method in your Shopware webshop in one go. Start growing your business with effortless payments today!","highlights":"Only pay per transaction: Mollie has no lock-in contract, monthly fees, or plugin costs\nGet access to all payment methods in one contract\nTurn payment methods on and off in one click\nGet onboarded in a few simple steps, and have your account activated in 1-2 business days\nOffer your customers all major global and local payment methods","features":"Customisation and localisation: set up a checkout that meets your customers’ needs\nTest environment: try out your payment methods and checkout experience\nDynamic 3D secure: guarantee customers safe credit card payments\nPCI-DSS level 1 certified: meet the highest security standards\nSubscriptions: receive recurring payments by enabling customers to subscribe to your products\nHeadless and Shopware PWA support: provide a seamless payment experience in all of your storefronts\nMulticurrency: give customers the freedom to pay in their preferred currency\nMobile friendly: let customers shop on their preferred device \nEasy-to-use dashboard: stay up-to-date on all payments, get real-time accounting information, and process refunds easily"},{"id":14666,"name":"Mollie Zahlungen für Shopware 6 - Plugin","description":"<p>Verwenden Sie das offizielle Mollie-Plugin, um Ihren Kunden ein hervorragendes Zahlungserlebnis in Ihrem von Shopware betriebenen Shop zu bieten. Sie können alle wichtigen globalen und lokalen Zahlungsmethoden in Ihrem Checkout anbieten, einschließlich:</p><p>Visa, Mastercard, American Express, PayPal, Klarna, Apple Pay, iDEAL, in3, SOFORT Banking, Giropay, EPS, SEPA-Überweisung, KBC-Zahlungsbutton, Bancontact, Belfius Pay Button, paysafecard, CartaSi, Cartes Bancaires und Geschenkkarten.</p><p>Das Plugin verfügt über einen integrierten Rückerstattungsmanager, sowie eine Integration für den Shopware 6 Flow Builder, sodass Sie über alle Tools verfügen, die Sie zum Verwalten von Bestellungen und Automatisieren Ihrer Geschäftsprozesse benötigen. Mit der vollsäntdigen Unterstützung als Shopware 6&nbsp;<a href=\"https://github.com/mollie/shopware6/wiki/Headless-setup-in-Shopware-6\">Headless-Lösung</a>, können&nbsp;Sie Mollie-Zahlungsmethoden in all Ihren Verkaufskanälen anbieten.</p><p><i>Gemeinsam mit unserem Entwicklungspartner <a href=\"https://www.dasistweb.de/\">dasistweb</a>&nbsp;streben wir danach, ein Best-in-Class-Plugin für Ihren Shop zu erstellen. Holen Sie sich Mollie Payments für Shopware 6 und erhalten Sie wie über 130.000 zufriedene Händler noch heute Zahlungen.</i></p><p></p><p></p>","installationManual":"<h4>Richten Sie Mollie Payments für Shopware 6 in wenigen Schritten ein:</h4><p></p><ol><li><a href=\"http://mollie.com/signup\">Erstellen und aktivieren Sie Ihr Mollie-Konto</a>.</li><li>Loggen Sie sich in Ihre Shopware 6 Administration ein.</li><li>Gehen Sie zu <b>Erweiterungen</b> &gt; <b>Store</b> und suchen Sie nach „Mollie Payments“.</li><li>Plugin hinzufügen, installieren und aktivieren.</li><li>Geben Sie Ihre Mollie-API-Schlüssel ein, um Shopware 6 mit Ihrem Mollie-Konto zu verbinden.</li><li><a href=\"https://github.com/mollie/Shopware6/wiki\">Konfigurieren Sie das Plugin</a> nach Ihren Bedürfnissen.</li></ol>Nachdem Ihr Mollie-Onboarding-Prozess abgeschlossen ist, können Sie damit beginnen, Online-Zahlungen in Ihrem Shopware 6-Webshop zu akzeptieren.</p>","shortDescription":"Mit Mollie integrieren Sie alle wichtigen internationalen und lokalen Zahlungsmethoden in nur einem Schritt in Ihren Shopware-Webshop. Starten Sie noch heute!","highlights":"Zahlen Sie nur pro Transaktion: Mollie hat keinen Lock-in-Vertrag, keine monatlichen Gebühren oder Plugin-Kosten\nErhalten Sie Zugriff auf alle Zahlungsmethoden in einem Vertrag\nAktivieren und deaktivieren Sie Zahlungsmethoden mit einem Klick\nSteigen Sie in wenigen einfachen Schritten ein und lassen Sie Ihr Konto in 1-2 Werktagen aktivieren\nBieten Sie Ihren Kunden alle wichtigen globalen und lokalen Zahlungsmethoden an","features":"Anpassung und Lokalisierung: Richten Sie einen Checkout ein, der den Bedürfnissen Ihrer Kunden entspricht\nTestumgebung: Probieren Sie Ihre Zahlungsmethoden und Ihren Checkout aus\nDynamic 3D Secure: Garantiert Kunden sichere Kreditkartenzahlungen\nPCI-DSS Level 1 zertifiziert: Erfüllt die höchsten Sicherheitsstandards\nAbonnements: Erhalten Sie wiederkehrende Zahlungen, indem Sie Kunden ermöglichen, Ihre Produkte zu abonnieren\nHeadless- und Shopware-PWA-Unterstützung: Bieten Sie Ihren Kunden ein nahtloses Zahlungserlebnis in all Ihren Verkaufskanälen\nMehrere Währungen: Geben Sie Kunden die Freiheit, in ihrer bevorzugten Währung zu bezahlen\nMobilfreundlich: Lassen Sie Kunden auf ihrem bevorzugten Gerät einkaufen\nBenutzerfreundliches Dashboard: Bleiben Sie über alle Zahlungen auf dem Laufenden, erhalten Sie Buchhaltungsinformationen in Echtzeit und verarbeiten Sie Rückerstattungen einfach und schnell"}],"addons":["SW6_integrated"],"standardLocale":{"id":2,"name":"en_GB"},"priceModels":[{"id":157474,"bookingKey":"Molli20782621168","bookingText":"Mollie Payments for Shopware 6","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8eUSG2","preview":true,"priority":1,"id":37109},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUMxj2U","preview":false,"priority":3,"id":37106},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1bSNFu","preview":false,"priority":2,"id":37107}],"comments":[{"authorName":"rene reckschwardt","text":"Wie gewünscht, installiert, Account angelegt und Zahlunge empfangen. Die Kompatibilät zu 6.5 wird zwar nict angezeigt, aber lt release Notes ist diese da.","headline":"perfekt und funktioniert ohne Probleme","creationDate":{"date":"2023-07-18 14:22:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Aljoscha Saalbaum","text":"","headline":"Top!","creationDate":{"date":"2023-06-04 18:16:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Flo","text":"Habe mehrmals probiert das Plugin zu deinstallieren, leider bleiben sämtliche Zahlungsmittel im System. Selten so ein schlechtes Plugin erlebt. Da fragt man sich schon, wo das Plugin noch überall seine Spuren hinterlässt. Es wird vermutlich keinen Wert drauf gelegt, was passiert wenn man sich am Ende doch gegen das Mollie Plugin entscheidet.","headline":"Unfassbar schlecht!","creationDate":{"date":"2023-04-26 16:14:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Gonçalo Pinheiro","text":"The Mollie Approval is a terror!!!! Lack of feedback, long-time approval, and worst service ever. When you think you will have a good API and a Fast and Easy Service, it transforms into a nightmare when the approval process begins.","headline":"Very bad experience","creationDate":{"date":"2023-04-03 18:34:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":4},{"authorName":"Patrick Gottsacker","text":"The plug-in works as expected. We use it in many projects. The excellent support from DasIstWeb deserves special praise. Many thanks for that!","headline":"Very good and fantastic Support by DasIstWeb","creationDate":{"date":"2023-01-13 14:44:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Dollinger","text":"Macht genau das was es soll, funktioniert einwandfrei.\nAuf Support Anfragen wird schnell und zuverlässig geantwortet.\n\nVielen Dank!","headline":"Klasse Plugin und Super Support","creationDate":{"date":"2022-12-20 22:58:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Markus","text":"","headline":"Einfache Installation und super integriert!","creationDate":{"date":"2022-08-26 09:03:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Viktor","text":"Dieses Plugin deckt unser spezielles Abo-Modell vollumfänglich ab. Support reagiert  sehr schnell.","headline":"Ein Abo-System mit vielen Möglichkeiten und hervorragendem Support","creationDate":{"date":"2022-08-19 09:47:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Heiko Richter","text":"Deutlich überzogene Gebührenstruktur, wenn man es mit anderen Anbietern vergleicht. Außerdem werden bei kleinen Shops praktisch alle Zahlungsmethoden abgelehnt, vor allem die Kreditkartenzahlung. Was soll ich mit einem überteuerten Anbieter, der mir dann nur PayPal freischaltet und die teuren PayPal-Gebühren mit eigenen Aufschlägen noch teurer macht? Dieser Anbieter ist einfach nur lächerlich und höchstens für diejenigen interessant, die die DSGVO-Mafia fürchten und auf US-Anbieter wie PayPal, Stripe &amp; Co. verzichten wollen.","headline":"Gebührenstruktur","creationDate":{"date":"2022-08-17 09:49:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":3},{"authorName":"B.","text":"Bisher sind wir sehr zufrieden mit der Mollie-Integration. Wir haben zwar beim Testen noch einen kleinen Fehler gefunden, aber der betrifft nicht die Kernfunktionalität und auch hier wird sich bereits gekümmert. Wir hoffen natürlich sehr, dass er bald behoben wird :-) Großes Lob auch an den Support des App-Entwicklers. Hier war die Betreuung wirklich top! Endlich mal wieder ein Support mit echten, kompetenten und lösungsortientierten Menschen statt sinnlosen, standardisierten und maschinengenerierten Textbausteinen.\nVielen herzlichen Dank dafür!","headline":"Sehr zufrieden","creationDate":{"date":"2022-08-01 14:18:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Tom Schmidt","text":"Für mich gibt es keine bessere Alternative als Zahlungsplugin für Shopware. Alles modern und top integriert.","headline":"Top Plugin","creationDate":{"date":"2022-03-15 17:27:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Chris Calm","text":"Wir sind sehr froh, dass es Mollie gibt, denn mit Mollie können wir unseren Kunden viele verschiedene Zahlungsarten anbieten, was ja auch mittlerweile sehr wichtig im E-Commerce ist. Es gibt jedoch eine Kleinigkeit die uns etwas stört. Wir sind der Meinung, dass der Kunde nicht 3 x das gleiche Klarna Symbol sehen möchte, denn dies würde einfach auch der Kunden irritieren, deswegen nehmen wir das Logo Klarna Sofort oder Klarna Pay now, damit der Kunde es schon beim Logo differenzieren kann. Es ist einfach so, dass immer nach einem Update, diese Bilder bzw. Logo, welche wir ja hinzugefügt haben,  plötzlich verschwinden und wir haben echt keine Lust mehr, immer wieder diese Bild bzw. Icon Zahlungsarten neu einzurichten. Bitte das neue Update so einrichten dass keine Bilder mehr verschwinden, oder die voreingestellten Bilder so einrichten, dass der Kunde nicht 3x das gleiche Bild sieht","headline":"Mollie ist Mega, aber","creationDate":{"date":"2022-02-16 18:37:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Kevin","text":"Thanks for the nice plugin!","headline":"Works as expected","creationDate":{"date":"2022-02-06 16:23:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Christian Herrmann","text":"Für unseren Fall genau das Richtige. Die Einrichtung ist kinderleicht. Nach dem Update auf 1.5.5 gab es aber leider ein Problem, was der Hersteller jedoch in Windeseile angepackt und gelöst hat. Spitze!","headline":"Unkompliziertes aber mächtiges Plugin und wenn mal etwas klemmt, Spitzen-Support","creationDate":{"date":"2021-11-05 11:26:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Florian Münkel","text":"Das Plugin funktioniert perfekt. Anfangs hatten wir noch kleinere Probleme bei sehr spezifischen Sonderfällen, aber diese wurden von dasistweb umgehend behoben.  Wir sind absolut zufrieden und können sowohl das Plugin als auch den Anbieter absolut weiterempfehlen. \n\nWir nutzen eine hohe Bandbreite an Zahlungsweisen.  Einziges Manko: Amazon Pay wird (noch) nicht angeboten, aber ich glaube das liegt eher an Amazon als an Mollie.","headline":"Hervorragendes Plugin","creationDate":{"date":"2021-10-05 18:21:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Franziska-Florina Eichler","text":"also das Plugin for Shopware 6 tut was es soll und wir wickeln damit bisher Apple Pay ab. ;) Mal schauen was noch umsetzbar ist.","headline":"Nutzung für Apple Pay und das klappt super","creationDate":{"date":"2021-05-27 10:03:13.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Malte Riechmann","text":"","headline":"It just works","creationDate":{"date":"2020-12-03 08:42:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Angelika Schneider","text":"nach anfänglichen Schwierigkeiten mit der Installation (hatte Mollie bereits in der Vergangenheit eingesetzt und dann deinstalliert) funktioniert das Plugin nun. Besonderer Dank geht an Geert, der mit großem Einsatz allen Widrigkeiten getrotzt hat (ein anderes Plugin verhinderte zusätzlich noch den Checkout)!","headline":"alles perfekt","creationDate":{"date":"2020-12-02 15:59:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Hans-Peter Frey","text":"Wir haben uns für die Zusammenarbeit mit Mollie aufgrund der Empfehlung von Shopware entschieden. Leider hat uns das Plug-in ab dem 1. Tag nur Probleme bereitet. Aus uns nicht erklärbaren Gründen hat das Plug-in sogar andere vorinstallierte Zahlungsarten gestört bis zum Schluss nichts mehr ging. Der Service von Shopware konnte uns bezüglich des Plug-in leider nicht weiterhelfen und wir haben das Plug-in offline genommen und den Hersteller kontaktiert.\n\nDie Krönung ist der Service vom Hersteller. Dieser hat unsere Anfrage vom 14.08.2020 am Freitag, den 21.08.2020 kurz vor Ablauf der Frist beendet. Die Entwicklungsabteilung werde sich bei uns zeitnah melden. Seitdem warten wir auf Rückmeldung von der Entwicklungsabteilung... Schade dass man hier keine Dringlichkeit sieht.  Ein Shop ohne vernünftige Zahlungsmodalitäten ist ein toter Shop!\n\nHier werfen sich für uns allerdings noch 2 Fragen auf. Auf welcher Basis spricht Shopware Empfehlungen für Hersteller von Plug-in aus und wie lange soll man aus Sicht des Herstellers auf eine Antwort warten?\n\nNun werden wir uns einen anderen Anbieter für die Abwicklung suchen. Das macht ja so keinen Sinn.\n\nNachtrag 09/2020: Support hat sich gemeldet, jetzt funktioniert es.","headline":"Einfach nur unterirdische Performance für ein von Shopware empfohlenes Plug-in","creationDate":{"date":"2020-09-04 20:10:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":6},{"authorName":"EnergyVital","text":"Zitat Mollie:\n\"wir haben Ihr Webseitenprofil für die Freischaltung der SEPA Lastschrift als Zahlungsmethode für Ihren Account (Kunden ID: xxx) überprüft. Leider können wir Ihre Anfrage im Moment nicht genehmigen. Sie verkaufen keine Abonnements oder andere Produkte, für SEPA Lastschrift als Zahlungsmethode benötigt wird.\"\n\nAha. Eine der in Deutschland wichtigsten Zahlungsarten wird aus einem völlig behämmerten Grund abgelehnt. Und  auch die Arroganz wieso die entscheiden welche Zahlungsart für mich wichtig ist...\nExtrem wichtig, gerade auch für meine ältere Zielgruppe ohne Kreditkarte und auch generell in Deutschland.\nSchade, schön wäre es gewesen, mal einen Anbieter mit Sitz in Deutschland zu haben, also wieder zurück zu Stripe...","headline":"Mollie entscheidet, welche Zahlart für mich wichtig ist...","creationDate":{"date":"2020-08-16 13:11:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Jurriaan Ruitenberg","text":"The support is good and you will get an answer reasonably fast. We had problems in the beginning, especially with the headless implementation, but most of this has been fixed over time. Still would like some more events or hooks to store some of the information coming back after payment. Another thing is that Shopware itself has some quirks but this plugin is not to blame for that.","headline":"Decent implementation working around Shopware quirks","creationDate":{"date":"2020-05-20 15:46:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8},{"authorName":"HEPTACOM","text":"Sehr einfach zu bedienen!\ntoller Support!\nKonfiguration wird automatisch über Mollie bezogen :) heißt das upgrade auf 6 geht easy","headline":"Klasse Plugin!","creationDate":{"date":"2019-11-13 09:44:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Peter","text":"Es hat zwar gedauert bis das neue Update gekommen. \nJetzt funktioniert es aber ohne Probleme.","headline":"Funktioniert","creationDate":{"date":"2019-10-28 18:54:44.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":8,"label":"Mollie Payments Plugin for Shopware 6","description":"<p>Use the official Mollie plugin to give your customers an excellent payment experience in your Shopware-powered store. You can offer all major global and local payment methods in your checkout, including:</p><p>Visa, Mastercard, American Express, PayPal, Klarna, Apple Pay, iDEAL, in3, SOFORT Banking, Giropay, EPS, SEPA bank transfer, KBC payment button, Bancontact, Belfius Pay Button, paysafecard, CartaSi, Cartes Bancaires, and gift cards.</p><p>The plugin comes with a built-in refund manager and an integration with the Shopware 6 flow builder, so that you have the tools you need to manage orders and automate your business processes. It also fully supports Shopware 6 <a href=\"https://github.com/mollie/shopware6/wiki/Headless-setup-in-Shopware-6\">headless solutions</a>, which means you can offer Mollie payment methods in all of your storefronts.</p><p><i>Together with our development partner, <a href=\"https://www.dasistweb.de/\">dasistweb</a>, we strive to create a best-in-class plugin for your shop. Get Mollie Payments for Shopware 6 and join over 130,000 satisfied merchants in receiving payments today.</i></p>","installationManual":"<h4>Set up Mollie Payments for Shopware 6 in a few steps:</h4><p></p><ol><li><a href=\"http://mollie.com/signup\">Create and activate your Mollie account</a>.</li><li>Log in to your Shopware 6 administration.</li><li>Go to <b>Extensions </b>&gt; <b>Store</b> and search “Mollie Payments”.</li><li>Add, install, and activate the plugin.</li><li>Enter your Mollie API keys to connect Shopware 6 to your Mollie account.</li><li><a href=\"https://github.com/mollie/Shopware6/wiki\">Configure the plugin</a> to meet your needs.</li></ol><p></p><p>After your Mollie onboarding process is complete, you can start accepting online payments in your Shopware 6 webshop.</p><p><br /></p>","version":"4.0.0","changelog":[{"version":"4.0.0","text":"<p><b>Breaking Changes:</b></p><p></p><p>The new version 4.0 has been restructured to support both Shopware 6.4 and the new Shopware 6.5 with one single plugin. This means that the Javascript in the Storefront is now loaded from a separate mollie-payments.js file. That behaviour can of course be turned off if you want to build the storefront on your own (please see documentation for more). If you do not see iDEAL dropdown or credit card components, then this could mean that your (custom) theme does accidentally override the Shopware default theme in a wrong way.</p><p></p><p></p><p><b>Features:</b></p><p></p><ul><li>Full support for Shopware 6.5</li><li>Renamed the “Credit Card” components to “Card” because it also allows debit cards.</li></ul><p></p><p><b>Fixes:</b></p><p></p><ul><li>Fixed wrong static quantity of “1” when building shipping items for Mollie. Custom implementation with different quantities will now also be correctly passed on to Mollie.</li><li>Fixed “division-by-zero” error on missing tax rates in the order for rare cases of shop configurations.</li><li>Fixed error in the Refund Manager ACL. Restricted user roles got an error when creating refunds, although the refund was always correctly passed on to Mollie.</li></ul><p></p>","creationDate":{"date":"2023-06-07 10:57:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.6.0","text":"<p><b>Features:</b></p><p></p><ul><li>New payment method \"Billie\" is now available.</li><li>With the new feature \"Automatic cancellation\" in the plugin configuration, the previously integrated cancellation of Klarna orders can now be optionally deactivated.</li><li>With the new placeholder \"customernumber\" for the user-defined order number format, the customer number can now also be integrated into the order number.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>[developer] The deprecated field \"mollieStatus\" has now been removed from the subscription. The \"status\" field has been used here for some time.</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Orders with refunds can now be deleted again according to the Shopware standard.</li><li>Fixed compatibility issue with NetInventors' \"Prices after login...\" plugin.</li><li>Fix problems with the automatic route detector for webhooks in headless shops based on Symfony Flex (.ENV parameter problem)</li><li>Removed the logs entry \"Product is no longer a subscription product..\" which was incorrectly always created.</li><li>Fixed a TWIG template error in combination with One-Click Payments and Shopware 6.3.5.x</li><li>Wrong \"associations\" were removed when loading orders, which led to ugly log entries.</li></ul>","creationDate":{"date":"2023-03-16 08:30:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.5.0","text":"<p><b>Hints:</b></p><p></p><ul><li>The plugin configuration \"final order status\" now only has the expected entries of the status list. Please check whether the configuration is still correct after the update.</li></ul><p><b>Features:</b></p><p></p><ul><li>With the integration of One-Click Payments, customers can easily save credit card details for repeating orders. No sensitive data is stored in Shopware.</li><li>The Refund Manager now offers the option of specifying internal comments for refunds in addition to official account statement descriptions.</li><li>New Flow Builder events CheckoutSuccess, CheckoutFailed and CheckoutCanceled for the storefront. This means that events during the payment process can be dealt with individually.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>The column \"Mollie\" in the order overview of the administration now also shows the Mollie ID of the order.</li><li>New DEBUG log entry if a subscription could not be created correctly due to invalid data.</li><li>The plugin configuration now immediately shows instructions for the individual order number area, and not only when you configure something.</li><li>The plugin configuration for the final order status now only shows the normal status entries of orders.</li></ul><p><b>Bug fixes:</b></p><p></p><ul><li>Fixed the Javascript issue due to Apple Pay Direct in the storefront.</li><li>Fixed the problem where an automatic \"cancellation\" of Klarna orders via administration did not use the correct API key of the sales channel.</li><li>Fixed the problem where anonymizing the URL in the logs didn't work properly. However, this only applies to tokens that are used once during the payment process.</li></ul>","creationDate":{"date":"2023-02-23 09:42:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.4.0","text":"<p><b>Breaking changes</b></p><p></p><ul><li>For the future extensions for subscriptions we had to adjust the webhooks for them. If there are firewall rules for this, these rules must be adjusted for the new webhooks: https://github.com/mollie/Shopware6/wiki/Webhooks</li><li>Statuses (badges) for subscriptions are no longer loaded directly from Mollie but are obtained from the local database. This new and empty field is usually filled in automatically. If status entries are unexpectedly empty, please let us know.</li><li>Since we always strive to deliver the best quality, we were forced to stop supporting older Shopware versions below 6.3.5. If this is a problem, please contact us to find a possible solution. We regret this step and ask for your understanding. This is the only way to maintain high quality in the long term.</li></ul><p><b>Features:</b></p><p></p><ul><li>New management for subscriptions. These can now also be paused, renewed or suspended (once).</li><li>Apple Pay Direct is now also available in the off-canvas and in the shopping cart as an express payment method.</li><li>New feature for \"rounding adjustments\" to be able to make payments with special rounding settings in Shopware.</li><li>New user roles and permission options for subscriptions and the Refund Manager in the administration</li><li>Possibility to configure a custom format for order numbers in Mollie</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Protections for API keys. It is no longer possible to enter a live API key in the test field and vice versa.</li><li>The plugin configuration was rebuilt to give a better overview</li><li>Credit card components now also work with Shopware's CSRF mode</li><li>Improved compatibility with the \"Best Practice Checkout\" plugin</li><li>Icons of payment methods are now loaded via a different way on initial installation. This is good if \"file_get_contents\" is not allowed on the server.</li><li>The refund manager now shows specific error texts in the alerts if an error occurs.</li><li>Unintentional spaces in the salutation of an address are now filtered out. This led to problems with orders.</li><li>Add new debug log entries for all changes of payment status and order status (Order State Management)</li><li>Apple Pay log entries are now only created if Apple Pay is also active. These were always created by mistake.</li><li>Apple Pay does not support a company name. Therefore, a company name stored in the account is now also removed when paying with Apple Pay Direct, since the address of Apple Pay should always be used here.</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fixed broken snippets for Flow Builder triggers since Shopware 6.4.18</li><li>Fixed an incorrect rounding display of \"shipping\" amount values ​​in the administration</li><li>Fixed the rare issue \"Struct::assign() must be type of array\" during a checkout</li></ul>","creationDate":{"date":"2023-01-10 12:50:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.3.0","text":"<p><b>Improvements:</b></p><p></p><ul><li>The Refund Manager now also supports promotions related to delivery costs.</li><li>The setting that customers are created at Mollie is now inactive for new installations by default.</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fixed a crash in combination with other payment provider plugins (Attempted to load class HandleIdentifier and Constant).</li><li>Fixed an issue in the Refund Manager where it was not possible to overwrite the final amount individually again for LineItem-based refunds.</li><li>Fixed a typo in the order state mapping in the plugin settings.</li></ul>","creationDate":{"date":"2022-11-09 10:08:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.2.0","text":"<p><b>Features:</b></p><p></p><ul><li>Remove SEPA Direct Debit. This is not available anymore for regular and initial payment attempts.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>The subscriptions in the storefront do not show a dropdown for the country anymore inside the address-edit form, because the country cannot, and must not be changed.</li><li>Subscription forms in the Storefront do now also support the CSRF mode \"Ajax\" of Shopware.</li><li>Smaller improvements of our debug logs</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fix a problem with opening orders in the Administration, that are paid with AMEX credit cards. Because of an issue with the displayed card logo, these orders led to errors in the Administration.</li><li>Fix a problem with a broken link in the Storefront when updating the payment method of a running subscription.</li><li>Add a missing german snippet for an error in the cart with subscription products (\"...not all payment methods available..\")</li></ul>","creationDate":{"date":"2022-10-13 12:11:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.1.0","text":"<p><b>Improvements:</b></p><p></p><ul><li>The Custom-Fields of an order in Shopware are now also enrichted with Mollie data via webhooks if the customer does not return to the actual finish page.</li><li>The clickable links within the plugin configuration have now also been implemented for Shopware versions &lt;= 6.3.</li></ul><b>Fixes:</b><p></p><ul><li>Fixed a problem that webhook updates of existing subscription orders might lead to new orders in Shopware.</li><li>Fixed wrong order times in emails (UTC times) when order confirmation emails are triggered by the combination of Flow Builder + webhooks.</li><li>Fixed a rare error \"Customer ID is invalid when creating and order\".</li></ul><p><br /></p>","creationDate":{"date":"2022-09-29 08:34:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p><b>(Possible) Breaking Changes:</b></p><p>The new version 3.0 offers official support for \"headless\" shops. With the help of \"Automatic Route Detection\" we have tried to avoid \"breaking changes\" for new and old payments. Should a problem arise, we have instructions here: https://github.com/mollie/Shopware6/wiki/Headless-setup-in-Shopware-6</p><p><b>Features:</b></p><p></p><ul><li>Support for \"Headless\" systems</li><li>Out-of-the-box support for the Shopware PWA</li><li>Display of (anonymous) credit card data in an order within the administration (for new orders)</li><li>Subscription feature can now also be disabled if not needed.</li><li>New configuration to skip failed subscription renewal payments, so that only valid payments lead to a new order in Shopware.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Buttons in the Refund Manager now show a progress if a refund takes a little longer.</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fixed a NULL problem in OrderLineItemAttributes that could occur in a few shops.</li></ul>","creationDate":{"date":"2022-09-12 14:06:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.5.0","text":"<p><b>Improvements:</b></p><p></p><ul><li>All Mollie Flow Builder events now support the use of email actions.</li></ul><p></p><ul><li>Refunds in the Refund Manager can now be created with more positions than before. Due to a limitation on Mollie's side, the data is now internally compressed and thus reduced.</li></ul><b>Fixes:</b><p></p><ul><li>Mollie subscriptions are now only started with the next interval to avoid an initial double booking</li></ul>","creationDate":{"date":"2022-08-29 10:30:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.4.0","text":"<p><b>Features:</b></p><ul><li>The Refund Manager can now be deactivated in the plugin settings. This prevents employees from using it when another system is responsible for refunds.</li></ul><p></p><p><b>Improvements:</b></p><ul><li>The selection of iDEAL banks is now mandatory. As a result, the customer can no longer forget it, and the checkout process on the Mollie payment page is reduced by 1 step.</li><li>The Shopware standard behaviour for failed payments is now activated by default when the plugin is installed the first time.</li></ul><p></p><p><b>Fixes:</b></p><p></p><ul><li>When creating subscriptions, the mandate of the initial payment was not used explicitly. If the customer already has several mandates, Mollie may have used the wrong one for recurring payments.</li><li>The \"additional\" field in the address is no longer sent to Mollie if there are only spaces in it. This caused a problem when creating the payment.</li><li>Fixed warnings for \"CLI commands\" in combination with the PSR Logger, Shopware 6.4.10.1 and PHP 8.0</li></ul><p></p>","creationDate":{"date":"2022-08-10 10:08:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.1","text":"<p><b>Fixes:</b></p><p></p><ul><li>Fixed the problem with MailTemplate errors when installing/updating the plugin in combination with a shop that only has DE as the default language</li><li>Fixed problems with internal loading of LineItems when CustomFields are empty (NULL)</li></ul><p><br /></p>","creationDate":{"date":"2022-08-01 13:14:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<p><b>(Possible) Breaking Changes:</b></p><p>This release brings support for the bulk editing of products in the Administration. Due to internal changes, please verify the configured \"Voucher Types\" of your products after the update. There should be no problem, but please verify that these settings still exist, or set them again.</p><p><b>Features:</b></p><p></p><ul><li>Brand new support for subscriptions in Shopware. Configure products and sell them based on daily, weekly or monthly subscriptions. Read more here: https://github.com/mollie/Shopware6/wiki/Subscription</li><li>Add new Order State Mappings for refunds and partial refunds.</li><li>Add new in3 payment method</li><li>Add SEPA Direct Debit payment method</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Mollie product properties are now available in the bulk editing within the Administration.</li><li>The detail view of an order in the Administration does now show the Paypal or SEPA reference number.</li><li>The Refund Manager does now show the total sum with and without taxes</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fix edge case problem where an expired order could not be re-paid from within the Storefront.</li></ul><p><br /></p>","creationDate":{"date":"2022-07-13 10:09:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"<p><b>Features:</b></p><p></p><ul><li>With the new setting \"Final order status\" you can lock a selected status as the final status. From this point on, the status will only be changed in the case of refunds and chargebacks. This feature is particularly helpful in combination with logistics plugins and logistics processes that differ from Mollie.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>The payment status \"expired\" now leads to an order status of \"cancelled\" instead of \"failed\". This is more in line with reality.</li><li>Compatibility support for the \"Article number direct URL\" plugin.<br /></li></ul><p><b>Fixes:</b></p><p></p><ul><li>The plugin now ignores webhook updates for orders that started with Mollie, but were not ultimately completed with Mollie.</li><li>Fixed an issue with the checkout in combination with mixed tax rates, discount codes and using a net-price customer group<br /></li></ul>","creationDate":{"date":"2022-05-11 10:35:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p><b>Features:</b></p><p></p><ul><li>We've added the brand new \"Smart Contact Form\" as new support option in plugin configuration. If you use this for support, we will automatically get all data that we need to help you as good as possible.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Improved and fixed handling of orders with different tax rates and promotions. Due to technical circumstances a promotion in Mollie is also 1 line item. Because of the fact that only 1 tax rate is possible, a mixed tax rate for promotions is now calculated and used inside Mollie to at least ensure that orders like this can be completed.</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fix problem with Refund Manager and specific API keys for different Sales Channels. It should now always use the correct API key from the Sales Channel of the order.</li><li>Fix problem where the Mollie Limits feature accidentally reduced payment methods in the account and logos in the footer. Please also clear your caches after updating.</li></ul><p><br /></p>","creationDate":{"date":"2022-04-27 09:23:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p><b>Features:</b><br /></p><ul><li>Release of the brand new Refund Manager in Administration and for your API. Handle full refund processes with transactions, stock and Flow Builder events in an intuitive refund form.</li><li>New Apple Pay Display Restrictions in the plugin configuration allow you to hide Apple Pay Direct buttons on different pages without coding.</li><li>New MollieOrderBuilder Event to customize metadata when creating orders (Feature for developers).</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Important change and fix for the Order Transactions in Shopware. When a customer creates additional payment attempts if the first one fails, then the status history in the Administration and API got out of sync. Mollie will now always use the correct latest transaction of Shopware and append the new status to this transaction and keep it consistent.</li><li>SEPA transaction will now stick with \"In Progress\" if started and will not transition back to \"Open\".</li><li>Payments with status \"Created\" will now be detected as \"failed\". This should not happen by Mollie, but did somehow.</li><li>Credit Card payments with status \"Open\" will now be detected as \"failed\". This should also not happen.</li><li>Apple Pay Direct will now use the Shopware customer number range when creating new guest accounts.</li><li>Replaced Javascript code in Apple Pay Direct to remove error outputs in Internet Explorer.</li><li>Removed jQuery to prepare for Shopware 6.5.</li><li>Improved performance of the \"voucher availability\" detection when working with a large set of products.</li><li>ING'Homepay will now always be disabled when updating payment methods. This payment method is deprecated in Mollie since a while.</li><li>Removed automatic activation of Mollie payment methods when installing the plugin. This led to a problem due to ING'Homepay, and one would not expect this to happen in that place.</li></ul><b>Fixes:</b><p></p><ul><li>Fix problem that some fields such as images and names of payment methods got removed and set back to factory defaults after updating them.</li><li>Fix problem with payment methods that were imported twice on an update. (This does not fix previously duplicated methods though).</li><li>Fix a problem with the IPAnonymizer in combination with IPv6 inside the Logging module.</li><li>Fix broken \"update payment method\" button in the plugin configuration in older Shopware versions.</li><li>Fix rare problem where \"checkSystemConfigChange()\" in the Mollie plugin threw an exception.</li><li>Fix a problem where shipping wasn't possible due to missing data in the Administration (Cannot read a.shippedQuantity)</li><li>Fix very rare problem of an exception when using the \"Mollie Limits\" feature.</li><li>Fix Javascript error that is visible if iDEAL is assigned to a Sales Channel but Mollie isn't even configured correctly.</li></ul>","creationDate":{"date":"2022-03-23 10:49:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p>This version brings support for the latest Shopware 6.4.9.0. The previous version was never meant to be available for this Shopware version. The Shopware store did unfortunately automatically approve the new Shopware version, which has been turned off for the future. We are sorry for any inconvenience.</p>","creationDate":{"date":"2022-03-16 08:38:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p><b>Improvements:</b><br /></p><ul><li>Due to a bug (NEXT-20128) in the current Shopware version 6.4.8.x there is a Javasript error \"HTML element not found\" on every page in the shop. We want the best for you, so we've figured out a way to get rid of this error.</li></ul>","creationDate":{"date":"2022-02-16 15:10:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p><b>Features:</b></p><p></p><ul><li>The new configuration \"Mollie Payment Limits\" helps you to automatically hide payment methods that are not available by Mollie for the current cart total amount. You can of course use your Shopware availability rules from the Rule Builder and also use the optional Mollie Limits on top of it.</li><li>We present the new plugin configuration. Improved onboarding, improved structure and more descriptions help you with an even easier configuration of the plugin.</li></ul><p></p><p><b>Improvements:</b></p><p></p><ul><li>Apple Pay Direct payments do now also get additional information like the Mollie-ID, etc. in the \"Custom Field\" of the Shopware order.</li><li>Avoiding of Javascript errors in the shipment section of an order in the Administration. This is just an additional optimization.</li></ul><p></p><p><b>Fixes:</b></p><p></p><ul><li>SEPA bank transfer payments with status \"open\" do now lead to a successful order.</li><li>PayPal payments with status \"pending\" do now lead to a successful order.</li></ul><p></p>","creationDate":{"date":"2022-02-15 09:57:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p><b>Welcome to MolliePayments v2.0!</b></p><p>We hope you enjoy the wide variety of new features, updates and fixes.</p><p>Great to have you as our customer :)</p><p><br /></p><p><b>BREAKING CHANGES:</b></p><p>Because of Flow Builder we had to remove the fixed shipments/refunds that happened on status transitions.</p><p>But no worries, there is a new \"Automatic Shipping\" feature that is enabled by default and makes sure</p><p>that it works in the same way after updating to v2.0.0</p><p><br /></p><p><b>Features:</b></p><p></p><ul><li>Brand new Flow Builder Integration. Listen for incoming Mollie Webhooks, or automatically trigger shipments and refunds. The flexibility of Flow Builder is now coming to payments!</li><li>New \"Automatic Shipping\" feature that can be turned off when you want to ship with other features such as Flow Builder.</li><li>Shipment Tracking is now available in the Administration. If you have tracking data, then it should automatically be prepared when you start a shipment.</li><li>Partial Shipments for line items is back and now possible in the Administration.</li><li>New Mollie Action buttons for shipment and refunds in Administration to improve the way you work with Mollie orders.</li><li>\"Chargeback\" payment status is now supported in the plugin.</li><li>Refunds can now be done through the Shopware API.</li><li>New Logging system. Our improved and better debug logs are now only in the file system next to other Shopware logs.</li><li>New button to update payment methods without re-activating the plugin is now existing in the plugin configuration.</li><li>New CLI command to update the Apple Pay Domain Verification file in case it changes.</li><li>Mollie information like Order ID, Transaction ID, PayPal Reference and SEPA Reference is now saved in the custom fields of the order.</li><li>Apple Pay Direct is now also supported on custom product pages built with the CMS system.</li></ul><p><br /></p><p><b>Improvements:</b></p><p></p><ul><li>Add Twig blocks to Apple Pay Direct buttons.</li><li>Improve margins of Apple Pay Direct buttons.</li><li>The lastUpdated of the order itself will now be updated too on incoming payment status changes.</li><li>The plugin will now automatically install new payment methods on plugin updates in the future.</li></ul><p><br /></p><p><b>Fixes:</b></p><p></p><ul><li>Fix Credit Card Components in Internet Explorer</li><li>Fix Credit Card Components on the Edit Order page after a failed payment.</li><li>Fix compatibility problem with the official Klarna plugin.</li><li>Fix problem with checkouts in Shopware 6.3.3.1</li><li>Fix wrong router in PaymentController that could lead to wrong URLs with other plugins.</li><li>Fix problem of duplicated payment methods after renaming them and updating the plugin.</li></ul><p><br /></p>","creationDate":{"date":"2022-01-31 11:22:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.8","text":"<p><b>Improvements</b></p><p></p><ul><li>Add compatibility for EasyCoupon Plugin by Net Inventors GmbH</li></ul>","creationDate":{"date":"2021-12-14 10:02:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.7","text":"<p><b>Features:</b></p><p></p><ul><li>New payment method \"Klarna Pay Now\" is available</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Apple Pay Direct forms will now not be rendered in the storefront anymore if Apple Pay Direct is not enabled</li></ul>","creationDate":{"date":"2021-11-15 11:55:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.6","text":"<p><b>Improvements:</b></p><p></p><ul><li>Failed payments now lead to a \"failed\" payment status instead of \"cancelled\"</li><li>Add compatibility for plugin \"ACRIS Checkout Shipping Payment Preselection\"</li><li>Add compatibility for plugin \"Custom Products\"</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fix rare rounding problem with \"net price\" based shops and vertical tax calculation</li><li>Fix Javascript problem in administration that prevented line items from being displayed in the order view </li></ul><p><br /></p>","creationDate":{"date":"2021-11-08 14:33:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.5","text":"<p><b>Features:</b></p><p></p><ul><li>Add new payment method \"Voucher\". Configure your products as Eco-, Meal- or Gift Voucher and let your customers use supported voucher systems.</li><li>New Shopware API route to ship orders. Use these routes for easy integrations of logistic systems and other tools.</li></ul><p><b>Improvements:</b></p><ul><li>Increase timeout for the communication with Mollie to allow stable payments also during peak times.</li></ul><p></p><ul><li>API keys are now shown as password fields in the administration</li><li>Improvement of plugin compatibilities with the new usage of the RouterInterface instead of the original Router in Shopware.</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Removed unsupported EMV Apple Pay cards from Apple Pay Direct</li><li>Customization of the checkout page might lead to Javascript problems with the credit card components. This has been improved now.</li></ul><p><br /></p>","creationDate":{"date":"2021-10-27 12:45:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<p><b>Features:</b></p><p></p><ul><li>The feature \"Create Customers in Mollie\" is back. It's now ready for Multi-Sales-Channel setups and both, test and live modes. If enabled customers will be created in Mollie and linked to their orders and transactions.</li></ul><p><b>Improvements:</b></p><p></p><ul><li>Apple Pay Direct has been completely refactored and improved for better stability, features and performance.</li><li>Apple Pay Direct does now reuse the existing Shopware customer, if already signed in.</li><li>Apple Pay Direct does now also work for earlier Shopware Versions 6.1.x, ...</li></ul><p><b>Fixes:</b></p><p></p><ul><li>Fix problem where the redirect to the Mollie Payment page after a failed payment led to a NOT FOUND error in Shopware 6.4.3.1</li><li>Fix problem with lost sessions, carts and disappearing promotions in combination with different Sales Channels due to wrong Apple Pay ID checks in the background.</li><li>Fix problem where wrong arguments led to an exception while trying to log data.</li><li>Optional MOLLIE_SHOP_DOMAIN variable for custom Webhook URLs is now correctly used again.</li><li>Fix problem of \"PROMOTION_LINE_ITEM Not Found\" in earlier Shopware versions 6.1.x</li><li>Fix general checkout problems in Shopware Versions 6.1.x</li></ul><p><br /></p>","creationDate":{"date":"2021-09-15 15:37:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<p>Bugfix:</p><p>- fix registration error with apple pay direct</p><p>- fix plugin config default values, if plugin is newly installed. In administration of the plugin config testModus has been shown as off, though it was on.</p>","creationDate":{"date":"2021-08-11 17:03:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<p>Refactoring and code improvements when changing payment transitions<br />Bugfix:<br /></p><p>- fixed a bug when entering wrong creditcard informations. The payment process is not blocked any more<br />- fixed a bug that prevented to pay if a promotion has been in cart </p><p>- Change router in MollieOrderBuilder to Shopware router instead of symfony router<br /><br /><br /></p>","creationDate":{"date":"2021-08-05 16:55:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Bugfix:<br />Fixed delivery cost transmission to mollie.</p>","creationDate":{"date":"2021-07-21 13:55:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<p>Feature</p><p>Added full support of Partial Refunds (just add wished sum and create refund directly at mollie)</p><p><br /></p><p>Refactoring</p><p>refactored payment handler for more code stability</p><p>Add new transition service for payments</p><p>Reuse mollie orders - don’t create new mollie orders in case of cancelled or failed payments</p><p>Reuse mollie order payments if possible (otherwise create new payment) if former payment has failed or has been cancelled </p><p><br />Bugfix</p><p>Fixed shipping transition</p>","creationDate":{"date":"2021-07-21 09:52:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>Bugfix:</p><p>fix backwards compatibility</p>","creationDate":{"date":"2021-07-07 17:29:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>Bugfixes:<br /></p><p></p><ul><li>Fixed Apple Pay domain verification, if Apple Pay direct should be used<br /></li><li>refactored web hook notifications. Some mollie order states haven’t been recognized correctly, which results that payment status didn’t change.</li><li>Apple Pay isn’t shown as payment method in storefront if browser isn’t supporting Apple Pay or no wallet has been configured on used device</li><li>Added a fix for Ideal issuer dropdown in Shopware 6.4 templates</li><li>fixed a bug that prevented order state transitions in multilingual shops </li></ul><ul><li><p>fixed a bug for shopware versions &gt; 6.4 with the return url. The former used return url could be too long for mollie api. Now we use only short urls </p></li></ul><p><br />Features</p><p></p><ul><li>Added a link to the developer section of the mollie dashboard in administration config</li><li>Added the mollie payment url to orders in Shopware backend</li><li>If you activate test mode in administration, every mollie payment in storefront gets an „test mode“ addition in the payment method name</li></ul>","creationDate":{"date":"2021-07-06 10:58:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>Bugfix:<br />transaction status is set to paid if mollie sets klarna order payment status from authorized to completed</p>","creationDate":{"date":"2021-05-17 11:46:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>Feature:</p><p>Plugin is now Shopware 6.4 compatible</p><p>\"Create customer at mollie\" feature deactivated and removed from administration</p><p>Bugfix:</p><p>fixed credit card components return url (thanks to fjbender for finding and solving this bug)</p><p>Notes:</p><p>If you use the new currency rounding feature (total sum), we calculate the surcharge or discount just like Shopware with 0% taxes.</p>","creationDate":{"date":"2021-05-06 10:31:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.16","text":"Bugfix:<br /><p>- fixed bug that prevented to edit an order in the administration</p>","creationDate":{"date":"2021-04-22 10:33:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.15","text":"<p>Bugfixes:</p><p>- added webhook url to payment node to transmitted data when order is placed. In edge cases this could lead to permanent payment status „processing“ in Shopware</p><p>- fixed a bug when payment has been set to refunded in administration. The bug has read wrong plugin configuration in multi sales channel environments</p><p>- Updated custom parameters for bank transfer payment method.</p><p>- Added better order state handling if order status change is configured in plugin</p><p>- Fixed wrong handling of feature „Do not create customers at Mollie“</p><p>- Fixed wrong error handling during checkout in case of mollie api errors</p>","creationDate":{"date":"2021-04-21 10:03:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.14","text":"<p>fixed bugs and refactored shipment submission to mollie api</p>","creationDate":{"date":"2021-03-15 11:02:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.13","text":"<p>* fixed js error in creditcard-components that could break payment process</p><p>* added fallback for empty order expires at configuration (let mollie handle this)</p><p>* fixed browser back button behaviour on mollie payment page when a payment has failed before </p>","creationDate":{"date":"2021-02-24 12:24:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.12","text":"<p>Improvements:<br /><br /></p><p>MOL-137:</p><p>updated translations for german and dutch </p><p><br /></p><p>Bugfixing</p><p><br /></p><p>MOL-142:<br /></p><p>Due to different tax calculations between Mollie API and Shopware, there could be different calculated tax amounts in some edge cases. This leads to an error in Mollie Api when orders are submitted for payment. Customer weren't able to pay successfully.</p><p><br /></p><p>MOL-140:</p><p>If \"Use standard failed payment redirect.\" in mollie configuration has been activated, following error could occur. If payments on the Mollie pages were unsuccessful, a customer was sent to the \"order successful\" page instead of the error page. The problem has been solved</p>","creationDate":{"date":"2021-02-15 09:31:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.11","text":"<p><b>Fixes:</b></p><p><br /></p><p></p><ul><li>Fixes an issue where cancelled Klarna orders could not be retried when using the Mollie redirect page.</li><li>Fixes an issue where an incorrect router object was being used.</li></ul>","creationDate":{"date":"2021-01-25 10:49:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.10","text":"<p><b>Fixes:</b></p><p><br /></p><p></p><ul><li>Fixes an error thrown when cancelling an order through the administration in Shopware 6.2.x and older.</li><li>Fixes an issue where the incorrect API key was being used.</li></ul><p></p>","creationDate":{"date":"2021-01-14 10:58:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.9","text":"<p>Fixes:</p><p><br /></p><p></p><ul><li>Resolves an issue where orders would not be getting the configured state when authorizing payment with Klarna, after a previous payment attempt for this order had been cancelled, using the Mollie redirect feature.</li><li>Klarna orders that are cancelled through the Shopware administration will now also get cancelled in Mollie dashboard.</li><li>Fixes the \"Standard failed payment redirect\" from not using the correct Shopware routing.</li><li>New installations will now load svg payment icons. Existing installations will keep using the png variants, until they are deleted from the media library and the plugin is reactived.</li></ul>","creationDate":{"date":"2020-12-28 16:53:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.8","text":"<p><b>Fixes:</b></p>Fixed encoded urls no longer being accepted by the API.Updated API client to 2.27.1","creationDate":{"date":"2020-12-16 19:05:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.7","text":"<p><b>Features:</b></p><p></p><ul><li>Added an option to disable Apple Pay Direct when Apple Pay is available as payment method</li></ul><p></p><p><br /></p><p><b>Bugfix:</b></p><p></p><ul><li>Improved compatibility with Shopware's Paypal integration</li><li>Fixed an issue where the wrong payment method was shown in the administration, when a different one was selected in Mollie</li><li>Fixed several minor bugs</li></ul><p></p>","creationDate":{"date":"2020-12-07 15:56:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.6","text":"<p></p><ul><li>Fixed multiple issues with completing Apple Pay Direct orders</li><li>Fixed an incompatibility issue with Custom Products</li><li>Fix for issue with VAT-related price rounding</li><li>Fix for an illegal return type</li></ul>","creationDate":{"date":"2020-11-13 16:25:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<ul><li>Mollie locale fix for creditcards components. </li><li>Order state automation on failed payments fix.  </li><li>General error handling for issue creating documents in the backend. </li></ul>","creationDate":{"date":"2020-10-30 11:11:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<ul><li>Bugfix with order states not working on failed payments.</li></ul>","creationDate":{"date":"2020-10-26 13:58:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>Bugfix</li></ul><p>Small error fixed with customer registration and headless storefronts. </p>","creationDate":{"date":"2020-10-21 14:13:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>Features:</p><ul><li>Added order state automation for Authorized orders. (Klarna)</li><li>Added the option to toggle single click payments on and off.</li></ul><p>Bugfixes:</p><ul><li>Fixed redirection error on certain sales channels after failed payments.</li><li>Fixed VAT calculation errors on certain customer groups.</li></ul>","creationDate":{"date":"2020-10-19 09:20:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.3","text":"<ul><li>Added \"Authorized\" status in order overview for Klarna.</li><li>Added Single Click Payments for second time credit card payment users.</li></ul>","creationDate":{"date":"2020-10-09 10:55:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.2","text":"<ul><li>Fixed a bug with not updating the transaction status from Klarna orders to paid.</li></ul>","creationDate":{"date":"2020-09-28 09:51:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.01","text":"<ul><li>Apple Pay Direct wurde auf der Produkt- und Listenseite hinzugefügt.<br /></li></ul>","creationDate":{"date":"2020-09-07 16:29:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.1","text":"<ul><li>Added Toggle option to choose standard Shopware or Mollie failed payment redirects.</li></ul>","creationDate":{"date":"2020-09-17 11:30:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.19","text":"<p><b>Features:</b></p><p></p><ul><li>Added the Mollie Order ID to the order detail in the administration</li><li>Added the preferred iDeal issuer to the customer detail in the administration</li><li>Added order state automation</li></ul><p></p><p><br /></p><p><b>Bugfixes:</b></p><p></p><ul><li>Fixed a bug with product URLs in the request to Mollie</li><li>Fixed issues with the payment state staying in progress after failed payments</li></ul><p></p>","creationDate":{"date":"2020-08-04 11:47:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.18","text":"<p><b>Bugfix:</b></p><p></p><ul><li>Fixed an issue where custom products would cause an error.</li></ul><p></p>","creationDate":{"date":"2020-07-29 15:08:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.17","text":"<p><b>Features:</b></p><p></p><ul><li>An event is triggered when the payment failed or passed, other plugins can act on this event</li><li>SKU number of line items is available in the Mollie Dashboard</li></ul><p></p><p><br /></p><p><b>Bugfixes:</b></p><p></p><ul><li>Multiple VAT rates in the basket no longer cause an exception</li><li>API test-button only appears within Mollie's configuration</li></ul>","creationDate":{"date":"2020-07-23 09:10:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.16","text":"<p><b>Features:</b></p><p></p><ul><li>Test-button in the plugin configuration to validate the API keys.</li></ul><p><br /></p><p><b>Bugfixes:</b></p><p></p><ul><li>Mollie Components is now a javascript plugin and works in live mode.</li></ul><p></p><p></p>","creationDate":{"date":"2020-07-08 10:30:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.15","text":"<p><b>Bugfixes:</b></p><p></p><ul><li>Fixed an issue where changing the delivery status would cause an exception.</li><li>Fixed an issue where Apple Pay would show up on not-supported devices.</li></ul><p></p>","creationDate":{"date":"2020-06-25 08:03:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.14","text":"<p><b>Bugfixes:</b></p><p></p><ul><li>Fixed an issue where the vat amount on orders for net free customers was off.</li><li>Fixed an issue where Mollie Components wasn't compatible with Shopware 6.1.5.</li></ul><p></p><p><br /></p><p><b>Features:</b></p><p></p><ul><li>The debug mode now indicates whether a payment is in live or test mode.</li></ul><p></p>","creationDate":{"date":"2020-06-15 11:24:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.13","text":"<p><b>Hotfix:</b></p><p></p><ul><li>Reversed a fix for customers with display of net prices, as it had the unwanted side effect of customers paying the net price.</li></ul><p></p>","creationDate":{"date":"2020-05-28 13:15:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.12","text":"<p><b>Features:</b></p><p></p><ul><li>iDeal issuer selection in the checkout</li><li>German translations for Mollie Components</li><li>Mollie Components now works as a Storefront plugin.</li></ul><p></p><p><br /></p><p><b>Bugfixes:</b></p><p></p><ul><li>API exception with vat free or net orders</li><li>Possible exceptions during checkout or payment retry</li><li>Possible exceptions when transitioning payment states</li></ul><p></p>","creationDate":{"date":"2020-05-28 11:52:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p><b>Features:</b></p><p></p><ul><li>The Mollie PHP SDK is updated</li><li>Payment methods are now installed with icons</li><li>Orders can be partially shipped and/or refunded</li><li>Order payment state will always first be set to in progress when payment at Mollie starts</li><li>Failed payments can now be retried</li></ul><p></p><p><br /></p><p><b>Bugfixes:</b></p><p></p><ul><li>Fixed an issue where changing the delivery status of an order would cause an exception</li><li>Fixed an issue where order lifetime had the wrong timezone</li><li>Fixed an issue where tax was calculated on orders from tax free countries</li><li>Fixed an issue where credit card components wasn't available on translated payment methods</li><li>Fixed an issue where credit card components couldn't be loaded in a shop with in a subdirectory</li><li>Fixed an issue where the webhook URL wasn't sent to Mollie</li></ul><p></p>","creationDate":{"date":"2020-05-20 17:11:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<ul><li>Created a bugfix for backwards compatibility of payment states<br /></li></ul>","creationDate":{"date":"2020-05-05 11:31:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p></p><ul><li>Fixed payment state transitions in the latest version of Shopware 6 (backwards compatible)</li><li>Added a debug mode, to gather extra information in the Shopware 6 log in the administration</li></ul>","creationDate":{"date":"2020-05-04 15:50:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p></p><ul><li>Webhook URLs are correctly set in production environments</li><li>Configuration has All Sales Channels as fallback data</li><li>Vat amount can be 0.0 (e.g. when an order is tax free)</li></ul>","creationDate":{"date":"2020-05-04 15:50:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- Fixed issues with multi channel API keys</p>","creationDate":{"date":"2020-04-06 21:32:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- Added Mollie Components</p><p>- Fixed an issue where API keys couldn't be different for each sales channel</p>","creationDate":{"date":"2020-03-30 15:25:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- Created fix voor version 6.1+ of Shopware</p>","creationDate":{"date":"2020-01-13 15:48:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- Fixed activation of the plugin</p><p>- Payment methods are now activated in your Mollie dashboard also when they're being activated in the shop</p>","creationDate":{"date":"2019-11-06 11:23:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Fixed an issue where the monolog logger service wasn't available during the activate lifecycle.</p>","creationDate":{"date":"2019-10-14 09:52:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>1.0.0 MVP with basic payments integration</p>","creationDate":{"date":"2019-10-08 19:54:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Molli20782621168","redirectToStore":false,"lowestPriceValue":0}