{"id":9111,"name":"SwpRefundSystemSix","code":"Swp4434165949053","lastChange":{"date":"2023-07-19 13:54:26.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMOsebo","examplePageUrl":"","moduleKey":"SwpRefundSystemSix","creationDate":{"date":"2019-06-05 11:24:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-12-23 11:23:43.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-01-12 11:23:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":39,"prefix":"Swp","name":"BuI Hinsche GmbH","website":"//www.bui-hinsche.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod39_bui-fb-logo_128.png"},"infos":[{"id":14062,"name":"Artikelpfand","description":"<h2>**** Was bietet das Plugin ****</h2>Mehrweg, Einweg, Pfandfrei - wer kennt dies nicht aus den stationären Läden. Inzwischen werden nicht mehr nur Schuhe oder Hosen im Internet gekauft - auch Lebensmittel und damit beispielhaft Getränke. Sobald man genau diese online anbieten möchte, muss man auf die Pfandart hinweisen. Dies ist mit Hilfe unseren Plugins schnell und einfach möglich. <br> Im Plugin sind die Vorschriften des Gesetzgebers mit den uns technisch zur Verfügung stehenden Mittel berücksichtigt. Das heißt konkret, dass bei Bruttokunden der Pfandpreis inkl. der gesetzlichen Umsatzsteuer berechnet wird und bei Nettokunden die Berechnung exklusive der Umsatzsteuer erfolgt. Dies hat leider den Nachteil, dass dieses Plugin grundlegend nur für den deutschen Markt angepasst ist. Für alle anderen Länder müssten Individuallösungen geschaffen werden.&nbsp;<p>Mit dem Shopware 6 Plugin werden die Pfandarten \"Einweg\", \"Mehrweg\" und \"pfandfrei\" mit der Installation des Plugin zur Verfügung gestellt. Diese drei Pfandarten können durch eigene Pfandarten ergänzt werden. Damit ist das Plugin noch flexibler.<br></p><p>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist.&nbsp;</p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen.&nbsp;</p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität&nbsp;kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden.&nbsp;</p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung.&nbsp;</p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können.&nbsp;</p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden.&nbsp;</p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br>E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1mmzZOThyrzXeFfxIReF7YlwCuxY6TB1ZBrpsaiQjUMw/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopware-Account zur Verfügung.\n<br />","shortDescription":"Mit unserem Plugin können diese Pfandarten einfach und schnell einem Artikel zugewiesen werden. Damit ist es eine unverzichtbare Ergänzung für alle Artikel mit Pfandangabepflicht.","highlights":"klare Darstellung der Pfandart\neigene Pfandart möglich","features":"pro Vertriebskanal\nPfandrückgabe möglich"},{"id":14535,"name":"article refund","description":"<h2>****** What does the plugin ****</h2><p>Reusable, disposable, deposit-free - who doesn't know this from the stationary shops. In the meantime, not only shoes or trousers are bought on the Internet - also food and thus exemplary drinks. As soon as you want to offer exactly these online, you have to indicate the type of deposit. This can be done quickly and easily with the help of our plugins. </p><p> The plugin takes into account the regulations of the legislator with the technical means available to us. This means in concrete terms that for gross customers the deposit price is calculated including the statutory VAT and for net customers the calculation is exclusive of VAT. Unfortunately this has the disadvantage that this plugin is basically only adapted for the German market. For all other countries individual solutions would have to be created. </p><p>With the Shopware 6 plugin, the deposit types \"disposable\", \"reusable\" and \"deposit-free\" are made available with the installation of the plugin. These three deposit types can be supplemented with your own deposit types. This makes the plugin even more flexible.</p><p>If you are missing any function in the plugin or have suggestions for improvement for us, then I simply report at info@bui-hinsche.com We will check your suggestion and decide if we can implement it technically. So please don't be angry with us if it's not immediately included in the next update. </p><h3>** FAQ **</h3><h4>**** Basic ****</h4><p>Our plugin are all designed to the standard functionalities of the basic system Shopware 6 (Community Edition). This concerns both the functionalities and the design. So if it does not fit once, may have to make adjustments to your own theme. Please understand that it is impossible for us to consider every single theme.&nbsp;</p><p>All plugin have been newly developed for Shopware 6. Therefore, it may be possible that functionalities that existed in Shopware 5 are no longer there. We have deliberately used this change to streamline and optimize the plugins.</p><h4>**** compatibility ****</h4><p>Basically, our plugins are compatible with each other. If there should be restrictions or malfunctions, we will gladly check them in a timely manner. In individual cases, it may happen that functionalities of individual plugins from our house are excluded. In this case, we will point this out to you. However, this compatibility&nbsp;can only be guaranteed for our plugin. The market of third party providers and their plugins makes it impossible to take into account all functionalities and modes of operation. This also applies to plugins from Shopware that are not included in the Community Edition.</p><p>In a few cases, multiple manipulation of the same template blocks in the theme can lead to display deficits.&nbsp;Unfortunately, we have no influence on this due to the original shop software. Due to this circumstance, only an individual solution can be provided in such cases.&nbsp;</p><h4>**** Support ****</h4><p>Basically, we first look to see if it is an error from the plugin or the cause is otherwise. Depending on the result, we will inform you whether there will be any costs or not. However, if you have made changes to the plugin yourself, any claim to free support is forfeited. In this case, we charge the full cost.&nbsp;</p><h4>**** Are there trial versions for our plugin ****</h4><p>All our plugin you can test with the free trial month to look at the functionalities in peace and try. In this trial month all functions are available to you, there are no limitations. We ask you to make use of this trial month to decide for sure if it is exactly the plugin you need or if it offers the functionalities you expected before buying or renting.</p><h4>**** Can I have the plugin customized? ****</h4><p>YES, if you are missing a functionality or you need a customization for your specific needs, we will be happy to find a solution together with you. The easiest way to do this is to send us an email with your ideas. Don't forget to give us your contact details, so we can get in touch with you.&nbsp;</p><h3>** What we do **</h3><h4>**** consulting ****</h4><p>The digital world is changing hourly and getting more and more complex. Therefore, we have made it our mission to stay on the ball for you and to constantly expand and develop our knowledge and relieve you of this tedious work. We can advise you, for example, on questions such as:</p><ul><li>How do I optimize my store system?</li><li>Which merchandise management fits me?</li><li>Can I optimize processes in relation to the store?</li><li>Can I optimize processes in the company with the store?</li></ul><h4>**** development ****</h4><p>Our developers are always and constantly to develop new products, expand, develop or optimize. But we also look beyond the horizon and develop together with you suitable websites or interfaces to software connections. Completely individual solutions are also no problem. We just have to talk about it.</p><h4>**** Design ****</h4><p>You want a new design? We help you with the implementation.</p><h4>**** support ****</h4><p>Like a car or bike, your store also needs regular maintenance. We also have suitable solutions for this. Many of our customers already use this and let store and plugin updates through us. Just ask for our maintenance contract.</p><h3>** Who are we? **</h3><p>BuI-Hinsche GmbH has been in the e-commerce sector since 2006 and therefore has 15 years of experience to fall back on. Our employees are 100% behind the company and give their best every day. Creative, solution-oriented and customer-oriented - these are always statements that are made about us.&nbsp;</p><p></p><h3>** Contact **</h3><p>phone: +49 3441 9799060<br>email: info@bui-hinsche.com or support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1GmIzwpqb9FLZFYtqOk5Ex_LUqSlyziy0jfUPGRxxHig/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Documentation / Installation / Configuration</a><br /><p>If you have any questions or are unsure about something, please contact us at support@bui-hinsche.com We will help you quickly and easily. Alternatively you can contact us directly via your shopware account.</p>","shortDescription":"With our plugin, these deposit types can be assigned to an article easily and quickly. This makes it an indispensable supplement for all articles with deposit obligation.","highlights":"clear presentation of the type of deposit\nown deposit type possible","features":"per sales channel"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161659,"bookingKey":"Swp4434165949053","bookingText":"article refund","price":95,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":161658,"bookingKey":"Swp4434165949053_M","bookingText":"article refund","price":9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYSYyWL","preview":true,"priority":0,"id":97221},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFiR2zn","preview":false,"priority":99,"id":55841},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiXuqOY","preview":false,"priority":0,"id":50959},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCkKZkx","preview":false,"priority":0,"id":50978},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgwcBqx","preview":false,"priority":0,"id":50979},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxJWFlx","preview":false,"priority":0,"id":50980},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCgTKqx","preview":false,"priority":0,"id":50981},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYIPHhx","preview":false,"priority":0,"id":50982},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppypHSy","preview":false,"priority":0,"id":50983},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpg7d9My","preview":false,"priority":0,"id":50985},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpm81DNy","preview":false,"priority":0,"id":50986},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMPC45T","preview":false,"priority":0,"id":50987},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6SpFaz","preview":false,"priority":0,"id":50988},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGVU92C","preview":false,"priority":0,"id":55842},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIl4WIH","preview":false,"priority":0,"id":55843},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOp18oP","preview":false,"priority":0,"id":55844},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxWrs9H","preview":false,"priority":0,"id":55845},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxAtZ8H","preview":false,"priority":0,"id":55846},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpguVG1h","preview":false,"priority":0,"id":55847},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpB1OQfI","preview":false,"priority":0,"id":55848},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptqt0TT","preview":false,"priority":0,"id":55849},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpP0NMdU","preview":false,"priority":0,"id":55850}],"comments":[],"ratingAverage":0,"label":"Artikelpfand","description":"<h2>**** Was bietet das Plugin ****</h2>Mehrweg, Einweg, Pfandfrei - wer kennt dies nicht aus den stationären Läden. Inzwischen werden nicht mehr nur Schuhe oder Hosen im Internet gekauft - auch Lebensmittel und damit beispielhaft Getränke. Sobald man genau diese online anbieten möchte, muss man auf die Pfandart hinweisen. Dies ist mit Hilfe unseren Plugins schnell und einfach möglich. <br /> Im Plugin sind die Vorschriften des Gesetzgebers mit den uns technisch zur Verfügung stehenden Mittel berücksichtigt. Das heißt konkret, dass bei Bruttokunden der Pfandpreis inkl. der gesetzlichen Umsatzsteuer berechnet wird und bei Nettokunden die Berechnung exklusive der Umsatzsteuer erfolgt. Dies hat leider den Nachteil, dass dieses Plugin grundlegend nur für den deutschen Markt angepasst ist. Für alle anderen Länder müssten Individuallösungen geschaffen werden. <p>Mit dem Shopware 6 Plugin werden die Pfandarten \"Einweg\", \"Mehrweg\" und \"pfandfrei\" mit der Installation des Plugin zur Verfügung gestellt. Diese drei Pfandarten können durch eigene Pfandarten ergänzt werden. Damit ist das Plugin noch flexibler.<br /></p><p>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist. </p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen. </p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br /></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden. </p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung. </p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können. </p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden. </p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br />E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1mmzZOThyrzXeFfxIReF7YlwCuxY6TB1ZBrpsaiQjUMw/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopware-Account zur Verfügung.\n<br />","version":"6.05.01","changelog":[{"version":"6.05.01","text":"<p>various small bug fixes </p>","creationDate":{"date":"2023-06-15 16:52:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.05.00","text":"<p>adjustment to Shopware-Version 6.5.0.0</p>","creationDate":{"date":"2023-05-03 13:22:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.08","text":"public function reset(): void in ProductPriceCalculatorDecorator","creationDate":{"date":"2023-02-21 10:02:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.07","text":"feature: productNumber RefundArticle per LineItem provided to enable allocation for WaWi (no guarantee)","creationDate":{"date":"2023-01-02 14:18:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.06","text":"<ul><li>feature: refund price becomes item price on return </li><li>bugfix: button for prozessing available again</li></ul>","creationDate":{"date":"2022-10-25 08:45:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.05","text":"<p>Improvement:</p><p>Processing adapted for complete category processing</p>","creationDate":{"date":"2022-02-16 15:33:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.04","text":"<p>adjustment to php 8.0</p>","creationDate":{"date":"2022-02-01 14:39:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.03","text":"<p>Bugfix: Cart-processor unter PHP 8</p>","creationDate":{"date":"2021-12-21 14:09:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.02","text":"<p>feature: ´refund can be assigned to a complete category</p>","creationDate":{"date":"2021-11-23 10:45:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.01","text":"<p>fixed error when uninstalling via CLI</p>","creationDate":{"date":"2021-07-07 13:16:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.00","text":"<p></p><ul><li>adjustment to Shopware 6.4.0.0</li><li>refund is possible</li></ul>","creationDate":{"date":"2021-04-26 14:44:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.01","text":"<p>The store operator has the option of deciding whether to display the deposit per item or as a total amount. In the case of individual listing, it is not possible to display the article image in the shopping cart. If the deposit is spent as a total amount, the article image will be displayed in the shopping cart.</p>","creationDate":{"date":"2021-01-26 16:39:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.00","text":"<p>first release for Shopware 6</p>","creationDate":{"date":"2020-10-26 14:15:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Swp4434165949053","redirectToStore":false,"lowestPriceValue":9}