{"id":9145,"name":"SwpQuickBuySix","code":"Swp1524957883482","lastChange":{"date":"2023-07-19 13:53:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqiGtVd","examplePageUrl":"","moduleKey":"SwpQuickBuySix","creationDate":{"date":"2019-06-07 11:23:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-04-16 13:51:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-04-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-01-12 11:30:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":39,"prefix":"Swp","name":"BuI Hinsche GmbH","website":"//www.bui-hinsche.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod39_bui-fb-logo_128.png"},"infos":[{"id":14112,"name":"Schnellkauf","description":"<h2>**** Was bietet das Plugin ****</h2>Schnell, schneller, am schnellsten - so sieht unser Leben im Onlineshopping aus. Die, die online kaufen, möchten schnell und effektiv einkaufen. Genau diesen Wunsch kannst du deinen Kunden mit unserem Plugin erfüllen. Durch eine spezielle Ansicht der Bestellliste muss der Kunden nur noch den Artikelnamen oder die Artikelnummer bzw. Herstellernummer für die gewünschten Produkte erfassen und kann diese dann als Gesamtheit mit einem Klick auf \"In den Warenkorb\" kaufen. Schneller geht es nicht. Gerade Kunden die immer wieder die gleichen Produkte kaufen und genau wissen was sie wollen, werden diese Funktion lieben. Das Plugin überzeugt durch sein schlichtes einfaches Design, welches die Funktionalität unterstreicht.&nbsp;<br><br><p><b>Hinweis:</b>&nbsp;Es ist nicht möglich, Artikel mit Optionen per Schnellkauf zu bestellen. Daher beachte dies bitte, wenn du beide Plugin einsetzen solltest. Artikel mit Optionen werden als ganz normale Artikel in den Warenkorb gelegt. Wenn man das Plugin \"Kundengruppenabhängige Verpackungseinheiten\" mit dem \"Artikelschnellkauf\" zusammen verwendet, wird im Artikelschnellkauf immer die ungestaffelte Menge angezeigt. Erst wenn man die Artikel in den Warenkorb legt werden die Staffelungsschritte beachtet.<br></p><p>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist.&nbsp;<br></p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen.&nbsp;</p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität&nbsp;kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden.&nbsp;</p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung.&nbsp;</p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können.&nbsp;</p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden.&nbsp;</p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br>E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1Rwek7DbWDYAouGjTXR7pYvZqAQHH2b7EX-BKMhUKCPE/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />Solltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.<br />","shortDescription":"Schnell - einfach - effektiv - so wollen Kunden einkaufen. Genau diese Funktionalität bietet unser Plugin. Kunden können über eine spezielle Ansicht alle gewünschten Produkte kaufen.","highlights":"schnell\neinfach\neffektiv","features":"pro Vertriebskanal\npro Kundengruppe\nBlöcke für Einkaufswelten für mehr Flexibilität"},{"id":14515,"name":"Quickbuy","description":"<h2>****** What does the plugin ****</h2><br>Fast, faster, fastest - that's our life in online shopping. Those who buy online want to shop quickly and effectively. Exactly this wish you can fulfill your customers with our plugin. Through a special view of the order list, the customer only needs to enter the article name or the article number or manufacturer number for the desired products and can then buy them as a whole with a click on \"Add to shopping cart\". It couldn't be faster. Especially customers who always buy the same products and know exactly what they want will love this function. The plugin convinces by its simple simple design, which underlines the functionality.&nbsp;<p>Note: It is not possible to order items with options via quick purchase. Therefore, please note this if you use both plugins. Items with options are placed in the shopping basket as normal items. If you use the plugin \"Customer group-dependent packaging units\" together with the \"Quick buy item\", the quick buy item will always show the non-graded quantity. The scaling steps are only taken into account when the items are placed in the shopping basket.</p><p><p>If you are missing any function in the plugin or have suggestions for improvement for us, then I simply report at info@bui-hinsche.com We will check your suggestion and decide if we can implement it technically. So please don't be angry with us if it's not immediately included in the next update.&nbsp;</p><h3>** FAQ **</h3><h4>**** Basic ****</h4><p>Our plugin are all designed to the standard functionalities of the basic system Shopware 6 (Community Edition). This concerns both the functionalities and the design. So if it does not fit once, may have to make adjustments to your own theme. Please understand that it is impossible for us to consider every single theme.&nbsp;</p><p>All plugin have been newly developed for Shopware 6. Therefore, it may be possible that functionalities that existed in Shopware 5 are no longer there. We have deliberately used this change to streamline and optimize the plugins.</p><h4>**** compatibility ****</h4><p>Basically, our plugins are compatible with each other. If there should be restrictions or malfunctions, we will gladly check them in a timely manner. In individual cases, it may happen that functionalities of individual plugins from our house are excluded. In this case, we will point this out to you. However, this compatibility&nbsp;can only be guaranteed for our plugin. The market of third party providers and their plugins makes it impossible to take into account all functionalities and modes of operation. This also applies to plugins from Shopware that are not included in the Community Edition.</p><p>In a few cases, multiple manipulation of the same template blocks in the theme can lead to display deficits.&nbsp;Unfortunately, we have no influence on this due to the original shop software. Due to this circumstance, only an individual solution can be provided in such cases.&nbsp;</p><h4>**** Support ****</h4><p>Basically, we first look to see if it is an error from the plugin or the cause is otherwise. Depending on the result, we will inform you whether there will be any costs or not. However, if you have made changes to the plugin yourself, any claim to free support is forfeited. In this case, we charge the full cost.&nbsp;</p><h4>**** Are there trial versions for our plugin ****</h4><p>All our plugin you can test with the free trial month to look at the functionalities in peace and try. In this trial month all functions are available to you, there are no limitations. We ask you to make use of this trial month to decide for sure if it is exactly the plugin you need or if it offers the functionalities you expected before buying or renting.</p><h4>**** Can I have the plugin customized? ****</h4><p>YES, if you are missing a functionality or you need a customization for your specific needs, we will be happy to find a solution together with you. The easiest way to do this is to send us an email with your ideas. Don't forget to give us your contact details, so we can get in touch with you.&nbsp;</p><h3>** What we do **</h3><h4>**** consulting ****</h4><p>The digital world is changing hourly and getting more and more complex. Therefore, we have made it our mission to stay on the ball for you and to constantly expand and develop our knowledge and relieve you of this tedious work. We can advise you, for example, on questions such as:</p><ul><li>How do I optimize my store system?</li><li>Which merchandise management fits me?</li><li>Can I optimize processes in relation to the store?</li><li>Can I optimize processes in the company with the store?</li></ul><h4>**** development ****</h4><p>Our developers are always and constantly to develop new products, expand, develop or optimize. But we also look beyond the horizon and develop together with you suitable websites or interfaces to software connections. Completely individual solutions are also no problem. We just have to talk about it.</p><h4>**** Design ****</h4><p>You want a new design? We help you with the implementation.</p><h4>**** support ****</h4><p>Like a car or bike, your store also needs regular maintenance. We also have suitable solutions for this. Many of our customers already use this and let store and plugin updates through us. Just ask for our maintenance contract.</p><h3>** Who are we? **</h3><p>BuI-Hinsche GmbH has been in the e-commerce sector since 2006 and therefore has 15 years of experience to fall back on. Our employees are 100% behind the company and give their best every day. Creative, solution-oriented and customer-oriented - these are always statements that are made about us.&nbsp;</p><p></p><h3>** Contact **</h3><p>phone: +49 3441 9799060<br>email: info@bui-hinsche.com or support@bui-hinsche.com</p><p></p></p>","installationManual":"<a href=\"https://drive.google.com/open?id=12zpp5Huy2FXePu5K0JXdZloGCwiN1K3GYxIMN-2uJoI\" target=\"_blank\" rel=\"noreferrer noopener\">Documentation / Installation / Configuration</a><br /><p>If you have any questions or are unsure about something, please contact us at support@bui-hinsche.com We will help you quickly and easily. Alternatively you can contact us directly via your shopware account.</p>","shortDescription":"Fast - simple - effective - this is how customers want to shop. Our plugin offers exactly this functionality. Customers can buy all desired products via a special view.","highlights":"quick\nsimple\neffective","features":"per sales channel\nper customer group"}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":156707,"bookingKey":"Swp1524957883482","bookingText":"Quickbuy","price":95,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":156706,"bookingKey":"Swp1524957883482_M","bookingText":"Quickbuy","price":9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjmd20p","preview":true,"priority":0,"id":49304},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgY8Hb0","preview":false,"priority":10,"id":41710},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzuA41x","preview":false,"priority":7,"id":41713},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzFtQCx","preview":false,"priority":6,"id":41711},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php36ln7P","preview":false,"priority":0,"id":81980},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXEf5rr","preview":false,"priority":0,"id":81981},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmiFEw1","preview":false,"priority":0,"id":85341},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKxUebu","preview":false,"priority":0,"id":85346}],"comments":[],"ratingAverage":0,"label":"Schnellkauf","description":"<h2>**** Was bietet das Plugin ****</h2>Schnell, schneller, am schnellsten - so sieht unser Leben im Onlineshopping aus. Die, die online kaufen, möchten schnell und effektiv einkaufen. Genau diesen Wunsch kannst du deinen Kunden mit unserem Plugin erfüllen. Durch eine spezielle Ansicht der Bestellliste muss der Kunden nur noch den Artikelnamen oder die Artikelnummer bzw. Herstellernummer für die gewünschten Produkte erfassen und kann diese dann als Gesamtheit mit einem Klick auf \"In den Warenkorb\" kaufen. Schneller geht es nicht. Gerade Kunden die immer wieder die gleichen Produkte kaufen und genau wissen was sie wollen, werden diese Funktion lieben. Das Plugin überzeugt durch sein schlichtes einfaches Design, welches die Funktionalität unterstreicht. <br /><br /><p><b>Hinweis:</b> Es ist nicht möglich, Artikel mit Optionen per Schnellkauf zu bestellen. Daher beachte dies bitte, wenn du beide Plugin einsetzen solltest. Artikel mit Optionen werden als ganz normale Artikel in den Warenkorb gelegt. Wenn man das Plugin \"Kundengruppenabhängige Verpackungseinheiten\" mit dem \"Artikelschnellkauf\" zusammen verwendet, wird im Artikelschnellkauf immer die ungestaffelte Menge angezeigt. Erst wenn man die Artikel in den Warenkorb legt werden die Staffelungsschritte beachtet.<br /></p><p>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist. <br /></p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen. </p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br /></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden. </p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung. </p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können. </p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden. </p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br />E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1Rwek7DbWDYAouGjTXR7pYvZqAQHH2b7EX-BKMhUKCPE/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />Solltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.<br />","version":"6.05.00","changelog":[{"version":"6.05.00","text":"<p>adjustment to Shopware-version 6.5.0.0</p>","creationDate":{"date":"2023-05-03 13:43:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.05","text":"<p>design improvement mobile</p>","creationDate":{"date":"2022-09-08 10:36:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.04","text":"<p>Adaptation to customer group-dependent packaging units - these are already taken into account during the quick purchase and not only in the shopping cart.</p>","creationDate":{"date":"2022-08-25 16:27:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.03","text":"<p>adaptation to price on request</p>","creationDate":{"date":"2022-07-07 15:40:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.02","text":"<p>new possibilities for presentation and use as a shopping experience created</p>","creationDate":{"date":"2022-03-10 11:15:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.01","text":"<p>variant designation and article number are output with</p>","creationDate":{"date":"2022-02-03 15:19:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.00","text":"<p>adjustment to Shopware 6.4.0.0</p>","creationDate":{"date":"2021-06-02 14:12:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.02","text":"<p></p><ul><li>bugfix faulty display after search query</li><li>version release adapted</li></ul>","creationDate":{"date":"2020-08-19 10:29:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.01","text":"<p>release for versions from Shopware 6.2.x on stored</p>","creationDate":{"date":"2020-07-15 15:25:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.00","text":"<p>first release for shopware 6</p>","creationDate":{"date":"2020-04-02 14:26:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Swp1524957883482","redirectToStore":false,"lowestPriceValue":9}