{"id":9147,"name":"SwpSampleOrderSix","code":"Swp2747781275973","lastChange":{"date":"2023-07-19 13:52:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZ1diCH","examplePageUrl":"","moduleKey":"SwpSampleOrderSix","creationDate":{"date":"2019-06-07 12:36:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-08-24 10:17:42.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-08-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-08-12 09:43:51.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":39,"prefix":"Swp","name":"BuI Hinsche GmbH","website":"//www.bui-hinsche.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod39_bui-fb-logo_128.png"},"infos":[{"id":14115,"name":"Musterbestellung","description":"<h2>**** Was bietet das Plugin ****</h2>Es bietet die Möglichkeit für bestimmte Artikel Muster anzubieten. Generell kann das Plugin pro Verkaufskanal aktiviert werden. Um Musterartikel im Warenkorb bzw. bei der Bestellung bereits namentlich zu unterscheiden, gibt es die Möglichkeit an den Artikelnamen bzw. an die Artikelnummer einen Präfix oder Suffix zu ergänzen. Zudem kann eine Pauschale für Musterartikel festgelegt werden. Bei dieser kann unterschieden werden ob die Pauschale berechnet wird, wenn nur Muster im Warenkorb enthalten sind oder wenn mindestens ein Muster enthalten ist. Der Preis für diese Pauschale ist frei definierbar. Um dem Kunden bereits im Listing zu signalisieren, dass eine Musterbestellung möglich ist, kann der Badge aktiviert werden. Um Missbrauch von Musterbestellungen vorzubeugen, ist es möglich die Anzahl der Muster pro Bestellung zu begrenzen.<p>Aktuell ist es noch nicht mit unserem Preis auf Anfrage-Plugin kompatibel.&nbsp; Weiter ist zu beachten, dass wenn man Muster bei einem Produktoptionsartikel anbieten möchte, nur der unkonfigurierte Grundartikel verwendet wird.<br></p><p>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist.&nbsp;</p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen.&nbsp;</p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität&nbsp;kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden.&nbsp;</p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung.&nbsp;</p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können.&nbsp;</p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden.&nbsp;</p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br>E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1nvq27hOQ7SbSh_zQR6Xr0bpeqpmkyobW24AYhOSi5PI/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.<br />","shortDescription":"Mit unserem Plugin \"Musterbestellung\" ist es möglich pro Produkt Muster anzubieten. Sie selbst entscheiden wieviele Muster maximal pro Bestellung vom Kunden geordert werden dürfen.","highlights":"Begrenzung Musteranzahl\nMuster können mit einem Preis versehen werden\nVariantenabhängig\nMusterpauschale möglich","features":""},{"id":14549,"name":"sample order","description":"<h2>****** What does the plugin ****</h2><p>It offers the possibility to offer samples for certain articles. In general the plugin can be activated per sales channel. In order to differentiate sample articles in the shopping cart or when ordering, it is possible to add a prefix or suffix to the article name or article number. In addition, a flat rate can be defined for sample articles. With this you can differentiate whether the flat rate is calculated if only samples are contained in the shopping basket or if at least one sample is contained. The price for this flat rate can be freely defined. The badge can be activated to signal to the customer in the listing that a sample order is possible. To prevent misuse of sample orders, it is possible to limit the number of samples per order.</p><p>Currently it is not yet compatible with our price on request plugin. It should also be noted that if you want to offer samples with a product option item, only the unconfigured basic item is used.</p><p>If you are missing any function in the plugin or have suggestions for improvement for us, then I simply report at info@bui-hinsche.com We will check your suggestion and decide if we can implement it technically. So please don't be angry with us if it's not immediately included in the next update.&nbsp;</p><h3>** FAQ **</h3><h4>**** Basic ****</h4><p>Our plugin are all designed to the standard functionalities of the basic system Shopware 6 (Community Edition). This concerns both the functionalities and the design. So if it does not fit once, may have to make adjustments to your own theme. Please understand that it is impossible for us to consider every single theme.&nbsp;</p><p>All plugin have been newly developed for Shopware 6. Therefore, it may be possible that functionalities that existed in Shopware 5 are no longer there. We have deliberately used this change to streamline and optimize the plugins.</p><h4>**** compatibility ****</h4><p>Basically, our plugins are compatible with each other. If there should be restrictions or malfunctions, we will gladly check them in a timely manner. In individual cases, it may happen that functionalities of individual plugins from our house are excluded. In this case, we will point this out to you. However, this compatibility&nbsp;can only be guaranteed for our plugin. The market of third party providers and their plugins makes it impossible to take into account all functionalities and modes of operation. This also applies to plugins from Shopware that are not included in the Community Edition.</p><p>In a few cases, multiple manipulation of the same template blocks in the theme can lead to display deficits.&nbsp;Unfortunately, we have no influence on this due to the original shop software. Due to this circumstance, only an individual solution can be provided in such cases.&nbsp;</p><h4>**** Support ****</h4><p>Basically, we first look to see if it is an error from the plugin or the cause is otherwise. Depending on the result, we will inform you whether there will be any costs or not. However, if you have made changes to the plugin yourself, any claim to free support is forfeited. In this case, we charge the full cost.&nbsp;</p><h4>**** Are there trial versions for our plugin ****</h4><p>All our plugin you can test with the free trial month to look at the functionalities in peace and try. In this trial month all functions are available to you, there are no limitations. We ask you to make use of this trial month to decide for sure if it is exactly the plugin you need or if it offers the functionalities you expected before buying or renting.</p><h4>**** Can I have the plugin customized? ****</h4><p>YES, if you are missing a functionality or you need a customization for your specific needs, we will be happy to find a solution together with you. The easiest way to do this is to send us an email with your ideas. Don't forget to give us your contact details, so we can get in touch with you.&nbsp;</p><h3>** What we do **</h3><h4>**** consulting ****</h4><p>The digital world is changing hourly and getting more and more complex. Therefore, we have made it our mission to stay on the ball for you and to constantly expand and develop our knowledge and relieve you of this tedious work. We can advise you, for example, on questions such as:</p><ul><li>How do I optimize my store system?</li><li>Which merchandise management fits me?</li><li>Can I optimize processes in relation to the store?</li><li>Can I optimize processes in the company with the store?</li></ul><h4>**** development ****</h4><p>Our developers are always and constantly to develop new products, expand, develop or optimize. But we also look beyond the horizon and develop together with you suitable websites or interfaces to software connections. Completely individual solutions are also no problem. We just have to talk about it.</p><h4>**** Design ****</h4><p>You want a new design? We help you with the implementation.</p><h4>**** support ****</h4><p>Like a car or bike, your store also needs regular maintenance. We also have suitable solutions for this. Many of our customers already use this and let store and plugin updates through us. Just ask for our maintenance contract.</p><h3>** Who are we? **</h3><p>BuI-Hinsche GmbH has been in the e-commerce sector since 2006 and therefore has 15 years of experience to fall back on. Our employees are 100% behind the company and give their best every day. Creative, solution-oriented and customer-oriented - these are always statements that are made about us.&nbsp;</p><p></p><h3>** Contact **</h3><p>phone: +49 3441 9799060<br>email: info@bui-hinsche.com or support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1G6XlH-aZhdZO_q9jcIMwrcEnHk43D_HOVu2IiYVFj5o/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Documentation / Installation / Configuration</a><br /><p>If you have any questions or are unsure about something, please contact us at support@bui-hinsche.com We will help you quickly and easily. Alternatively you can contact us directly via your shopware account.</p>","shortDescription":"With our plugin \"sample order\" it is possible to offer samples per product. You yourself decide how many samples per order may be ordered by the customer.","highlights":"limit number of samples\nsamples can be provided with a price\ndepending on variant\nsample flat rate possible","features":""}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160826,"bookingKey":"Swp2747781275973","bookingText":"sample order","price":95,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160825,"bookingKey":"Swp2747781275973_M","bookingText":"sample order","price":9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQBFH4X","preview":true,"priority":0,"id":47810},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php47jHO4","preview":false,"priority":0,"id":47334},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpucz655","preview":false,"priority":0,"id":47335},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvWh0l7","preview":false,"priority":0,"id":47336},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php74Cru7","preview":false,"priority":0,"id":47337},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8XL2p8","preview":false,"priority":0,"id":47338},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQhUbY7","preview":false,"priority":0,"id":47339},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjkoVJx","preview":false,"priority":0,"id":47340},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPKSIw8","preview":false,"priority":0,"id":47341},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXxqLxz","preview":false,"priority":0,"id":47342},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpXFfFMA","preview":false,"priority":0,"id":47343},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLlffR9","preview":false,"priority":0,"id":47344},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeMrVjd","preview":false,"priority":0,"id":47345}],"comments":[{"authorName":"Selahattin Kamircan","text":"Die schnelle Reaktion von Frau Hinsche ist einfach der Wahnsinn!\nMir wurde sehr schnell geholfen auch wurden mir Probleme genannt die sich kreuzen! Dementsprechend konnte ich handeln und das ganze an Vordermann bringen!","headline":"Super PlugIn und Super Support!","creationDate":{"date":"2022-10-27 13:45:55.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Steve","text":"\"…Es tut mir leid, dass das Plugin nicht Ihren Vorstellungen entspricht. Dafür gibt es wie bereits geschrieben, die 30-Tage-Probemonat, die sogar bei Anfrage verlängert werden können. …\"\n\nDie Erweiterung ist sehr eigen und für uns ist es leider unbrauchbar. \n\nWir haben dies ohne einer Erweiterung viel besser lösen können. Einfach ein zweites Artikel mit gewünschtem TAG anlegen. Dann kann man auch individuell die Versandregeln erstellen.\n\nUnd ich muss sagen wir hatten sonnst keinen anderen Entwickler für Shopware-Erweiterungen kennen gelernt, welche so unflexibel mit deren Kunden umgehen.","headline":"Benutzt umbedingt den Probemonat …","creationDate":{"date":"2022-09-19 13:52:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":3},{"authorName":"Dennis","text":"","headline":"Gutes Plugin mit top Support!","creationDate":{"date":"2021-10-13 14:37:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sascha Weißhorn","text":"Leider funktioniert das Plugin nicht und wirft einen Fehler aus, sobald man einen Artikel in den Warenkorb legt. Nach einigem hin und her mit dem Pluginhersteller und der Aussage, dass sich die Entwicklung melden wird, kam leider keine Antwort mehr.","headline":"Plugin fehlerhaft","creationDate":{"date":"2021-05-26 08:45:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2}],"ratingAverage":6,"label":"Musterbestellung","description":"<h2>**** Was bietet das Plugin ****</h2>Es bietet die Möglichkeit für bestimmte Artikel Muster anzubieten. Generell kann das Plugin pro Verkaufskanal aktiviert werden. Um Musterartikel im Warenkorb bzw. bei der Bestellung bereits namentlich zu unterscheiden, gibt es die Möglichkeit an den Artikelnamen bzw. an die Artikelnummer einen Präfix oder Suffix zu ergänzen. Zudem kann eine Pauschale für Musterartikel festgelegt werden. Bei dieser kann unterschieden werden ob die Pauschale berechnet wird, wenn nur Muster im Warenkorb enthalten sind oder wenn mindestens ein Muster enthalten ist. Der Preis für diese Pauschale ist frei definierbar. Um dem Kunden bereits im Listing zu signalisieren, dass eine Musterbestellung möglich ist, kann der Badge aktiviert werden. Um Missbrauch von Musterbestellungen vorzubeugen, ist es möglich die Anzahl der Muster pro Bestellung zu begrenzen.<p>Aktuell ist es noch nicht mit unserem Preis auf Anfrage-Plugin kompatibel.  Weiter ist zu beachten, dass wenn man Muster bei einem Produktoptionsartikel anbieten möchte, nur der unkonfigurierte Grundartikel verwendet wird.<br /></p><p>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist. </p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 6 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen. </p><p>Alle Plugin wurden für Shopware 6 neu entwickelt. Daher kann es möglich sein, dass Funktionalitäten, die es in Shopware 5 gab, nicht mehr gibt. Wir haben diesen Umstieg bewusst genutzt, um die Plugins zu entschlacken und zu optimieren.</p><h4>**** Kompatibilität ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins von Shopware, die nicht in der Community-Edition enthalten sind.<br /></p><p>In wenigen Fällen kann es aufgrund von mehrfacher Manipulation gleicher Template-Blöcke im Theme zum Darstellungsdefiziten kommen. Auf diese haben wir leider aufgrund der ursprünglichen Shop-Software keinen Einfluss. Aufgrund dieses Umstandes kann in solchen Fällen nur eine indivduelle Lösung hinterlegt werden. </p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung. </p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können. </p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden. </p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br />E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/1nvq27hOQ7SbSh_zQR6Xr0bpeqpmkyobW24AYhOSi5PI/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.<br />","version":"6.05.03","changelog":[{"version":"6.05.03","text":"<p>all classes adapted and templates written</p>","creationDate":{"date":"2023-06-28 14:12:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.05.02","text":"<p>Speed optimised ....</p>","creationDate":{"date":"2023-06-13 11:48:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.05.01","text":"<p>bugfixes between rule</p>","creationDate":{"date":"2023-05-25 15:41:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.05.00","text":"<p>adjustment to Shopware-version 6.5.0.0</p>","creationDate":{"date":"2023-05-03 13:30:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.06","text":"<p>Extension of the Rule Builder with the query for sample flat rate</p>","creationDate":{"date":"2022-11-15 10:01:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.05","text":"<p>Ordering samples from listing solved optionally.</p>","creationDate":{"date":"2022-10-27 15:27:07.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.04","text":"<ul><li>purchase sample from listing </li><li>mirror category custom fields to articles</li></ul>","creationDate":{"date":"2022-10-25 09:31:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.03","text":"<p>minor improvements ...</p>","creationDate":{"date":"2022-09-08 11:45:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.02","text":"message queue error solved","creationDate":{"date":"2022-09-05 10:47:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.01","text":"<p></p><ul><li>samples can be sent free of charge</li><li>product layout considered</li></ul>","creationDate":{"date":"2022-02-04 11:42:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.00","text":"<p>adjustment to Shopware 6.4.2.0</p>","creationDate":{"date":"2021-06-24 10:01:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.03","text":"<p>Problem with quantity increase in shopping cart fixed</p>","creationDate":{"date":"2021-03-16 17:49:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.02","text":"<p>Performance improved with product count greater than 1000</p>","creationDate":{"date":"2021-02-17 20:04:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.01","text":"<p>The performance of the plugin was improved.</p>","creationDate":{"date":"2020-11-02 11:32:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.00.00","text":"<p>first release for shopware 6</p>","creationDate":{"date":"2020-08-12 09:48:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Swp2747781275973","redirectToStore":false,"lowestPriceValue":9}