{"id":9256,"name":"StuttRedirects","code":"stutt56214257426","lastChange":{"date":"2023-07-18 11:16:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppv0Bg9","examplePageUrl":"","moduleKey":"StuttRedirects","creationDate":{"date":"2019-06-20 23:16:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-10-30 12:12:56.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":true,"lastBusinessModelChangeDate":{"date":"2023-06-05 16:40:02.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":3955,"prefix":"Media711","name":"711media websolutions GmbH","website":"//711media.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod3955_711media-logo-128px.png"},"infos":[{"id":14294,"name":"SEO Weiterleitungen (301 und 302 Redirects) für Shopware 6","description":"<p>Im Laufe der Zeit, aber gerade auch bei einem Relaunch oder einer \ngrößeren Aktualisierung entstehen alte URLs, die in Ihrem Shop nicht \nmehr zutreffend oder verfügbar sind. Diese können Sie mit unserem Plugin\n nun bequem vom Backend aus auf die korrekten URLs Ihrer Produkte, \nKategorien, Blog-Inhalte, Einkaufswelten oder auf beliebige Unterseiten \nweiterleiten.\n</p><p>Eine Weiterleitung wirkt sich <strong>positiv für Ihre Kunden</strong> aus, da diese ihr Lieblingsprodukt unter der bekannten URL auffinden können. Aber auch gerade für das <strong>Ranking in Suchmaschinen</strong> wie Google ist es ein wichtiger Faktor, URLs mit guter Bewertung umzuleiten anstatt ins Leere laufen zu lassen.</p><p>Das Plugin verwendet dabei die für Google &amp; Co. richtige Weiterleitungsart per sogenannter <strong>301 Weiterleitung</strong> (301 Redirect), so dass Suchmaschinen auch weiterhin problemlos Ihre Inhalte auffinden können. <br /></p><p>Mit\n der intuitiven Oberfläche des Plugins im Backend (im Original Shopware \nLook&amp;Feel) verwalten Sie ganz simpel die Weiterleitungen und können \ndiese auch gezielt temporär deaktivieren und aktivieren, wenn dies \ngewünscht ist.</p><p><br />Das Plugin erlaubt nun außerdem, temporäre Weiterleitungen mit\n HTTP-Statuscode 302 einzurichten, falls Sie Seiten nur für eine gewisse\n Zeit umleiten möchten.</p><p><br /></p><p>Unser Plugin unterstützt den <b>Migrationsassistent</b> von Shopware 6. Installieren und aktivieren Sie unser Plugin und starten Sie danach die Migration der Produktdaten. So werden die Weiterleitungen automatisch mit übertragen. Eine Migration von Weiterleitungen ist sowohl über den lokalen Migrationsmodus als <b>auch über die API möglich</b> (bitte aktualisieren Sie für die Nutzung der API-Migration unser Shopware-5-Plugin SEO Weiterleitungen auf die aktuellste Version 1.9.0).</p>","installationManual":"<p>Installieren Sie das Plugin über den Plugin Manager in Ihrem Shopware\nBackend. Nachdem Sie das Plugin installiert und aktiviert haben, laden\nSie bitte das Backend neu, damit der Menüpunkt für die\nSEO-Weiterleitungen angezeigt wird.</p><p><br /></p><p>Die intuitive Oberfläche für\ndie Verwaltung Ihrer Weiterleitungen finden Sie dann unter dem Menüpunkt\n\"Einstellungen\" &gt; \"SEO Redirects (301/302/410)\".</p><p>Fügen neue Weiterleitungen über den Button oben rechts hinzu.</p><p>Bestehende Weiterleitungen bearbeiten Sie einfach <b>per Doppelklick auf einen Eintrag</b> in der Liste.<br /></p><p><br /></p><p>Tragen Sie in den\nWeiterleitungen folgendes ein:</p><ul><li><strong>alte URL: </strong>die URL, von der aus weitergeleitet werden soll, die der Benutzer also in seine Adresszeile seines Browsers eintippt</li><li><strong>Weiterleitungs-Ziel: </strong>die neue URL, unter der die gewünschten Inhalte in Ihrem Shop nun zu finden sind</li><li><strong>nur temporär (302): </strong>wenn\naktiviert, sendet das Plugin bei der Weiterleitung einen\nHTTP-Statuscode 302, so dass Browser jedes Mal erneut überprüfen, ob die\nWeiterleitung noch besteht</li><li><b>externe Weiterleitung: </b>Aktivieren SIe diese Option, wenn die URL auf eine Seite außerhalb Ihres Shops umgeleitet werden soll. Tragen Sie hierfür unter Weiterleitungs-Ziel (\"neue URL\") die gesamte URL einschließlich http(s):// und Domain ein, z.b. https://www.shopware.com/download</li><li><b>Inhalt entfernt (410):</b> Wenn Sie einen Artikel oder eine Kategorie aus dem Sortiment nehmen, kann es sich empfehlen, Suchmaschinen dies über den HTTP-Statuscode 410 (\"Inhalt entfernt\") mitzuteilen. Dies führt dazu, dass Suchmaschinen diese Suchtreffer dann auslisten. Aktivieren Sie hierzu das \"Häkchen bei Inhalt entfernt (410)\", tragen Sie als alte URL die auszulistende Adresse ein und als neue URL einen Inhalt der menschlichen Benutzern angezeigt werden soll, z.B. die URL der 404-Seite Ihres Shops<br /></li></ul><br /><b>Wichtige Hinweise zum Eintragen der URLs</b><br />1. Damit die Weiterleitungen\nkorrekt funktionieren, tragen Sie bitte in beiden Feldern die jeweilige\nURL ohne \"http://\" sowie ohne die Domain ein.<p>Beispielsweise tragen Sie\nfür https://www.meinedomain.de/alte-url/ folgendes ein:</p><p><strong>/alte-url/</strong></p><p><strong><br /></strong></p><p><strong>2. Wenn Ihr Shop in einem Unterverzeichnis auf dem Server liegt</strong></p><p>Liegt die Shopware-Installation nicht direkt im Hauptverzeichnis Ihrer Domain, sondern in einem Unterverzeichnis (bspw. auch als Staging- oder Test-System), leitet unser Plugin die URLs unterhalb dieses Pfades um. Die weiterzuleitenden URLs tragen Sie dann ebenso wie die (internen) Weiterleitungsziele erst ab dem führenden Querstrich nach dem (physischen) Unterordner ein.</p><p><strong>Beispiel:</strong> Ihr Shop liegt unter meinedomain.de/shopware6/public und Sie möchten die Kategorie Herren-Bekleidung (meinedomain.de/shopware6/public/Bekleidung/Herren) umleiten. Dann tragen Sie als \"alte URL\" bitte folgendes ein: /Bekleidung/Herren</p><p>Dies hat u.a. den Vorteil, dass Sie die eingetragenen Weiterleitungen nicht anpassen müssen, wenn Sie Ihren Shop umziehen. Wenn Sie diesen beispielsweise in einem Unterverzeichnis auf den Livegang vorbereiten oder Weiterleitungen in einem Staging-System vortesten, passen sich diese beim Umzug in das Hauptverzeichnis oder ein anderes Unterverzeichnis somit automatisch an.</p><p><strong><br /></strong></p><p><strong>3. Virtuelle Unterverzeichnisse / Sprach-Shops<br /></strong></p><p>Anders als bei physischen, also \"echten\", Unterverzeichnissen verhält es sich mit virtuellen Unterpfaden, die Sie etwa für Sprach-Shops oder Sub-Shops konfiguriert haben. Hier tragen Sie bitte den Teil der URL des Subshops mit in die Weiterleitungsziele und weiterzuleitenden (alten) URLs ein. Somit können Sie (ab Version 1.5.0 unseres Plugins) gezielt URLs nur für einzelne Sprach-Shops umleiten.</p><p><strong>Beispielsweise </strong>meinedomain.com/fr/URL-soll-in-DE-Shop-umgeleitet-werden:</p><p>alte URL: /fr/URL-soll-in-DE-Shop-umgeleitet-werden</p><p>neue URL: /de/<strong><strong><br /></strong></strong></p><p><strong><strong><br /></strong></strong></p><p><strong><strong>4. Sprach-Shops und physische Unterverzeichnisse</strong></strong></p><p>Entsprechend 2. und 3. gehen Sie wie folgt vor, wenn Ihre Shopware-Installation in einem Unterverzeichnis liegt und Sie virtuelle Sprach-Shop-URLs konfiguriert haben:</p><p>Weiterzuleitende URL (Beispiel): meinedomain.com/shopware6-test/public/en/Clothing/Men/</p><p>Als alte URL tragen Sie in diesem Fall ein: /en/Clothing/Men/<br /><strong><strong></strong></strong></p><p><strong><br /></strong></p><p><strong><br /></strong></p><p>Sobald\nSie die Weiterleitung speichern und sofern diese von Ihnen auf\n\"aktiviert\" gesetzt wurde, greift die Weiterleitung im Shop-Frontend.</p><p>Probieren Sie es einmal aus.</p><p><br /></p><p><br /></p><b>Weitere Hinweise zum Weiterleiten von URLs</b><br />Das\nPlugin kann nur URLs weiterleiten, die auf Ihre Shopware-Installation\nführen. Üblicherweise sind dies alle URLs innerhalb der Shop-Domain(s).\nIn einigen Fällen werden jedoch vom Webserver vorab bereits Umleitungen\nvorgenommen oder URL-Aufrufe nicht an Shopware weitergereicht, z.B. wenn\neine Dateiendung wie .php in der URL enthalten ist.<b><br /></b><br /><b>Troubleshooting / Fehlerbehebung</b><br />Falls eine\nWeiterleitung nicht funktioniert, stellen Sie bitte sicher, dass der\nAufruf in Shopware ankommt. Deaktivieren Sie die Weiterleitung zunächst\nwieder und rufen Sie die weiterzuleitende (\"alte\") URL im Browser auf.\nSie sollten die Seite Ihres Shops, bspw. mit einer 404-Meldung oder\neinem Shopinhalt sehen. Falls Sie eine Fehlermeldung sehen, die nicht\nvon Shopware stammt, liegt der Fehler in Ihrer Webserverkonfiguration.\nBitte überprüfen Sie dies entsprechend oder wenden Sie sich an Ihren\nSystemadministrator oder Webhoster.","shortDescription":"Leiten Sie Besucher und Suchmaschinen von alten URLs automatisch auf die neuen Inhalte um. Pflegen Sie jede Weiterleitung bequem im Backend oder migrieren Sie diese aus Shopware 5.","highlights":"einfache Pflege von Weiterleitungen\nunterstützt Shopware 6 Migrationsassistent\nMigration von Shopware 5 über API oder lokal möglich","features":""},{"id":15820,"name":"SEO Redirects (301 and 302 redirects) for Shopware 6","description":"<p>During time, especially after a relaunch or a larger update, some old\n URLs in your shop will no longer be applicable or available. Using our \nplug-in, you can now conveniently redirect those URLs to the right ones,\n the new URLs of your products, categories, blog content, shopping \nenvironments or any sub-pages. All this from within a convenient \ninterface within your Shopware backend.\n</p><p>A redirect will have a positive effect on your customers, as they\n can find their favorite products using the URLs the knew and \nbookmarked. Even your search engine ranks in Google and others will \nbenefit, as it is an important factor to redirect URLs with a good \nreputation rather than to run into dead ends.</p><p>The plugin uses the \ncorrect method to tell redirects to Google and other search engines \n(using HTTP 301 redirect headers). So search engines will be able to \naccess and index the contents of your shop again.</p><p>With our \nintuitive interface (in the original Shopware look &amp; feel), you can \neasily manage the forwarding and temporarily deactivate it and \ntemporarily activate it if desired.</p><p>The plugin now allows temporary forwarding with HTTP \nstatus code 302 as well, if you want to redirect pages only for a \ncertain time.</p><p><br /></p><p>Our plugin supports the Shopware 6 Migration Assistant. Please install and activate our plugin before migrating your product data from Shopware 5. Redirects will then be automatically included within the product data migration. Migration is support via local mode or via the Shopware API. If you intend to use API mode, please make sure to update to the newest version of our Shopware 5 plugin SEO Redirects (v1.9.0) first.<br /></p>","installationManual":"<p>Install the plugin via the Plugin Manager in your Shopware backend. After you have installed and activated the plugin, please reload the backend so that the menu item for SEO redirects is displayed.</p><br />The intuitive interface for managing your redirects can then be found under the menu item \"Settings\"&gt; \"SEO Redirects (301/302/410)\".<br />Add new redirects using the button at the top right.<br />You can edit existing forwardings simply by <b>double-clicking on an entry in the list</b>.<br /><br />Please enter your redirects as follows:<br /><ul><li><b>Old URL</b>: the URL from which the redirect should take place, i.e. the address which the user types in the address line of their browser</li><li><b>Redirect target</b>: the new URL under which the desired content can now be found in your shop</li><li><b>Only temporary (302)</b>: if activated, the plugin sends an HTTP status code 302 when redirecting, so that browsers check each time again whether the redirect is still active</li><li><b>External redirect</b>: Activate this option if the URL should be redirected to a page outside of your shop. To do this, enter the entire URL including http (s): // and domain under forwarding target (\"new URL\"), e.g. https://www.shopware.com/download</li><li><b>Content removed (410)</b>: If you remove an item or a category from the range, it may be advisable to inform search engines of this via the HTTP status code 410 (\"content removed\"). This leads to the fact that search engines list these search hits. To do this, activate the option \"removed from content (410)\", enter the address to be unlisted as the old URL and a URL to display content for human users as the redirect target (new URL), e.g. the URL of your shop's 404 page</li></ul><br /><br /><b>Important information on entering the URLs</b><br />1. In order for the redirects to work correctly, please enter the respective URL in both fields without \"http: //\" and without the domain.<br />For example, enter the following for https://www.mydomain.com/old-url/:<br />/old-url/<br /><br /><b>2. If your shop is in a subdirectory on the server</b><br />If your Shopware installation isn't located directly in the root directory of your domain, but in a subdirectory (e.g. also as a staging or test system), our plugin redirects the URLs below this path. You then only enter the URLs to be forwarded, as well as the (internal) forwarding destinations, starting with the leading slash after the (physical) subfolder.<br /><br /><p><b>Example:</b> Your shop is located at mydomain.com/shopware6/public and you want to redirect the men's clothing category (mydomain.com/shopware6/public/Clothing/Men). Then please enter the following as the \"old URL\": /Clothing/Men</p><p><br /></p>This also has the advantage that you don't have to adjust the forwarding entries once you move your shop. If, for example, you prepare this for going live in a subdirectory or pre-test forwarding in a staging system, these will automatically adapt when moving to the main directory or another subdirectory.<br /><br /><b>3. Virtual subdirectories / language shops</b><br />In contrast to physical, ie \"real\", subdirectories, it is  the opposite with virtual subpaths that you have configured for language shops or sub-shops, for example. Please enter the part of the URL of the subshop in the forwarding targets and the (old) URLs to be forwarded. This means that (from version 1.5.0 of our plugin) you can redirect specific URLs for individual language shops only.<br /><br />For example, mydomain.com/fr/URL-to-be-redirected-to-German-Shop will mean to enter the following as the<br />old URL: /fr/URL-to-be-redirected-to-German-shop<br />new url: /de/Landingpage-in-German-shop<br /><br /><br />4. Language shops combined with physical subdirectories<br />Proceed as follows according to 2. and 3. if your Shopware installation is in a subdirectory and you have configured virtual language shop URLs:<br />URL to be forwarded (example): mydomain.com/shopware6-test/public/en/Clothing/Men/<br />In this case, please enter the old URL: /en/Clothing/Men/<br /><br /><br />As soon as you save the redirect and if you have set it to \"active\", the redirect takes effect in the shop front end.<br />Give it a try.<br /><p><br /></p><p><br /></p><b>More information on forwarding URLs</b><br /><p>The plugin can only forward URLs that lead to your Shopware installation. Usually these are all URLs within the shop domain (s). In some cases, however, the web server redirects in advance or URL calls are not passed on to Shopware, e.g. if a file extension like .php is included in the URL.</p><p><br /><b>Troubleshooting</b></p><p>If redirecting an URL does not work, please make sure that the call \"arrives\" in Shopware. First, deactivate the redirect and open up the (\"old\") URL to be forwarded in your web browser. You should see a page of your shop, for example with a 404 message or shop content. If you see an error message that doesn't come from Shopware but from the webserver, the error is in your web server configuration. Please check this accordingly or contact your system administrator or webhosting provider in such a case.</p>","shortDescription":"Redirect visitors and search enginges from old URLs to the new contents in your shop automatically. Create and manage redirects in the Shopware backend or migrate them from Shopware 5.","highlights":"easy-to-use administration of redirects\nsupports Shopware 6 migration assistant\nmigrate from Shopware 5 via API or local","features":""}],"addons":["highlightInListing","ignorePrefixCheck"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157663,"bookingKey":"stutt56214257426","bookingText":"SEO Redirects (301 and 302 redirects) for Shopware 6","price":129,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":157662,"bookingKey":"stutt56214257426_M","bookingText":"SEO Redirects (301 and 302 redirects) for Shopware 6","price":12,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168836,"bookingKey":"stutt56214257426_M12","bookingText":"SEO Redirects (301 and 302 redirects) for Shopware 6","price":129,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpaJHCgB","preview":true,"priority":0,"id":36538},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpiqGEzy","preview":false,"priority":0,"id":36539}],"comments":[],"ratingAverage":0,"label":"SEO Weiterleitungen (301 und 302 Redirects) für Shopware 6","description":"<p>Im Laufe der Zeit, aber gerade auch bei einem Relaunch oder einer \ngrößeren Aktualisierung entstehen alte URLs, die in Ihrem Shop nicht \nmehr zutreffend oder verfügbar sind. Diese können Sie mit unserem Plugin\n nun bequem vom Backend aus auf die korrekten URLs Ihrer Produkte, \nKategorien, Blog-Inhalte, Einkaufswelten oder auf beliebige Unterseiten \nweiterleiten.\n</p><p>Eine Weiterleitung wirkt sich <strong>positiv für Ihre Kunden</strong> aus, da diese ihr Lieblingsprodukt unter der bekannten URL auffinden können. Aber auch gerade für das <strong>Ranking in Suchmaschinen</strong> wie Google ist es ein wichtiger Faktor, URLs mit guter Bewertung umzuleiten anstatt ins Leere laufen zu lassen.</p><p>Das Plugin verwendet dabei die für Google &amp; Co. richtige Weiterleitungsart per sogenannter <strong>301 Weiterleitung</strong> (301 Redirect), so dass Suchmaschinen auch weiterhin problemlos Ihre Inhalte auffinden können. <br /></p><p>Mit\n der intuitiven Oberfläche des Plugins im Backend (im Original Shopware \nLook&amp;Feel) verwalten Sie ganz simpel die Weiterleitungen und können \ndiese auch gezielt temporär deaktivieren und aktivieren, wenn dies \ngewünscht ist.</p><p><br />Das Plugin erlaubt nun außerdem, temporäre Weiterleitungen mit\n HTTP-Statuscode 302 einzurichten, falls Sie Seiten nur für eine gewisse\n Zeit umleiten möchten.</p><p><br /></p><p>Unser Plugin unterstützt den <b>Migrationsassistent</b> von Shopware 6. Installieren und aktivieren Sie unser Plugin und starten Sie danach die Migration der Produktdaten. So werden die Weiterleitungen automatisch mit übertragen. Eine Migration von Weiterleitungen ist sowohl über den lokalen Migrationsmodus als <b>auch über die API möglich</b> (bitte aktualisieren Sie für die Nutzung der API-Migration unser Shopware-5-Plugin SEO Weiterleitungen auf die aktuellste Version 1.9.0).</p>","installationManual":"<p>Installieren Sie das Plugin über den Plugin Manager in Ihrem Shopware\nBackend. Nachdem Sie das Plugin installiert und aktiviert haben, laden\nSie bitte das Backend neu, damit der Menüpunkt für die\nSEO-Weiterleitungen angezeigt wird.</p><p><br /></p><p>Die intuitive Oberfläche für\ndie Verwaltung Ihrer Weiterleitungen finden Sie dann unter dem Menüpunkt\n\"Einstellungen\" &gt; \"SEO Redirects (301/302/410)\".</p><p>Fügen neue Weiterleitungen über den Button oben rechts hinzu.</p><p>Bestehende Weiterleitungen bearbeiten Sie einfach <b>per Doppelklick auf einen Eintrag</b> in der Liste.<br /></p><p><br /></p><p>Tragen Sie in den\nWeiterleitungen folgendes ein:</p><ul><li><strong>alte URL: </strong>die URL, von der aus weitergeleitet werden soll, die der Benutzer also in seine Adresszeile seines Browsers eintippt</li><li><strong>Weiterleitungs-Ziel: </strong>die neue URL, unter der die gewünschten Inhalte in Ihrem Shop nun zu finden sind</li><li><strong>nur temporär (302): </strong>wenn\naktiviert, sendet das Plugin bei der Weiterleitung einen\nHTTP-Statuscode 302, so dass Browser jedes Mal erneut überprüfen, ob die\nWeiterleitung noch besteht</li><li><b>externe Weiterleitung: </b>Aktivieren SIe diese Option, wenn die URL auf eine Seite außerhalb Ihres Shops umgeleitet werden soll. Tragen Sie hierfür unter Weiterleitungs-Ziel (\"neue URL\") die gesamte URL einschließlich http(s):// und Domain ein, z.b. https://www.shopware.com/download</li><li><b>Inhalt entfernt (410):</b> Wenn Sie einen Artikel oder eine Kategorie aus dem Sortiment nehmen, kann es sich empfehlen, Suchmaschinen dies über den HTTP-Statuscode 410 (\"Inhalt entfernt\") mitzuteilen. Dies führt dazu, dass Suchmaschinen diese Suchtreffer dann auslisten. Aktivieren Sie hierzu das \"Häkchen bei Inhalt entfernt (410)\", tragen Sie als alte URL die auszulistende Adresse ein und als neue URL einen Inhalt der menschlichen Benutzern angezeigt werden soll, z.B. die URL der 404-Seite Ihres Shops<br /></li></ul><br /><b>Wichtige Hinweise zum Eintragen der URLs</b><br />1. Damit die Weiterleitungen\nkorrekt funktionieren, tragen Sie bitte in beiden Feldern die jeweilige\nURL ohne \"http://\" sowie ohne die Domain ein.<p>Beispielsweise tragen Sie\nfür https://www.meinedomain.de/alte-url/ folgendes ein:</p><p><strong>/alte-url/</strong></p><p><strong><br /></strong></p><p><strong>2. Wenn Ihr Shop in einem Unterverzeichnis auf dem Server liegt</strong></p><p>Liegt die Shopware-Installation nicht direkt im Hauptverzeichnis Ihrer Domain, sondern in einem Unterverzeichnis (bspw. auch als Staging- oder Test-System), leitet unser Plugin die URLs unterhalb dieses Pfades um. Die weiterzuleitenden URLs tragen Sie dann ebenso wie die (internen) Weiterleitungsziele erst ab dem führenden Querstrich nach dem (physischen) Unterordner ein.</p><p><strong>Beispiel:</strong> Ihr Shop liegt unter meinedomain.de/shopware6/public und Sie möchten die Kategorie Herren-Bekleidung (meinedomain.de/shopware6/public/Bekleidung/Herren) umleiten. Dann tragen Sie als \"alte URL\" bitte folgendes ein: /Bekleidung/Herren</p><p>Dies hat u.a. den Vorteil, dass Sie die eingetragenen Weiterleitungen nicht anpassen müssen, wenn Sie Ihren Shop umziehen. Wenn Sie diesen beispielsweise in einem Unterverzeichnis auf den Livegang vorbereiten oder Weiterleitungen in einem Staging-System vortesten, passen sich diese beim Umzug in das Hauptverzeichnis oder ein anderes Unterverzeichnis somit automatisch an.</p><p><strong><br /></strong></p><p><strong>3. Virtuelle Unterverzeichnisse / Sprach-Shops<br /></strong></p><p>Anders als bei physischen, also \"echten\", Unterverzeichnissen verhält es sich mit virtuellen Unterpfaden, die Sie etwa für Sprach-Shops oder Sub-Shops konfiguriert haben. Hier tragen Sie bitte den Teil der URL des Subshops mit in die Weiterleitungsziele und weiterzuleitenden (alten) URLs ein. Somit können Sie (ab Version 1.5.0 unseres Plugins) gezielt URLs nur für einzelne Sprach-Shops umleiten.</p><p><strong>Beispielsweise </strong>meinedomain.com/fr/URL-soll-in-DE-Shop-umgeleitet-werden:</p><p>alte URL: /fr/URL-soll-in-DE-Shop-umgeleitet-werden</p><p>neue URL: /de/<strong><strong><br /></strong></strong></p><p><strong><strong><br /></strong></strong></p><p><strong><strong>4. Sprach-Shops und physische Unterverzeichnisse</strong></strong></p><p>Entsprechend 2. und 3. gehen Sie wie folgt vor, wenn Ihre Shopware-Installation in einem Unterverzeichnis liegt und Sie virtuelle Sprach-Shop-URLs konfiguriert haben:</p><p>Weiterzuleitende URL (Beispiel): meinedomain.com/shopware6-test/public/en/Clothing/Men/</p><p>Als alte URL tragen Sie in diesem Fall ein: /en/Clothing/Men/<br /><strong><strong></strong></strong></p><p><strong><br /></strong></p><p><strong><br /></strong></p><p>Sobald\nSie die Weiterleitung speichern und sofern diese von Ihnen auf\n\"aktiviert\" gesetzt wurde, greift die Weiterleitung im Shop-Frontend.</p><p>Probieren Sie es einmal aus.</p><p><br /></p><p><br /></p><b>Weitere Hinweise zum Weiterleiten von URLs</b><br />Das\nPlugin kann nur URLs weiterleiten, die auf Ihre Shopware-Installation\nführen. Üblicherweise sind dies alle URLs innerhalb der Shop-Domain(s).\nIn einigen Fällen werden jedoch vom Webserver vorab bereits Umleitungen\nvorgenommen oder URL-Aufrufe nicht an Shopware weitergereicht, z.B. wenn\neine Dateiendung wie .php in der URL enthalten ist.<b><br /></b><br /><b>Troubleshooting / Fehlerbehebung</b><br />Falls eine\nWeiterleitung nicht funktioniert, stellen Sie bitte sicher, dass der\nAufruf in Shopware ankommt. Deaktivieren Sie die Weiterleitung zunächst\nwieder und rufen Sie die weiterzuleitende (\"alte\") URL im Browser auf.\nSie sollten die Seite Ihres Shops, bspw. mit einer 404-Meldung oder\neinem Shopinhalt sehen. Falls Sie eine Fehlermeldung sehen, die nicht\nvon Shopware stammt, liegt der Fehler in Ihrer Webserverkonfiguration.\nBitte überprüfen Sie dies entsprechend oder wenden Sie sich an Ihren\nSystemadministrator oder Webhoster.","version":"1.6.0","changelog":[{"version":"1.6.0","text":"<p>- Shopware 6.5 compatibility</p>","creationDate":{"date":"2023-03-29 16:45:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.4","text":"<p>Changed type hint of RequestTransformer to RequestTransformerInterface for compatibility with other plugins decorating that service</p>","creationDate":{"date":"2022-07-01 12:46:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<p>Restored menu entry in backend for Shopware versions 6.4.10.x and up</p>","creationDate":{"date":"2022-05-10 12:31:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"<p>Bugfixes regarding Shopware 6.4.x compatibility</p>","creationDate":{"date":"2021-10-08 14:09:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"<p>Compatbility with Shopware 6.4.x<br /></p>","creationDate":{"date":"2021-05-30 16:37:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<p>Subshop specific redirects, redirects for URLs with existing Shopware content, better usability and automatic URL sanitizing, UX improvements, Display of any shop content for 410 Content removed-entries, better integration in Shopware installations in subfolders, extended user manual in Shopware Backend<br /></p>","creationDate":{"date":"2020-09-21 14:05:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<p>Fixes for migration assistant with Shopware 6.3.x.x<br /></p>","creationDate":{"date":"2020-09-13 18:04:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>Compatibility fixes for Shopware migration assistant with Shopware versions 6.3.x.x<br /></p>","creationDate":{"date":"2020-08-26 12:40:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>Compatibility adjustments for migration assistant<br /></p>","creationDate":{"date":"2020-06-05 13:37:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Bugfixes for Shopware 6.1.1<br /></p>","creationDate":{"date":"2020-02-11 17:59:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release of the plugin<br /></p>","creationDate":{"date":"2019-10-29 18:25:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=stutt56214257426","redirectToStore":true,"lowestPriceValue":12}