{"id":9281,"name":"DvsnTicketSystem","code":"dvsn150171908595","lastChange":{"date":"2023-07-25 08:00:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLAahKT","examplePageUrl":"","moduleKey":"DvsnTicketSystem","creationDate":{"date":"2019-06-22 09:50:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2020-09-11 16:28:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-09-01 10:52:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":1812,"prefix":"dvsn","name":"digitvision","website":"//www.digitvision.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod1812_dv128.jpg"},"infos":[{"id":14321,"name":"Ticket System (inkl. Email Import)","description":"\n\n\n\n\n\n\n<h2>\n    Ticket System\n</h2><p>\n\nKundenservice hat sich im Vergleich zu früher dramatisch weiterentwickelt - aber viele Unternehmen\nverwenden nach wie vor überholte Technologien oder wickeln die Kommunikation per Email ab.\n\n\n\n</p><p>\nMit einem Ticket System können Sie Kundenanfragen in einem System kanalisieren\nund jede Kommunikation darüber abwickeln. Verfolgen Sie Kundenanfragen und\nverzichten Sie auf Email Strukturen mit mehreren Ordnern oder komplizierten\nFarbkodierungen. Optimieren Sie Ihren Kundensupport und vereinfachen Sie\ndie Möglichkeiten zur Kontaktaufnahme für Ihre Kunden.\n\nÜber dieses praktische Ticket System können Sie die komplette Kundenkommunikation\nzentral in der Shopware Administration verwalten.\n\n\n\n</p><h4>Tickets</h4><p>\n\nJede Anfrage über definierbare Formulare (mit unterschiedlichen Inhalten)\nlanden zentral im Ticket System als einzelne Tickets. Zudem können Sie Email Konten\npflegen, die automatisch abgerufen werden, um neue Anfragen direkt in das Ticket\nSystem zu importieren. Die komplette Kommunikation mit dem Kunden läuft\nletztendlich über Tickets. Der Kunde wird stets bei Änderungen (auf Wunsch) per Email\ninformiert. Registrierte Kunden können in Ihrem Kundenkonto eine Übersicht\naller Tickets einsehen.\n\n</p><h4>Formulare</h4><p>\n\nSie können die Formulare für Anfragen frei gestalten und je nach Anfrage\neigene Elemente aufnehmen. So sollten bei einer möglichen Retoure\nnatürlich andere Daten abgefragt werden, als ein Kunde, der eine Frage zu einem\nProdukt oder einer Bestellung hat. Sämtliche Stammdaten eines Kunden (Name,\nEmail Adresse, Telefonnummer) sind dabei immer Bestandteil eines jeden Tickets.\nWeitere Angaben können über frei wählbare Formular Elemente abgefragt werden.\nJedes Formular ist über eine konfigurierbare SEO Url erreichbar. So können Sie\nz.B. \"rücksendung\" oder \"support\" als SEO Url für verschiedene Formulare nutzen.\n\n</p><h4>Status</h4><p>\n\nDas Plugin bringt im Standard ausgesuchte Status für Tickets mit. Diese können\nSie frei anpassen und erweitern, um Ihre individuellen Prozesse perfekt abbilden\nzu können. Dabei können Sie festlegen, ob ein Status Ihre Aufmerksamkeit verlangt\n(Sie werden in der Übersicht der Tickets darauf hingewiesen) oder ob ein Kunde\nauf das Ticket weiter antworten kann (z.B. für geschlossene Tickets).\nZudem können Sie definieren, ob und welche Email der Kunde bei einem Statuswechsel\nerhält. So können Sie z.B. unterschiedliche Emails senden, wenn ein Ticket neu\neröffnet oder geschlossen wurde.\n\n\n</p><h4>Vorlagen</h4><p>\n\nUm die Kommunikation möglichst schnell und effizient zu halten, bietet das Plugin\ndie Möglichkeit Standardantworten / Antwort-Vorlagen zu administrieren. Aus diesen\nStandardanworten können Sie beim Antworten einer Anfrage direkt wählen - oder selbstverständlich\neine individuelle Antwort schreiben. Um es noch bequemer zu machen, unterstützt das\nPlugin bei Standardanworten die twig Syntax. Somit enthält die Anrede z.B. immer\nden Namen des Kunden und der Gruß enthält den Namen des Mitarbeiters.\n\n</p><h4>Email Konten</h4><p>\n\nSie können beliebig viele Email Konten festlegen, die Sie für den Import von Emails\nverwenden möchten. Um eine Integration in das Ticket System zu ermöglichen, müssen\nSie natürlich festlegen, welchem Verkaufskanal oder welcher Sprache ein Ticket\ndes Email Kontos zugewiesen werden soll. Anschließend können Sie Emails entweder\nper Knopfdruck oder über einen Konsolen-Befehl importieren. Den Konsolen-Befehl\nsollten Sie in Ihren crontab einfügen. Hinweis: das Plugin liest nur ungelesene\nEmails aus einem zu definierenden Ordner (z.B. \"INBOX\") und markiert diese anschließend\nautomatisch als gelesen. Hinweis: das Plugin unterstützt aktuell nur IMAP.\n\n</p><h4>Hinweis</h4><p>\n\nDie Konfiguration der einzelnen Elemente (Formulare, Status etc) finden Sie in der\nAdministration unter \"Einstellungen\" -> \"Erweiterungen\". Dort hat jedes Element\neinen eigenen Eintrag.\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin wird mit einer Reihe an Beispielen geliefert</li><li>die Verlinkung auf ein neues Ticket im Kundenkonto ist Teil eines Textbausteins. Wenn Sie dort ein anderes Formular anzeigen möchten, dann müssen Sie den Textbaustein anpassen</li><li>konfigurieren Sie die Status nach Ihren Wünschen</li><li>konfigurieren Sie die Vorlagen nach Ihren Wünschen</li><li>konfigurieren Sie die Email Konten nach Ihren Wünschen</li><li>konfigurieren Sie die Formulare nach Ihren Wünschen</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>Quelloffen</strong><br />\nDas Plugin ist quelloffen und kann ohne den ionCube Loader und den Lizenz Manager genutzt werden\n</li><li><strong>PHP 7 kompatibel</strong><br />\nDas Plugin ist vollständig zu PHP 7.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDas Plugin verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDas Plugin ist stets zur aktuellen Shopware Version und zum Shopware standard responsive Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Plugins von Drittanbietern nutzen, dann sollten Sie das Plugin vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - das Plugin ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\nDas Plugin kann kostenlos und unverbindlich 30 Tage lang getestet werden\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Plugins entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Plugin Hersteller haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung des Plugins entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Kontakt</h4><ul><li><strong>Anschrift</strong><br />\nTrienendorfer Straße 142<br>\n58300 Wetter (Ruhr)\n</li><li><strong>Telefon</strong><br />\n+49 (0) 2335 8490522\n</li><li><strong>Internet</strong><br />\ninfo@digitvision.de<br />\nhttps://www.digitvision.de\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Plugins entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Plugins ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin wird mit einer Reihe an Beispielen geliefert</li><li>die Verlinkung auf ein neues Ticket im Kundenkonto ist Teil eines Textbausteins. Wenn Sie dort ein anderes Formular anzeigen möchten, dann müssen Sie den Textbaustein anpassen</li><li>konfigurieren Sie die Status nach Ihren Wünschen</li><li>konfigurieren Sie die Vorlagen nach Ihren Wünschen</li><li>konfigurieren Sie die Email Konten nach Ihren Wünschen</li><li>konfigurieren Sie die Formulare nach Ihren Wünschen</li></ul>","shortDescription":"Verwalte und bearbeite die komplette Kommunikation mit dem Kunden zentral in der Administration - ganz ohne Emails. Emails können auf Wunsch in das Ticket System importiert werden.","highlights":"","features":""},{"id":14322,"name":"Ticket system (incl. email import)","description":"<h2>\nTicket System\n</h2><p>\n\nCustomer service has developed dramatically compared to the past - but many companies\nstill use outdated technologies or handle communication via email.\n\n\n\n</p><p>\nWith a ticket system you can channel customer requests in one system\nand handle all communication about it. Track customer inquiries and\ndo without email structures with several folders or complicated\nColor coding. Optimize your customer support and simplify\nthe possibilities to contact your customers.\n\nWith this practical ticket system you can manage the complete customer communication\ncentrally managed in the Shopware Administration.\n\n\n\n\n</p><h4>Tickets</h4><p>\n\nEach request via definable forms (with different contents)\nland centrally in the ticket system as individual tickets. You can also create email accounts\nwhich are automatically retrieved to enter new requests directly into the ticket\nsystem. The complete communication with the customer runs\nultimately via tickets. The customer will always be informed about changes (on request) by email\ninformed. Registered customers can view an overview of all our products in their customer account\nof all tickets.\n\n\n</p><h4>Forms</h4><p>\n\nYou can freely design the forms for inquiries and, depending on the inquiry\ninclude your own elements. So in case of a possible return\nof course, different data are requested than a customer who asks a question about a\nproduct or an order. All master data of a customer (name,\nEmail address, phone number) are always part of every ticket.\nFurther information can be requested via freely selectable form elements.\nEach form is accessible via a configurable SEO Url. So you can\ne.g. use \"return\" or \"support\" as SEO Url for different forms.\n\n\n\n</p><h4>Status</h4><p>\n\nThe plugin comes with selected statuses for tickets by default. These can be\nCustomize and extend them freely to perfectly map your individual processes\nto be able. You can determine whether a status requires your attention\n(you will be informed in the overview of the tickets) or if a customer\ncan continue to respond to the ticket (e.g. for closed tickets).\nIn addition, you can define whether and which email the customer should receive when the status changes\nreceives. So you can send different emails, for example, if a ticket is new\nwas opened or closed.\n\n\n</p><h4>Reply templates</h4><p>\n\nTo keep the communication as fast and efficient as possible, the plugin\nthe possibility to administrate standard answers / answer templates. From these\nYou can choose standard answers directly when answering an inquiry - or of course\nwrite an individual answer. To make it even more convenient, the\nplugin uses the twig syntax for standard replies. So the salutation always contains e.g.\nthe name of the customer and the greeting contains the name of the employee.\n\n</p><h4>Email accounts</h4><p>\n\nYou can define as many email accounts as you like for the import of emails\nto use. To enable integration into the ticket system\nOf course, you determine which sales channel or language a ticket is sold to\nof the email account to be assigned. You can then either\nimport at the push of a button or via a console command. The console command\nshould be inserted into your crontab.\n\n</p><h4>instruction</h4><ul><li>install the plugin</li><li>the plugin comes with a number of examples</li><li>the link to a new ticket in the customer account is part of a text module. If you want to display another form there, you have to adapt the text module</li><li>configure the status according to your wishes</li><li>configure the templates according to your wishes</li><li>configure the email accounts according to your wishes</li><li>configure the forms according to your wishes</li></ul><br /><br /><h4>General information</h4><ul><li><strong>PHP 7 and PHP 8 compatible</strong><br />\nThe plugin is fully compatible with PHP 7.x and PHP 8x\n</li><li><strong>Snippets</strong><br />\nThe plugin uses snippets so that all texts and labels can be translated into other languages in the backend / in the administration\n</li><li><strong>Subshop-able</strong><br />\nRelevant configuration options can be individually adapted for each subshop / sales channel\n</li><li><strong>Compatibility</strong><br />\nThe plugin is always compatible with the latest Shopware version and the Shopware standard theme\n</li><li><strong>Incompatibility</strong><br />\nIf you are using a custom theme and/or third-party plugins, you should test the plugin thoroughly before buying. A compatibility can not be guaranteed\n</li><li><strong>Responsive</strong><br />\nWhether desktop PC or mobile phone - the plugin is fully responsive\n</li><li><strong>Test version</strong><br />\nThe plugin can be tested free of charge and without obligation for 30 days (see free trial month of the rental license)\n</li><li><strong>Individual change requests</strong><br />\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows. Please contact me without obligation to adapt my plugins according to your requirements in order to integrate them perfectly into your in-house processes\n</li><li><strong>Liability disclaimer</strong><br />\nThe plugin manufacturer is not liable for damages, in particular not for direct or indirect consequential damages, data loss, lost profits, system or production failures that result from the use of the plugin - except for intent or gross negligence\n</li></ul><h4>About me</h4><ul><li><strong>15+ years of experience</strong><br />\nFor over 15 years in e-commerce and for over 5 years exclusively with shopware. Your specialist with extensive industry and technical knowledge.\n</li><li><strong>Reliable</strong><br />\nShopware is my passion and my hobby. I take care of your project in a reliable and committed way as if it were my own.\n</li><li><strong>Quality</strong><br />\nHigh service quality is the focus. I use state-of-the-art design patterns, current technologies and innovative tools.\n</li></ul><h4>Your competent partner</h4><p>\nFor more than 15 years I have been working as a passionate web developer in e-commerce. In this time\nI have already advised and supported many companies in interesting projects. Thereby I stand for\nuncomplicated communication, future-proof solutions, modern technologies and a high level of commitment.\n</p><p>\nEvery company is unique and requires individual solutions that are precisely tailored to its own workflows.\nGet in contact with me without obligation, to get my plugins according to your requirements\nin order to integrate them perfectly into your in-house processes. I would be happy to provide you with\noffers for adaptations or, if necessary, individually programmed plugins according to your wishes.\n</p>","installationManual":"<h4>Instructions</h4><ul><li>install the plugin</li><li>the plugin comes with a number of examples</li><li>the link to a new ticket in the customer account is part of a text module. If you want to display another form there, you have to adapt the text module</li><li>configure the status according to your wishes</li><li>configure the templates according to your wishes</li><li>configure the email accounts according to your wishes</li><li>configure the forms according to your wishes</li></ul>","shortDescription":"Manage and process the complete communication with the customer centrally in the administration - without e-mails. Emails can be imported into the ticket system if desired.","highlights":"","features":""}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161016,"bookingKey":"dvsn150171908595","bookingText":"Ticket system (incl. email import)","price":449.1,"subscription":true,"discount":10,"discr":"priceModelBuy"},{"id":161015,"bookingKey":"dvsn150171908595_M","bookingText":"Ticket system (incl. email import)","price":69,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpeogHQk","preview":true,"priority":99900,"id":92518},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php38MpHb","preview":false,"priority":99800,"id":92517},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpF9AyUx","preview":false,"priority":99700,"id":93201},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpc86sAX","preview":false,"priority":98900,"id":92519},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7m9esw","preview":false,"priority":97900,"id":92520},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmaONuf","preview":false,"priority":97800,"id":92521},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyNzXQ5","preview":false,"priority":89900,"id":92522},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGZcLia","preview":false,"priority":89800,"id":48390},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLxh0Vr","preview":false,"priority":88900,"id":48270},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpawR11e","preview":false,"priority":88800,"id":48269},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5wIYeN","preview":false,"priority":88700,"id":92523},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8JA0rK","preview":false,"priority":88600,"id":92524},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJlkChL","preview":false,"priority":88500,"id":92525},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpwrkAvp","preview":false,"priority":88400,"id":48265},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3kFjAy","preview":false,"priority":85000,"id":71541},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLDfknI","preview":false,"priority":79900,"id":92526},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWyS7Ie","preview":false,"priority":78900,"id":48274},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAMEqXa","preview":false,"priority":78800,"id":92527},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBzjM0d","preview":false,"priority":77900,"id":92528},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpAZ9DUq","preview":false,"priority":77800,"id":48272},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdfeUtp","preview":false,"priority":77700,"id":48271},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcz8h6T","preview":false,"priority":69900,"id":92529},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUBazxT","preview":false,"priority":68900,"id":48278},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGbECzM","preview":false,"priority":59900,"id":92530},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php4OmFSD","preview":false,"priority":58900,"id":92531},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkwXi4O","preview":false,"priority":49900,"id":92532},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDXSQ5x","preview":false,"priority":48900,"id":48283},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpPO8z6x","preview":false,"priority":48800,"id":48282},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYL1IKw","preview":false,"priority":48700,"id":48281},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnH7XPY","preview":false,"priority":39900,"id":49020},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZG30mi","preview":false,"priority":38900,"id":48286},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVL0Nni","preview":false,"priority":37900,"id":48287},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php11CFgg","preview":false,"priority":36900,"id":48285},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpkCbtcG","preview":false,"priority":29900,"id":48290},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6h0ClS","preview":false,"priority":28900,"id":92533},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFFduvp","preview":false,"priority":19900,"id":92534}],"comments":[{"authorName":"Jannis Reil","text":"Ich bin für den Support in unserem Unternehmen zuständig und habe für den Wechsel auf Shopware 6 nach einem Nachfolger vom Shopware Ticket System gesucht. Dieses Plugin erfüllt unsere Erwartungen und wir sind höchst zufrieden. Der Import der Emails sorgt dafür, dass wir nur noch eine Quelle an Tickets haben und nicht mehr mit Emails arbeiten müssen.","headline":"Super Nachfolger","creationDate":{"date":"2020-11-14 10:28:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Ticket System (inkl. Email Import)","description":"<h2>\n    Ticket System\n</h2><p>\n\nKundenservice hat sich im Vergleich zu früher dramatisch weiterentwickelt - aber viele Unternehmen\nverwenden nach wie vor überholte Technologien oder wickeln die Kommunikation per Email ab.\n\n\n\n</p><p>\nMit einem Ticket System können Sie Kundenanfragen in einem System kanalisieren\nund jede Kommunikation darüber abwickeln. Verfolgen Sie Kundenanfragen und\nverzichten Sie auf Email Strukturen mit mehreren Ordnern oder komplizierten\nFarbkodierungen. Optimieren Sie Ihren Kundensupport und vereinfachen Sie\ndie Möglichkeiten zur Kontaktaufnahme für Ihre Kunden.\n\nÜber dieses praktische Ticket System können Sie die komplette Kundenkommunikation\nzentral in der Shopware Administration verwalten.\n\n\n\n</p><h4>Tickets</h4><p>\n\nJede Anfrage über definierbare Formulare (mit unterschiedlichen Inhalten)\nlanden zentral im Ticket System als einzelne Tickets. Zudem können Sie Email Konten\npflegen, die automatisch abgerufen werden, um neue Anfragen direkt in das Ticket\nSystem zu importieren. Die komplette Kommunikation mit dem Kunden läuft\nletztendlich über Tickets. Der Kunde wird stets bei Änderungen (auf Wunsch) per Email\ninformiert. Registrierte Kunden können in Ihrem Kundenkonto eine Übersicht\naller Tickets einsehen.\n\n</p><h4>Formulare</h4><p>\n\nSie können die Formulare für Anfragen frei gestalten und je nach Anfrage\neigene Elemente aufnehmen. So sollten bei einer möglichen Retoure\nnatürlich andere Daten abgefragt werden, als ein Kunde, der eine Frage zu einem\nProdukt oder einer Bestellung hat. Sämtliche Stammdaten eines Kunden (Name,\nEmail Adresse, Telefonnummer) sind dabei immer Bestandteil eines jeden Tickets.\nWeitere Angaben können über frei wählbare Formular Elemente abgefragt werden.\nJedes Formular ist über eine konfigurierbare SEO Url erreichbar. So können Sie\nz.B. \"rücksendung\" oder \"support\" als SEO Url für verschiedene Formulare nutzen.\n\n</p><h4>Status</h4><p>\n\nDas Plugin bringt im Standard ausgesuchte Status für Tickets mit. Diese können\nSie frei anpassen und erweitern, um Ihre individuellen Prozesse perfekt abbilden\nzu können. Dabei können Sie festlegen, ob ein Status Ihre Aufmerksamkeit verlangt\n(Sie werden in der Übersicht der Tickets darauf hingewiesen) oder ob ein Kunde\nauf das Ticket weiter antworten kann (z.B. für geschlossene Tickets).\nZudem können Sie definieren, ob und welche Email der Kunde bei einem Statuswechsel\nerhält. So können Sie z.B. unterschiedliche Emails senden, wenn ein Ticket neu\neröffnet oder geschlossen wurde.\n\n\n</p><h4>Vorlagen</h4><p>\n\nUm die Kommunikation möglichst schnell und effizient zu halten, bietet das Plugin\ndie Möglichkeit Standardantworten / Antwort-Vorlagen zu administrieren. Aus diesen\nStandardanworten können Sie beim Antworten einer Anfrage direkt wählen - oder selbstverständlich\neine individuelle Antwort schreiben. Um es noch bequemer zu machen, unterstützt das\nPlugin bei Standardanworten die twig Syntax. Somit enthält die Anrede z.B. immer\nden Namen des Kunden und der Gruß enthält den Namen des Mitarbeiters.\n\n</p><h4>Email Konten</h4><p>\n\nSie können beliebig viele Email Konten festlegen, die Sie für den Import von Emails\nverwenden möchten. Um eine Integration in das Ticket System zu ermöglichen, müssen\nSie natürlich festlegen, welchem Verkaufskanal oder welcher Sprache ein Ticket\ndes Email Kontos zugewiesen werden soll. Anschließend können Sie Emails entweder\nper Knopfdruck oder über einen Konsolen-Befehl importieren. Den Konsolen-Befehl\nsollten Sie in Ihren crontab einfügen. Hinweis: das Plugin liest nur ungelesene\nEmails aus einem zu definierenden Ordner (z.B. \"INBOX\") und markiert diese anschließend\nautomatisch als gelesen. Hinweis: das Plugin unterstützt aktuell nur IMAP.\n\n</p><h4>Hinweis</h4><p>\n\nDie Konfiguration der einzelnen Elemente (Formulare, Status etc) finden Sie in der\nAdministration unter \"Einstellungen\" -&gt; \"Erweiterungen\". Dort hat jedes Element\neinen eigenen Eintrag.\n\n</p><h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin wird mit einer Reihe an Beispielen geliefert</li><li>die Verlinkung auf ein neues Ticket im Kundenkonto ist Teil eines Textbausteins. Wenn Sie dort ein anderes Formular anzeigen möchten, dann müssen Sie den Textbaustein anpassen</li><li>konfigurieren Sie die Status nach Ihren Wünschen</li><li>konfigurieren Sie die Vorlagen nach Ihren Wünschen</li><li>konfigurieren Sie die Email Konten nach Ihren Wünschen</li><li>konfigurieren Sie die Formulare nach Ihren Wünschen</li></ul><br /><br /><h4>Allgemeine Hinweise</h4><ul><li><strong>Quelloffen</strong><br />\nDas Plugin ist quelloffen und kann ohne den ionCube Loader und den Lizenz Manager genutzt werden\n</li><li><strong>PHP 7 kompatibel</strong><br />\nDas Plugin ist vollständig zu PHP 7.x kompatibel\n</li><li><strong>Textbausteine</strong><br />\nDas Plugin verwendet Textbausteine damit alle Texte und Beschriftungen bequem im backend in andere Sprachen übersetzt werden können\n</li><li><strong>Subshop-fähig</strong><br />\nRelevante Optionen der Konfiguration können pro Verkaufskanal individuell angepasst werden\n</li><li><strong>Kompatibilität</strong><br />\nDas Plugin ist stets zur aktuellen Shopware Version und zum Shopware standard responsive Theme kompatibel\n</li><li><strong>Inkompatibilität</strong><br />\nSollten Sie ein individuelles Theme und/oder Plugins von Drittanbietern nutzen, dann sollten Sie das Plugin vor dem Kauf gründlich testen. Eine Kompatibilität kann nicht garantiert werden\n</li><li><strong>Responsive</strong><br />\nEgal ob Desktop PC oder Mobiltelefon - das Plugin ist vollständig responsive\n</li><li><strong>Testversion</strong><br />\nDas Plugin kann kostenlos und unverbindlich 30 Tage lang getestet werden\n</li><li><strong>Individuelle Änderungswünsche</strong><br />\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe zugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Plugins entsprechend Ihren Anforderungen anzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren\n</li><li><strong>Haftungsausschluss</strong><br />\nDer Plugin Hersteller haftet nicht für Schäden insbesondere nicht für mittelbare oder unmittelbare Folgeschäden, Datenverlust, entgangene Gewinne, System- oder Produktionsausfälle, die durch die Nutzung des Plugins entstehen - ausgenommen Vorsatz oder grobe Fahrlässigkeit\n</li></ul><h4>Über mich</h4><ul><li><strong>15+ Jahre Erfahrung</strong><br />\nSeit über 15 Jahren im E-Commerce und seit über 5 Jahren exklusiv mit Shopware. Ihr Spezialist mit umfangreichem Branchen- und Fachwissen.\n</li><li><strong>Zuverlässig</strong><br />\nShopware ist meine Leidenschaft und mein Hobby. Ich kümmere mich zuverlässig und engagiert um Ihr Projekt, als wäre es mein eigenes.\n</li><li><strong>Qualität</strong><br />\nHohe Service-Qualität steht im Mittelpunkt. Ich verwende modernste Design Patterns, aktuelle Technologien und innovative Werkzeuge.\n</li></ul><h4>Kontakt</h4><ul><li><strong>Anschrift</strong><br />\nTrienendorfer Straße 142<br />\n58300 Wetter (Ruhr)\n</li><li><strong>Telefon</strong><br />\n+49 (0) 2335 8490522\n</li><li><strong>Internet</strong><br />\ninfo@digitvision.de<br />\nhttps://www.digitvision.de\n</li></ul><h4>Ihr kompetenter Partner</h4><p>\nBereits seit über 15 Jahren bin ich als leidenschaftlicher Web-Entwickler im E-Commerce tätig. In dieser Zeit konnte\nich bereits viele Unternehmen bei interessanten Projekten beraten und ausführend unterstützen. Dabei stehe ich für\nunkomplizierte Kommunikation, zukünftsfähige Lösungen, moderne Technologien und ein hohes Engagement.\n</p><p>\nJedes Unternehmen ist einzigartig und bedarf individueller Lösungen, die exakt auf die eigenen Arbeitsabläufe\nzugeschnitten sind. Nehmen Sie unverbindlich Kontakt zu mir auf, um meine Plugins entsprechend Ihren Anforderungen\nanzupassen, um diese maßgeschneidert in Ihre hauseigenen Prozesse perfekt zu integrieren. Gerne erstelle ich Ihnen\nAngebote für Anpassungen oder ggf. individuell programmierte Plugins ganz nach Ihren Wünschen.\n</p>","installationManual":"<h4>Anleitung</h4><ul><li>installieren Sie das Plugin</li><li>das Plugin wird mit einer Reihe an Beispielen geliefert</li><li>die Verlinkung auf ein neues Ticket im Kundenkonto ist Teil eines Textbausteins. Wenn Sie dort ein anderes Formular anzeigen möchten, dann müssen Sie den Textbaustein anpassen</li><li>konfigurieren Sie die Status nach Ihren Wünschen</li><li>konfigurieren Sie die Vorlagen nach Ihren Wünschen</li><li>konfigurieren Sie die Email Konten nach Ihren Wünschen</li><li>konfigurieren Sie die Formulare nach Ihren Wünschen</li></ul>","version":"2.0.2","changelog":[{"version":"2.0.2","text":"- added language selection to ticket details to use translated status and response templates","creationDate":{"date":"2023-06-02 11:32:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"- fixed missing default header and footer within emails<br />\n- fixed missing icons within the administration","creationDate":{"date":"2023-04-08 17:53:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"- added levenshtein distance check for captcha to ignore a single char error<br />\n- added shopware 6.5 compatibility","creationDate":{"date":"2023-04-02 18:56:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"- added check for invalid/removed status within a ticket","creationDate":{"date":"2023-03-10 10:05:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"- removed jquery dependency","creationDate":{"date":"2022-07-20 22:03:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"- added optional category for tickets<br />\n- added manual selection for administration user for tickets","creationDate":{"date":"2022-03-22 07:45:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"- changed generating ticket numbers from random to incremental numbers","creationDate":{"date":"2021-10-14 13:33:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"- added image file-upload form element<br />\n- moved ticket configuration modules (forms, templates etc) to default shopware settings","creationDate":{"date":"2021-09-03 19:40:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"- fixed mail import for office365","creationDate":{"date":"2021-08-19 12:33:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"- added shopware 6.4 compatibility","creationDate":{"date":"2021-05-17 07:45:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"- fixed missing snippet","creationDate":{"date":"2021-04-29 10:28:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"- fixed tickets with missing additional form elements","creationDate":{"date":"2021-04-07 18:25:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"- added plugin configuration to enable/disable captcha","creationDate":{"date":"2021-04-07 10:30:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"- fixed missing footer payment and shipping logos","creationDate":{"date":"2021-04-06 15:23:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"- first plugin version","creationDate":{"date":"2020-09-01 12:42:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=dvsn150171908595","redirectToStore":false,"lowestPriceValue":69}