{"id":9291,"name":"PevrPayeverIntegration","code":"Pevr250179638108","lastChange":{"date":"2023-07-14 22:18:31.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phprH9x0l","examplePageUrl":"","moduleKey":"PevrPayeverIntegration","creationDate":{"date":"2019-06-25 08:41:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2019-10-02 13:18:32.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":null,"pluginTestingInstanceDisabled":false,"producer":{"id":242,"prefix":"Pevr","name":"payever","website":"//getpayever.com/checkout","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod242_payever_logo_128px.png"},"infos":[{"id":14340,"name":"payever Checkout - Composable Payment Gateway. For Free.","description":"<h3><b>payever Checkout - Composable Payment Gateway. For Free.</b></h3><p>With payever Checkout you can offer your customers a variety of payment methods - from B2C/B2B Buy Now Pay Later, Installments &amp; Financing to Credit Card payments, PayPal, local payment methods and real time bank transfers based on Open banking technologies - with just one plugin. You can also benefit from an exclusive selection of payment options from our close partners Santander, Openbank and Ivy.</p><p>More than 5,000 merchants in 9 countries trust in us - with a simple integration and just a few clicks you can be part of it too!</p><p><a href=\"https://www.getpayever.com/checkout\" target=\"_blank\" rel=\"noreferrer\">www.getpayever.com/checkout</a></p><p><br></p><h3><b>Our payment methods</b></h3><h4><b>Buy Now Pay Later:</b></h4><h3><p style=\"color: rgb(96, 113, 130);\">Together with our partners Santander, Openbank and Swedbank we offer exclusive Buy Now Pay Later options. You have the choice between invoice, installments and installment loans.</p><p style=\"color: rgb(96, 113, 130);\"><b><br></b></p><p style=\"color: rgb(96, 113, 130);\"><b>Santander BNPL:</b></p><p style=\"color: rgb(96, 113, 130);\"></p><ul><li>Payment period: 30 days</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Availability: Germany, Norway</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br></p><p></p><p style=\"color: rgb(96, 113, 130);\"><b>Santander BNPL / Installments:</b></p><p style=\"color: rgb(96, 113, 130);\"></p><p></p><ul><li>Payment period: 3 - 36 Month (customer interest rate between 0% - 7,9%)</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Availability: German</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br></p><p></p><p></p><p style=\"color: rgb(96, 113, 130);\"><b>Santander Financing / Installments:</b></p><p style=\"color: rgb(96, 113, 130);\"></p><ul><li>Payment period: 6 - 72 Month (0% financing possible)</li><li>Special Feature: The process is completely digital with video legitimation and electronic signing.</li><li>Availability: Germany, Austria, Netherlands, Belgium, Sweden, Denmark, Norway, Finland, Great Britain</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br></p><p></p><p style=\"color: rgb(96, 113, 130);\"><b>Zinia Buy Now Pay Later - Invoice:</b></p><p style=\"color: rgb(96, 113, 130);\"></p><ul><li>Availability: Germany, Netherlands</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br></p><p></p><p style=\"color: rgb(96, 113, 130);\"><b>Swedbank Pay Invoice:</b></p><p style=\"color: rgb(96, 113, 130);\"></p><ul><li>Availability: Sweden, Denmark, Norway</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p></p></h3><h3><p style=\"color: rgb(96, 113, 130);\"><br></p></h3><h4><b>Open Banking:</b></h4><p>Open Banking enables your customers to transfer the purchase amount in real time via online banking access during the checkout process. You will immediately receive the transaction confirmation and can start the delivery process. As a green payment method, Ivy combines the topics payment with sustainability and structurally reduces transaction fees through open banking. Ivy uses these cost savings to offer merchants the lowest transactions fees on the market and to support climate protection projects with every transaction. Instant Payments is an offer by Santander, which can be used by all customers from all banks with online banking access. Sofortüberweisung rounds off the Open Banking payment options available in the payever Checkout.</p><p><b><br></b></p><p><b>Ivy:</b></p><p></p><ul><li>Special Feature: Ivy supports climate protection projects with every purchase without any additional costs for you or your customer.</li><li>Availability: Germany, Finland, France, Italy, Estonia, Lithuania, Netherlands, Portugal, Austria, Spain, Great Britain, Belgium, Hungary, Ireland, Latvia, Poland, Australia</li><li>Transaction fees: Please contact support@payever.de&nbsp;to receive an individual offer.</li></ul><br><p></p><p><b>Santander Instant Payments:</b></p><p></p><ul><li>Special Feature: Beneficial terms and conditions in combination with other Santander payment methods.</li><li>Availability: Germany, Austria, Switzerland</li><li>Transactions fees: Please contact support@payever.de&nbsp;to receive an individual offer.</li></ul><br><p></p><p><b>Sofort (Klarna):</b></p><p>The modern version of prepayment. The customer transfers the purchase amount via online banking, you immediately receive a transactions confirmation and can start the shipping process.</p><p></p><ul><li>Availability: Germany, Austria, Netherlands, Belgium, Spain, Italy, Switzerland, Poland, Great Britain</li><li>Special Feature: Partner Conditions of 0,8% + 0,25€ fix</li></ul><p><br></p><p></p><h4><b>Credit Cards:</b></h4><p><b>Stripe:</b></p><p>Via Stripe or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.</p><p></p><ul><li>Availability: Worldwide</li><li>Special Feature: Smooth onboarding for credit card acceptance with Stripe.</li><li>Transaction Fees: 1.4% + € 0.25&nbsp; on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.</li></ul><p><br></p><p><b>Swedbank Pay:</b></p><p></p><ul><li>Via Swedbank Pay or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.</li><li>Availability: Worldwide</li></ul><p></p><ul><li>Special Feature: Smooth onboarding for credit card acceptance with Swedbank Pay.</li><li>Transaction Fees: Please contact support@payever.de&nbsp;to receive an individual offer.</li></ul><p><br></p><h4><b>Wallets and Local Payment Methods:</b></h4><p>Offer your customers the most common wallet solutions as well as local payment options in each of the markets.&nbsp;</p><p><b><br></b></p><p><b>Apple Pay:</b></p><p>Apple Pay replaces debit cards and cash with a simpler, safer, and more private payment method, wether in store on a website or in an app.</p><ul><li>Availability: Worldwide</li><li>Transaction Fees: 1.4% + € 0.25&nbsp; on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.</li></ul><p><br></p><p><b>Google Pay:</b></p><p>The simple way to pay in store, in apps or in online shops. Your customers can also collect bonuses and store their favourite cards - all at one place.</p><ul><li>Availability: Worldwide</li><li>Transaction Fees: 1.4% + € 0.25&nbsp; on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.</li></ul><p><br></p><p><b>PayPal:</b></p><p>This&nbsp; payment provider is&nbsp; popular&nbsp;worldwide and offers you and your customers extra protection in case of lost parcels and attempts of fraud.</p><p></p><ul><li>Availability: Worldwide</li><li>Special Feature: Smooth onboarding by simply connecting your existing PayPal account.</li><li>Transaction fees: Between 1.49% to 2.49% (depending on the total monthly volume) + € 0.35 fixed fee.</li></ul><p></p><p><br></p><h4><b>Other:</b></h4><p><b>Prepayment:</b></p><p>The customer transfers the money in advance and you ship the goods as soon as the money has arrived.&nbsp;</p><p></p><ul><li>Availability: Worldwide</li><li>Special Feature: Fast onboarding and instant availability with just a few clicks.</li><li>Transaction fees: None - Wire transfer is free of charge!</li></ul><p><br></p><p><b>Direct Debit (SEPA):</b></p><p>Direct Debit is still a very common payment method: During the checkout process your customers just give permission to debit the amount from their bank account.</p><p></p><ul><li>Availability: 36 countries within the Single Euro Payment Area (SEPA)</li><li>Special Feature: Smooth onboarding for credit card acceptance with Stripe.</li><li>Transactions fees: 0,35€ fix</li></ul><p><br></p><p><b>How to get in touch with us:</b></p><p>To receive further information or an offer for one of our payment methods, please contact us at any time by email: support@payever.de. We look forward to hearing from you!</p><p></p>","installationManual":"<p>The integration is easy and doesn't require any development!</p><p>Should there ever be a problem, please send a description (if possible with screenshot) and the email address you have used to create you payever account to support@payever.de.</p><p><br></p><p></p><p>Step 1:</p><p>Please first create a payever account at&nbsp;https://commerceos.payever.org/registration/business and configure the payment methods you want to integrate.</p><p><br></p><p>Step 2:</p><p>The next step is to download the plugin and adjust some settings.&nbsp;</p><p>Detailed instructions can be found here:&nbsp;<a href=\"https://support.payever.org/hc/en-us/articles/360023894874\">https://support.payever.org/hc/en-us/articles/360023894874</a></p>","shortDescription":"payever combines all common payment methods in just one plugin: From B2C/B2B Buy Now Pay Later, Installments & Financing to Credit Card, PayPal, local payment methods and Open Banking.","highlights":"Buy Now Pay Later: Pay in 14 or 30 days, split in up to 36 monthly installments as well as traditional financing with best terms and conditions for both costumers and merchants, we offer different types of buy now pay later products - in cooperation with our partners Santander and Openbank.\nSustainability: Together with our exclusive partner Ivy, you and your customers can support certified climate protection projects with every payment - without any additional costs.\nAll Payment Options: With payever Checkout you can offer your customers all common payment options via just one partner - without having to install and maintain multiple plugins.\nFree of Charge: payever is not charging any setup or transaction fees - you only bear the costs of the respective payment provider or bank. You can even benefit from lower partner conditions for specific payment options.\nCheckout Branding: You can completely customize your payever Checkout - upload your logo and adjust colors, fields as well as buttons so that the checkout fits your online shop perfectly.","features":"Point of Sale: All payment methods can also be used completely digital in your local store - as a Self-Checkout via QR codes or SMS/email and as a merchant version via the payever platform or integration into your existing PoS system.\nPay by Link: The payment link (or the QR code) can be send via e-mail or SMS to your customers and works with all payment methods. Therefore, Pay by Link is the ideal solution for merchants, who want to make special offers for their customers or process call center orders. Alternatively, Pay by Link can also integrated by API into existing processes and systems.\nOrder Management: The plugin allows you to control all transactions including after-sales actions in your shop-backend as well as in your payever account.\nSpecific Settings: Activate or deactivate payment methods with just one click. Select different payment options depending on shopping cart size or on customer address. You can even offer the same payment method in different variations (e.g. different terms and conditions for installments).\nWidgets & Rate Calculator: To make your customers aware about the payment methods such as installments and financing as well as Ivy, specific widgets can be implemented to provide more information or calculate the monthly rate directly on the product page.\nProduct Synchronization: Besides the payment integrations, this plugin can easily synchronize your products via payever to other sales channels such as marketplaces (e.g. Amazon, ebay), product comparison platforms (e.g. Google shopping) and social media (e.g. Facebook shops/marketplace, Instagram).\nCyber Security: We guarantee the highest security standards by using the latest technology and periodic PCI scans as well as annual external audits based on our close cooperation with partners from the highly regulated banking sector.\nGDPR: To meet the highest compliance and security standards, all data ist stored on ISO/IEC 27001 & PCI DSS certified servers located in the European Union. \nCustomer Support: Our customer support is german and english speaking and helps you with the integration or any technical issues. On weekdays between 9 am and 6 pm, you will receive immediate response to any question."},{"id":15480,"name":"payever Checkout - Ihr Payment Gateway. Kostenlos.","description":"<h2><b>payever Checkout - Ihr Payment Gateway. Kostenlos.</b><br></h2><p>Mit dem payever Checkout können Sie Ihren Kund:innen verschiedenste Zahlungsmöglichkeiten anbieten - von B2C/B2B Rechnungs-/Ratenkauf &amp; Finanzierung bis hin zur Kreditkartenzahlung, PayPal, lokalen Zahlarten sowie Echtzeit-Banküberweisung auf Basis von Open-Banking-Technologien - alles über nur ein Plugin. Profitieren Sie außerdem von einer exklusiven Auswahl der Zahlungsoptionen unserer engen Partner Santander, Openbank und Ivy.</p><p>Über 5.000 Händler:innen in 9 Ländern vertrauen uns bereits - mit einer einfachen Integration und nur wenigen Klicks können auch Sie dazugehören!</p><p><a href=\"https://www.payever.de/checkout\" target=\"_blank\" rel=\"noreferrer\">www.payever.de/checkout</a></p><p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; font-size: 12px; line-height: normal; font-family: &quot;Helvetica Neue&quot;; color: rgb(0, 0, 0); min-height: 14px;\"><br></p><h3><b>Unsere Zahlungsarten</b></h3><h4><b>Buy Now Pay Later:</b></h4><p>Unsere exklusiven Buy Now Pay Later Optionen bieten wir zusammen mit unseren Partnern Santander, Openbank und Swedbank an. Dabei haben Sie die Wahl zwischen dem Rechnungs- und Ratenkauf sowie Ratenkredit bzw. Finanzierung.</p><p><b>Santander Rechnungskauf:</b></p><p></p><ul><li>Besonderheit: Kein Darlehensvertrag oder Identitätsnachweis notwendig.</li><li>Verfügbarkeit: Deutschland Norwegen</li><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li><li>Mindest- und Maximalbetrag: i.d.R. 5€ - 1.500&nbsp;</li></ul><p></p><br><p><b>Santander Ratenkauf:</b></p><ul><li>Laufzeiten: 3 - 36 Monate (Kundenzins von 0% - 7,9%)</li><li>Besonderheit: Kein Darlehensvertrag oder Identitätsnachweis notwendig.</li><li>Verfügbarkeit: Deutschland</li><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li><li>Mindest- Maximalbetrag: i.d.R. 20€ - 1.500€ (ggf. auch höhere Beträge möglich)<br></li></ul><br><p><b>Santander Ratenkredit / Finanzierung:</b></p><ul><li>Laufzeiten: 6 - 72 Monate (0%-Finanzierung möglich)</li><li>Besonderheit: Komplett digitaler Prozess durch elektronische Unterschrift und Video-Legitimation.</li><li>Verfügbarkeit: Deutschland, Österreich, Niederlande, Schweden, Dänemark, Norwegen, Finnland, Großbritannien</li><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li><li>Mindest- Maximalbetrag: i.d.R. 99€ - 100.000€<br></li></ul><br><p><b>Zinia Buy Now Pay Later - Rechnungskauf:</b></p><ul><li>Verfügbarkeit: Deutschland Niederlande</li><li>Besonderheit: Kein Darlehensvertrag oder Identitätsnachweis notwendig.</li><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li><li>Mindest- Maximalbetrag: i.d.R. 5€ - 750€<br></li></ul><br><p><b>Swedbank Pay Rechnungskauf:</b></p><ul><li>Verfügbarkeit: Schweden, Dänemark, Norwegen</li><li>Besonderheit: Kein Darlehensvertrag oder Identitätsnachweis notwendig.</li><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li><li>Mindest- Maximalbetrag: i.d.R. 5€ - 750€</li></ul><p><br></p><h4><b>Open Banking</b></h4><p>Open Banking ermöglicht es Kund:innen, während des Checkout-Prozesses den Kaufbetrag über den Online-Banking Zugang in Echtzeit zu überweisen. Sie erhalten sofort eine Transaktionsbestätigung und können die Ware direkt versenden. Ivy kombiniert dabei als grüne Bezahlmethode die Themen Payment mit Nachhaltigkeit und senkt durch Open Banking Transaktionsgebühren strukturell. Diese Kosteneinsparungen nutzt Ivy, um Händlern die günstigsten Transaktionsgebühren am Markt anzubieten und zugleich mit jeder Transaktion Klimaschutzprojekte zu finanzieren. Die Direktüberweisung ist ein Angebot der Santander, kann aber von allen Kunden aller Banken genutzt werden, die über ein Konto mit Online Banking verfügen. Als Deutschlands bekannteste Lösung rundet die Sofortüberweisung das Open Banking Angebot des payever Checkouts ab.</p><p><b>Ivy:</b></p><p></p><ul><li>Besonderheit: Ivy schützt z.B. mit jedem Einkauf 1 Quadratmeter deutschen Wald, notariell beurkundet, ohne extra Kosten für Sie oder Ihre Kund:innen.</li><li>Verfügbarkeit: Deutschland, Finnland, Frankreich, Frankreich, Italien, Estland, Litauen, Niederlande, Portugal, Spanien, Österreich, Großbritannien, Belgien, Ungarn, Irland, Lettland, Polen, Australien</li></ul><p></p><ul><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li></ul><br><p><b>Santander Direktüberweisung:</b></p><p></p><ul><li>Besonderheit: Gute Konditionen insbesondere in Kombination mit weiteren Santander Zahlarten.</li><li>Verfügbarkeit: Deutschland, Österreich, Schweiz</li><li>Transaktionsgebühren: Wenden Sie sich für ein individuelles Angebot gerne an support@payever.de.</li></ul><br><p></p><p><b>Sofortüberweisung (Klarna):</b></p><p>Die moderne Version der Vorkasse: Der Kunde überweist via Online-Banking den Kaufbetrag, Sie erhalten sofort eine Transaktionsbestätigung und können die Waren direkt versenden.</p><p></p><ul><li>Verfügbarkeit: Deutschland, Österreich, Niederlande, Belgien, Spanien, Italien, Schweiz, Polen, Großbritannien</li><li>Transaktionsgebühren: 0,8% + 0,25€ Fixgebühr</li></ul><p><br></p><p></p><h4><b>Kreditkarten&nbsp;</b></h4><p>Akzeptieren Sie via Stripe oder Swedbank Pay alle gängigen Kreditkarten: Visa, Master, American Express, JCB und Diners.&nbsp;</p><ul><li>Verfügbarkeit: Weltweit&nbsp;</li><li>Transaktionsgebühren:&nbsp;1,4% + 0,25€ Fixgebühr auf in Europa ausgestellte Karten,&nbsp;&nbsp;2,9% + 0,25€ Fixgebühr außerhalb Europas ausgestellte Karten.</li></ul><p><br></p><h4><b>Wallets und lokale Zahlarten:</b></h4><p><b>Apple Pay:</b></p><p>Apple Pay ist die moderne Art zu bezahlen. Es ersetzt Bankkarten und Bargeld durch eine einfa­chere, sicherere und privatere Zahlungs­­methode, egal ob im Geschäft, auf einer Website oder in einer App.</p><ul><li>Verfügbarkeit: Weltweit&nbsp;</li><li>Transaktionsgebühren:&nbsp;1,4% + 0,25€ Fixgebühr auf in Europa ausgestellte Karten,&nbsp;&nbsp;2,9% + 0,25€ Fixgebühr außerhalb Europas ausgestellte Karten.</li></ul><br><p><b>Google Pay:</b></p><p>Der simple und schnelle Weg zum Bezahlen in Geschäften, in Apps oder im Web. Außerdem können Ihre Kund:innen Prämien sammeln und Ihre Lieblingskarten speichern - alles an einem Ort.</p><ul><li>Verfügbarkeit: Weltweit&nbsp;</li><li>Transaktionsgebühren:&nbsp;1,4% + 0,25€ Fixgebühr auf in Europa ausgestellte Karten,&nbsp;&nbsp;2,9% + 0,25€ Fixgebühr außerhalb Europas ausgestellte Karten.</li></ul><p><b><br></b></p><p><b>PayPal&nbsp;</b></p><p>Der weltweit beliebte Zahlungsanbieter bietet Ihnen und Ihren Kunden zusätzlichen Schutz bei verlorenen Sendungen und Betrugsversuchen.&nbsp;</p><ul><li>Verfügbarkeit: Weltweit</li><li>Transaktionsgebühren:&nbsp;Zwischen 1,49% bis 2,49% (abhängig vom monatlichen Gesamtvolumen) + 0,35€ Fixgebühr</li></ul><p><br></p><h4><b>Sonstiges:</b></h4><p><b>Vorkasse:</b></p><p>Bei der Vorkasse überweist der Kunde Ihnen das Geld im Voraus. Sie versenden die Waren, sobald das Geld eingetroffen ist.&nbsp;</p><ul><li>Verfügbarkeit: Weltweit</li><li>Transaktionsgebühren: Keine -&nbsp; die Vorkasse ist kostenlos!</li></ul><p><br></p><p><b>SEPA-Lastschrift</b></p><p>Die Lastschrift ist nach wie vor eine sehr gängige Zahlart: Ihr Kunde erteilt Ihnen hier die Erlaubnis, den Kaufbetrag direkt von seinem Konto einzuziehen.&nbsp;</p><ul><li>Verfügbarkeit: Europäischer Zahlungsraum (SEPA-Länder)</li><li>Transaktionsgebühren: 0,35€ Fixgebühr</li></ul><p><br></p><p><br></p><p><b>So erreichen Sie uns:</b></p><p>Für weiterführende Informationen oder ein Angebot der entsprechenden Zahlarten kontaktieren Sie uns gerne jederzeit per E-Mail via support@payever.de. Wir freuen uns auf Ihre Nachricht!</p>","installationManual":"<p>Die Integration ist einfach und erfordert kein Vorwissen oder Programmierkenntnisse! </p><p><br /></p>Folgen Sie einfach dieser Anleitung - hier erfahren Sie, wie Sie sich bei payever registrieren und wie Sie das Plugin installieren und in Betrieb nehmen können: <a href=\"https://support.payever.org/hc/de/articles/360012435820-Shopware-6\">https://support.payever.org/hc/de/articles/360012435820-Shopware-6</a><p><br /></p><p>Sollte es doch einmal ein Problem geben, senden Sie bitte unter Angabe Ihres payever Kontos und Ihrer Shopware Version  eine Schilderung (gerne mit Screenshot) an <a href=\"mailto:support@payever.de\">support@payever.de</a></p><p><br /></p><h2></h2><h2></h2>","shortDescription":"payever verbindet alle gängigen Zahlungsarten in nur einem Plugin: Von B2C/B2B Rechnungs-/Ratenkauf & Finanzierung bis Kreditkartenzahlung, PayPal, lokalen Zahlarten sowie Open Banking.","highlights":"Buy Now Pay Later: Rechnungs- oder Ratenkauf sowie Ratenkredit bzw. die klassische Finanzierung zu besten Kondition sowohl für Kund:innen als auch Händler:innen - in Zusammenarbeit mit unseren Partnern Santander und Openbank.\nNachhaltigkeit: Gemeinsam mit unserem exklusiven Partner Ivy können Sie und Ihre Kund:innen bei jeder Bezahlung zertifizierte Klimaschutzprojekte unterstützen - und das ohne extra Kosten.\nAlle Zahlarten: Mit payever Checkout können Sie Ihren Kund:innen alle gängigen Zahlarten über nur einen Partner anbieten, ohne mehrere Plugins installieren und warten zu müssen.\nKostenlos: payever selbst berechnet Ihnen weder eine Setup- noch Transaktionsgebühr - Sie tragen ausschließlich die Kosten der jeweiligen Zahlart selbst, teilweise sogar zu niedrigeren Partnerkonditionen.\nCheckout Branding: Passen Sie den payever Checkout vollständig nach Ihren Vorstellungen an - Laden Sie Ihr Logo hoch und passen Sie Farben, Felder und Buttons so an, dass der Checkout perfekt zu Ihrem Online-Shop passt.","features":"Point of Sale: Alle Zahlarten können Sie auch komplett digital in Ihrem Ladengeschäft verwenden - als Self-Checkout über QR Codes bzw. SMS/E-Mail und als Händlerversion über die payever Plattform oder Integration in Ihr bestehendes PoS-System.\nPay by Link: Der Bezahl-Link (auch als QR-Code) kann per E-Mail und SMS an Ihre Kunden versendet werden und funktioniert für alle Zahlarten. Damit ist Pay by Link die perfekte Lösung für Händler:innen, die spezielle Angebote an die Kunden versenden möchten oder Call Center Bestellungen abwickeln und für die eine Integration zu kompliziert ist. Alternativ kann man die Pay by Link Lösung auch über eine API in bestehende Prozesse bzw. System integrieren.\nBestellverwaltung: Durch die einfache Verwaltung können Sie alle Transaktionen sowohl aus Ihrem Shop-Backend als auch über Ihren payever Account steuern.\nSpezifische Einstellungen: Mit einem Klick können Sie Zahlarten aktivieren oder deaktivieren, unterschiedliche Zahlarten nach Warenkorbhöhe oder Kundenadresse steuern oder über Varianten die gleiche Zahlarten in unterschiedlichen Variation anbieten (z.B. verschieden Konditionen bei der Finanzierung).\nWidgets & Ratenrechner: Um auf Zahlarten wie Ratenkauf und Finanzierung sowie Ivy aufmerksam zu machen, können auf den relevanten Produktseiten spezifische Widgets implementiert werden um mehr Information oder direkt die monatliche Rate zu berechnen.\nProdukt Synchronisation: Mit dem Plugin können Sie auch ganz einfach Ihre Produkte über payever zu anderen Verkaufskanälen wie Marktplätze (z.B. Amazon, ebay), Produktvergleich (z.B. Google Shopping) und Social Media (z.B. Facebook Shops/Marketplace, Instagram) synchronisieren.\nCyber Security: Höchste Sicherheitsstandards garantieren wir durch die Nutzung neuster Technologien und regelmäßiger PCI Scans sowie jährliche externe Audits auf Grund enger Kooperationen mit Partnern aus dem hochregulierten Bankensektor.\nDSGVO: Alle Daten liegen auf ISO/IEC 27001 & PCI DSS zertifizierten Servern innerhalb der europäischen Union, um höchsten Compliance und Sicherheitsansprüchen gerecht zu werden.\nKundenservice: Unser kompetenter Support unterstützt Sie sowohl auf Deutsch als auch in Englisch und hilft Ihnen bei der Integration und bei der Lösung von technischen Problemen. Werktags erhalten Sie zwischen 9 und 18 Uhr innerhalb kürzester Zeit eine umgehende Rückmeldung."}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157389,"bookingKey":"Pevr250179638108","bookingText":"payever - One plugin. All payment methods . Free of charge.","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpinLefB","preview":true,"priority":1,"id":117251},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpC41beZ","preview":false,"priority":11,"id":117252},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1DvFQe","preview":false,"priority":10,"id":117254},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpK5BesZ","preview":false,"priority":9,"id":117253},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZlVJJZ","preview":false,"priority":8,"id":117256},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuO3gHc","preview":false,"priority":6,"id":117255},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php86mZfJ","preview":false,"priority":6,"id":117258},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWY6djU","preview":false,"priority":5,"id":53456},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWmxpcd","preview":false,"priority":5,"id":117257}],"comments":[],"ratingAverage":0,"label":"payever Checkout - Composable Payment Gateway. For Free.","description":"<h3><b>payever Checkout - Composable Payment Gateway. For Free.</b></h3><p>With payever Checkout you can offer your customers a variety of payment methods - from B2C/B2B Buy Now Pay Later, Installments &amp; Financing to Credit Card payments, PayPal, local payment methods and real time bank transfers based on Open banking technologies - with just one plugin. You can also benefit from an exclusive selection of payment options from our close partners Santander, Openbank and Ivy.</p><p>More than 5,000 merchants in 9 countries trust in us - with a simple integration and just a few clicks you can be part of it too!</p><p><a href=\"https://www.getpayever.com/checkout\" target=\"_blank\" rel=\"noreferrer noopener\">www.getpayever.com/checkout</a></p><p><br /></p><h3><b>Our payment methods</b></h3><h4><b>Buy Now Pay Later:</b></h4><h3></h3><p>Together with our partners Santander, Openbank and Swedbank we offer exclusive Buy Now Pay Later options. You have the choice between invoice, installments and installment loans.</p><p><b><br /></b></p><p><b>Santander BNPL:</b></p><p></p><ul><li>Payment period: 30 days</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Availability: Germany, Norway</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br /></p><p></p><p><b>Santander BNPL / Installments:</b></p><p></p><p></p><ul><li>Payment period: 3 - 36 Month (customer interest rate between 0% - 7,9%)</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Availability: German</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br /></p><p></p><p></p><p><b>Santander Financing / Installments:</b></p><p></p><ul><li>Payment period: 6 - 72 Month (0% financing possible)</li><li>Special Feature: The process is completely digital with video legitimation and electronic signing.</li><li>Availability: Germany, Austria, Netherlands, Belgium, Sweden, Denmark, Norway, Finland, Great Britain</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br /></p><p></p><p><b>Zinia Buy Now Pay Later - Invoice:</b></p><p></p><ul><li>Availability: Germany, Netherlands</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br /></p><p></p><p><b>Swedbank Pay Invoice:</b></p><p></p><ul><li>Availability: Sweden, Denmark, Norway</li><li>Special Feature: No loan agreement or identity check necessary.</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><p></p><h3></h3><p><br /></p><h4><b>Open Banking:</b></h4><p>Open Banking enables your customers to transfer the purchase amount in real time via online banking access during the checkout process. You will immediately receive the transaction confirmation and can start the delivery process. As a green payment method, Ivy combines the topics payment with sustainability and structurally reduces transaction fees through open banking. Ivy uses these cost savings to offer merchants the lowest transactions fees on the market and to support climate protection projects with every transaction. Instant Payments is an offer by Santander, which can be used by all customers from all banks with online banking access. Sofortüberweisung rounds off the Open Banking payment options available in the payever Checkout.</p><p><b><br /></b></p><p><b>Ivy:</b></p><p></p><ul><li>Special Feature: Ivy supports climate protection projects with every purchase without any additional costs for you or your customer.</li><li>Availability: Germany, Finland, France, Italy, Estonia, Lithuania, Netherlands, Portugal, Austria, Spain, Great Britain, Belgium, Hungary, Ireland, Latvia, Poland, Australia</li><li>Transaction fees: Please contact support@payever.de to receive an individual offer.</li></ul><br /><p></p><p><b>Santander Instant Payments:</b></p><p></p><ul><li>Special Feature: Beneficial terms and conditions in combination with other Santander payment methods.</li><li>Availability: Germany, Austria, Switzerland</li><li>Transactions fees: Please contact support@payever.de to receive an individual offer.</li></ul><br /><p></p><p><b>Sofort (Klarna):</b></p><p>The modern version of prepayment. The customer transfers the purchase amount via online banking, you immediately receive a transactions confirmation and can start the shipping process.</p><p></p><ul><li>Availability: Germany, Austria, Netherlands, Belgium, Spain, Italy, Switzerland, Poland, Great Britain</li><li>Special Feature: Partner Conditions of 0,8% + 0,25€ fix</li></ul><p><br /></p><p></p><h4><b>Credit Cards:</b></h4><p><b>Stripe:</b></p><p>Via Stripe or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.</p><p></p><ul><li>Availability: Worldwide</li><li>Special Feature: Smooth onboarding for credit card acceptance with Stripe.</li><li>Transaction Fees: 1.4% + € 0.25  on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.</li></ul><p><br /></p><p><b>Swedbank Pay:</b></p><p></p><ul><li>Via Swedbank Pay or you can accept all common credit cards: Visa, Master, American Express, JCB and Diners.</li><li>Availability: Worldwide</li></ul><p></p><ul><li>Special Feature: Smooth onboarding for credit card acceptance with Swedbank Pay.</li><li>Transaction Fees: Please contact support@payever.de to receive an individual offer.</li></ul><p><br /></p><h4><b>Wallets and Local Payment Methods:</b></h4><p>Offer your customers the most common wallet solutions as well as local payment options in each of the markets. </p><p><b><br /></b></p><p><b>Apple Pay:</b></p><p>Apple Pay replaces debit cards and cash with a simpler, safer, and more private payment method, wether in store on a website or in an app.</p><ul><li>Availability: Worldwide</li><li>Transaction Fees: 1.4% + € 0.25  on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.</li></ul><p><br /></p><p><b>Google Pay:</b></p><p>The simple way to pay in store, in apps or in online shops. Your customers can also collect bonuses and store their favourite cards - all at one place.</p><ul><li>Availability: Worldwide</li><li>Transaction Fees: 1.4% + € 0.25  on cards issued in Europe, 2.9% + € 0.25 on cards issued outside Europe.</li></ul><p><br /></p><p><b>PayPal:</b></p><p>This  payment provider is  popular worldwide and offers you and your customers extra protection in case of lost parcels and attempts of fraud.</p><p></p><ul><li>Availability: Worldwide</li><li>Special Feature: Smooth onboarding by simply connecting your existing PayPal account.</li><li>Transaction fees: Between 1.49% to 2.49% (depending on the total monthly volume) + € 0.35 fixed fee.</li></ul><p></p><p><br /></p><h4><b>Other:</b></h4><p><b>Prepayment:</b></p><p>The customer transfers the money in advance and you ship the goods as soon as the money has arrived. </p><p></p><ul><li>Availability: Worldwide</li><li>Special Feature: Fast onboarding and instant availability with just a few clicks.</li><li>Transaction fees: None - Wire transfer is free of charge!</li></ul><p><br /></p><p><b>Direct Debit (SEPA):</b></p><p>Direct Debit is still a very common payment method: During the checkout process your customers just give permission to debit the amount from their bank account.</p><p></p><ul><li>Availability: 36 countries within the Single Euro Payment Area (SEPA)</li><li>Special Feature: Smooth onboarding for credit card acceptance with Stripe.</li><li>Transactions fees: 0,35€ fix</li></ul><p><br /></p><p><b>How to get in touch with us:</b></p><p>To receive further information or an offer for one of our payment methods, please contact us at any time by email: support@payever.de. We look forward to hearing from you!</p><p></p>","installationManual":"<p>The integration is easy and doesn't require any development!</p><p>Should there ever be a problem, please send a description (if possible with screenshot) and the email address you have used to create you payever account to support@payever.de.</p><p><br /></p><p></p><p>Step 1:</p><p>Please first create a payever account at https://commerceos.payever.org/registration/business and configure the payment methods you want to integrate.</p><p><br /></p><p>Step 2:</p><p>The next step is to download the plugin and adjust some settings. </p><p>Detailed instructions can be found here: <a href=\"https://support.payever.org/hc/en-us/articles/360023894874\">https://support.payever.org/hc/en-us/articles/360023894874</a></p>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"<p>Fixed discount issue</p>","creationDate":{"date":"2023-07-14 22:17:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>- Fixed refund action for IVY payment</p><p>- Claim action for specific payments</p><p>- Small compatibility fixes for latest shopware 6 version</p>","creationDate":{"date":"2023-07-03 09:43:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.22.2","text":"<p>- Added date selection for logs to allow downloading logs from previous days;</p><p>- Accounting for tabs that were added in  6.5.0RC4;</p>","creationDate":{"date":"2023-05-25 10:04:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.22.1","text":"<p>- Bug fix: disabled changing of order status based on payment actions;</p><p>- Improved  price rounding;</p>","creationDate":{"date":"2023-05-03 09:41:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.21.0","text":"<p>- Added Organization name field;</p><p>- Shopware 6.4.19.0 compatibility;</p><p>- Added locale to create payment request;</p>","creationDate":{"date":"2023-02-14 08:39:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.20.1","text":"<p>- improved plugin registration functionality and removed v1 requests;</p>","creationDate":{"date":"2023-02-08 11:55:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.20.0","text":"<p>- partial action improvements;</p>","creationDate":{"date":"2023-02-01 16:55:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.19.1","text":"<p>- fixed billing firstname and lastname;</p>","creationDate":{"date":"2022-12-20 14:29:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.18.0","text":"<p>- Added \"allow-popups-to-escape-sandbox\" sandbox attribute to iframe;</p><p>- Fixed payment methods variants issue;</p><p>- Controlling pending amount after performing a refund;</p>","creationDate":{"date":"2022-07-29 08:51:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.17.0","text":"<p>- fixed wrongfully updating non-payever transactions;</p>","creationDate":{"date":"2022-05-23 10:23:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.16.2","text":"<p>- compatibility with Shopware 6.4.7.0;</p><p>- updated payever logo;</p>","creationDate":{"date":"2021-12-27 21:04:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.16.1","text":"<p>- fixed iframe issue;</p>","creationDate":{"date":"2021-11-12 16:27:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.16.0","text":"<p>- added shipping address to create payment request to allow for automatic  hiding of payment options that do not allow an alternative shipping address;</p><p>- processed requests with invalid tokens;</p><p><br /></p>","creationDate":{"date":"2021-11-12 16:24:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.15.1","text":"<p>- adjusted importing Shopware 6 global object;</p>","creationDate":{"date":"2021-11-01 09:07:16.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.15.0","text":"<p>- fixed hidden payment options for shopware 6.4;</p>","creationDate":{"date":"2021-09-14 13:01:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.14.0","text":"<p>- Fixed error message upon synchronization;</p><p>- Processed callback urls for finance express;</p><p>- PHP8 compatibility;</p><p>- Disabling product sync on error;</p><p>- Added support for virtual products in the cart;</p><p><br /></p>","creationDate":{"date":"2021-07-23 08:55:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.13.1","text":"<p>- fixed iframe mode for Showpare 6.4</p>","creationDate":{"date":"2021-05-19 15:36:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.13.0","text":"<p>- Added compatibility for Shopware Version 6.4</p>","creationDate":{"date":"2021-05-12 09:35:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.12.0","text":"<p>- Improved expired shop session handling in checkout callbacks</p>","creationDate":{"date":"2021-04-05 09:49:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.11.0","text":"<p>- Made valid sku in cart;</p><p>- Switched products and inventory synchronization to third party products;</p>","creationDate":{"date":"2021-03-01 12:52:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.1","text":"<p>- fixed issue with editing item variants;</p>","creationDate":{"date":"2021-03-01 08:28:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.10.0","text":"<p>- implemented submit payments;</p>","creationDate":{"date":"2021-01-25 16:35:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.1","text":"<p>- Compatibility with Santander Austria: replaced Order-ID with order number;</p>","creationDate":{"date":"2021-01-15 11:07:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.9.0","text":"<p>- implemented products and inventory synchronization;</p><p>- compatibility with Shopware 6.3.x;</p>","creationDate":{"date":"2020-11-20 18:29:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.8.0","text":"<p>- implemented payment notifications signature;</p><p>- implemented auto-cancelling for not finished orders;</p><p>- fixed error in checkout after payment;</p>","creationDate":{"date":"2020-07-31 16:22:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.7.0","text":"<p>- mapped status in progress to payment status Open/In Progress (since Shopware 6.2);</p><p>- Implemented automatic capture of payment on order status \"done\";</p><p>- Implemented automatic cancellation of payment on order status \"cancelled\";</p><p>- implemented partial refund (added a field to enter amount to be refunded);</p>","creationDate":{"date":"2020-06-24 18:07:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.2","text":"<p>- removed fee description from title</p>","creationDate":{"date":"2020-06-08 13:14:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.1","text":"<p>- Shopware 6.2 transaction statuses compatibility</p>","creationDate":{"date":"2020-05-25 09:33:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<p>- added salutation to create payment request</p>","creationDate":{"date":"2020-05-08 18:58:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<p>- included payever sdk into the plugin in order to simplify installation process</p>","creationDate":{"date":"2020-04-17 16:55:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<p>- Plugin registry and commands</p><p>- Embedded support info</p><p>- Fixes for transaction status updates</p><p>- Compatibility with Shopware 6.1</p>","creationDate":{"date":"2020-01-14 08:38:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<p>- Admin UI and config adjustments. </p><p>- Implemented multichannel config support. </p><p>- Implemented payment option variants. </p><p>- Refactoring.</p>","creationDate":{"date":"2019-12-12 15:01:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>First Plugin for Shopware 6</p>","creationDate":{"date":"2019-10-01 18:56:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Pevr250179638108","redirectToStore":false,"lowestPriceValue":0}