{"id":9302,"name":"CbaxModulManufacturers","code":"cbax951420758690","lastChange":{"date":"2023-07-18 11:16:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2HZo48","examplePageUrl":"","moduleKey":"CbaxModulManufacturers","creationDate":{"date":"2019-06-28 08:59:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-10-28 08:44:49.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-06-13 11:04:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":429,"prefix":"cbax","name":"coolbax","website":"//www.coolbax.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpff89q3"},"infos":[{"id":14357,"name":"Hersteller Professionell | Pro","description":"<p><strong>*** Ab Version 2.0.1 kann für jeden Hersteller eine eigenen Erlebniswelten zugewiesen werden***<br>*** Ab Version 1.1.5 gestalten Sie die Seiten: Herstellerübersicht und Herstellerdetailseiten in den Erlebniswelten ***</strong></p><h3>Hersteller Professionell | Pro</h3><p>Sie möchten für ihren Shopware 6 Shop automatisch Herstellerseiten und eine Herstellerübersicht erzeugen? Mit unserem Plugin können Sie das mit wenigen Klicks verwirklichen. Eine Vielzahl an Einstellungen und Optionen bitten Ihnen die Möglichkeit dieses Plugin problemlos an ihr Shopdesign anzupassen. Mit der Plugin Version 1.1.5 sind Sie noch flexibler und können die ganze Vielfalt der Erlebniswelten nutzen!</p><p><strong>Die Hersteller Übersichtseite&nbsp;</strong>bietet Ihren Kunden einen schnellen Überblick all ihrer angebotenen Hersteller/Marken. Diese Seite wird automatisch, anhand Ihrer angelegten Hersteller ermittelt und nach Alphabet sortiert. Über eine Legende kann der Kunden sehen, unter welchen Buchstaben, Zahlen oder Zeichen er Hersteller/Marken finden kann. Mit Klick auf einen aktiven z. B. Buchstaben slidet der Kunde direkt zu dem gewählten&nbsp; Buchstaben. Eine andere Option ermöglicht es ihm, alle nicht ausgewählten&nbsp; Buchstaben auszublenden. Mithilfe des Top-Hersteller-Sliders können Sie einzelne Hersteller hervorheben. Wer als Top-Hersteller deklariert wird, entscheiden Sie! Ein individuelles Aussehen der Übersichtsseite können Sie unter anderem mithilfe von Banner + Anzeigeart, Headline &amp; Text + Positionierung, Template und Darstellung der Hersteller/Marken erzeugen. Mit der Version 1.1.5 gestalten Sie diese Seite über die Erlebniswelten und können die Seite somit noch flexibler und individueller Gestalten!</p><p><strong>Die Herstellerseiten&nbsp;</strong>bieten Ihnen die optimale Lösung, um einen Hersteller oder Marke bestmöglich zu präsentieren! Ihre Kunden sehen auf einem Blick, welche Produkte Sie von einem Hersteller/ Marke anbieten. Die Ermittlung der Produkte erfolgt automatisch und muss nicht von Ihnen per Hand zugewiesen werden. Unser Plugin verlinkt automatisch die Hersteller Logos auf den Artikeldetailseiten mit den entsprechenden Herstellerseiten.<br> Für alle Herstellerseiten kann nochmals eingestellt werden, wie das Banner dargestellt, wo der Hersteller Text &amp; Headline angezeigt und welches Produktlayout verwendet werden soll. Für eine optimale Darstellung der Hersteller/Marken haben Sie die Möglichkeit ein Banner sowie Text für jeden Hersteller zu hinterlegen. Ab der Plugin Version 2.0.1 können Sie jedem Hersteller eine eigenen Erlebniswelt zuweisen und können somit noch individueller die Seiten gestallten.</p><p><strong>Die linke Sidebar&nbsp;</strong>kann optional eingeblendet werden. Durch sie haben Ihre Kunden eine zusätzliche Möglichkeit zwischen den Herstellern zu navigieren. Hinter der alphabetischen Sortierung der Buchstaben verbergen sich die Hersteller/Marken. Mit Klick auf einen Buchstaben öffnet sich das Feld und die Hersteller werden sichtbar. Ist der Kunde auf einer Herstellerseite, kann die aktive Buchstabengruppe auch eingeblendet bleiben. Über einen Button kommen ihre Kunden wieder zur Hersteller Übersichtsseite.<br> Weiterhin haben Sie die Möglichkeit, die Headline über der Sidebar auszublenden, die Shop Kategorien anzuzeigen oder die Artikelanzahl eines Herstellers darzustellen.</p><p><strong>Die Artikel Detailseite</strong> kann optional erweitert werden. Sie haben die Möglichkeit einen zusätzlichen Tab, nach der Beschreibung, einblenden zu lassen. Der Tab \"Infos zum Hersteller\" beinhaltet die Herstellerbeschreibung und einen Link zur Herstellerseite. Des Weiteren kann über oder unter der Beschreibung ein Hersteller Slider dargestellt werden. In diesem können alle Produke oder kategoriebezogene Produke des Herstellers angezeigt werden. Die Darstellung der Artikel ist wählbar genauso ob eine Headline, das Logo und/oder die Hersteller Beschreibung im Slider angezeigt werden soll.</p><p><strong><a href=\"https://demo-6.coolbax.com/hersteller/\" target=\"_blank\" rel=\"noreferrer noopener\">Im Demoshop testen</a></strong><br><strong><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Das Handbuch ansehen</a></strong></p><h3>Funktionsumfang &amp; Vorteile</h3><ul><li><b>NEU: Herstellerseiten als Erlebniswelten Seiten konfigurierbar (ab Plugin Version:&nbsp; 1.1.5 )</b></li><li><b>NEU:&nbsp;Jeder Hersteller kann eine eigenen Erlebniswelten zugewiesen werden&nbsp;</b><b>(ab Plugin Version:&nbsp; 2.0.1 )</b></li><li>Professionelle Darstellung der Hersteller / Marken</li><li>Erzeugung von Content für die Suchmaschinen</li><li>Übersichtliche Darstellung aller Hersteller/Marken als Übersichtseite für ihre Kunde</li><li>Überblick aller Artikel eines Hersteller/Marken</li><li>Verlinkung zu den Herstellerseiten über das Logo des Hersteller/Marken auf der Detailseite</li><li>Breadcrumb wird automatisch gesetzt und ist SEO optimiert (Rich Snippets – Breadcrumbs)</li><li>Twig-Blöcke integriert um eine leichtere Änderung des Templates zu ermöglichen</li><li>Hersteller Produktslider&nbsp;</li><li>Berücksichtigung der Verfügbarkeit von Varianten bei Anzeige von Herstellern</li><li>Individuelle Metatitel für Hersteller zuweisbar</li></ul><p>EINSTELLUNGEN FÜR DIE ÜBERSICHTSEITE:</p><ul><li>Anzeigefilter (aller Hersteller oder nur Hersteller mit Artikel)</li></ul><p>SEO EINSTELLUNGEN:</p><ul><li>SEO-Basispfad für die Übersichtsseite festlegen</li><li>SEO-Basispfad auch für Herstellerseite übernehmen (ja oder nein)</li><li>Slash am Ende der Url (ja oder nein)</li></ul><p>PLUGIN EINSTELLUNGEN FÜR ARTIKEL DETAILSEITE:</p><ul><li>Hersteller Tab anzeigen (ja oder nein)</li><li>Produkt Slider anzeigen (ja oder nein)</li><li>Position des Sliders (über oder unter der Beschreibung)</li><li>Headline des Sliders anzeigen (ja oder nein)</li><li>Hersteller (Logo und Name) im Slider anzeigen (ja oder nein)</li><li>Hersteller Beschreibung im Slider anzeigen (ja oder nein)</li><li>Maximale Höhe der Hersteller Beschreibung</li><li>Minimale Breite der Sliderelemente</li><li>Slider automatisch Rotieren (ja oder nein)</li><li>Produkte im Slider kategoriebezogen anzeigen (ja oder nein)</li><li>Sortierung im Slider (Name, Preis oder Erscheinungsdatum auf- und absteigend )</li><li>Maximale Anzahl von Produkten</li></ul><p>EINSTELLUNGEN FÜR HERSTELLER IM HERSTELLER MODUL:</p><ul><li>Hersteller können einzeln ausgeblendet werden</li><li>Alternative URL (z.B. um auf Landingpages zu verweisen)</li><li>Einstellung ob Tob Hersteller oder nicht</li><li>Banner zuweisen</li><li>Meta-Keyword und Meta-Description hinterlegen</li></ul><p>ERLEBNISWELTEN ELEMENTE UND EINSTELLUNGEN:</p><ul><li>Coolbax Herstellernavigation\n\n<ul><li>Navigation der Legende (zum Buchstaben scrollen oder alle anderen Buchstaben ausblenden)</li><li>Scroll-Geschwindigkeit zum Hersteller definieren</li><li>Scroll-Abstand zum Hersteller bestimmen</li></ul></li><li>Coolbax Herstellerfilter\n\n<ul><li>Headline anzeigen (ja oder nein)</li><li>Aktive Buchstabengruppe geöffnet lassen (ja oder nein)</li><li>Artikelanzahl anzeigen (ja oder nein)</li></ul></li><li>Coolbax Hersteller Listing\n\n<ul><li>Darstellung der Hersteller ( Logo und/oder Herstellername)</li><li>Template (zwei-, drei-, vierspaltig oder Slider)</li><li>Höhe der Herstellerbox festlegen</li><li>Artikelanzahl anzeigen (ja oder nein)</li></ul></li><li>Coolbax Herstellerbanner</li><li>Coolbax Herstellerüberschrift\n\n<ul><li>Text vor dem Herstellernamen festlegen</li><li>Text nach dem Herstellernamen festlegen</li></ul></li><li>Coolbax Produkts Listing\n\n<ul><li>Layout-Typ definieren (Standard, Großes Bild, Minimaler Inhalt)</li></ul></li><li>Coolbax Top Hersteller Slider\n\n<ul><li>Artikelanzahl anzeigen (ja oder nein)</li></ul></li><li>Coolbax Bild-Text, Spalten flexibel</li></ul><h3>Herstellerübersicht und -detailseiten über Erlebniswelten konfigurieren</h3><p>Ab der Plugin Version 1.1.5 wird Ihnen nicht mehr vorgeschrieben wo ein Element der Seite platziert wird. Sie können selbst bestimmen, an welcher Stelle welches Element platziert werden soll und ob Sie es überhaupt nutzen möchten. Die ganze Vielfalt und Flexibilität der Erlebniswelten steht Ihnen jetzt auch für die Herstellerübersicht und –detailseiten zur Verfügung.</p><h3>Eine besondere Seite für einen besonderen Hersteller</h3><p>Sie&nbsp; möchten einen Hersteller noch besser darstellen, als es mit unserem Plugin&nbsp; geht. Kein Problem. Sie haben die Möglichkeit, eine alternative URL für&nbsp; Hersteller zu hinterlegen. Sie können z. B. eine Landingpage für einen&nbsp; Hersteller anlegen und verlinken. Ihre Kunden landen dann nicht mehr auf&nbsp; unserer Herstellerseite, sondern auf die extra angelegte Landingpage.</p><h3>Alle Seiten SEO optimiert</h3><p>Alle erzeugten Seiten des Plugins können mit Meta-Keyword und Meta-Description versehen werden. Zusätzlich haben Sie die Möglichkeit, den SEO Pfade zu beeinflussen. Sie entscheiden, unter welchen Namen (SEO-Basispfad) die Übersichtsseite aufgerufen werden soll. Des Weiteren können Sie konfigurieren, ob der SEO-Basispfad auch vor den einzelnen Hersteller ausgegeben werden soll und ob ein Slash am Ende der Url ausgegeben werden soll.</p><h3>Aufwertung Ihrer Detailseiten</h3><p>Mit diesem Plugin erstellen Sie nicht nur eine Hersteller Übersichtsseite bzw. Herstellerseiten sondern können ganz nebenbei Ihre Produktdetailseiten aufwerten. Mit diesem Plugin haben Sie die Möglichkeit, deinen Slider auf der Detailseite einzubinden, welcher weitere Produkte des Herstellers anzeigt. Zudem haben Sie weitere Filter und Sortierungsmöglichkeiten. Sie können z. B. die Artikel des Herstellers aus der gleichen Kategorie anzeigen lassen oder nach Name, Preis, Erscheinungsdatum sortieren. Sie können zudem noch einen zusätzlichen Tab integrieren, welcher die Herstellerbeschreibung ausgibt.</p><p><strong>Fragen</strong><br> Sie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","shortDescription":"Professionelle Hersteller- bzw. Markenseite mit Übersichtsseite, Logo-Anzeige mit Namen & Artikelanzahl, SEO-Optimierung, Filtermöglichkeiten, Hersteller Artikel Slider auf Detailseite","highlights":"Professionelle und übersichtliche Darstellung der Hersteller / Marken\nVielseitige Darstellungsmöglichkeiten und Templates mittels Erlebniswelten\nZuweisung  eigenen Erlebniswelten für jeden Hersteller möglich\nGesamte Plugin ist SEO optimiert\nHersteller Tab und/oder Herstellerslider auf Artikel Detailseite anzeigen","features":"Anzeigeart des Banners konfigurierbar (Standard und Vollflächig)\nPositionierung von Headline, Text (über oder unter dem Listing)\nDarstellung der Hersteller ( Logo und/oder Herstellername)\nTemplate für Übersichtsseite (zwei-, drei-, vierspaltig oder Slider)\nAnzeigefilter (aller Hersteller oder nur Hersteller mit Artikel)\nAnzeige der Artikelanzahl (im Listing und/oder Top Hersteller Slider, nicht anzeigen)\nNavigation der Legende (zum Buchstaben scrollen oder alle anderen Buchstaben ausblenden)\nHersteller Links werden zur sitemap xml hinzugefügt\nAuswahl des Produkt Layout (minimaler Inhalt, Standard oder großes Bild)\nSidebar kann anzeigt oder ausgeblendet werden\nSEO-Basispfad für die Übersichtsseite\nMeta-Keyword und Meta-Description kann für jede Seite hinterlegt werden\nVielzahl an Twig-Blöcke integriert um eine leichtere Änderung des Templates zu ermöglichen\nHersteller können einzeln ausgeblendet werden\nAlternative URL (z.B. um auf Landingpages zu verweisen)"},{"id":14376,"name":"Professional Manufacturer | Pro","description":"<h3>Manufacturer professional | Pro</h3><p>Would you like to automatically generate a manufacturer's page and a manufacturer's overview for your Shopware 6 shop? With our plugin you can achieve this with just a few clicks. A variety of settings and options ask you to easily adapt this plugin to your shop design.</p><p><strong>The manufacturer overview page </strong>offers your customers a quick overview of all of their manufacturers / brands. This page is automatically determined based on the manufacturers you have created and sorted according to alphabet. Using a legend, the customer can see under which letters, numbers or characters he can find manufacturers / brands. By clicking on an active z. B. The customer slides letters directly to the selected letter. Another option enables him to hide all unselected letters. With the help of the top manufacturer slider, you can highlight individual manufacturers. You decide who is declared as the top manufacturer. The top manufacturer slider is always shown above the legend.<br />\n\nYou can create an individual look for the overview page using banners + display type, headline &amp; text + positioning, template and representation of the manufacturers / brands.</p><p><strong>The manufacturer pages </strong>offer you the optimal solution to present a manufacturer or brand in the best possible way! Your customers can see at a glance which products they offer from a manufacturer / brand. The products are determined automatically and you do not have to assign them manually. Our plugin automatically links the manufacturer logos on the article detail pages with the corresponding manufacturer pages.<br />\nFor all manufacturer pages, you can set again how the banner is displayed, where the manufacturer displays text &amp; headline and which product layout is to be used. For an optimal representation of the manufacturers / brands, you have the option of storing a banner and text for each manufacturer. The manufacturer's logo is always presented to the left of the text.</p><p><strong>The left sidebar </strong>can optionally be shown. They give your customers an additional opportunity to navigate between manufacturers. The manufacturers / brands are hidden behind the alphabetical sorting of the letters. Clicking on a letter opens the field and the manufacturers become visible. If the customer is on a manufacturer's website, the active group of letters can also remain displayed. With a button your customers come back to the manufacturer overview page.<br />\nYou also have the option of hiding the headline above the sidebar, displaying the shop categories or displaying the number of items from a manufacturer.</p><p><strong>The item details page</strong> can optionally be expanded. You have the option of displaying an additional tab after the description. The tab \"Information about the manufacturer\" contains the manufacturer's description and a link to the manufacturer's website. Furthermore, a manufacturer slider can be displayed above or below the description. All products or category-related products of the manufacturer can be displayed here. The representation of the article can be selected as well as whether a headline, the logo and / or the manufacturer description should be displayed in the slider.</p><p><strong><a href=\"https://demo-6.coolbax.com/en/cbax/manufacturer/index\" target=\"_blank\" rel=\"noreferrer noopener\">Test in the demo shop</a></strong><br /><strong><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">View the manual (in German)</a></strong></p><h3>Features &amp; benefits</h3><ul><li>Professional representation of the manufacturer / brandn</li><li>Creation of content for the search engines</li><li>Clear representation of all manufacturers / brands as an overview page for their customers</li><li>Overview of all articles of a manufacturer / brand</li><li>Link to the manufacturer's website via the manufacturer's / brand logo on the detail page</li><li>Breadcrumb is set automatically and is SEO optimized (Rich Snippets - Breadcrumbs)</li><li>Twig blocks integrated to make it easier to change the template</li></ul><p>SETTINGS FOR THE OVERVIEW PAGE:</p><ul><li>Banner and display type of the banner (standard and full area)</li><li>Headline, text and positioning (above or below the listing)</li><li>Representation of the manufacturer (logo and / or manufacturer name)</li><li>Template (two, three, four columns or slider)</li><li>Display filter (all manufacturers or only manufacturers with articles)</li><li>Display of the number of articles (do not show in listing and / or top manufacturer slider)</li><li>Navigation of the legend (scroll to the letter or hide all other letters)</li><li>Scroll speed and scroll distance to manufacturer</li></ul><p>SEO SETTINGS:</p><ul><li>Define the basic SEO path for the overview page</li><li>Accept SEO base path also for manufacturer side (yes or no)</li><li>Slash at the end of the url (yes or no)</li></ul><p>MANUFACTURER SITE SETTINGS:</p><ul><li>Display type of the banner (standard and full area)</li><li>Position manufacturer text (above or below the listing)</li><li>Selection of the product layout (minimal content, standard or large image)</li></ul><p>SETTINGS FOR EVERY INDIVIDUAL MANUFACTURER:</p><ul><li>Manufacturers can be hidden individually</li><li>Alternative URL (e.g. to refer to landing pages)</li><li>Attitude whether Tob manufacturer or not</li><li>Assign banners</li><li>Store meta keyword and meta description</li></ul><p>LEFT SIDEBAR SETTINGS:</p><ul><li>Show sidebar (yes or no)</li><li>Show headline (yes or no)</li><li>Show shop category (yes or no)</li><li>Leave active group of letters open (yes or no)</li><li>Show number of items (yes or no)</li></ul><p>SETTINGS FOR ITEM DETAIL PAGE:</p><ul><li>Show manufacturer tab (yes or no)</li></ul><p>SETTINGS FOR ITEM DETAIL PAGE:</p><ul><li>Show product slider (yes or no)</li><li>Position of the slider (above or below the description)</li><li>Show headline of slider (yes or no)</li><li>Show manufacturer (logo and name) in the slider (yes or no)</li><li>Show manufacturer description in slider (yes or no)</li><li>Maximum height of the manufacturer description</li><li>Minimum width of the slider elements</li><li>Rotate slider automatically (yes or no)</li><li>Show products in the slider by category (yes or no)</li><li>Sorting in the slider (name, price or publication date ascending and descending)</li><li>Maximum number of products</li></ul><h3>A special page for a special manufacturer</h3><p>You want to represent a manufacturer even better than with our plugin. No problem. You have the option of storing an alternative URL for manufacturers. You can e.g. B. create and link a landing page for a manufacturer. Your customers will no longer end up on our manufacturer's website, but on the specially created landing page.</p><h3>All pages SEO optimized</h3><p>All generated pages of the plugin can be provided with a meta keyword and meta description. You also have the option of influencing the SEO path. You decide under which name (SEO base path) the overview page should be called. You can also configure whether the SEO base path should also be output in front of the individual manufacturers and whether a slash should be output at the end of the URL.</p><h3>Upgrading your detail pages</h3><p>With this plugin you not only create a manufacturer overview page or manufacturer pages, you can also upgrade your product detail pages. With this plugin you have the possibility to integrate your slider on the detail page, which shows other products of the manufacturer. You also have additional filters and sorting options. You can e.g. display the manufacturer's articles from the same category or sort by name, price, release date.\n\nYou can also integrate an additional tab that outputs the manufacturer's description.</p><p><strong>Ask questions</strong><br />\n\n\n\n\nDo you have questions about the plugin or the setup? Then take a look at our <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">manual (in German)</a> or write to us directly: info@coolbax.de</p>","installationManual":"<p>The installation is done via the Plugin Manager.</p><p><strong><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">View the manual (in German)</a></strong></p>","shortDescription":"Professional manufacturer or brand page with overview page, logo display with name & number of articles, SEO optimization, filter options, manufacturer article slider on detail page","highlights":"Professional and clear presentation of the manufacturers / brands\nEntire plugin is SEO optimized\nVersatile display options and templates\nManufacturer tab on article Show detail page\nItem listing on the manufacturer's website","features":"Configurable display type of the banner (standard and full area)\nPositioning of headline, text (above or below the listing)\nRepresentation of the manufacturer (logo and / or manufacturer name)\nTemplate for overview page (two, three, four columns or slider)\nDisplay filter (all manufacturers or only manufacturers with articles)\nDisplay of the number of articles (do not show in listing and / or top manufacturer slider)\nNavigation of the legend (scroll to the letter or hide all other letters)\nScroll speed and scroll distance to manufacturer\nSelection of the product layout (minimal content, standard or large image)\nSidebar can be shown or hidden\nSEO base path for the overview page\nMeta keywords and meta descriptions can be stored for each page\nLarge number of Twig blocks integrated to make it easier to change the template\nManufacturers can be hidden individually\nAlternative URL (e.g. to refer to landing pages)"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":156568,"bookingKey":"cbax951420758690","bookingText":"Professional Manufacturer SW6","price":99,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":161803,"bookingKey":"cbax951420758690_M","bookingText":"Professional Manufacturer SW6","price":9.99,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":169006,"bookingKey":"cbax951420758690_M12","bookingText":"Professional Manufacturer | Pro","price":99,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7TAkq5","preview":true,"priority":0,"id":83876},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOF4dzv","preview":false,"priority":25,"id":82199},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpKdn1qI","preview":false,"priority":24,"id":82200},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcXKJxR","preview":false,"priority":23,"id":82201},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpNksZQg","preview":false,"priority":22,"id":82202},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpS6IEXk","preview":false,"priority":21,"id":82204},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLZlJvq","preview":false,"priority":20,"id":82203},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpy8YkTu","preview":false,"priority":19,"id":111101},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpz0HVPt","preview":false,"priority":18,"id":82206},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php03JyYG","preview":false,"priority":17,"id":82207},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php9BrvTj","preview":false,"priority":16,"id":82209},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTY8koR","preview":false,"priority":15,"id":82208},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHRSFF1","preview":false,"priority":14,"id":82214},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTWLlTu","preview":false,"priority":13,"id":82212},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDBOQdP","preview":false,"priority":11,"id":82211},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpJ1IAoG","preview":false,"priority":11,"id":83766},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpi54a79","preview":false,"priority":9,"id":82213}],"comments":[{"authorName":"Maik. K.","text":"Eine wichtige Funktion, welche ich bei Shopware 6 vermisst habe und durch dieses Plugin ausgleichen konnte. Nach der Umstellung von Shopware 5 auf Shopware 6 wurde ich erstmals auf die fehlenden Herstellerseiten in der Google Suche aufmerksam. Viele gut gelistete Seiten konnten nicht mehr aufgerufen werden und somit entschied ich mich schnell dieses Plugin zusätzlich zu nutzen. Wie auch das Theme von Coolbax konnte ich dieses Plugin mit wenigen Einstellungen zum Laufen bekommen und erfüllt seinen Zweck zu 100%.","headline":"Wichtiges Plugin nach Umstellung (im Zusammenhang mit Google)","creationDate":{"date":"2023-07-05 10:56:29.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Lisa L.","text":"Das Plugin funktioniert wirklich toll! Die Herstellerseiten, die wir in Shopware 5 gepflegt haben, werden super angezeigt und man kann diese auch über die Erlebniswelten erweitern. So hat man seo-optimierte Herstellerseiten, bei denen man auch optisch alle Möglichkeiten hat. \n\nAuf unsere Nachfrage, wie wir die URL über sowohl /hersteller/herstellername als auch /herstellername erreichen könnten, haben wir direkt die Info erhalten, dass wir dazu einfach den Schalter SEO-Basispfad auch für die einzelnen Hersteller deaktivieren können und die SEO-URLS neu erzeugen. Jetzt funktionieren beide Optionen.\n\nWas ich mir noch wünschen würde wäre, dass man auch über die Suchfunktion direkt auf die Herstellerseiten kommen könnte. Diese Funktionalität hatten wir allerdings auch im SW5 Shop nur über ein Plugin implementiert.","headline":"Tolles Plugin","creationDate":{"date":"2023-06-28 15:37:09.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"MW","text":"Wir sind zufrieden mit dem Plugin und der Support ist schnell und kümmert sich gut.","headline":"Tolle Ergänzung zum Standardshop &amp; Guter Support","creationDate":{"date":"2022-12-08 10:06:19.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sander Vinkenborg","text":"I had some question about the configuration to keep my Shopware 5 SEO URL's in Shopware 6 for the brand page with this extension and they helped me perfectly.","headline":"Great support!","creationDate":{"date":"2022-10-27 11:44:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Khunpon.de","text":"Wir nutzen das Tool seit dem Start unserer Shopware6 Reise und es ist absolut zu empfehlen. Wir nutzen die volle Funktionalität und haben vielen wichtigen Herstellern individuelle Erlebniswelten zugewiesen. Darüber kann man selbst ohne Entwicklungsaufwand die Herstellerseiten verschönern. \n\nAuch die Herstellerübersichtsseite ist sehr gut gelöst.\n\nWir können uns unseren Shop ohne dem Plugin nicht mehr vorstellen. \n\nLeider fehlt uns noch die Möglichkeit Filter und Sortierungen auf den einzelnen Herstellerseiten einzufügen. Wir haben angeboten diese Entwicklung zu bezahlen und wurden mehrfach vertröstet, so dass wir einen Workaround bauen mussten, um wenigsten die neuesten Produkte nach vorne zu holen. \nDiese Baustelle ist bis heute offen.","headline":"Hervorragendes Tool mit offener Baustelle","creationDate":{"date":"2022-07-12 07:03:45.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Tobias Lepper","text":"Endlich - wie bei SW5 - die bekannte Herstellerseite und reichlich neue Möglichkeiten im Cross-Selling. Nicht unser erstes Plugin von Coolbax. Support und Reaktionsgeschwindigkeit bei Anfragen sind seit Jahren super !","headline":"Cooles Plugin mit vielen Möglichkeiten","creationDate":{"date":"2022-03-25 17:37:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Art von ELS-Licht","text":"Das  Plugin läuft jetzt perfekt und macht was es soll.\nDer Support hat schnell und kompetent auf unsere Wünsche reagiert. Top Service !!!","headline":"Das Plugin ist eine Bereicherung für unseren Shop","creationDate":{"date":"2020-08-06 10:55:30.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Hersteller Professionell | Pro","description":"<p><strong>*** Ab Version 2.0.1 kann für jeden Hersteller eine eigenen Erlebniswelten zugewiesen werden***<br />*** Ab Version 1.1.5 gestalten Sie die Seiten: Herstellerübersicht und Herstellerdetailseiten in den Erlebniswelten ***</strong></p><h3>Hersteller Professionell | Pro</h3><p>Sie möchten für ihren Shopware 6 Shop automatisch Herstellerseiten und eine Herstellerübersicht erzeugen? Mit unserem Plugin können Sie das mit wenigen Klicks verwirklichen. Eine Vielzahl an Einstellungen und Optionen bitten Ihnen die Möglichkeit dieses Plugin problemlos an ihr Shopdesign anzupassen. Mit der Plugin Version 1.1.5 sind Sie noch flexibler und können die ganze Vielfalt der Erlebniswelten nutzen!</p><p><strong>Die Hersteller Übersichtseite </strong>bietet Ihren Kunden einen schnellen Überblick all ihrer angebotenen Hersteller/Marken. Diese Seite wird automatisch, anhand Ihrer angelegten Hersteller ermittelt und nach Alphabet sortiert. Über eine Legende kann der Kunden sehen, unter welchen Buchstaben, Zahlen oder Zeichen er Hersteller/Marken finden kann. Mit Klick auf einen aktiven z. B. Buchstaben slidet der Kunde direkt zu dem gewählten  Buchstaben. Eine andere Option ermöglicht es ihm, alle nicht ausgewählten  Buchstaben auszublenden. Mithilfe des Top-Hersteller-Sliders können Sie einzelne Hersteller hervorheben. Wer als Top-Hersteller deklariert wird, entscheiden Sie! Ein individuelles Aussehen der Übersichtsseite können Sie unter anderem mithilfe von Banner + Anzeigeart, Headline &amp; Text + Positionierung, Template und Darstellung der Hersteller/Marken erzeugen. Mit der Version 1.1.5 gestalten Sie diese Seite über die Erlebniswelten und können die Seite somit noch flexibler und individueller Gestalten!</p><p><strong>Die Herstellerseiten </strong>bieten Ihnen die optimale Lösung, um einen Hersteller oder Marke bestmöglich zu präsentieren! Ihre Kunden sehen auf einem Blick, welche Produkte Sie von einem Hersteller/ Marke anbieten. Die Ermittlung der Produkte erfolgt automatisch und muss nicht von Ihnen per Hand zugewiesen werden. Unser Plugin verlinkt automatisch die Hersteller Logos auf den Artikeldetailseiten mit den entsprechenden Herstellerseiten.<br /> Für alle Herstellerseiten kann nochmals eingestellt werden, wie das Banner dargestellt, wo der Hersteller Text &amp; Headline angezeigt und welches Produktlayout verwendet werden soll. Für eine optimale Darstellung der Hersteller/Marken haben Sie die Möglichkeit ein Banner sowie Text für jeden Hersteller zu hinterlegen. Ab der Plugin Version 2.0.1 können Sie jedem Hersteller eine eigenen Erlebniswelt zuweisen und können somit noch individueller die Seiten gestallten.</p><p><strong>Die linke Sidebar </strong>kann optional eingeblendet werden. Durch sie haben Ihre Kunden eine zusätzliche Möglichkeit zwischen den Herstellern zu navigieren. Hinter der alphabetischen Sortierung der Buchstaben verbergen sich die Hersteller/Marken. Mit Klick auf einen Buchstaben öffnet sich das Feld und die Hersteller werden sichtbar. Ist der Kunde auf einer Herstellerseite, kann die aktive Buchstabengruppe auch eingeblendet bleiben. Über einen Button kommen ihre Kunden wieder zur Hersteller Übersichtsseite.<br /> Weiterhin haben Sie die Möglichkeit, die Headline über der Sidebar auszublenden, die Shop Kategorien anzuzeigen oder die Artikelanzahl eines Herstellers darzustellen.</p><p><strong>Die Artikel Detailseite</strong> kann optional erweitert werden. Sie haben die Möglichkeit einen zusätzlichen Tab, nach der Beschreibung, einblenden zu lassen. Der Tab \"Infos zum Hersteller\" beinhaltet die Herstellerbeschreibung und einen Link zur Herstellerseite. Des Weiteren kann über oder unter der Beschreibung ein Hersteller Slider dargestellt werden. In diesem können alle Produke oder kategoriebezogene Produke des Herstellers angezeigt werden. Die Darstellung der Artikel ist wählbar genauso ob eine Headline, das Logo und/oder die Hersteller Beschreibung im Slider angezeigt werden soll.</p><p><strong><a href=\"https://demo-6.coolbax.com/hersteller/\" target=\"_blank\" rel=\"noreferrer noopener\">Im Demoshop testen</a></strong><br /><strong><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Das Handbuch ansehen</a></strong></p><h3>Funktionsumfang &amp; Vorteile</h3><ul><li><b>NEU: Herstellerseiten als Erlebniswelten Seiten konfigurierbar (ab Plugin Version:  1.1.5 )</b></li><li><b>NEU: Jeder Hersteller kann eine eigenen Erlebniswelten zugewiesen werden </b><b>(ab Plugin Version:  2.0.1 )</b></li><li>Professionelle Darstellung der Hersteller / Marken</li><li>Erzeugung von Content für die Suchmaschinen</li><li>Übersichtliche Darstellung aller Hersteller/Marken als Übersichtseite für ihre Kunde</li><li>Überblick aller Artikel eines Hersteller/Marken</li><li>Verlinkung zu den Herstellerseiten über das Logo des Hersteller/Marken auf der Detailseite</li><li>Breadcrumb wird automatisch gesetzt und ist SEO optimiert (Rich Snippets – Breadcrumbs)</li><li>Twig-Blöcke integriert um eine leichtere Änderung des Templates zu ermöglichen</li><li>Hersteller Produktslider </li><li>Berücksichtigung der Verfügbarkeit von Varianten bei Anzeige von Herstellern</li><li>Individuelle Metatitel für Hersteller zuweisbar</li></ul><p>EINSTELLUNGEN FÜR DIE ÜBERSICHTSEITE:</p><ul><li>Anzeigefilter (aller Hersteller oder nur Hersteller mit Artikel)</li></ul><p>SEO EINSTELLUNGEN:</p><ul><li>SEO-Basispfad für die Übersichtsseite festlegen</li><li>SEO-Basispfad auch für Herstellerseite übernehmen (ja oder nein)</li><li>Slash am Ende der Url (ja oder nein)</li></ul><p>PLUGIN EINSTELLUNGEN FÜR ARTIKEL DETAILSEITE:</p><ul><li>Hersteller Tab anzeigen (ja oder nein)</li><li>Produkt Slider anzeigen (ja oder nein)</li><li>Position des Sliders (über oder unter der Beschreibung)</li><li>Headline des Sliders anzeigen (ja oder nein)</li><li>Hersteller (Logo und Name) im Slider anzeigen (ja oder nein)</li><li>Hersteller Beschreibung im Slider anzeigen (ja oder nein)</li><li>Maximale Höhe der Hersteller Beschreibung</li><li>Minimale Breite der Sliderelemente</li><li>Slider automatisch Rotieren (ja oder nein)</li><li>Produkte im Slider kategoriebezogen anzeigen (ja oder nein)</li><li>Sortierung im Slider (Name, Preis oder Erscheinungsdatum auf- und absteigend )</li><li>Maximale Anzahl von Produkten</li></ul><p>EINSTELLUNGEN FÜR HERSTELLER IM HERSTELLER MODUL:</p><ul><li>Hersteller können einzeln ausgeblendet werden</li><li>Alternative URL (z.B. um auf Landingpages zu verweisen)</li><li>Einstellung ob Tob Hersteller oder nicht</li><li>Banner zuweisen</li><li>Meta-Keyword und Meta-Description hinterlegen</li></ul><p>ERLEBNISWELTEN ELEMENTE UND EINSTELLUNGEN:</p><ul><li>Coolbax Herstellernavigation\n\n<ul><li>Navigation der Legende (zum Buchstaben scrollen oder alle anderen Buchstaben ausblenden)</li><li>Scroll-Geschwindigkeit zum Hersteller definieren</li><li>Scroll-Abstand zum Hersteller bestimmen</li></ul></li><li>Coolbax Herstellerfilter\n\n<ul><li>Headline anzeigen (ja oder nein)</li><li>Aktive Buchstabengruppe geöffnet lassen (ja oder nein)</li><li>Artikelanzahl anzeigen (ja oder nein)</li></ul></li><li>Coolbax Hersteller Listing\n\n<ul><li>Darstellung der Hersteller ( Logo und/oder Herstellername)</li><li>Template (zwei-, drei-, vierspaltig oder Slider)</li><li>Höhe der Herstellerbox festlegen</li><li>Artikelanzahl anzeigen (ja oder nein)</li></ul></li><li>Coolbax Herstellerbanner</li><li>Coolbax Herstellerüberschrift\n\n<ul><li>Text vor dem Herstellernamen festlegen</li><li>Text nach dem Herstellernamen festlegen</li></ul></li><li>Coolbax Produkts Listing\n\n<ul><li>Layout-Typ definieren (Standard, Großes Bild, Minimaler Inhalt)</li></ul></li><li>Coolbax Top Hersteller Slider\n\n<ul><li>Artikelanzahl anzeigen (ja oder nein)</li></ul></li><li>Coolbax Bild-Text, Spalten flexibel</li></ul><h3>Herstellerübersicht und -detailseiten über Erlebniswelten konfigurieren</h3><p>Ab der Plugin Version 1.1.5 wird Ihnen nicht mehr vorgeschrieben wo ein Element der Seite platziert wird. Sie können selbst bestimmen, an welcher Stelle welches Element platziert werden soll und ob Sie es überhaupt nutzen möchten. Die ganze Vielfalt und Flexibilität der Erlebniswelten steht Ihnen jetzt auch für die Herstellerübersicht und –detailseiten zur Verfügung.</p><h3>Eine besondere Seite für einen besonderen Hersteller</h3><p>Sie  möchten einen Hersteller noch besser darstellen, als es mit unserem Plugin  geht. Kein Problem. Sie haben die Möglichkeit, eine alternative URL für  Hersteller zu hinterlegen. Sie können z. B. eine Landingpage für einen  Hersteller anlegen und verlinken. Ihre Kunden landen dann nicht mehr auf  unserer Herstellerseite, sondern auf die extra angelegte Landingpage.</p><h3>Alle Seiten SEO optimiert</h3><p>Alle erzeugten Seiten des Plugins können mit Meta-Keyword und Meta-Description versehen werden. Zusätzlich haben Sie die Möglichkeit, den SEO Pfade zu beeinflussen. Sie entscheiden, unter welchen Namen (SEO-Basispfad) die Übersichtsseite aufgerufen werden soll. Des Weiteren können Sie konfigurieren, ob der SEO-Basispfad auch vor den einzelnen Hersteller ausgegeben werden soll und ob ein Slash am Ende der Url ausgegeben werden soll.</p><h3>Aufwertung Ihrer Detailseiten</h3><p>Mit diesem Plugin erstellen Sie nicht nur eine Hersteller Übersichtsseite bzw. Herstellerseiten sondern können ganz nebenbei Ihre Produktdetailseiten aufwerten. Mit diesem Plugin haben Sie die Möglichkeit, deinen Slider auf der Detailseite einzubinden, welcher weitere Produkte des Herstellers anzeigt. Zudem haben Sie weitere Filter und Sortierungsmöglichkeiten. Sie können z. B. die Artikel des Herstellers aus der gleichen Kategorie anzeigen lassen oder nach Name, Preis, Erscheinungsdatum sortieren. Sie können zudem noch einen zusätzlichen Tab integrieren, welcher die Herstellerbeschreibung ausgibt.</p><p><strong>Fragen</strong><br /> Sie haben Fragen zum Plugin oder zur Einrichtung? Dann schauen Sie gerne bei unserem <a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\">Handbuch</a> vorbei oder Sie schreiben uns direkt an: info@coolbax.de</p>","installationManual":"<p>Die Installation erfolgt über den Plugin Manager.</p><p><a href=\"https://www.coolbax.de/handbuecher/storefront/plugin-hersteller-professionell-sw6\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>Handbuch ansehen</strong></a></p>","version":"3.0.3","changelog":[{"version":"3.0.3","text":"<p>- Fixed a bug in Scheduled Task</p>","creationDate":{"date":"2023-06-26 08:41:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.2","text":"<p></p><ul><li>New option in the plugin settings: Product count calculation live (default, like it was before) or product count calculation per scheduled task and saving them to make the manufacturer sites faster</li><li>Error with language widget fixed</li><li>Error with data mapping in cms elemnts fixed</li></ul>","creationDate":{"date":"2023-06-16 11:22:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.1","text":"<p></p><ul><li>Fixed manufacturer navigation filter error in mobile view when manufacturer detail page with sidebar is selected</li><li>Fixed loading error</li><li>Dutch translations</li></ul>","creationDate":{"date":"2023-06-12 10:02:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"3.0.0","text":"<p>- Adjustments to Shopware 6.5</p>","creationDate":{"date":"2023-04-19 11:42:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.7","text":"<p>- Fixed a bug in Scheduled Task</p>","creationDate":{"date":"2023-06-26 08:39:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.6","text":"<p>New option in the plugin settings: Product count calculation live (default, like it was before) or product count calculation per scheduled task and saving them to make the manufacturer sites faster</p>","creationDate":{"date":"2023-06-16 11:17:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.5","text":"<p></p><ul><li>Fixed manufacturer navigation filter error in mobile view when manufacturer detail page with sidebar is selected</li><li>Dutch translations</li></ul>","creationDate":{"date":"2023-06-12 09:58:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.4","text":"<p>Fixed a loading error</p>","creationDate":{"date":"2023-05-31 09:16:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.3","text":"<p></p><ul><li>Adjusted FrontendController</li><li>fixed a small error when logging the error when generating the SEO Url's</li><li>Adjusted SEO info text in the plugin settings</li></ul>","creationDate":{"date":"2023-05-08 15:29:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.2","text":"<p>Fixed duplicate canonical urls bug</p>","creationDate":{"date":"2023-02-20 10:31:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<p></p><ul><li>Added manufacturer slider</li><li>Removed top slider</li></ul>","creationDate":{"date":"2023-01-30 09:37:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p></p><ul><li>Mapping Error with the text cms element fixed</li><li>double canonical urls fixed</li></ul>","creationDate":{"date":"2022-11-04 11:55:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.9","text":"<p>Improvement of the seo url generation</p>","creationDate":{"date":"2022-10-27 08:45:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.8","text":"- Improvements in the presentation of the CMS blocks and elements in the Shopping Experiences module<br />- 2 new sample cms pages for manufacturer detail pages (with and without sidebar)<br />- These 2 new samples use the SW product listing element, so sorting and filters are possible!<br />- New detail page must be created and assigned from one of the 2 new templates in order to be able to use filters and sorting<br /><p>- Integration of the SW product listing in old detail pages is not possible</p>","creationDate":{"date":"2022-10-18 13:27:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.7","text":"<p></p><ul><li>Adjustments for shopware update 6.4.12</li><li>Detail page bug with sidebar filter fixed</li></ul>","creationDate":{"date":"2022-09-05 08:49:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.6","text":"<p>Manufacturer detail page Error with missing ID caught</p>","creationDate":{"date":"2022-04-21 09:57:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.5","text":"<p>Manufacturer tab is now also displayed on the product page for a shopping world</p>","creationDate":{"date":"2022-04-11 13:35:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.4","text":"<p></p><ul><li>Fixed a bug in the seo creation</li><li>Fixed the bug cms-breadcrump instead of cms-breadcrumb</li></ul>","creationDate":{"date":"2022-03-28 14:02:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.3","text":"<p>Fixed a bug in the FrontendController</p>","creationDate":{"date":"2022-03-10 09:38:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.2","text":"<p>Fixed a bug in the scheduled task</p>","creationDate":{"date":"2021-12-15 14:48:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.1","text":"<p></p><ul><li>Optimizations of the data procedures for a better performance</li><li>Seo url creation possible in plugin configuration</li><li>Error logging for the seo url creation</li></ul>","creationDate":{"date":"2021-12-14 14:52:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<p>Criteria Event Cbax\\CbaxModulManufacturers\\Core\\Content\\Events\\CbaxManufacturersProductListingCriteriaEvent added for the product listing on the manufacturer detail page</p>","creationDate":{"date":"2021-11-08 11:13:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p>Improvements for the generation of the seo urls</p>","creationDate":{"date":"2021-10-19 08:53:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p></p><ul><li>Adaptation to SW6.4.5</li><li>Fixed bug when hiding certain manufacturers</li></ul>","creationDate":{"date":"2021-10-13 12:38:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p>Listings take into account the extended visibility of the products now</p>","creationDate":{"date":"2021-09-28 15:19:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p></p><ul><li>Seo creation error with manufacturers with the same name catched</li><li>Alt and title of manufacturer detail banner</li></ul>","creationDate":{"date":"2021-09-16 15:16:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>Mapping of customfields type text and html from sets related to manufacturer in text elements now possible</p>","creationDate":{"date":"2021-09-01 10:52:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p>* Seo url creation improved</p><p>* Error with cms element with empty config catched</p>","creationDate":{"date":"2021-08-04 14:24:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>* Sitemap url generation adjusted to Shopware 6.4</p><p>* Manufacturer detail site now gets product limit for listing from Shopware product settings</p>","creationDate":{"date":"2021-07-08 11:35:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>Product listing on manufacturer detail page now takes into account the variants display settings.</p>","creationDate":{"date":"2021-06-17 10:52:34.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>* Error in seo creation in scheduled task fixed</p><p>* Layout of the settings of the manufacturer customfield set changed</p><p>* A manufacturer can now be assigned its own detail cms page</p><p>* Manufacturer banner now as media instead as link</p>","creationDate":{"date":"2021-06-10 15:21:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>* Adjustment for Shopware 6.4.0.0</p><p>* New cms element: Product slider for product detail pages</p>","creationDate":{"date":"2021-05-20 09:20:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.6","text":"<p>Pagination of the manufacturer detail page improved</p>","creationDate":{"date":"2021-06-29 15:46:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.5","text":"<p>* Manufacturer pages configurable as shopping experiences pages<br /></p><p>* Cms blocks und elements for Manufacturer pages added</p><p>* Default index und detail cms page</p><p>* Consideration of the availability of variants when displaying manufacturers</p><p>* Individual meta titles can be assigned to manufacturers</p>","creationDate":{"date":"2021-05-10 11:38:02.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<p>* Fixed a bug in the display of certain text snippets</p><p>* Classification of umlauts changed</p>","creationDate":{"date":"2021-03-11 14:58:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<p>Adjustments for extended Google crawling of manufacturer pages</p><p>Hide switches for products after sale in the backend is now taken into account in the product filter<br /></p>","creationDate":{"date":"2020-11-03 11:35:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<p>Removal of CustomFields adapted to SW 6.3</p>","creationDate":{"date":"2020-10-07 10:53:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<p>Obsolete call removed from the Shopware container and integrated as a service</p><p> </p><p>Correction of the last update when building the cache</p>","creationDate":{"date":"2020-09-30 13:25:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<p>Error correction for detail page with manufacturers without products in the sale channel</p><p><br /></p><p>Fixed problems with control characters in the product ID when building the cache</p>","creationDate":{"date":"2020-09-24 15:12:31.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p>Performance improvement for scheduled task</p>","creationDate":{"date":"2020-09-17 13:11:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p>Added layout type setting for the product slider</p>","creationDate":{"date":"2020-08-18 10:19:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>Deletion of the plugin config added</p>","creationDate":{"date":"2020-08-14 10:56:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"Performance improvement inserted<br /><p>* Error correction if no manufacturer was assigned to a product</p>","creationDate":{"date":"2020-08-05 14:42:49.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>* Product slider added to product detail site</p><p>* Manufaturer links added to sitemap xml</p>","creationDate":{"date":"2020-05-28 15:36:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>Important template adjustments and CSS corrections</p>","creationDate":{"date":"2020-03-20 09:59:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Integration of rich snippets - breadcrumbs</p>","creationDate":{"date":"2020-03-09 15:34:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><ul><li>New template structure integrated</li><li>Creation of SEO Urls corrected</li><li>New plugin settings added</li></ul>","creationDate":{"date":"2020-03-04 15:32:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>This version is compatible with Shopware 6.1.</li><li>Filters added as mobile offcavanas</li><li>SEO options built in - Cronjob runs once a day</li><li>Added function to hide the categories in the sidebar</li></ul>","creationDate":{"date":"2020-02-13 10:41:24.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>First release of the plugin</p>","creationDate":{"date":"2019-10-25 15:15:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=cbax951420758690","redirectToStore":true,"lowestPriceValue":9.99}