{"id":9327,"name":"MillCustomFieldTabs","code":"Mill101694612374","lastChange":{"date":"2023-07-18 11:16:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpbnEBRw","examplePageUrl":"","moduleKey":"MillCustomFieldTabs","creationDate":{"date":"2019-07-07 14:32:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-08-28 09:19:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-10-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2023-05-28 13:05:07.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":419,"prefix":"Mill","name":"MILLENWORLD","website":"//www.millenworld.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod419_store_icon.png"},"infos":[{"id":14416,"name":"Zusatzfeld Tab Manager (HTML/PDF/Video)","description":"<h2>Für wen ist diese App gedacht</h2><p>&nbsp;Diese App ermöglicht Ihnen Ihre Produktseiten mit individuellen (produktspezifischen) Daten zu erweitern - die Darstellung erfolgt in Tabs - sowohl am Desktop, Tablet oder Smartphone!&nbsp;Ob (HTML) Beschreibungen/Erklärungen, Videos (YouTube/Vimeo) oder PDFs - Sie können Ihre Produkte mit zusätzlichen Informationen ausstatten, um diese geordnet bzw. strukturiert in Tabs ausgeben zu lassen.Die App nutzt zur Datenspeicherung ausschließlich Boardmittel (Zusatzfelder), damit Sie updatesicher und zukunftssicher Ihre Daten ablegen und verwalten können. Die App erweitert Ihre Datenbank somit nicht mit eigenen Feldern sondern nur mit Inhalten, die der Shop auch selbst zur Verfügung stellt. Damit wird eine maximale Kompatibilität zu anderen Erweiterungen erreicht!</p><h3>Auszeichnungen</h3><p>Offizieller Plugin/App Nachfolger des Shopware 5 Plugins \"Freitextfeld Tab Manager\" (\"GOLD\" zertifiziert mit über 500 Downloads) für die Darstellung von Produkt-Zusatzfeldern als Tabs (HTML/Text, PDF, YouTube/Vimeo) - ausgezeichnet als \"Plugin der Woche\" in KW47 2021 und KW12 in 2021! Frei definierbare Konfigurationen für individuelle Einstellungen erlauben Ihnen schnell und einfach individuelle Tabs pro Produkt.</p><h2>Plugin Konfigurationen</h2><h3>Allgemeines</h3><h4>Aktiv</h4><p>Über die \"Aktiv\" Einstellung lässt sich schnell und einfach die gesamte Plugin-Funktionalität pro Verkaufskanal aktivieren bzw. deaktivieren. Deaktiviert gibt es keine Ausgabe von Tabs. Achten Sie daher bei der Installation diese Einstellung zu setzen.</p><h4>Produktnamen ausblenden</h4><p>Innerhalb der Tab-Container wird die Überschrift regulär als \"Überschrift 'Produktname'\" aufgebaut. Falls Sie den Produktnamen nicht noch zusätzlich hinter der Überschrift ausgeben möchten, können Sie dieses mit dieser Einstellung deaktivieren.</p><h4>Alternative PDF Viewer Engine</h4><p>Im Standard werden PDFs als iframe eingebettet und mit dem nativen Browser PDF Viewer dargestellt. Mit dieser Einstellungen werden PDFs immer noch als iframe eingebunden, verweisen aber auf Google Docs. Dieser Dienst verwendet die bei Ihnen abgelegte PDF und bettet diese als PDF ein. Vorteil ist, dass die Einbettung über Google Docs auf nahezu allen Endgeräten funktioniert. Von Nachteil ist, dass Größenbegrenzungen existieren und die Erreichbarkeit des Dienstes nicht gewährleistet ist. Die Wahl können Sie als Nutzer frei treffen!<br></p><h3>YouTube Einstellungen</h3><p>Die Ausgabe von YouTube Videos hat spezifische Einstellungen, die sich auf die Ausgabe von allen YouTube Videos auswirken.</p><h4>Erweiterter Datenschutzmodus</h4><p>Um DSGVO konform Videos einzubetten, stellt YouTube die Funktion \"No Cookie\" zur Verfügung. Hier wird über eine bestimmte URL das Video ohne Cookies eingebunden. Mit dieser Einstellung bestimmen Sie, ob grundsätzlich Videos ohne Cookies eingebunden werden sollen, oder nicht.</p><h4>Steuerelemente anzeigen</h4><p>Über diese Einstellungen können Sie die Steuerelemente (\"Player Controls\") global aktivieren bzw. deaktivieren.</p><h3>pro Tab (1-10)</h3><p>Jedes Tab verfügt über eigene Konfigurationsmöglichkeiten. Im folgenden werden diese genauer für ein erfolgreiches Setup erklärt.</p><h4>Aktiv</h4><p>Die \"Aktiv\" Einstellung aktiviert bzw. deaktiviert einen spezifischen Tab. Deaktiviert wird dieser Tab nicht aufbereitet und an die Storefront gegeben.</p><h4>Titel</h4><p>Tab Titel kann innerhalb der Textbausteine definiert werden:&nbsp;millCustomFieldTabs.tab1.title (tab1-tab10)</p><h4>Überschrift</h4><p>(optionale) Überschrift kann innerhalb der Textbausteine definiert werden:&nbsp;millCustomFieldTabs.tab1.headline (tab1-tab10)</p><h4>Inhaltstyp</h4><p>Die Daten aus Ihren Zusatzfeldern können unterschiedlich interpretiert und ausgegeben werden. Für jede unterstützte Art gibt es hier einen spezifischen \"Inhaltstyp\". Achten Sie pro Tab immer darauf den richtigen \"Inhaltstyp\" zu setzen, um eine gültige Ausgabe im Shop sicher zu stellen.</p><h4><i>Text/HTML</i></h4><p>Über den Inhaltstyp \"HTML\" werden die Inhalte aus dem Zusatzfeld direkt ausgegeben . Es werden Zusatzfelder des Typs \"Text Editor\" (HTML Editor) hierfür empfohlen.</p><h4><i>PDF (Medium)</i></h4><p>Über den Inhaltstyp \"PDF (Medium)\" wird das im Zusatzfeld angegeben PDF Dokument als Tab ausgegeben. Erstellen Sie dafür ein Produkt-Zusatzfeld des Typs \"Medium\" und verweisen Sie dieses dieser Tab-Konfiguration. Beachten Sie, dass mit dieser Einstellung nur ein PDF im Tab ausgegeben werden. Vorteil ist die einfache Angabe: Innerhalb des Produktes einfach ein \"Medium hinzufügen\", indem aus der Medienverwaltung ein PDF ausgesucht wird.</p><h4><i>PDF (Name)</i></h4><p>Über den Inhaltstyp \"PDF (Name)\" können beliebig viele PDFs pro Tab ausgegeben werden. Erstellen Sie dafür ein Produkt-Zusatzfeld des Typs \"Textfeld\". Danach können Sie im jeweiligen Produkt PDFs angeben, indem Sie die Medien-Titel im Zusatzfeld angeben. Mehrere Dateinamen (Medientitel, z.B. \"DatenblattBeispiel\") werden über Kommata getrennt (z.B: \"DatenblattBeispiel, TechnischeListeABC\"). Vorteil dieser Konfiguration ist, dass Sie mehrere PDFs ausgeben können. Dafür ist im Vergleich zum Inhaltstyp \"PDF (Medium)\" die Angabe über Medien-Titel manueller.</p><p></p><h4><i>Video (YouTube)</i></h4><p>Über den Inhaltstyp \"Video (YouTube)\" können Sie beliebig viele YouTube pro Tab in Ihren Produkten ausgeben. Ein Zusatzfeld vom Typ \"Textfeld\" ist hier empfehlenswert. Um Videos auszugeben, reichen im Produkt-Zusatzfeld eine Liste von YouTube Video-IDs. Mehrere IDs werden über Kommata getrennt. Beispiel: Die YouTube Video-ID der URL&nbsp;<a href=\"https://www.youtube.com/watch?v=fJ7klzu_CJQ\">https://www.youtube.com/watch?v=fJ7klzu_CJQ</a>&nbsp;lautet&nbsp;<b>fJ7klzu_CJQ</b>. Mehrere Videos könnten so angegeben werden: \"fJ7klzu_CJQ,&nbsp;KAIw9I6D5Y4\". In den Plugin-Einstellungen gibt es noch zwei Einstellungen um die Ausgabe (\"No Cookie\") als auch die Anzeige von Steuerelementen global zu steuern.</p><h4><i>Video (Vimeo)</i></h4><p>Ähnlich wie bei YouTube Videos können Sie mehrere Videos ausgeben. Dafür listen Sie einfach beliebig viele Vimeo Video-IDs (getrennt mit Kommata) auf. Die Vimeo Video-IDs können Sie der Video URL jeweils entnehmen. Beispiel: Die ID der URL&nbsp;<a href=\"https://vimeo.com/170541389\">https://vimeo.com/170541389</a>&nbsp;lautet&nbsp;170541389. Die eigentliche Ausgabe wird vollständig vom Plugin geregelt.</p><h3>Tab mit Inhalt weiterer ergänzen</h3><p>Pro Tab können Sie definieren, ob Inhalte aus anderen Tabs zum Inhalt des jeweiligen ergänzt werden soll.&nbsp;Sie können so effektiv Inhalte mehrerer Tabs zu einem einem ganz einfach zusammenfassen (Inhalt des Haupt-Tabs kommt immer an erster Stelle, danach untereinander aufsteigend in der Reihenfolge der jeweiligen Tab Nummern)</p><h3>Überschriften von ergänzenden Tabs anzeigen</h3><p>Einstellung (pro Tab) steuert, ob Überschriften von ergänzenden Tabs angezeigt werden sollen.</p><p></p><h3>Zusatzfeld</h3><p>Pro Tab müssen Sie über diese Einstellung setzen, aus welcher Datenquelle (Zusatzfeld) die Tab-Daten bezogen werden sollen. Achten Sie bei einem Mapping darauf, nur aus Produkt-Zusatzfeldern auszuwählen. Zusatzfelder aus anderen Datentypen (Medien, Kunden, ...) werden innerhalb der Tabs nicht berücksichtigt und können nicht als Datenquelle genutzt werden.</p><p></p><h2>Professionell und zukunftssicher</h2><p></p><p></p><p></p><p></p><ul style=\"box-sizing: border-box; padding: 0px 0px 0px 20px; margin: 0px; font-size: 14px; line-height: 24px;\"><li style=\"box-sizing: border-box; padding: 0px; margin: 0px;\">seit 2013 Shopware Entwickler</li><li style=\"box-sizing: border-box; padding: 0px; margin: 0px;\">seit 2015 Hersteller im Shopware Store</li><li style=\"box-sizing: border-box; padding: 0px; margin: 0px;\">Entwicklung nach aktuellen Coding Guidelines</li><li style=\"box-sizing: border-box; padding: 0px; margin: 0px;\">Support aktueller Shopware Versionen</li><li style=\"box-sizing: border-box; padding: 0px; margin: 0px;\">Hersteller mit insgesamt über 7000 Plugin Downloads</li></ul>","installationManual":"<h2>Vorbereitungen</h2><h3>Plugin</h3><p>Installieren und aktivieren das Plugin.</p><h3>Allgemeine Konfigurationen</h3><p>Setzen Sie die Plugin Konfiguration \"Aktiv\" auf aktiv und speichern anschließend die Konfiguration.</p><h2>Zusatzfelder</h2><h3>Zusatzfeld-Set anlegen</h3><p>Zusatzfelder werden in Shopware in einem Set gruppiert. Legen Sie daher zunächst unter Einstellungen &gt; System &gt; Zusatzfelder ein Set an. Der Name kann hier frei gewählt werden, z.B. \"Zusatzfeld Tabs\" (technischer Name \"custom_field_tabs\"). Wichtig ist außerdem die Angaben \"Verwenden für\" mit einer Angabe \"Produkte\". Ansonsten können Sie die gewünschten Daten nicht in Ihren Produkten pflegen. Navigieren Sie anschließend in das gerade angelegte Set.</p><h3>Welche Tabs sind gewünscht?</h3><p>Überlegen Sie sich, welche Tab-Arten Sie zunächst auf der Produktseite darstellen möchten. Hier können Sie aus den Inhaltstypen HTML (Text), PDF (Medium), PDF (Namen), Video (YouTube) und Video (Vimeo) wählen. Die genauen Beschreibungen zu den einzelnen Inhaltstypen finden Sie in der Plugin Beschreibung.<br /></p><h4>Datentypen</h4><p>Für jeden Inhaltstypen werden bestimmte Datentypen empfohlen</p><p><i>HTML</i> = Text Editor</p><p><i>YouTube</i> = Textfeld</p><p><i>Vimeo</i> = Textfeld</p><p><i>PDF (Medium)</i> = Medium</p><p><i>PDF (Namen) </i>= Textfeld</p><h4>Einstellungen</h4><p>Jedes Zusatzfeld braucht individuelle \"technische Namen\". Empfehlenswert sind sinnvolle Angaben, z.B. bei einem Zusatzfeld für YouTube Videos  \"custom_field_tab_youtube\". Nach diesem Prinzip legen Sie alle benötigten Zusatzfelder an. Weitere Hilfe zum Thema Zusatzfelder gibt es hier: <a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/zusatzfelder?category=shopware-6-de/einstellungen/system\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/zusatzfelder?category=shopware-6-de/einstellungen/system</a></p><h2>Plugin Konfigurationen</h2><p>Nachdem Sie alle Produkt-Zusatzfelder erfolgreich definiert und angelegt haben, können Sie zurück in die Plugin Konfigurationen navigieren. Konfigurieren Sie jede Tab Konfigurationen frei nach Ihren Wünschen:</p><h3>Aktiv</h3><p>Dieser Schalter aktiviert den Tab grundsätzlich.</p><h3>Titel</h3><p>Zu finden innerhalb der Shopware Textbausteinen (<a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine</a>) unter millCustomFieldTabs.tab1.title (von \"tab1\" bis \"tab10\")</p><h3>Überschrift</h3><p>Zu finden innerhalb der Shopware Textbausteinen (<a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine</a>) unter millCustomFieldTabs.tab1.headline (von \"tab1\" bis \"tab10\").<br />Überschriften sind optional - wenn Sie keine Überschrift angeben, wird der Titel als Ersatz genommen.</p><h3>Inhaltstyp</h3><p>Wählen Sie pro Tab den jeweils passenden Inhaltstyp aus, je nachdem was Sie im jeweiligen Tab anzeigen mlchten.</p><h3>Tab mit Inhalt weiterer ergänzen</h3><p>Pro Tab können Sie definieren, ob Inhalte aus anderen Tabs zum Inhalt des jeweiligen ergänzt werden soll. Sie können so effektiv Inhalte mehrerer Tabs zu einem einem ganz einfach zusammenfassen! Achten Sie nur darauf, dass die Tabs aus denen Sie den Inhalt zusammenfassen wollen auch vollständig definiert ist! Wenn Sie den zusammengefassten Inhalt nicht noch zusätzlich in eigenen Tabs darstellen möchten,, reicht es die Einstellung <b>Aktiv </b>in den Verweistabs passiv zu setzen.</p><h3>Überschriften von ergänzenden Tabs anzeigen</h3><p>Einstellung (pro Tab) steuert, ob Überschriften von ergänzenden Tabs angezeigt werden sollen.</p><h3>Zusatzfeld</h3><p>In diesem Verweis wählen Sie aus, welches Zusatzfeld als Datenquelle dienen soll. Achten Sie hier auf einen korrekten Verweis zum jeweiligen Tab.</p><h2>Abschluss</h2><p>Speichern Sie die Plugin Konfigurationen. Anschließend können Sie Ihren Produkten individuelle Daten geben. Dafür einfach in die jeweiligen Produkte navigieren, und am unten Seitenbereich unter Zusatzfelder das gewünschte Set (z.B. \"Zusatzfeld Tabs\") auswählen (ab Shopware 6.4 unter der Registerkarte Spezifikationen) und in den spezifischen Zusatzfeldern sinnvolle Daten ergänzen. Wie diese Daten jeweils aussehen, wird in der Plugin detailliert beschrieben.</p>","shortDescription":"Shopware 6 Plugin für die Anzeige von Produkt-Zusatzfeldern als Tabs in verschiedenen Formaten wie HTML, PDF oder Video (YouTube/Vimeo) auf der Produkt-Detailseite.","highlights":"Plugin für die Darstellung von Zusatzfeldern als Tabs\nOffizieller Nachfolger des \"GOLD\" ausgezeichneten Plugins \"Freitextfeld Tab Manager\" (über 470Downloads)\nAuszeichnung als Plugin der Woche (\"PLUGIN OF THE WEEK\") KW47 2020 und KW12 2021\nAusgabe von HTML, PDFs und Videos (YouTube und Vimeo)\nMobile Unterstützung (Responsive)","features":"Plugin für die Ausgabe von bis zu 10 Tabs aus Produkt-Zusatzfeldern\neigene Verweise von selbst definierten Zusatzfeldern zu Tabs\nTab-Titel (Name des Tabs) und Tab-Überschrift (Titel des Tab-Containers) pro Tab definierbar (innerhalb der Textbausteine)\nverschiedene Typen pro Tab: HTML, PDF (Medium), PDF (Name), Video (YouTube) und Video (Vimeo) (weitere Erklärungen in der Plugin Beschreibung)\nInhalt mehrerer Tabs können optional zu einem zusammengefasst werden\nDSGVO konforme Einbettung von YouTube Videos möglich (\"No Cookie\"), Player-Controls (Steuerelemente) optional deaktivierbar\nEingebettete PDF: Viewer kann nativ über den Browser erfolgen (Standard) oder optional wahlweise auch über Google Drive (Kompatibel auf allen Endgeräten)\nKonfigurationen pro Verkaufskanal definierbar\nAusschließliche Nutzung nur von Bootstrap (von Shopware eingesetztes Frontend Framework) CSS Standard Klassen (hohe Kompatibiliät zu allen Endgeräten!)\nMobile Untersützung (Responsive) als Offcanvas Menü\nErlebniswelten CMS Produkt Layout Support\nextrem viele Twig Theme Blöcke für eigene Anpassungsmöglichkeiten"},{"id":15053,"name":"Custom Field Tab Manager (HTML/PDF/Video)","description":"<p>Official plugin successor of the Shopware 5 plugin \"Attribute Tab Manager\" (\"GOLD\" certified with over 370 downloads) for displaying product custom fields as tabs (HTML/Text, PDF, YouTube/Vimeo). Freely definable configurations for individual settings allow you to quickly and easily create individual tabs for each product. Expand your product detail pages with specific and individual data in order to provide your customers with additional product information in a clear and visually appealing way.</p><h2>Plugin Configurations</h2><h3>General</h3><h4>Active</h4><p>The \"Active\" setting can be used to quickly and easily activate or deactivate the entire plugin functionality per sales channel. Deactivated there is no output of tabs. Please make sure to set this setting during installation.</p><h4>Hide product names</h4><p>Within the tab containers, the heading is normally structured as \"Headline 'Product name'\". If you do not want to display the product name after the heading, you can deactivate it with this setting.</p><h3>YouTube Settings</h3><p>The output of YouTube videos has specific settings that affect the output of all YouTube videos.</p><h4>Advanced privacy mode</h4><p>In order to embed DSGVO compliant videos, YouTube provides the function \"No Cookie\". Here the video is embedded without cookies via a specific URL. With this setting you determine whether videos should be integrated without cookies or not.</p><h4>Show controls</h4><p>You can use these settings to globally activate or deactivate Player Controls.</p><h3>Tab configurations (1-10)</h3><p>Each tab has its own configuration options. In the following these are explained in more detail for a successful setup.</p><h4>Active</h4><p>The \"Active\" setting activates or deactivates a specific tab. If this tab is deactivated, it will not be edited and given to the storefront.</p><h4>Title</h4><p>Tab title is configurable as a snippet: millCustomFieldTabs.tab1.title (tab1-tab10)</p><h4>Headline</h4><p>(Optional) tab headline is configurable as a snippet: millCustomFieldTabs.tab1.headline (tab1-tab10)</p><h4>Content type</h4><p>The data from your custom fields can be interpreted and output in different ways. There is a specific \"content type\" for each supported type. Always make sure to set the correct \"content type\" for each tab in order to ensure a valid output in the shop.</p><h4><i>HTML</i></h4><p>The content type \"HTML\" directly displays the content from the custom field. Custom fields of the type \"Text Editor\" (HTML Editor) are recommended.</p><h4><i>PDF (Medium)</i></h4><p>The PDF document specified in the custom field is output as a tab via the content type \"PDF (Medium)\". Create a product custom field of type \"Medium\" and link it to this tab configuration. Note that with this setting, only one PDF will be output in the tab. The advantage is the simple specification: Within the product, simply add a \"medium\" by selecting a PDF from the media management.</p><h4><i>PDF (Names)</i></h4><p>The content type \"PDF (Names)\" can be used to output any number of PDFs per tab. To do this, create a custom field of the type \"Text field\". You can then specify PDFs in the respective product by specifying the media titles in the custom field. Several file names (media title, e.g. \"DatasheetExample\") are separated by commas (e.g.: \"DatasheetExample, TechnicalListABC\"). The advantage of this configuration is that you can output several PDFs. Compared to the content type \"PDF (Medium)\", the specification of media titles is more manual.</p><h4><i>Video (YouTube)</i></h4><p>The content type \"Video (YouTube)\" allows you to display any number of YouTube per tab in your products. A custom field of the type \"Text field\" is recommended here. To output videos, a list of YouTube video IDs is sufficient in the custom field. Multiple IDs are separated by commas. Example: The YouTube video ID of the URL https://www.youtube.com/watch?v=fJ7klzu_CJQ is fJ7klzu_CJQ. Multiple videos could be specified as: \"fJ7klzu_CJQ, KAIw9I6D5Y4\". In the plugin settings there are two more settings to globally control the output (\"No Cookie\") as well as the display of controls.</p><h4><i>Video (Vimeo)</i></h4><p>Similar to YouTube videos, you can output multiple videos. Just list as many Vimeo video IDs as you like (separated by commas). The Vimeo Video IDs can be found in the Video URL. Example: The ID of the URL https://vimeo.com/170541389 is 170541389. The actual output is completely controlled by the plugin.</p><h4>Custom field</h4><p>For each tab, you must use this setting to specify the data source (custom field) from which the tab data is to be obtained. When mapping, make sure that you only select from product custom fields. Custom fields from other data types (media, customers, ...) are not taken into account within the tabs and can be</p><p><br /></p><p>Used (example) videos, captured in these screenshots:<br /></p><p>[YouTube: ZURÜCK IN DIE ZUKUNFT Trailer] <a href=\"https://www.youtube.com/watch?v=jv3GPWe56Qw\">https://www.youtube.com/watch?v=jv3GPWe56Qw</a></p><p>[Vimeo: Russian Circles — Mládek (Live in Hong Kong)] <a href=\"https://vimeo.com/51692608\">https://vimeo.com/51692608</a><br /></p>","installationManual":"<h2>Preparations</h2><h3>Plugin</h3><p>Install and activate the plugin.</p><h3>General Configurations</h3><p>Set the plugin configuration \"Active\" to active and then save the configuration.</p><h2>Custom fields</h2><h3>Create additional field set</h3><p>Custom fields are grouped into a set in Shopware. You should therefore first create a set under Settings &gt; System &gt; Custom fields. The name can be freely chosen here, e.g. \"Custom field tabs\" (technical name \"custom_field_tabs\"). It is also important to specify a product relation. Otherwise you cannot maintain the desired data in your products. Then navigate to the set you have just created.</p><h3>Which tabs are required?</h3><p>Think about which tab types you would like to display on your product pages in general. Here you can choose from the content types HTML (Text), PDF (Medium), PDF (Names), Video (YouTube) and Video (Vimeo). The exact descriptions of the individual content types can be found in the plugin description.</p><h4>Data Types</h4><p>Certain data types are recommended for each content type</p><p><i>HTML</i> = Text Editor</p><p><i>YouTube</i> = Text field</p><p><i>Vimeo</i> = Text field</p><p><i>PDF (Medium) </i>= Medium</p><p><i>PDF (name)</i> = text field</p><h4>Settings</h4><p>Each custom field needs individual \"technical names\". It is advisable to provide useful information, e.g. \"custom_field_tab_youtube\" for a custom field for YouTube videos. According to this principle, you create all required custom fields. Further help on the subject of custom fields can be found here: https://docs.shopware.com/de/shopware-6-de/einstellungen/zusatzfelder?category=shopware-6-de/einstellungen/system</p><h2>Plugin Configurations</h2><p>After you have successfully defined and created all custom product fields, you can navigate back to the plugin configurations. Configure each tab Configuration according to your wishes:</p><h3>Active</h3><p>This switch basically activates the tab.</p><h3>Title</h3><p>Located in the snippets section (<a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine</a>) as millCustomFieldTabs.tab1.title (\"tab1\" to \"tab10\")</p><h3>Headline</h3><p>Located in the snippets section (<a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine</a>) as millCustomFieldTabs.tab1.headline (\"tab1\" to \"tab10\")</p><p>You can use an optional headline to give the tab container a different heading. If you do not maintain this field, the Title tab is used as a replacement.</p><h3>Content type</h3><p>Select the appropriate content type for each tab, depending on what you want to display in the respective tab.</p><h3>Custom field</h3><p>In this reference, you select which custom field is to be used as the data source. Make sure that the link to the relevant tab is correct.</p><h2>Finished installation</h2><p>Save the plugin configurations. Then you can give your products individual data. To do this, simply navigate to the respective products and select the desired set (e.g. \"Custom field tabs\") under \"custom fields\" at the bottom of the page area and add useful data in the specific custom fields. How these data look like is described in detail in the plugin.</p>","shortDescription":"Shopware 6 plugin for displaying product custom fields as tabs in various formats such as HTML, PDF or video (YouTube/Vimeo) on the product detail page.","highlights":"Plugin to display product custom fields as tabs\nOfficial successor of the \"Gold\" awarded plugin \"Attribute Tab Manager\" (more than 370 downloads)\nSupported tab types: HTML, PDFs and Videos (YouTube and Vimeo)\nMobile support (Responsive)","features":"Plugin to display of up to 10 tabs from custom fields\nTab title (name of the tab) and tab headline (title of the tab container) can be defined per tab (as snippets)\ndifferent types per tab: HTML, PDF (Medium), PDF (Name), Video (YouTube) and Video (Vimeo) (more explanations in the plugin description)\nDSGVO compliant embedding of YouTube videos possible (\"No Cookie\"), player controls (controls) can be deactivated optionally\nConfigurations per sales channel definable\nExclusive use only of Bootstrap (frontend framework used by Shopware) CSS standard classes (high compatibility to all devices!)\nMobile support (Responsive) as Offcanvas Menus\nmany custom Twig Theme blocks for own customization options"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":156997,"bookingKey":"Mill101694612374","bookingText":"Custom Field Tab Manager (HTML/PDF/Video)","price":49,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":162879,"bookingKey":"Mill101694612374_M","bookingText":"Custom Field Tab Manager (HTML/PDF/Video)","price":4.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168237,"bookingKey":"Mill101694612374_M12","bookingText":"Custom Field Tab Manager (HTML/PDF/Video)","price":49,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpgXkUjR","preview":true,"priority":0,"id":109860},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5WdFVg","preview":false,"priority":0,"id":109861},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphxBjb9","preview":false,"priority":0,"id":109862},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpujPudY","preview":false,"priority":0,"id":109863},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phppfTXG7","preview":false,"priority":0,"id":109864},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpK9PHNr","preview":false,"priority":0,"id":109865},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2mZbva","preview":false,"priority":0,"id":109866},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpvPJjx7","preview":false,"priority":0,"id":109867},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTJ2Ez7","preview":false,"priority":0,"id":109868},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcqgGed","preview":false,"priority":0,"id":109871},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBT4gdp","preview":false,"priority":0,"id":109872},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpE7ppPj","preview":false,"priority":0,"id":109873},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpegOJkd","preview":false,"priority":0,"id":109874},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnLDDNP","preview":false,"priority":0,"id":109875}],"comments":[{"authorName":"Jan Sass","text":"…und selbst auf Einsteiger-Fragen antwortet der Support prompt und freundlich. Vielen Dank!","headline":"Macht exakt das gewünschte","creationDate":{"date":"2021-05-27 17:04:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Simon Mader","text":"Wir haben mehrere Plugins von MILLENWORLD und sind von dem Support und der Funktionalität der Plugins überzeugt.\nAuch der Support ist Spitze !!","headline":"alles TOP *****","creationDate":{"date":"2021-04-27 12:59:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Arwin","text":"Das Plugin macht Zusatztabs mit individuellen Inhalten zum Kinderspiel. Mit der neuen \"Verkettungsfunktion\" jetzt noch flexibler! Vorbildlicher Support, das war auch schon bei SW5 so. \n\nVon mir eine uneingeschränkte Empfehlung.","headline":"Tolles Plugin!","creationDate":{"date":"2021-03-05 09:22:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Zusatzfeld Tab Manager (HTML/PDF/Video)","description":"<h2>Für wen ist diese App gedacht</h2><p> Diese App ermöglicht Ihnen Ihre Produktseiten mit individuellen (produktspezifischen) Daten zu erweitern - die Darstellung erfolgt in Tabs - sowohl am Desktop, Tablet oder Smartphone! Ob (HTML) Beschreibungen/Erklärungen, Videos (YouTube/Vimeo) oder PDFs - Sie können Ihre Produkte mit zusätzlichen Informationen ausstatten, um diese geordnet bzw. strukturiert in Tabs ausgeben zu lassen.Die App nutzt zur Datenspeicherung ausschließlich Boardmittel (Zusatzfelder), damit Sie updatesicher und zukunftssicher Ihre Daten ablegen und verwalten können. Die App erweitert Ihre Datenbank somit nicht mit eigenen Feldern sondern nur mit Inhalten, die der Shop auch selbst zur Verfügung stellt. Damit wird eine maximale Kompatibilität zu anderen Erweiterungen erreicht!</p><h3>Auszeichnungen</h3><p>Offizieller Plugin/App Nachfolger des Shopware 5 Plugins \"Freitextfeld Tab Manager\" (\"GOLD\" zertifiziert mit über 500 Downloads) für die Darstellung von Produkt-Zusatzfeldern als Tabs (HTML/Text, PDF, YouTube/Vimeo) - ausgezeichnet als \"Plugin der Woche\" in KW47 2021 und KW12 in 2021! Frei definierbare Konfigurationen für individuelle Einstellungen erlauben Ihnen schnell und einfach individuelle Tabs pro Produkt.</p><h2>Plugin Konfigurationen</h2><h3>Allgemeines</h3><h4>Aktiv</h4><p>Über die \"Aktiv\" Einstellung lässt sich schnell und einfach die gesamte Plugin-Funktionalität pro Verkaufskanal aktivieren bzw. deaktivieren. Deaktiviert gibt es keine Ausgabe von Tabs. Achten Sie daher bei der Installation diese Einstellung zu setzen.</p><h4>Produktnamen ausblenden</h4><p>Innerhalb der Tab-Container wird die Überschrift regulär als \"Überschrift 'Produktname'\" aufgebaut. Falls Sie den Produktnamen nicht noch zusätzlich hinter der Überschrift ausgeben möchten, können Sie dieses mit dieser Einstellung deaktivieren.</p><h4>Alternative PDF Viewer Engine</h4><p>Im Standard werden PDFs als iframe eingebettet und mit dem nativen Browser PDF Viewer dargestellt. Mit dieser Einstellungen werden PDFs immer noch als iframe eingebunden, verweisen aber auf Google Docs. Dieser Dienst verwendet die bei Ihnen abgelegte PDF und bettet diese als PDF ein. Vorteil ist, dass die Einbettung über Google Docs auf nahezu allen Endgeräten funktioniert. Von Nachteil ist, dass Größenbegrenzungen existieren und die Erreichbarkeit des Dienstes nicht gewährleistet ist. Die Wahl können Sie als Nutzer frei treffen!<br /></p><h3>YouTube Einstellungen</h3><p>Die Ausgabe von YouTube Videos hat spezifische Einstellungen, die sich auf die Ausgabe von allen YouTube Videos auswirken.</p><h4>Erweiterter Datenschutzmodus</h4><p>Um DSGVO konform Videos einzubetten, stellt YouTube die Funktion \"No Cookie\" zur Verfügung. Hier wird über eine bestimmte URL das Video ohne Cookies eingebunden. Mit dieser Einstellung bestimmen Sie, ob grundsätzlich Videos ohne Cookies eingebunden werden sollen, oder nicht.</p><h4>Steuerelemente anzeigen</h4><p>Über diese Einstellungen können Sie die Steuerelemente (\"Player Controls\") global aktivieren bzw. deaktivieren.</p><h3>pro Tab (1-10)</h3><p>Jedes Tab verfügt über eigene Konfigurationsmöglichkeiten. Im folgenden werden diese genauer für ein erfolgreiches Setup erklärt.</p><h4>Aktiv</h4><p>Die \"Aktiv\" Einstellung aktiviert bzw. deaktiviert einen spezifischen Tab. Deaktiviert wird dieser Tab nicht aufbereitet und an die Storefront gegeben.</p><h4>Titel</h4><p>Tab Titel kann innerhalb der Textbausteine definiert werden: millCustomFieldTabs.tab1.title (tab1-tab10)</p><h4>Überschrift</h4><p>(optionale) Überschrift kann innerhalb der Textbausteine definiert werden: millCustomFieldTabs.tab1.headline (tab1-tab10)</p><h4>Inhaltstyp</h4><p>Die Daten aus Ihren Zusatzfeldern können unterschiedlich interpretiert und ausgegeben werden. Für jede unterstützte Art gibt es hier einen spezifischen \"Inhaltstyp\". Achten Sie pro Tab immer darauf den richtigen \"Inhaltstyp\" zu setzen, um eine gültige Ausgabe im Shop sicher zu stellen.</p><h4><i>Text/HTML</i></h4><p>Über den Inhaltstyp \"HTML\" werden die Inhalte aus dem Zusatzfeld direkt ausgegeben . Es werden Zusatzfelder des Typs \"Text Editor\" (HTML Editor) hierfür empfohlen.</p><h4><i>PDF (Medium)</i></h4><p>Über den Inhaltstyp \"PDF (Medium)\" wird das im Zusatzfeld angegeben PDF Dokument als Tab ausgegeben. Erstellen Sie dafür ein Produkt-Zusatzfeld des Typs \"Medium\" und verweisen Sie dieses dieser Tab-Konfiguration. Beachten Sie, dass mit dieser Einstellung nur ein PDF im Tab ausgegeben werden. Vorteil ist die einfache Angabe: Innerhalb des Produktes einfach ein \"Medium hinzufügen\", indem aus der Medienverwaltung ein PDF ausgesucht wird.</p><h4><i>PDF (Name)</i></h4><p>Über den Inhaltstyp \"PDF (Name)\" können beliebig viele PDFs pro Tab ausgegeben werden. Erstellen Sie dafür ein Produkt-Zusatzfeld des Typs \"Textfeld\". Danach können Sie im jeweiligen Produkt PDFs angeben, indem Sie die Medien-Titel im Zusatzfeld angeben. Mehrere Dateinamen (Medientitel, z.B. \"DatenblattBeispiel\") werden über Kommata getrennt (z.B: \"DatenblattBeispiel, TechnischeListeABC\"). Vorteil dieser Konfiguration ist, dass Sie mehrere PDFs ausgeben können. Dafür ist im Vergleich zum Inhaltstyp \"PDF (Medium)\" die Angabe über Medien-Titel manueller.</p><p></p><h4><i>Video (YouTube)</i></h4><p>Über den Inhaltstyp \"Video (YouTube)\" können Sie beliebig viele YouTube pro Tab in Ihren Produkten ausgeben. Ein Zusatzfeld vom Typ \"Textfeld\" ist hier empfehlenswert. Um Videos auszugeben, reichen im Produkt-Zusatzfeld eine Liste von YouTube Video-IDs. Mehrere IDs werden über Kommata getrennt. Beispiel: Die YouTube Video-ID der URL <a href=\"https://www.youtube.com/watch?v=fJ7klzu_CJQ\">https://www.youtube.com/watch?v=fJ7klzu_CJQ</a> lautet <b>fJ7klzu_CJQ</b>. Mehrere Videos könnten so angegeben werden: \"fJ7klzu_CJQ, KAIw9I6D5Y4\". In den Plugin-Einstellungen gibt es noch zwei Einstellungen um die Ausgabe (\"No Cookie\") als auch die Anzeige von Steuerelementen global zu steuern.</p><h4><i>Video (Vimeo)</i></h4><p>Ähnlich wie bei YouTube Videos können Sie mehrere Videos ausgeben. Dafür listen Sie einfach beliebig viele Vimeo Video-IDs (getrennt mit Kommata) auf. Die Vimeo Video-IDs können Sie der Video URL jeweils entnehmen. Beispiel: Die ID der URL <a href=\"https://vimeo.com/170541389\">https://vimeo.com/170541389</a> lautet 170541389. Die eigentliche Ausgabe wird vollständig vom Plugin geregelt.</p><h3>Tab mit Inhalt weiterer ergänzen</h3><p>Pro Tab können Sie definieren, ob Inhalte aus anderen Tabs zum Inhalt des jeweiligen ergänzt werden soll. Sie können so effektiv Inhalte mehrerer Tabs zu einem einem ganz einfach zusammenfassen (Inhalt des Haupt-Tabs kommt immer an erster Stelle, danach untereinander aufsteigend in der Reihenfolge der jeweiligen Tab Nummern)</p><h3>Überschriften von ergänzenden Tabs anzeigen</h3><p>Einstellung (pro Tab) steuert, ob Überschriften von ergänzenden Tabs angezeigt werden sollen.</p><p></p><h3>Zusatzfeld</h3><p>Pro Tab müssen Sie über diese Einstellung setzen, aus welcher Datenquelle (Zusatzfeld) die Tab-Daten bezogen werden sollen. Achten Sie bei einem Mapping darauf, nur aus Produkt-Zusatzfeldern auszuwählen. Zusatzfelder aus anderen Datentypen (Medien, Kunden, ...) werden innerhalb der Tabs nicht berücksichtigt und können nicht als Datenquelle genutzt werden.</p><p></p><h2>Professionell und zukunftssicher</h2><p></p><p></p><p></p><p></p><ul><li>seit 2013 Shopware Entwickler</li><li>seit 2015 Hersteller im Shopware Store</li><li>Entwicklung nach aktuellen Coding Guidelines</li><li>Support aktueller Shopware Versionen</li><li>Hersteller mit insgesamt über 7000 Plugin Downloads</li></ul>","installationManual":"<h2>Vorbereitungen</h2><h3>Plugin</h3><p>Installieren und aktivieren das Plugin.</p><h3>Allgemeine Konfigurationen</h3><p>Setzen Sie die Plugin Konfiguration \"Aktiv\" auf aktiv und speichern anschließend die Konfiguration.</p><h2>Zusatzfelder</h2><h3>Zusatzfeld-Set anlegen</h3><p>Zusatzfelder werden in Shopware in einem Set gruppiert. Legen Sie daher zunächst unter Einstellungen &gt; System &gt; Zusatzfelder ein Set an. Der Name kann hier frei gewählt werden, z.B. \"Zusatzfeld Tabs\" (technischer Name \"custom_field_tabs\"). Wichtig ist außerdem die Angaben \"Verwenden für\" mit einer Angabe \"Produkte\". Ansonsten können Sie die gewünschten Daten nicht in Ihren Produkten pflegen. Navigieren Sie anschließend in das gerade angelegte Set.</p><h3>Welche Tabs sind gewünscht?</h3><p>Überlegen Sie sich, welche Tab-Arten Sie zunächst auf der Produktseite darstellen möchten. Hier können Sie aus den Inhaltstypen HTML (Text), PDF (Medium), PDF (Namen), Video (YouTube) und Video (Vimeo) wählen. Die genauen Beschreibungen zu den einzelnen Inhaltstypen finden Sie in der Plugin Beschreibung.<br /></p><h4>Datentypen</h4><p>Für jeden Inhaltstypen werden bestimmte Datentypen empfohlen</p><p><i>HTML</i> = Text Editor</p><p><i>YouTube</i> = Textfeld</p><p><i>Vimeo</i> = Textfeld</p><p><i>PDF (Medium)</i> = Medium</p><p><i>PDF (Namen) </i>= Textfeld</p><h4>Einstellungen</h4><p>Jedes Zusatzfeld braucht individuelle \"technische Namen\". Empfehlenswert sind sinnvolle Angaben, z.B. bei einem Zusatzfeld für YouTube Videos  \"custom_field_tab_youtube\". Nach diesem Prinzip legen Sie alle benötigten Zusatzfelder an. Weitere Hilfe zum Thema Zusatzfelder gibt es hier: <a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/zusatzfelder?category=shopware-6-de/einstellungen/system\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/zusatzfelder?category=shopware-6-de/einstellungen/system</a></p><h2>Plugin Konfigurationen</h2><p>Nachdem Sie alle Produkt-Zusatzfelder erfolgreich definiert und angelegt haben, können Sie zurück in die Plugin Konfigurationen navigieren. Konfigurieren Sie jede Tab Konfigurationen frei nach Ihren Wünschen:</p><h3>Aktiv</h3><p>Dieser Schalter aktiviert den Tab grundsätzlich.</p><h3>Titel</h3><p>Zu finden innerhalb der Shopware Textbausteinen (<a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine</a>) unter millCustomFieldTabs.tab1.title (von \"tab1\" bis \"tab10\")</p><h3>Überschrift</h3><p>Zu finden innerhalb der Shopware Textbausteinen (<a href=\"https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine\" target=\"_blank\" rel=\"noreferrer noopener\">https://docs.shopware.com/de/shopware-6-de/einstellungen/Textbausteine</a>) unter millCustomFieldTabs.tab1.headline (von \"tab1\" bis \"tab10\").<br />Überschriften sind optional - wenn Sie keine Überschrift angeben, wird der Titel als Ersatz genommen.</p><h3>Inhaltstyp</h3><p>Wählen Sie pro Tab den jeweils passenden Inhaltstyp aus, je nachdem was Sie im jeweiligen Tab anzeigen mlchten.</p><h3>Tab mit Inhalt weiterer ergänzen</h3><p>Pro Tab können Sie definieren, ob Inhalte aus anderen Tabs zum Inhalt des jeweiligen ergänzt werden soll. Sie können so effektiv Inhalte mehrerer Tabs zu einem einem ganz einfach zusammenfassen! Achten Sie nur darauf, dass die Tabs aus denen Sie den Inhalt zusammenfassen wollen auch vollständig definiert ist! Wenn Sie den zusammengefassten Inhalt nicht noch zusätzlich in eigenen Tabs darstellen möchten,, reicht es die Einstellung <b>Aktiv </b>in den Verweistabs passiv zu setzen.</p><h3>Überschriften von ergänzenden Tabs anzeigen</h3><p>Einstellung (pro Tab) steuert, ob Überschriften von ergänzenden Tabs angezeigt werden sollen.</p><h3>Zusatzfeld</h3><p>In diesem Verweis wählen Sie aus, welches Zusatzfeld als Datenquelle dienen soll. Achten Sie hier auf einen korrekten Verweis zum jeweiligen Tab.</p><h2>Abschluss</h2><p>Speichern Sie die Plugin Konfigurationen. Anschließend können Sie Ihren Produkten individuelle Daten geben. Dafür einfach in die jeweiligen Produkte navigieren, und am unten Seitenbereich unter Zusatzfelder das gewünschte Set (z.B. \"Zusatzfeld Tabs\") auswählen (ab Shopware 6.4 unter der Registerkarte Spezifikationen) und in den spezifischen Zusatzfeldern sinnvolle Daten ergänzen. Wie diese Daten jeweils aussehen, wird in der Plugin detailliert beschrieben.</p>","version":"1.2.0","changelog":[{"version":"1.2.0","text":"<ul><li>Shopware 6.5 support</li><li>increased min. version to 6.5</li><li>EntityRepository refactoring</li><li>PHP 8.1</li><li>updated Shopware default twig block names</li><li>updated Bootstrap 5 tags (video/pdf)</li></ul>","creationDate":{"date":"2023-02-25 18:25:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.4","text":"<ul><li>fixed CMS product layout offcanvas tab close button</li><li>fixed twig inheritance and removed unused styles</li><li>removed redudant page template</li></ul>","creationDate":{"date":"2021-06-08 11:18:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.3","text":"<ul><li>added padding to CMS product layout offcanvas tab container<br /></li></ul>","creationDate":{"date":"2021-06-07 19:42:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.2","text":"<ul><li>new plugin config to change the embedded pdf viewer engine</li><li>default: browser native, new optional config: Google Docs</li></ul>","creationDate":{"date":"2021-05-19 11:57:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>added missing git files</li><li>fixed media service function if file does not exists</li><li>added pdf zoom parameter to fix chrome bug</li></ul>","creationDate":{"date":"2021-05-10 14:29:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Shopware 6.4 support</li><li>twig config</li><li>new template structure</li><li>updated block names</li><li>CMS product layout support</li><li>increased min version</li><li>fixed combined child tab sorting</li></ul>","creationDate":{"date":"2021-04-12 16:08:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<ul><li>fixed embedded pdfs by name if media manager file is not available</li><li>pdf zoom iframe fix (Google Chrome bug, thanks to Marcus Hegger)<br /></li></ul>","creationDate":{"date":"2021-04-27 12:18:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<ul><li>fixed service id to get the correct translator</li></ul>","creationDate":{"date":"2021-03-07 13:11:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Important: Tab titles and headlines are <b>not</b> longer configurable via plugin configs! Those are now located as snippets to make translatable tabs!</li><li>Please configure now for each tab (1-10) the snippets called <i>millCustomFieldTabs.tab1.title </i>and<i> </i><i>millCustomFieldTabs.tab1.headline</i></li><li>new plugin config to show/head headlines of summarized tabs</li></ul>","creationDate":{"date":"2021-03-06 18:02:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<ul><li>new function to combine tabs</li><li>new plugin configs to define a custom list of child tabs</li><li>new theme file to avoid duplications</li></ul>","creationDate":{"date":"2021-03-04 17:16:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<ul><li>Shopware 6.3 support</li></ul>","creationDate":{"date":"2020-08-22 19:13:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<ul><li>Shopware 6.2 support</li><li>code refactoring</li><li>usage of shopware config values</li></ul>","creationDate":{"date":"2020-06-04 17:39:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>Shopware 6.1</li><li>fixed storefront namespace</li><li>storefront composer require</li><li>added default plugin configuration values</li></ul>","creationDate":{"date":"2019-12-15 19:35:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<ul><li>fixed copyright data</li><li>removed (currently unsupported) plugin logger</li></ul>","creationDate":{"date":"2019-10-29 23:05:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<ul><li>changed logger system to the recommended mono plugin logger<br /></li></ul>","creationDate":{"date":"2019-08-28 17:29:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>initial plugin release</li></ul>","creationDate":{"date":"2019-08-27 21:21:28.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Mill101694612374","redirectToStore":true,"lowestPriceValue":4.9}