{"id":9328,"name":"MillAverageReviewRating","code":"Mill632364433971","lastChange":{"date":"2023-07-18 11:16:34.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCY8FK9","examplePageUrl":"","moduleKey":"MillAverageReviewRating","creationDate":{"date":"2019-07-07 14:39:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-11-14 10:41:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2019-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":true,"lastBusinessModelChangeDate":{"date":"2023-06-03 19:18:39.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":419,"prefix":"Mill","name":"MILLENWORLD","website":"//www.millenworld.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod419_store_icon.png"},"infos":[{"id":14417,"name":"Durchschnittliche Shop Bewertung - Widget & Trust-Banner","description":"<h2>Für wen ist dieses Plugin gedacht?</h2><p>Es ist kein groß gehütetes Geheimnis, dass Bewertungen extrem wichtig im E-Commerce sind, und sich potentielle Kunden sehr an dieses orientieren. Dementsprechend ist es wichtig zum einen Käufer zu animieren zu bewerten, und zum anderen diese präsent im Shop darzustellen. Im Standard werden Produktbewertungen immer nur produktbezogen dargestellt. Dieses Plugin errechnet aus allen Produktbewertungen die durchschnittliche Bewertung, die Sie global und überall im Shop prominent darstellen könnten!</p><h2>Anzeigemöglichkeiten</h2><p>Der Bewertungsdurchschnitt Ihres Shops kann an mehreren Stellen angezeigt werden. Dabei können Sie steuern, ab welchem Wert (mind.) die Anzeige grundsätzlich erfolgen soll. Eine Anzeige bei vielleicht zu niedrigen Werten kann hier automatisch verhindert werden. Die verschiedenen Anzeigeorte werden Ihnen folgend genauer erklärt.</p><h3>Siegel (Widget)</h3><p>Entweder unten rechts oder unten links kann ein Siegel (bzw. Widget-Box) ausgegeben werden. Diese Box hat den für Kunden üblichen Aufbau und wird durch einen textlichen Zusatz (\"SEHR GUT, \"GUT\", ...) ergänzt. Diese Bezeichnungen sind so wie alle anderen Plugin-Texte frei definierbar (innerhalb der Shop-Übersetzungen). Das Widget beinhaltet mehrere Konfigurationsmöglichkeiten, um eine individuelle Anzeige zu ermöglichen. Mobil (Smartphones) wird diese Bewertungsbox am unteren Bildschirmrand unter dem Footer fest angezeigt, um dem Nutzer keinen kostbaren Platz zu verdecken!</p><h3>Obere Leiste (Header)</h3><p>Über dem eigentlichen Header wird eine schmale, dezente aber trotzdem nicht unauffällige Leiste ausgegeben, die textlich als auch grafisch die Durchschnittsbewertung ausgibt. Die Texte sind selbst frei definierbar, die Punkte (\"4.75/5.00\") oder die Gesamtanzahl können hier separat ausgeblendet werden.</p><h3>Untere Leiste (Footer)</h3><p>Die Anzeige im Footer ist platzbedingt etwas umfangreicher: Neben der selbst frei definierbaren textlichen Zusammenfassung (Sterne, Bewertungsdurchschnitt, Anzahl) auf der linken Seite (mobil auf der vollen Breite) ist noch die aktuellste Bewertung vorhanden. Die Bewertung wird hier mit einem \"Verifiziert\" Icon (erweitertes Shopware-Icon) ausgestattet (kann optional ausgeblendet werden), als auch der Name, Kommentar und das Bewertungsdatum (Formatierung automatisch anhand der Lokalisierung). Das Layout einer Sprechblase wird hier rein per CSS gelöst, damit eine ordentliche Anzeige auf allen Breiten, Höhen und Auflösungen ermöglicht wird!</p><h2>Plugin-Konfigurationen</h2><h3>Allgemein</h3><h4>Aktiv</h4><p>Das Plugin kann spezifisch pro Verkaufskanal aktiviert bzw. deaktiviert werden.</p><h4>Bewertungen zusammenfassen</h4><p>Wenn Sie für die Berechnung des Bewertungsdurchschnitts Bewertungen aller Verkaufskanäle zusammenfassen möchten, sollte diese Einstellung aktiv sein. Ansonsten werden nur Bewertung passend zum jeweiligen Verkaufskanal in die Berechnung und Anzeige mit aufgenommen.</p><h4>Mind. Bewertungsdurchschnitt</h4><p>Mit diesem Wert können Sie automatisch steuern, welche Bewertung mindestens erreicht werden muss, damit alle Elemente angezeigt werden. Falls dieser definierte Wert unterschritten wird, werden alle Komponenten (Siegel-Widget, obere Leiste, untere Leiste) ausgeblendet. Dieser Wert bestimmt ebenfalls, welche Bewertung mind. die letzte Bewertung haben muss, die im unteren Bereich (\"Untere Leiste\") angezeigt wird.</p><h4>Bewertungsübersicht</h4><p>Mit dieser optionalen Konfiguration können Sie eine Kategorieseite definieren, die über ein Link verwiesen wird (Top-Bar, Widget). Mit einem anderen meiner Plugins können Sie eine Kategorieseite zu einer Übersicht mit allen Bewertungen umfunktionieren (Erlebniswelten Element). So können Sie von der Anzeige des Bewertungsdurchschnitts komfortabel zur Übersichtsseite verweisen!</p><h3>Widget</h3><h4>Aktiv</h4><p>Mit dieser Einstellung können Sie das Siegel-Widget aktivieren bzw. deaktivieren.</p><h4>Positionen</h4><p>Über die Positionen \"Unten rechts\" bzw. \"Unten links\" können Sie den Ort der Anzeige definieren. Beachten Sie, dass mobil (Smartphones) das Siegel-Widget statisch/fest unter dem Footer angezeigt wird, um keinen Content zu verdecken.</p><h4>Überschrift ausblenden</h4><p>Die Überschrift (im Standard \"Kundenzufriedenheit\") kann über diese Einstellung ausgeblendet werden</p><h4>Bewertungspunkte ausblenden</h4><p>Die schriftlichen Punkte (z.B. \"4.75 / 5.00\") können über diese Einstellung ausgeblendet werden.</p><h4>Gesamtanzahl ausblenden</h4><p>Diese Konfiguration erlaubt Ihnen die Gesamtanzahl innerhalb des Siegel-Widgets ausblenden zu können. Besonders empfehlenswert, falls Sie nur wenige Bewertungen haben.</p><h3>Obere Leiste</h3><h4>Aktiv</h4><p>Mit dieser Einstellung können Sie die obere Top-Bar Leiste aktivieren bzw. deaktivieren.</p><h4>Bewertungspunkte ausblenden</h4><p>Die schriftlichen Punkte (z.B. \"4.75 / 5.00\") können über diese Einstellung ausgeblendet werden.</p><h4>Gesamtanzahl ausblenden</h4><p>Diese Konfiguration erlaubt Ihnen die Gesamtanzahl innerhalb der oberen Leiste ausblenden zu können.</p><h3>Untere Leiste</h3><h4>Aktiv</h4><p>Mit dieser Einstellung können Sie die gesamte Footer-Leiste (\"Untere Leiste\", beide Spalten) ausblenden.</p><h4>Sterne ausblenden</h4><p>Falls Sie die Sterne (in der linken Spalte) ausblenden möchten.</p><h4>Überschrift ausblenden</h4><p>Falls Sie die Überschrift (unterhalb der Sterne innerhalb der linken Spalte) ausblenden möchten.</p><h4>Zeile 1 ausblenden</h4><p>Die Zeile unterhalb der Überschrift ausblenden.</p><h4>Zeile 2 ausblenden</h4><p>Die Zeile unterhalb der ersten Zeile ausblenden.</p><h4>Kommentar-Icon ausblenden</h4><p>Mit dieser Einstellung können Sie das kleine \"Verified\" (verifiziert) Icon neben dem Namen des Autors ausblenden.</p><h4>Kommentar passend zur aktiven Sprache</h4><p>Über diese Einstellung können Sie steuern, ob der letzte anzuzeigende Bewertungskommentar in der passenden Sprache angezeigt werden soll (anhand der Sprache des Kunden bzw. des Shops). Passiv: Es wird die aktuellste aktive Bewertung bezogen, die die min. Bewertung erfüllt.</p>","installationManual":"<h3>Plugin</h3><p>Installieren und aktivieren Sie das Plugin im Plugin-Manager</p><h3>Konfigurationen</h3><p>Achten Sie darauf, dass Sie das Plugin für alle gewünschten Verkaufskanäle aktivieren (Plugin-Konfiguration: Allgemeines &gt; Aktiv).<br />Alle Standardwerte der Konfigurationen sind gesetzt, um generell den Bewertungsdurchschnitt anzuzeigen. Genauere Infos zu allen Plugin-Konfigurationen finden Sie innerhalb der Plugin-Beschreibung!</p><h3>Cache</h3><p>Um aktuelle Daten anzeigen zu können, muss der Cache geleert werden. Dies passiert i.d.R. direkt nach der Plugin-Installation oder z.B. nach Theme Änderungen. Nach geänderten Plugin-Konfigurationen ist eine Leerung des Shop-Caches ebenfalls notwendig. Eine manuelle Leerung des Caches erfolgt über die Entwicklerkonsole. Weitere Infos dazu finden Sie in der offiziellen Shopware Dokumentation.</p>","shortDescription":"Shopware 6 Plugin um den Durchschnitt aller Produktbewertungen als Bewertungsbox (Siegel-Widget), obere Leiste und Footer-Erweiterung global anzeigen lassen (inkl. letzter Bewertung)","highlights":"Offizieller Nachfolger des \"GOLD\" prämierten Plugins \"Bewertungsbox\" (mit über 300 Downloads)\nKW 03/2020 \"Plugin of the week\" ausgezeichnet\nseit 2015 Plugin-Hersteller mit über 3700 Downloads\nBewertungsdurchschnitt aller Bewertungen errechnen und anzeigen lassen\nOptisch ansprechend im Header, am unteren Seitenrand oder vor dem Footer anzeigen","features":"Berechnung und Anzeige der durchschnittlichen Shop-Bewertung (anhand der aktiven Produktbewertungen)\nAnzeige pro Verkaufskanal definierbar\n(optional) Bewertungen aller Verkaufskanäle können zusammengefasst werden\nDefinition der notwendigen min. Bewertung für die Anzeige aller Elemente\nAnzeige als Siegel: Widget im unteren Bereich (unten rechts/links definierbar)\nAnzeige im Header: Top-Bar-Leiste\nAnzeige im Footer: Textliche Zusammenfassung und aktuellste Bewertung\n(optionaler) Link zur Bewertungsübersicht (Kategorieseite, anderes Plugin)\n(optional) Letzte Bewertung anhand der aktiven Sprache\nAlle Texte können frei definierbar übersetzt werden (innerhalb der Übersetzungen)\nAlle Bereiche zur Anzeige können unabhängig definiert und ein/ausgeblendet werden\nInnerhalb der Bereiche sind mehrere Konfigurationen zur Ein- und Ausblendung möglich\nmobile Unterstützung (Siegel-Widget, Footer-Box)"},{"id":15944,"name":"Average review ratings","description":"<h2>What does this plugin do?</h2><p>It's no big secret that reviews are extremely important in e-commerce environments and potential customers are very much interested in these. Accordingly, it is important to animate buyers to write reviews and on the other hand to present this data in the shop. In a standard shop, product reviews are only displayed product-related. This plugin calculates the average rating from all product reviews and displays it globally and prominently everywhere in the shop!</p><h2>Display options</h2><p>The average rating of your shop can be displayed in several places:</p><h3>\"Seal\" Widget</h3><p>A seal (widget box) can be displayed either at the bottom right or at the bottom left of your shop. This box includes for example a text addition (\"VERY GOOD, \"GOOD\", ...) and ratin stars. Like all other plugin texts, these texts are freely editable. The widget contains several configuration options to allow an individual layout.</p><h3>Top bar (header)</h3><p>Above the actual header, a small bar is displayed, which shows the average rating textually as well as graphically.</p><h3>Lower bar (footer)</h3><p>Next to the text summary, the most current rating is also available (review, name, date). The layout of the speech bubble is build purely in CSS (high res)</p><h2>Plugin configurations</h2><h3>General information</h3><h4>Active</h4><p>The plugin can be activated for each sales channel individually.</p><h4>Summarize ratings</h4><p>If you want to summarize the ratings of all sales channels (for the calculation of the average rating), this setting has to be active. Otherwise, only reviews that match the current sales channel are included in the calculation.</p><h4>Min. review rating</h4><p>You can use this value to automatically control which minimum rating must be reached so that all elements are displayed.</p><h3>Widget</h3><h4>Active</h4><p>With this setting you can activate or deactivate the seal widget (rating box)</p><h4>Positions</h4><p>You can define the position (\"Bottom right\" or \"Bottom left\"). Just note that the seal widget is displayed statically/fixed under the footer on mobile (smartphones) devices.</p><h4>Hide headline</h4><p>The headline can be hidden using this setting.</p><h4>Hide rating points</h4><p>The written points (\"4.75 / 5.00\") can be hidden using this setting.</p><h4>Hide total number</h4><p>This configuration allows you to hide the total number within the seal widget.</p><h3>Upper bar</h3><h4>Active</h4><p>With this setting you can activate or deactivate the top bar.</p><h4>Hide rating points</h4><p>The written points (\"4.75 / 5.00\") can be hidden using this setting.</p><h4>Hide total number</h4><p>This configuration allows you to hide the total number of reviews within the upper bar.</p><h3>Bottom bar (footer)</h3><h4>Active</h4><p>With this setting you can hide the entire footer bar (\"Lower bar\", both columns).</p><h4>Hide Stars</h4><p>If you want to hide the stars (left column)</p><h4>Hide headline</h4><p>If you want to hide the headline (below the stars in the left column).</p><h4>Hide line 1</h4><p>Hide the line below the headline.</p><h4>Hide line 2</h4><p>Hide the line below the first line.</p><h4>Hide comment icon</h4><p>With this setting you can hide the small \"Verified\" icon next to the comment name.</p><h4>Comment matching the active language</h4><p>You can use this setting to control, if the latest review should match the current/active shop language.</p>","installationManual":"<h3>Plugin</h3><p>Install and activate the plugin via the Plugin Manager</p><h3>Configurations</h3><p>Make sure that you activate the plugin for all desired sales channels (plugin configuration: General &gt; Active).</p><p>All default values of the configurations are set to generally display the average rating</p><h3>Cache</h3><p>In order to display current data, you must empty the Shopware cache. This usually happens directly after the plugin installation. Make sure to clear the shop cache after changing plugin configurations.</p>","shortDescription":"Shopware 6 Plugin to display the average of all product reviews as a rating box (widget), top bar and footer extension globally (incl. the last rating)","highlights":"Official successor of the \"GOLD\" plugin \"Rating Box\" with over 300 downloads\nsince 2015 plugin manufacturer with over 3700 downloads\nCalculate and display the average rating of all reviews\nmany configurations","features":"Calculation and display of the average shop rating (based on active product review ratings)\n(optional) reviews of all sales channels can be summarized\nDefinition of the necessary minimum rating\nDisplay as a rating box widget\nHeader top bar\nFooter bar (text summary and last review)\n(optional) Last review based on the active language\nAll texts can be translated\nSeveral configurations\nmobile support (widget, footer box)"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157785,"bookingKey":"Mill632364433971","bookingText":"Average review ratings","price":49,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":162880,"bookingKey":"Mill632364433971_M","bookingText":"Average review ratings","price":4.9,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"},{"id":168775,"bookingKey":"Mill632364433971_M12","bookingText":"Average review ratings","price":49,"duration":12,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGbmoUj","preview":true,"priority":1,"id":36904},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBt2daC","preview":false,"priority":2,"id":37037},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMMlIct","preview":false,"priority":0,"id":36906},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpnxSxpH","preview":false,"priority":0,"id":36907},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLEnAg7","preview":false,"priority":0,"id":36908},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpDY8Ztt","preview":false,"priority":0,"id":36909},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php6r6S91","preview":false,"priority":0,"id":38379}],"comments":[{"authorName":"Josua Sievers","text":"","headline":"Gutes Plugin und freundlicher Support","creationDate":{"date":"2022-01-02 10:56:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Durchschnittliche Shop Bewertung - Widget & Trust-Banner","description":"<h2>Für wen ist dieses Plugin gedacht?</h2><p>Es ist kein groß gehütetes Geheimnis, dass Bewertungen extrem wichtig im E-Commerce sind, und sich potentielle Kunden sehr an dieses orientieren. Dementsprechend ist es wichtig zum einen Käufer zu animieren zu bewerten, und zum anderen diese präsent im Shop darzustellen. Im Standard werden Produktbewertungen immer nur produktbezogen dargestellt. Dieses Plugin errechnet aus allen Produktbewertungen die durchschnittliche Bewertung, die Sie global und überall im Shop prominent darstellen könnten!</p><h2>Anzeigemöglichkeiten</h2><p>Der Bewertungsdurchschnitt Ihres Shops kann an mehreren Stellen angezeigt werden. Dabei können Sie steuern, ab welchem Wert (mind.) die Anzeige grundsätzlich erfolgen soll. Eine Anzeige bei vielleicht zu niedrigen Werten kann hier automatisch verhindert werden. Die verschiedenen Anzeigeorte werden Ihnen folgend genauer erklärt.</p><h3>Siegel (Widget)</h3><p>Entweder unten rechts oder unten links kann ein Siegel (bzw. Widget-Box) ausgegeben werden. Diese Box hat den für Kunden üblichen Aufbau und wird durch einen textlichen Zusatz (\"SEHR GUT, \"GUT\", ...) ergänzt. Diese Bezeichnungen sind so wie alle anderen Plugin-Texte frei definierbar (innerhalb der Shop-Übersetzungen). Das Widget beinhaltet mehrere Konfigurationsmöglichkeiten, um eine individuelle Anzeige zu ermöglichen. Mobil (Smartphones) wird diese Bewertungsbox am unteren Bildschirmrand unter dem Footer fest angezeigt, um dem Nutzer keinen kostbaren Platz zu verdecken!</p><h3>Obere Leiste (Header)</h3><p>Über dem eigentlichen Header wird eine schmale, dezente aber trotzdem nicht unauffällige Leiste ausgegeben, die textlich als auch grafisch die Durchschnittsbewertung ausgibt. Die Texte sind selbst frei definierbar, die Punkte (\"4.75/5.00\") oder die Gesamtanzahl können hier separat ausgeblendet werden.</p><h3>Untere Leiste (Footer)</h3><p>Die Anzeige im Footer ist platzbedingt etwas umfangreicher: Neben der selbst frei definierbaren textlichen Zusammenfassung (Sterne, Bewertungsdurchschnitt, Anzahl) auf der linken Seite (mobil auf der vollen Breite) ist noch die aktuellste Bewertung vorhanden. Die Bewertung wird hier mit einem \"Verifiziert\" Icon (erweitertes Shopware-Icon) ausgestattet (kann optional ausgeblendet werden), als auch der Name, Kommentar und das Bewertungsdatum (Formatierung automatisch anhand der Lokalisierung). Das Layout einer Sprechblase wird hier rein per CSS gelöst, damit eine ordentliche Anzeige auf allen Breiten, Höhen und Auflösungen ermöglicht wird!</p><h2>Plugin-Konfigurationen</h2><h3>Allgemein</h3><h4>Aktiv</h4><p>Das Plugin kann spezifisch pro Verkaufskanal aktiviert bzw. deaktiviert werden.</p><h4>Bewertungen zusammenfassen</h4><p>Wenn Sie für die Berechnung des Bewertungsdurchschnitts Bewertungen aller Verkaufskanäle zusammenfassen möchten, sollte diese Einstellung aktiv sein. Ansonsten werden nur Bewertung passend zum jeweiligen Verkaufskanal in die Berechnung und Anzeige mit aufgenommen.</p><h4>Mind. Bewertungsdurchschnitt</h4><p>Mit diesem Wert können Sie automatisch steuern, welche Bewertung mindestens erreicht werden muss, damit alle Elemente angezeigt werden. Falls dieser definierte Wert unterschritten wird, werden alle Komponenten (Siegel-Widget, obere Leiste, untere Leiste) ausgeblendet. Dieser Wert bestimmt ebenfalls, welche Bewertung mind. die letzte Bewertung haben muss, die im unteren Bereich (\"Untere Leiste\") angezeigt wird.</p><h4>Bewertungsübersicht</h4><p>Mit dieser optionalen Konfiguration können Sie eine Kategorieseite definieren, die über ein Link verwiesen wird (Top-Bar, Widget). Mit einem anderen meiner Plugins können Sie eine Kategorieseite zu einer Übersicht mit allen Bewertungen umfunktionieren (Erlebniswelten Element). So können Sie von der Anzeige des Bewertungsdurchschnitts komfortabel zur Übersichtsseite verweisen!</p><h3>Widget</h3><h4>Aktiv</h4><p>Mit dieser Einstellung können Sie das Siegel-Widget aktivieren bzw. deaktivieren.</p><h4>Positionen</h4><p>Über die Positionen \"Unten rechts\" bzw. \"Unten links\" können Sie den Ort der Anzeige definieren. Beachten Sie, dass mobil (Smartphones) das Siegel-Widget statisch/fest unter dem Footer angezeigt wird, um keinen Content zu verdecken.</p><h4>Überschrift ausblenden</h4><p>Die Überschrift (im Standard \"Kundenzufriedenheit\") kann über diese Einstellung ausgeblendet werden</p><h4>Bewertungspunkte ausblenden</h4><p>Die schriftlichen Punkte (z.B. \"4.75 / 5.00\") können über diese Einstellung ausgeblendet werden.</p><h4>Gesamtanzahl ausblenden</h4><p>Diese Konfiguration erlaubt Ihnen die Gesamtanzahl innerhalb des Siegel-Widgets ausblenden zu können. Besonders empfehlenswert, falls Sie nur wenige Bewertungen haben.</p><h3>Obere Leiste</h3><h4>Aktiv</h4><p>Mit dieser Einstellung können Sie die obere Top-Bar Leiste aktivieren bzw. deaktivieren.</p><h4>Bewertungspunkte ausblenden</h4><p>Die schriftlichen Punkte (z.B. \"4.75 / 5.00\") können über diese Einstellung ausgeblendet werden.</p><h4>Gesamtanzahl ausblenden</h4><p>Diese Konfiguration erlaubt Ihnen die Gesamtanzahl innerhalb der oberen Leiste ausblenden zu können.</p><h3>Untere Leiste</h3><h4>Aktiv</h4><p>Mit dieser Einstellung können Sie die gesamte Footer-Leiste (\"Untere Leiste\", beide Spalten) ausblenden.</p><h4>Sterne ausblenden</h4><p>Falls Sie die Sterne (in der linken Spalte) ausblenden möchten.</p><h4>Überschrift ausblenden</h4><p>Falls Sie die Überschrift (unterhalb der Sterne innerhalb der linken Spalte) ausblenden möchten.</p><h4>Zeile 1 ausblenden</h4><p>Die Zeile unterhalb der Überschrift ausblenden.</p><h4>Zeile 2 ausblenden</h4><p>Die Zeile unterhalb der ersten Zeile ausblenden.</p><h4>Kommentar-Icon ausblenden</h4><p>Mit dieser Einstellung können Sie das kleine \"Verified\" (verifiziert) Icon neben dem Namen des Autors ausblenden.</p><h4>Kommentar passend zur aktiven Sprache</h4><p>Über diese Einstellung können Sie steuern, ob der letzte anzuzeigende Bewertungskommentar in der passenden Sprache angezeigt werden soll (anhand der Sprache des Kunden bzw. des Shops). Passiv: Es wird die aktuellste aktive Bewertung bezogen, die die min. Bewertung erfüllt.</p>","installationManual":"<h3>Plugin</h3><p>Installieren und aktivieren Sie das Plugin im Plugin-Manager</p><h3>Konfigurationen</h3><p>Achten Sie darauf, dass Sie das Plugin für alle gewünschten Verkaufskanäle aktivieren (Plugin-Konfiguration: Allgemeines &gt; Aktiv).<br />Alle Standardwerte der Konfigurationen sind gesetzt, um generell den Bewertungsdurchschnitt anzuzeigen. Genauere Infos zu allen Plugin-Konfigurationen finden Sie innerhalb der Plugin-Beschreibung!</p><h3>Cache</h3><p>Um aktuelle Daten anzeigen zu können, muss der Cache geleert werden. Dies passiert i.d.R. direkt nach der Plugin-Installation oder z.B. nach Theme Änderungen. Nach geänderten Plugin-Konfigurationen ist eine Leerung des Shop-Caches ebenfalls notwendig. Eine manuelle Leerung des Caches erfolgt über die Entwicklerkonsole. Weitere Infos dazu finden Sie in der offiziellen Shopware Dokumentation.</p>","version":"1.1.2","changelog":[{"version":"1.1.2","text":"<ul><li>Shopware 6.5</li><li>Bootstrap update</li><li>EntityRepository refactoring</li></ul>","creationDate":{"date":"2023-06-03 19:17:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul><li>new plugin config to set an optional link (rating overview)</li><li>new snippets and styles</li></ul>","creationDate":{"date":"2021-12-31 16:25:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Shopware 6.4 support</li><li>twig config</li><li>base scss</li></ul>","creationDate":{"date":"2021-04-19 12:12:53.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>Shopware 6.3 support</li></ul>","creationDate":{"date":"2020-10-26 20:22:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<ul><li>Shopware 6.2 support</li><li>usage of shopware config values</li><li>removed custom theme config variables</li></ul>","creationDate":{"date":"2020-05-29 21:06:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<ul><li>Shopware 6.1</li><li>fixed storefront namespace</li><li>fixed snippet namespace</li><li>relocated styles</li><li>relocated snippets</li><li>default plugin configuration values</li><li>storefront composer require</li></ul>","creationDate":{"date":"2019-12-15 20:21:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>initial plugin release</li></ul>","creationDate":{"date":"2019-11-11 20:06:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Mill632364433971","redirectToStore":true,"lowestPriceValue":4.9}