{"id":9385,"name":"SwpPollSix","code":"Swp4527451723974","lastChange":{"date":"2023-07-19 13:49:04.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptZavRl","examplePageUrl":"","moduleKey":"SwpPollSix","creationDate":{"date":"2019-07-18 14:10:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2022-08-16 14:43:58.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2022-09-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-08-11 15:14:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":39,"prefix":"Swp","name":"BuI Hinsche GmbH","website":"//www.bui-hinsche.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/prod39_bui-fb-logo_128.png"},"infos":[{"id":14519,"name":"Umfrage","description":"<h2>**** Was bietet das Plugin ****</h2><p>Du möchtest gerne wissen wie deine Kunden zu dir gefunden haben? Oder\ninteressiert dich vielleicht ihre Meinung zu Funktionalitäten in deinem\nShop. Du kannst Sie aber auch nach ihrer Meinung zu deinem Service\nbefragen. All diese Fragen kannst du mit unseren Plugin \"Umfrage\"\nklären. Die Umfragen kannst du über die Erlebniswelten darstellen.<br></p><p>Deine Kunden erhalten direkt danach eine Auswertung der Umfrage. Selbstverständlich ohne jegliche Rückschlüsse auf die anderen Kunden. Wichtig ist jedoch, dass der Kunde vor der Umfrage die Cookies akzeptieren muss oder sich anmelden. Sollte er dies nicht tun, kann er nicht an der Umfrage teilnehmen.</p><p><br>Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist.</p><p><br></p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 5 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen.&nbsp;</p><h4>**** Kompatibilität zu Plugins ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität&nbsp;kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins bzw. Funktionserweiterungen von Shopware, die nicht in der Community-Edition enthalten sind.&nbsp;</p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung.&nbsp;</p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können.&nbsp;</p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden.&nbsp;</p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br>E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>\n\n\n","installationManual":"<a href=\"https://docs.google.com/document/d/13B4o-Mwer3mLoxBM7uVXFITKMwni6cSpArLclnhXcG0/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br>\n\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.\n\n\n","shortDescription":"Mit unserem Plugin Umfragen können Sie zum Beispiel Meinungsumfragen anlegen und auswerten. Über Erlebniswelten können diese ganz bequem relativ flexibel ausgegeben werden.","highlights":"über Erlebniswelten nahezu überall einsetzbar","features":""},{"id":14546,"name":"poll","description":"<h2>**** What does the plugin ****</h2>\n\nYou would like to know how your customers found you? Or maybe you're interested in their opinion about the functionalities in your shop. You can also ask them about their opinion of your service. You can answer all these questions with our \"Survey\" plugin. You can display the surveys via the experience worlds.\n\nYour customers will receive an evaluation of the survey directly afterwards. Of course without any conclusions about the other customers. However, it is important that the customer accepts the cookies before the survey or he must login in the store. If he does not do this, he cannot participate in the survey.\n\nIf you are missing any function in the plugin or have suggestions for improvement, please contact me at info@bui-hinsche.com. We will gladly check your suggestion and then decide whether we can implement it technically in a sensible way. Therefore, please don't be angry with us if it is not immediately included in the next update.<h3>** FAQ **</h3><h4>**** Basic ****</h4><p>Our plugin are all designed to the standard functionalities of the basic system Shopware 5 (Community Edition). This concerns both the functionalities and the design. So if it does not fit once, may have to make adjustments to your own theme. Please understand that it is impossible for us to consider every single theme.&nbsp;</p><h4>**** compatibility to plugins ****</h4><p>Basically, our plugins are compatible with each other. If there should be restrictions or malfunctions, we will gladly check them in a timely manner. In individual cases, it may happen that functionalities of individual plugins from our house are excluded. In this case, we will point this out to you. However, this compatibility&nbsp;can only be guaranteed for our plugin. The market of third party providers and their plugins makes it impossible to take into account all functionalities and modes of operation. This also applies to plugins or functional extensions of Shopware that are not included in the Community Edition.</p><h4>**** Support ****</h4><p>Basically, we first look to see if it is an error from the plugin or the cause is otherwise. Depending on the result, we will inform you whether there will be any costs or not. However, if you have made changes to the plugin yourself, any claim to free support is forfeited. In this case, we charge the full cost.&nbsp;</p><h4>**** Are there trial versions for our plugin ****</h4><p>All our plugin you can test with the free trial month to look at the functionalities in peace and try. In this trial month all functions are available to you, there are no limitations. We ask you to make use of this trial month to decide for sure if it is exactly the plugin you need or if it offers the functionalities you expected before buying or renting.</p><h4>**** Can I have the plugin customized? ****</h4><p>YES, if you are missing a functionality or you need a customization for your specific needs, we will be happy to find a solution together with you. The easiest way to do this is to send us an email with your ideas. Don't forget to give us your contact details, so we can get in touch with you.&nbsp;</p><h3>** What we do **</h3><h4>**** consulting ****</h4><p>The digital world is changing hourly and getting more and more complex. Therefore, we have made it our mission to stay on the ball for you and to constantly expand and develop our knowledge and relieve you of this tedious work. We can advise you, for example, on questions such as:</p><ul><li>How do I optimize my store system?</li><li>Which merchandise management fits me?</li><li>Can I optimize processes in relation to the store?</li><li>Can I optimize processes in the company with the store?</li></ul><h4>**** development ****</h4><p>Our developers are always and constantly to develop new products, expand, develop or optimize. But we also look beyond the horizon and develop together with you suitable websites or interfaces to software connections. Completely individual solutions are also no problem. We just have to talk about it.</p><h4>**** Design ****</h4><p>You want a new design? We help you with the implementation.</p><h4>**** support ****</h4><p>Like a car or bike, your store also needs regular maintenance. We also have suitable solutions for this. Many of our customers already use this and let store and plugin updates through us. Just ask for our maintenance contract.</p><h3>** Who are we? **</h3><p>BuI-Hinsche GmbH has been in the e-commerce sector since 2006 and therefore has 15 years of experience to fall back on. Our employees are 100% behind the company and give their best every day. Creative, solution-oriented and customer-oriented - these are always statements that are made about us.&nbsp;</p><p></p><h3>** Contact **</h3><p>phone: +49 3441 9799060<br>e-mail: info@bui-hinsche.com or support@bui-hinsche.com</p><p></p>\n\n\n\n\n\n","installationManual":"<a href=\"https://docs.google.com/document/d/1vizsuwITsMRKlxu2KU3uucN5GVOvZYt4b9gXvWwqxB4/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Documentation / Installation / Configuration</a><br><p>If you have any questions or are unsure about something, please contact us at support@bui-hinsche.com We will help you quickly and easily. Alternatively you can contact us directly via your shopware account.</p>\n\n\n","shortDescription":"With our plugin Surveys you can for example create and evaluate opinion polls. This evaluation is available in the backend in the form of a table, bar chart or pie chart.","highlights":"Can be used almost anywhere via worlds of experience","features":""}],"addons":["enterpriseCertified","highlightInListing"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":166153,"bookingKey":"Swp4527451723974","bookingText":"poll","price":294.97,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":166152,"bookingKey":"Swp4527451723974_M","bookingText":"poll","price":29.97,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpxtO1YZ","preview":true,"priority":0,"id":91830},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpLtQyMf","preview":false,"priority":100,"id":95126},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdpEcpY","preview":false,"priority":99,"id":95122},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuCJbIY","preview":false,"priority":98,"id":95123},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIp3zzG","preview":false,"priority":97,"id":95124},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php2ImX3f","preview":false,"priority":96,"id":95125},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYH6yWe","preview":false,"priority":95,"id":95127},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php1uabRH","preview":false,"priority":0,"id":91833},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpF92lPP","preview":false,"priority":0,"id":91837},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpL1vqYa","preview":false,"priority":0,"id":91839},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdoJ9vT","preview":false,"priority":0,"id":91841},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphEbrPI","preview":false,"priority":0,"id":91842},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVOlkDw","preview":false,"priority":0,"id":95128},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3x9Ck2","preview":false,"priority":0,"id":95129},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqUJl9Z","preview":false,"priority":0,"id":95130},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpU7faub","preview":false,"priority":0,"id":95131},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpzbEZ8g","preview":false,"priority":0,"id":95132}],"comments":[],"ratingAverage":0,"label":"Umfrage","description":"<h2>**** Was bietet das Plugin ****</h2><p>Du möchtest gerne wissen wie deine Kunden zu dir gefunden haben? Oder\ninteressiert dich vielleicht ihre Meinung zu Funktionalitäten in deinem\nShop. Du kannst Sie aber auch nach ihrer Meinung zu deinem Service\nbefragen. All diese Fragen kannst du mit unseren Plugin \"Umfrage\"\nklären. Die Umfragen kannst du über die Erlebniswelten darstellen.<br /></p><p>Deine Kunden erhalten direkt danach eine Auswertung der Umfrage. Selbstverständlich ohne jegliche Rückschlüsse auf die anderen Kunden. Wichtig ist jedoch, dass der Kunde vor der Umfrage die Cookies akzeptieren muss oder sich anmelden. Sollte er dies nicht tun, kann er nicht an der Umfrage teilnehmen.</p><p><br />Sollte dir irgendeine Funktion im Plugin fehlen oder du hast Verbesserungsvorschläge für uns, dann melde ich einfach unter info@bui-hinsche.com. Wir prüfen deinen Vorschlag gerne und entscheiden dann ob wir ihn sinnvoll technisch umsetzen können. Daher sei uns bitte nicht böse, wenn es nicht sofort beim nächsten Update enthalten ist.</p><p><br /></p><h3>** FAQ **</h3><h4>**** Grundlegend ****</h4><p>Unser Plugin sind alle auf die Standardfunktionalitäten des Grundsystems Shopware 5 (Community-Edition) ausgelegt. Dies betrifft sowohl die Funktionalitäten als das Design. Sollte es also einmal nicht passen, müssen evtl. Anpassungen am eigenen Theme vorgenommen werden. Bitte habe Verständnis dafür, dass es uns unmöglich ist, jedes einzelne Theme zu berücksichtigen. </p><h4>**** Kompatibilität zu Plugins ****</h4><p>Grundlegend sind unsere Plugin untereinander kompatibel. Sofern es zu Einschränkungen oder Fehlfunktionen kommen sollte, prüfen wir diese gerne zeitnah. In einzelnen Fällen kann es vorkommen, dass sich Funktionsweisen einzelner Plugins aus unserem Haus ausschließen. In diesem Fall, weisen wir dich darauf hin. Diese Kompatibilität kann jedoch nur für unsere Plugin gewährleistet werden. Der Markt an Drittanbietern und deren Plugins macht es unmöglich auf alle Funktionalitäten und Funktionsweisen Rücksicht nehmen zu können. Dies gilt auch für Plugins bzw. Funktionserweiterungen von Shopware, die nicht in der Community-Edition enthalten sind. </p><h4>**** Support ****</h4><p>Grundlegend schauen wir zunächst, ob es ein Fehler vom Plugin ist oder die Ursache anders begründet ist. Je nach Ergebnis informieren wir dich darüber, ob Kosten entstehen oder nicht. Solltest du jedoch selbst Änderungen am Plugin vorgenommen haben, ist damit jeglicher Anspruch auf kostenlosen Support verwirkt. In diesem Fall stellen wir die kompletten Kosten in Rechnung. </p><h4>**** Gibt es Testversionen für unsere Plugin ****</h4><p>Alle unsere Plugin kannst du mit dem kostenfreien Probemonat testen, um Dir die Funktionalitäten in Ruhe anzuschauen und auszuprobieren. In diesem Probemonat stehen dir alle Funktionen zur Verfügung, es gibt keine Eingrenzungen. Wir bitten von diesem Probemonat Gebrauch zu machen, um vor dem Kauf oder der Miete wirklich sicher sicher zu entscheiden, ob es genau das Plugin ist, was du benötigst bzw. es die Funktionalitäten bietet die du erwartet hast.</p><h4>**** Kann ich das Plugin individuell anpassen lassen? ****</h4><p>JA, wenn dir eine Funktionalität fehlt oder du für deine speziellen Bedürfnisse eine Anpassung benötigst, finden wir gerne mit dir zusammen eine Lösung. Dafür schreibst du uns am einfachsten eine E-Mail mit deinen Vorstellungen. Vergiß nicht uns deine Kontaktdaten mitzuteilen, damit wir mit dir ins Gespräch kommen können. </p><h3>** Was leisten wir **</h3><h4>**** Beratung ****</h4><p>Die digitale Welt ändert sich stündlich und wird immer komplexer. Daher haben wir es uns zur Aufgabe gemacht für dich am Ball zu bleiben und unser Wissen stetig zu erweitern und auszubauen und dir diese lästige Arbeit abzunehmen. Wir können dich zum Beispiel beraten bei Fragen wie:</p><ul><li>Wie optimiere ich mein Shopsystem?</li><li>Welche Warenwirtschaft passt zu mir?</li><li>Kann ich Abläufe im Bezug auf den Shop optimieren?</li><li>Kann ich Abläufe im Unternehmen mit dem Shop optimieren?</li></ul><h4>**** Entwicklung ****</h4><p>Unsere Entwickler sind immer und ständig daran neue Produkte zu entwickeln, auszubauen, weiterzuentwickeln oder zu optimieren. Wir sehen aber auch über den Tellerrand hinaus und entwickeln mit dir zusammen passende Webseiten oder Schnittstellen zu Softwareanbindungen. Komplett individuelle Lösungen stellen dabei auch kein Problem dar. Wir müssen nur darüber sprechen.</p><h4>**** Design ****</h4><p>Du möchtest ein neues Design? Wir helfend dir bei der Umsetzung.</p><h4>**** Betreuung ****</h4><p>Wie ein Auto oder Fahrrad benötigt auch dein Shop eine regelmäßige Wartung. Auch dafür haben wir passende Lösungen. Viele unserer Kunden nutzen dies bereits und lassen Shop- und Pluginupdates durch uns durchführen. Frag einfach nach unserem Wartungsvertrag.</p><h3>** Wer sind wir? **</h3><p>Die BuI-Hinsche GmbH ist seit 2006 im E-Commerce-Sektor tätig und verfügt daher seit 15 Jahren über Erfahrung, auf die sie zurückgreifen kann. Unsere Mitarbeiter stehen zu 100% hinter dem Unternehmen und geben tag-täglich ihr Bestes. Kreativ, lösungsorientiert und kundennah - dies sind immer wieder Aussagen die über uns getroffen werden. </p><p></p><h3>** Kontakt **</h3><p>Telefon: +49 (0) 3441 9799060<br />E-Mail: info@bui-hinsche.com oder support@bui-hinsche.com</p><p></p>","installationManual":"<a href=\"https://docs.google.com/document/d/13B4o-Mwer3mLoxBM7uVXFITKMwni6cSpArLclnhXcG0/edit?usp=sharing\" target=\"_blank\" rel=\"noreferrer noopener\">Dokumentation / Installation / Konfiguration</a><br />\n\nSolltest du Fragen haben oder irgendetwas unklar sein, melde idealerweise unter support@bui-hinsche.com. Wir helfen dir schnell und unkompliziert weiter. Alternativ dazu steht dir auch der direkte Kontakt über deinen Shopwareaccount zur Verfügung.","version":"6.05.00","changelog":[{"version":"6.05.00","text":"<p>adjustment to Shopware-Version 6.5.0.0</p>","creationDate":{"date":"2023-05-04 10:54:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.01","text":"<p>improvement in the creation of surveys and questions</p><p>adaptation to standard cookie management</p>","creationDate":{"date":"2022-09-28 14:33:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"6.04.00","text":"<p>first release for Shopware 6</p>","creationDate":{"date":"2022-08-11 15:22:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Swp4527451723974","redirectToStore":false,"lowestPriceValue":29.97}