{"id":9422,"name":"NetzpStaging6","code":"Netzp57164792228","lastChange":{"date":"2023-07-18 15:58:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":false,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php06PZ1R","examplePageUrl":"","moduleKey":"NetzpStaging6","creationDate":{"date":"2019-07-26 14:41:22.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-09-28 16:20:46.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-08-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-07-06 12:07:23.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":41,"prefix":"Netzp","name":"netzperfekt","website":"//netzperfekt.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpZAJJJq"},"infos":[{"id":14594,"name":"Testserver/Stagingumgebung einrichten","description":"<h2>Schnell eine Testumgebung einrichten&nbsp;</h2><h3>Das Original-Plugin für Testumgebungen - das erfolgreiche Shopware 5-Plugin jetzt auch für Shopware 6.</h3><h3><b>Hinweis</b>: Wir bieten dieses Plugin für Sie absolut kostenfrei an, daher können wir keinen Support leisten. Bitte nutzen Sie unsere ausführliche Dokumentation und die FAQ.</h3><p><b>Funktionen im Überblick:</b></p><p></p><ul><li>Eine Testumgebung wird vollautomatisch in einem Unterverzeichnis erstellt. Dabei werden sowohl die Shopware-Dateien als auch die Datenbank und Einstellungen des Liveservers übernommen. Durch das Unterverzeichnis gibt es keine Probleme mit Plugin-Lizenzen, der Shop funktioniert in der Testumgebung wie gewohnt.</li><li>Es können beliebig viele Testumgebungen in unterschiedlichen Unterverzeichnissen angelegt werden.</li><li>Eine Testumgebung ist mit wenigen Mausklicks erstellt - einfach die Daten einer zweiten Datenbank eingeben und auf „Erstellen“ klicken (je nach Server ist evtl. zusätzlich die Einstellung des Testverzeichnisses als ausführbares Shopwareverzeichnis erforderlich).</li><li>Eine Testumgebung kann per Mausklick konfiguriert werden: so ist etwa der Wartungsmodus des Test-Shops einstellbar, oder die Optionen der .env-Datei können verändert werden.&nbsp;</li><li>Verzeichnisse und einzelne Datenbank-Tabellen können ausgeschlossen werden (z.B. die Artikelbilder) - das spart enorm Zeit. Das Dateisystem und die Datenbank können getrennt voneinander in der Testumgebung neu erstellt werden.</li><li>Daten können vollständig anonymisiert werden (Kundendaten, Bestellungen etc.) oder alternativ können nur die Stammdaten (Artikel, Kategorien, Konfiguration) in die Testumgebung übertragen werden, die Kundendaten sind dann vollständig leer.</li></ul><p><b>Das Testserver-Plugin ist für jeden professionellen Shopbetreiber sinnvoll und erleichtert die Arbeit von Dienstleistern und Agenturen ganz erheblich!</b></p><p>Das Plugin wurde ausführlich getestet, dennoch übernehmen wir keine Haftung. Bitte stellen Sie sicher, dass Sie vor der ersten Einrichtung eines Testservers eine Datensicherung erstellen. Weiterhin ersetzt dieses Plugin keinen Backup. Ein Zurückspielen des Testservers auf den Liveserver ist aus technischen Gründen nicht möglich.</p><p><b>Systemvoraussetzungen</b></p><p></p><ul><li>Shopware-zertifizierter Webserver mit Apache oder Nginx</li><li>Zugangsdaten für eine zweite Datenbank</li><li>Die PHP-Einstellung max_execution_time muss auf 1200 (oder gegebenenfalls höher) stehen</li><li>Da große Mengen an Dateien kopiert werden, sollte der Server ausreichend schnell sein und über eine SSD verfügen. Weiterhin dürfen keine übertriebenen PHP-Sicherheitsfunktionen aktiv sein (z.B. muss die PHP-Funktion dir() verfügbar sein).</li><li><b>Wichtig</b>: <i>die Domain des Testservers muss identisch mit der Domain des Live-Servers sein</i>, d.h. es darf keine Zuordnung einer Subdomain zum Unterverzeichnis des Testservers vorgenommen werden. Dies wären für die Shopware-Lizenzprüfung zwei unterschiedliche Domains, entsprechend wären die Plugin-Lizenzen dann nicht mehr gültig.</li></ul><p><b>Bitte testen Sie das Plugin vor dem Einsatz</b>. Da es leider sehr viele unterschiedliche Serverkonfigurationen gibt, kann es im Einzelfall sein, dass das Plugin auf Ihrem Server nicht lauffähig ist. Insbesondere ist ein Shopware-zertifizierter Hoster wichtig: \"günstige\" Hostingpakete sind i.d.R. nicht geeignet!&nbsp;</p><p><b>Ausführliche Dokumentation</b>:&nbsp;&nbsp;<a href=\"https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6</a></p><h3><b>Hinweis</b>:&nbsp;Wir bieten dieses Plugin für Sie absolut kostenfrei an, daher können wir keinen Support leisten. Bitte nutzen Sie unsere ausführliche Dokumentation und die FAQ. Vielen Dank!</h3><h2>+++ Entdecken Sie auch unsere anderen&nbsp;<a href=\"https://store.shopware.com/netzperfekt.html?p=1&amp;o=12&amp;n=21&amp;c=3&amp;shopwareVersion=6\" target=\"_blank\" rel=\"noreferrer\">Plugins für Shopware 6</a>&nbsp;und insbesondere unsere&nbsp;<a href=\"https://store.shopware.com/netzp10138892889/mobile-shop-manager-app.html?c=3\" target=\"_blank\" rel=\"noreferrer\"><b>Mobile Shop Manager App</b></a>&nbsp;für iOS und Android - unterwegs immer alle wichtigen Kennzahlen Ihres Shops dabei haben! +++</h2>","installationManual":"<p></p><ul><li>Wie gewohnt über den Plugin-Manager installieren und aktivieren</li><li>Im Backend den Menüpunkt Einstellungen / Plugins / Staging/Testumgebungen aufrufen</li><li>Eine neue Testumgebung anlegen und zunächst im Tab Einstellungen den Namen, Verzeichnis und die Datenbank-Zugangsdaten für den Testserver eintragen.</li><li>Im ersten Tab den Button Erstellen wählen. Wichtig: die Einrichtung eines Testserver kann - je nach Shopgröße - durchaus mehrere Minuten in Anspruch nehmen.&nbsp;</li><li>Falls das Frontend des Testservers nicht oder mit einer Fehlermeldung erscheint, muss unter Umständen der Cache des Testservers geleert werden</li></ul><p></p><p><b>Ausführliche Dokumentation und Support:&nbsp;</b><a href=\"https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6</a><br></p><p><b>Wichtig: </b>In den meisten Fällen muss das <b>Testserver-Unterverzeichnis noch in der Hosting-Oberfläche einmalig konfiguriert</b> werden. Weitere Informationen dazu finden sich hier:&nbsp;<a href=\"https://plugins.netzperfekt.de/faq/Netzp57164792228#99\" target=\"_blank\" rel=\"noreferrer\" style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">https://plugins.netzperfekt.de/faq/Netzp57164792228#99</a></p><p><br></p><h2><b>Hinweis</b>:&nbsp;Wir bieten dieses Plugin kostenfrei an. Wenn Sie es regelmäßig einsetzen,&nbsp;bitten wir Sie um Abschluss der <i>kostenpflichtigen Version</i>. Sie helfen uns damit, das Plugin zu pflegen und weiter zu entwickeln. Für die kostenfreie Version können wir keinen Support leisten. Vielen Dank!</h2><p><br></p>","shortDescription":"Mit einer Testumgebung Updates und neue Plugins gefahrlos testen! Unser Plus: Beliebig viele Staging-Server, Anonymisierung von Nutzerdaten, Kennzeichnung des als Test und vieles mehr!","highlights":"Testumgebung auf Knopfdruck einrichten\nPlugins, neue Shopware-Versionen und Änderungen gefahrlos testen\nDienstleistern gefahrlos Zugriff auf den Shop geben\nErstellung/Steuerung per Kommandozeile","features":"Beliebig viele Testumgebungen\nDaten anonymisierbar\nAusschluss von Verzeichnissen und Datenbank-Tabellen\nAutomatisierung per Kommandozeile/Cron-Job"},{"id":19676,"name":"Set up test server/staging environment","description":"<h2>Set up a test environment in a flash&nbsp;</h2><h3>The original plugin for test environments - the successful Shopware 5 plugin now also for Shopware 6.</h3><p><br></p><p><b>Features at a glance:</b></p><p></p><ul><li>A test environment is created fully automatically in a subdirectory. The Shopware files as well as the database and settings of the live server are taken over. Because of the subdirectory there are no problems with plugin licenses, the store works in the test environment as usual.</li><li>Any number of test environments can be created in different subdirectories.</li><li>A test environment is created with a few mouse clicks - just enter the data of a second database and click \"Create\" (depending on the hosting server it might be neccessary to set up the directory to execute a shopware shop).</li><li>A test environment can be configured with a few mouse clicks: for example, the maintenance mode of the test store can be set, or the options of the .env file can be changed.&nbsp;</li><li>Directories and individual database tables can be excluded (e.g. the item images) - this saves a lot of time. The file system and the database can be recreated separately in the test environment.</li><li>Data can be made completely anonymous (customer data, orders etc.) or alternatively only the master data (articles, categories, configuration) can be transferred to the test environment, the customer data is then completely empty.</li></ul><p></p><p><br></p><p><b>The test server plugin is useful for every professional store operator and makes the work of service providers and agencies much easier!</b></p><p><br></p><p>The plugin has been tested extensively, but we do not assume any liability. Please make sure that you create a backup before setting up a test server for the first time. Furthermore this Plugin does not replace a backup. A restore of the test server to the live server is not possible for technical reasons.</p><p><br></p><p><b>System requirements</b></p><p></p><ul><li>Shopware certified web server with Apache or Nginx</li><li>Access data for a second database</li><li>The PHP setting <i>max_execution_time</i> must be set to 1200 (or higher if necessary)</li><li>Since large amounts of files are copied, the server should be sufficiently fast and have an SSD. Furthermore, no excessive PHP security functions should be active (e.g. the PHP function dir() must be available).</li></ul><p></p><p><br></p><p><b>Please test the free demo version before purchasing</b>. Since there are unfortunately many different server configurations, it is possible that in individual cases the plugin will not run on your server. Especially a shopware certified hoster is important: \"cheap\" hosting packages are usually not suitable!&nbsp;</p><h3>Note: We offer this plugin absolutely free of charge for you, so we cannot provide support. Please use our detailed documentation and FAQ. Thanks for your understanding.<br></h3><h2>+++ Discover also our&nbsp;<a href=\"https://store.shopware.com/en/netzperfekt.html?p=1&amp;o=12&amp;n=21&amp;shopwareVersion=6\" target=\"_blank\" rel=\"noreferrer\">other plugins for Shopware 6</a>&nbsp;and especially our&nbsp;<a href=\"https://store.shopware.com/en/netzp10138892889/mobile-shop-manager-app.html?c=3\" target=\"_blank\" rel=\"noreferrer\"><b>Mobile Shop Manager App</b></a>&nbsp;for iOS and Android - always have all important key figures of your store with you on the go! +++</h2>","installationManual":"<p></p><p></p><ul><li>Install and activate as usual via the plugin manager</li><li>In the backend call the menu item Settings / Plugins / Staging/Test environments</li><li>Create a new test environment and first enter the name, directory and database access data for the test server in the Settings tab.</li><li>In the first tab select the button Create. Important: The setup of a test server can take several minutes, depending on the size of the store.&nbsp;</li><li>If the frontend of the test server does not appear or with an error message, the cache of the test server may have to be cleared</li></ul><p><br></p><p><b>Important</b>: If you set up an nginx web server, the subdirectory may have to be configured correctly once for shopware. Please contact your provider for this. At TimmeHosting you will find instructions for this: https://timmehosting.de/blog/individuelle-nginx-konfiguration-je-unterordner-per-mausklick</p><p><br></p><p>If you have made manual adjustments to the .htaccess file on Apache servers, a manual configuration may be necessary here (Attention: only change the .htaccess file <i>on the test server</i>!&nbsp;</p><p><br></p><h3>Note: We offer this plugin free of charge. If you use the plugin regularly,&nbsp;<b>we ask you to subscribe to the paid version with monthly support</b>. You help us to maintain and develop the plugin. Thank you very much!</h3>","shortDescription":"Test updates and new plug-ins safely with a test environment! Our plus: Any number of staging servers, anonymization of user data, visible infobadge and much more!","highlights":"Set up test environment at the push of a button\nTest plugins, new shopware versions and changes without danger\nGiving service providers safe access to the store","features":"Any number of test environments\nData can be anonymized\nExclusion of directories and database tables"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161539,"bookingKey":"Netzp57164792228","bookingText":"Set up test server/staging environment","discr":"priceModelFree"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpREqQDO","preview":true,"priority":0,"id":108577},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpma0eQq","preview":false,"priority":30,"id":108576},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcahPP3","preview":false,"priority":20,"id":108578},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQLYyaL","preview":false,"priority":10,"id":108575}],"comments":[{"authorName":"Gabriele","text":"Wer einen Shopware 6 Shop entwickelt oder betreibt, für den ist diese Erweiterung unverzichtbar. Durchdacht, einfach zu bedienen, mit guten Zusatzfunktionen und dann auch noch kostenlos - einfach klasse!","headline":"TOP!","creationDate":{"date":"2023-05-23 20:08:50.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Mark A.","text":"mehr geht nicht danke!!!","headline":"mega","creationDate":{"date":"2023-04-16 17:33:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Karsten Siebert","text":"Nach kurzer Anpassung der nginx Pfadangaben für den Staging Katalog funktionierte die Stagingumgebung auf Anhieb. Die Datenbank wurde vollständig übertragen.","headline":"Wichtige Erweiterung, um keine Überraschungen bei Upgrades zu erhalten.","creationDate":{"date":"2023-02-03 13:14:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Sebastian Scherer","text":"Dafür, dass die App nichts kostet ist der Leistungsumfang unglaublich, echt top! Schwierigster Teil der Einrichtung ist sicher - wie schon die meisten Vorredner sagten - die Erstellung des Sym-Links auf dem Server. Hatte ich auch noch nie gemacht - kann man aber (ggf. mit Hilfe) vom support hinkriegen. Ich habe bei mir einen relativen Pfad angegeben (\".../staging/public/\") - mit einer absoluten Pfadangabe ging's bei mir nicht (gut, vielleicht auch den falschen root herangezogen - egal).","headline":"Einfach gut!","creationDate":{"date":"2023-01-11 07:51:28.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Frank Peter","text":"Es ist eine sehr hilfreiches Plugin, da es easy einzurichten ist und man ohne großen Aufwand immer wieder neue Testumgebungen einstellen kann. It's a must have!","headline":"Super Plugin","creationDate":{"date":"2022-10-07 14:47:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Joachim Eicher","text":"Es funktioniert, nach doch einigem Tüfteln. rstmal kam natürlich der 404 Error. Hmpf. Dann in die Doku geschaut, aha, Simlink anlegen - noch nie gemacht in einem Linux. Aber auch auf ein Hosting Paket kommt man mit mittels dem kostenlosen Putty über SSH rein. Strato 24/7 Support hat geholfen, nach der Anleitung in der Doku über Piutty/SSH den \"Simlink\" einzurichten. Naja, schwer ist's ja wirklich nicht, wenn man's mal gmaxcht hat. Wichtig ist, dass das Staging Verzeichnis auf der gleichen Ebene liegt wie das Shopware \"Public\". Im Shopware Public kommt dann der Simlink rein, der erst eine ebene hoch, dann ins simlink Verzeichnis rein, und ins dortige public zeigt, dann klappt es mit dem Aufruf der Staging Umgebung über /staging (oder was ihr halt festgelegt habt). Ich habe noch ein Plugin womit man die Backend URL ändern kann, damit kommt das Staging Plugin nicht zurecht, wir mussten erst das Backend URL Plugin deaktivieren, dann die Staging Umgebung aufrufen, die dann endlich auch kam, dann konnte ich sie die URL Änderung fürs Backend wieder aktivieren. Allerdings funktionieren dann die beiden praktischen Schaltflächen in der übersichtlichen Staging Liste nicht (domain/backendurl/staging wird aufgerufen statt domain/staging bzw domain/backendurl/stagiung/admin statt domain/staging/backendurl). Naja, manuell geh'ts, damit alles rodscher. Das Erstellen der Staging Umgebung geht recht schnell und stabil, ein anderes Plugin ist da oft hängen geblieben und hat viel länger gebracht. Super ist auch die Zusatzfunktion, das Staging ohne Kundendaten machen zu können. Wir brauchen es nur ziemlich selten um mal was auszuprobieren, und danken euch sehr herzlich, dass es das Plugin für diesen Zweck sogar kostenlos gibt. Echt stark!","headline":"Super wenn's denn mal läuft","creationDate":{"date":"2022-09-25 03:07:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":9},{"authorName":"Josua Sievers","text":"","headline":"Funktioniert super und ist performant","creationDate":{"date":"2022-03-24 08:15:12.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"TGU","text":"Das Staging funktioniert, daher ein super Plugin.\nEinrichtung hat nur mit Hilfe unseres Hosters Profihost geklappt. Die htaccess-Datei des Stagings hatte nicht die erforderlichen Berechtigungen,  sodass der Zugriff auf das Staging verweigert wurde.","headline":"Super Plugin","creationDate":{"date":"2022-01-19 10:55:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Anja J.","text":"Updates in einem Liveshop durchzuführen - gerade bei Shopware 6, wo es doch laufend Aktualisierungen gibt - ist mir zu unsicher. Da nutze ich gern ein Testsystem zum Ausprobieren.","headline":"Sehr sinnvoll","creationDate":{"date":"2021-11-04 15:04:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Oliver Donath","text":"Nach vielem rumprobieren ist das beste was wir bekommen haben ein 404 Fehler, so kann leider nichts getestet werden, schade.","headline":"Leider nicht funktional","creationDate":{"date":"2021-10-12 14:11:57.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":2},{"authorName":"Daniel","text":"Super Plugin! Hat auf Anhieb reibungslos funktioniert und ein vollständiges Testsystem war innerhalb von Minuten aufgesetzt und das als Laie. Kann ich nur jedem empfehlen.\n\nVielen Dank für das Plugin!","headline":"Mehr geht nicht! :)","creationDate":{"date":"2021-05-22 17:59:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Johannes","text":"Die Dokumentation ist super, die Staging Umgebung hat auf Anhieb funktioniert und alles läuft wie es soll. Kann nur sagen Top und dazu noch gratis, macht weiter so!","headline":"Ein wirklich hilfreiches Plugin","creationDate":{"date":"2021-05-16 23:38:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Andre","text":"Hi zusammen,\nHandhabung, Funktionsumfang ist spitze- hier noch heiße Tipps, damit es bei Euch auch funktioniert:\n\n1. Richtige Struktur durch Symlink erstellen\nDas Plugin erzeugt den neuen \"Staging\" Ordner nicht im \"/public\" Verzeichnis von Shopware, sondern davor.\nZeigt Eure Domain aber direkt in das shopware/public Verzeichnis,  dann müsst Ihr (so war es bei mir unter Apache) einen Symlink erstellen.\nSo geht´s:\nAngenommen Euer neues Staging-Verzeichnis lautet \"staging\"\"\nErstellt einen Symlink mit dem Namen \"staging\"  im Verzeichnis \"/Euer/Pfad/shopware/public\"\ndieser Symlink muss auf \"/Euer/Pfad/staging/public\" zeigen.\nEinen Symlink könnt ihr per SSH mit WIN SCP erstellen- oder mit dem MidnightCommander oder einfach pur per Console :-)\n\n2. Achtung bei der Namensgebung!!!\nDas hat mich eine ganze Zeit gekostet diesen Fehler zu sehen:\nIm PlugIn stellt ihr unter \"Haupdtaen\" den Namen der Testumgebung ein. Wählt hier einen Namen OHNE LEERZEICHEN!\nSobald Leerzeichen in´s Spiel kommen läuft das ganze nicht.\n \nSo, ich hoffe das ganze läuft bei Euch besser an als bei mir :-)\n\nGruß\nAndré","headline":"Kleine Stolpersteine die ich euch ersparen möchte ......","creationDate":{"date":"2021-04-20 15:17:18.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":8}],"ratingAverage":9,"label":"Testserver/Stagingumgebung einrichten","description":"<h2>Schnell eine Testumgebung einrichten </h2><h3>Das Original-Plugin für Testumgebungen - das erfolgreiche Shopware 5-Plugin jetzt auch für Shopware 6.</h3><h3><b>Hinweis</b>: Wir bieten dieses Plugin für Sie absolut kostenfrei an, daher können wir keinen Support leisten. Bitte nutzen Sie unsere ausführliche Dokumentation und die FAQ.</h3><p><b>Funktionen im Überblick:</b></p><p></p><ul><li>Eine Testumgebung wird vollautomatisch in einem Unterverzeichnis erstellt. Dabei werden sowohl die Shopware-Dateien als auch die Datenbank und Einstellungen des Liveservers übernommen. Durch das Unterverzeichnis gibt es keine Probleme mit Plugin-Lizenzen, der Shop funktioniert in der Testumgebung wie gewohnt.</li><li>Es können beliebig viele Testumgebungen in unterschiedlichen Unterverzeichnissen angelegt werden.</li><li>Eine Testumgebung ist mit wenigen Mausklicks erstellt - einfach die Daten einer zweiten Datenbank eingeben und auf „Erstellen“ klicken (je nach Server ist evtl. zusätzlich die Einstellung des Testverzeichnisses als ausführbares Shopwareverzeichnis erforderlich).</li><li>Eine Testumgebung kann per Mausklick konfiguriert werden: so ist etwa der Wartungsmodus des Test-Shops einstellbar, oder die Optionen der .env-Datei können verändert werden. </li><li>Verzeichnisse und einzelne Datenbank-Tabellen können ausgeschlossen werden (z.B. die Artikelbilder) - das spart enorm Zeit. Das Dateisystem und die Datenbank können getrennt voneinander in der Testumgebung neu erstellt werden.</li><li>Daten können vollständig anonymisiert werden (Kundendaten, Bestellungen etc.) oder alternativ können nur die Stammdaten (Artikel, Kategorien, Konfiguration) in die Testumgebung übertragen werden, die Kundendaten sind dann vollständig leer.</li></ul><p><b>Das Testserver-Plugin ist für jeden professionellen Shopbetreiber sinnvoll und erleichtert die Arbeit von Dienstleistern und Agenturen ganz erheblich!</b></p><p>Das Plugin wurde ausführlich getestet, dennoch übernehmen wir keine Haftung. Bitte stellen Sie sicher, dass Sie vor der ersten Einrichtung eines Testservers eine Datensicherung erstellen. Weiterhin ersetzt dieses Plugin keinen Backup. Ein Zurückspielen des Testservers auf den Liveserver ist aus technischen Gründen nicht möglich.</p><p><b>Systemvoraussetzungen</b></p><p></p><ul><li>Shopware-zertifizierter Webserver mit Apache oder Nginx</li><li>Zugangsdaten für eine zweite Datenbank</li><li>Die PHP-Einstellung max_execution_time muss auf 1200 (oder gegebenenfalls höher) stehen</li><li>Da große Mengen an Dateien kopiert werden, sollte der Server ausreichend schnell sein und über eine SSD verfügen. Weiterhin dürfen keine übertriebenen PHP-Sicherheitsfunktionen aktiv sein (z.B. muss die PHP-Funktion dir() verfügbar sein).</li><li><b>Wichtig</b>: <i>die Domain des Testservers muss identisch mit der Domain des Live-Servers sein</i>, d.h. es darf keine Zuordnung einer Subdomain zum Unterverzeichnis des Testservers vorgenommen werden. Dies wären für die Shopware-Lizenzprüfung zwei unterschiedliche Domains, entsprechend wären die Plugin-Lizenzen dann nicht mehr gültig.</li></ul><p><b>Bitte testen Sie das Plugin vor dem Einsatz</b>. Da es leider sehr viele unterschiedliche Serverkonfigurationen gibt, kann es im Einzelfall sein, dass das Plugin auf Ihrem Server nicht lauffähig ist. Insbesondere ist ein Shopware-zertifizierter Hoster wichtig: \"günstige\" Hostingpakete sind i.d.R. nicht geeignet! </p><p><b>Ausführliche Dokumentation</b>:  <a href=\"https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6</a></p><h3><b>Hinweis</b>: Wir bieten dieses Plugin für Sie absolut kostenfrei an, daher können wir keinen Support leisten. Bitte nutzen Sie unsere ausführliche Dokumentation und die FAQ. Vielen Dank!</h3><h2>+++ Entdecken Sie auch unsere anderen <a href=\"https://store.shopware.com/netzperfekt.html?p=1&amp;o=12&amp;n=21&amp;c=3&amp;shopwareVersion=6\" target=\"_blank\" rel=\"noreferrer noopener\">Plugins für Shopware 6</a> und insbesondere unsere <a href=\"https://store.shopware.com/netzp10138892889/mobile-shop-manager-app.html?c=3\" target=\"_blank\" rel=\"noreferrer noopener\"><b>Mobile Shop Manager App</b></a> für iOS und Android - unterwegs immer alle wichtigen Kennzahlen Ihres Shops dabei haben! +++</h2>","installationManual":"<p></p><ul><li>Wie gewohnt über den Plugin-Manager installieren und aktivieren</li><li>Im Backend den Menüpunkt Einstellungen / Plugins / Staging/Testumgebungen aufrufen</li><li>Eine neue Testumgebung anlegen und zunächst im Tab Einstellungen den Namen, Verzeichnis und die Datenbank-Zugangsdaten für den Testserver eintragen.</li><li>Im ersten Tab den Button Erstellen wählen. Wichtig: die Einrichtung eines Testserver kann - je nach Shopgröße - durchaus mehrere Minuten in Anspruch nehmen. </li><li>Falls das Frontend des Testservers nicht oder mit einer Fehlermeldung erscheint, muss unter Umständen der Cache des Testservers geleert werden</li></ul><p></p><p><b>Ausführliche Dokumentation und Support: </b><a href=\"https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugins.netzperfekt.de/plugins/testserver-staging-shopware6</a><br /></p><p><b>Wichtig: </b>In den meisten Fällen muss das <b>Testserver-Unterverzeichnis noch in der Hosting-Oberfläche einmalig konfiguriert</b> werden. Weitere Informationen dazu finden sich hier: <a href=\"https://plugins.netzperfekt.de/faq/Netzp57164792228#99\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugins.netzperfekt.de/faq/Netzp57164792228#99</a></p><p><br /></p><h2><b>Hinweis</b>: Wir bieten dieses Plugin kostenfrei an. Wenn Sie es regelmäßig einsetzen, bitten wir Sie um Abschluss der <i>kostenpflichtigen Version</i>. Sie helfen uns damit, das Plugin zu pflegen und weiter zu entwickeln. Für die kostenfreie Version können wir keinen Support leisten. Vielen Dank!</h2><p><br /></p>","version":"2.0.1","changelog":[{"version":"2.0.1","text":"<ul>\n<li>Fix: Database port numbers from 1-65535 possible</li>\n</ul>","creationDate":{"date":"2023-05-04 16:36:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul>\n<li>Support for SW 6.5</li>\n</ul>\n<ul>\n<li>+++ ATTENTION +++ <strong>Update to SW 6.5</strong></li>\n<li>First deactivate all plugins (do not uninstall them!).</li>\n<li>Then update the store to SW 6.5</li>\n<li>Then update the plugins to the compatible version for SW 6.5</li>\n<li>Activate all plugins again</li>\n<li>Perform the update for each single plugin (click on the version number of each plugin)</li>\n<li>Shopware has made significant changes in version 6.5. The adaptation of our plugins here was very complex and took a lot of time.</li>\n<li>If something does not work as expected, please contact our plugin support at <a href=\"https://plugins.netzperfekt.de/support\">https://plugins.netzperfekt.de/support</a>.</li>\n</ul>","creationDate":{"date":"2023-05-03 11:59:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<ul>\n<li>Fix: support for SW 6.4.20.x (fixed problems with database connection)</li>\n</ul>","creationDate":{"date":"2023-05-17 13:19:12.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<ul>\n<li>Fix: Database port numbers from 1-65535 possible</li>\n</ul>","creationDate":{"date":"2023-05-04 16:39:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<ul><li>Non-functional: Added reference to plugin documentation when creating a test environment.</li></ul>","creationDate":{"date":"2022-06-08 09:30:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<ul><li>Fix: internal api call changed (no 401 error anymore</li><li>Fix: moved npm packages to Resources/app/administration</li></ul>","creationDate":{"date":"2022-06-03 11:08:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p></p><ul><li>Fix: don't allow whitespaces in staging name or directory</li></ul>","creationDate":{"date":"2021-10-11 11:26:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p></p><ul><li>Fix: additional security checks</li></ul>","creationDate":{"date":"2021-07-07 09:17:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p></p><ul><li>Version: compatibility with SW 6.4</li><li>Fix: include Axios in plugin</li></ul>","creationDate":{"date":"2021-06-02 17:34:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>Fix: correct encoding of special chars in database connection (.env)</li><li>Change: plugin setting to force \"tar\" filecopy</li></ul>","creationDate":{"date":"2021-01-18 11:55:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial plugin version</p>","creationDate":{"date":"2020-09-22 14:16:05.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Netzp57164792228","redirectToStore":false,"lowestPriceValue":0}