{"id":9440,"name":"NetzpEvents6","code":"Netzp26231516916","lastChange":{"date":"2023-07-18 15:58:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVh9Uyq","examplePageUrl":"","moduleKey":"NetzpEvents6","creationDate":{"date":"2019-07-29 10:40:48.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-06-24 11:06:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2021-03-19 08:38:11.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":41,"prefix":"Netzp","name":"netzperfekt","website":"//netzperfekt.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpZAJJJq"},"infos":[{"id":14616,"name":"Events & Tickets","description":"<h2>Bietest Du Kurse, Seminare oder andere Events an und möchtest Tickets dafür verkaufen?</h2><h4>Dann ist unsere App genau richtig: definiere buchbare Events, verkaufe Tickets direkt in Deinem Shop und verwalte die Teilnehmer.<br>Optimal integriert und einfach zu bedienen.<br><br></h4><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp26231516916\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p><p>Du kannst <b>beliebige viele Events</b> anlegen und jedem Event wiederum beliebige <b>Termine</b> zuweisen. Diese können dann im Shop als Ticket gekauft werden - einfach das gewünschte Produkt zuordnen - fertig. Neben den Standard-Produkten werden auch <b>Variantenartikel</b> und Produkte mit Eigenschaften unterstützt. So kannst Du zu Deinem Seminar noch Zusatzoptionen oder unterschiedliche Ausprägungen anbieten.</p><p>Zusammen mit der Bestellung wird ein <b>PDF-Ticket</b> erstellt, dass Du dann Deinem Kunden mit der Bestellbestätigung zuschicken kannst (optional, in den App-Settings definierbar). Deine Teilnehmer können ihre Tickets jederzeit selbst im <b>Kundenaccount</b> unter Bestellungen abrufen, hier steht auch ein iCal-Download (.ics) zur Verfügung.</p><p>Ein Event muss nicht unbedingt buchbar sein: so kannst Du auch auf <b>Veranstaltungen, Messen</b> und andere Termine hinweisen, die nicht gekauft werden sollen.</p><p>Dir steht ein Block/Element für die <b>Einkaufserlebnisse</b> zur Verfügung, mit dem Du die Events übersichtlich darstellen kannst. Hier kannst Du aus 4 unterschiedlichen Layouts auswählen (Kartendarstellung, Liste, Slider und die <b>neue Kalenderansicht</b>). Aber natürlich kannst Du die Produkte ganz normal in <b>Kategorien</b> organisieren - sind buchbare Termine für ein Event definiert, werden diese direkt beim Artikel als Buchungsoption angezeigt. Schnell und einfach können <b>Terminserien</b><i style=\"font-weight: bold;\">&nbsp;</i>für wiederkehrende Termine erzeugt werden.&nbsp;</p><p>Die Events und Teilnehmerlisten verwaltest Du ganz komfortabel im Backend, Teilnehmerlisten lassen sich als PDF oder CSV-Datei exportieren.<br></p><p>Zusätzlich wird unsere mobile&nbsp;<a href=\"https://plugins.netzperfekt.de/plugin/NetzpShopManager6\" target=\"_blank\" rel=\"noreferrer\">Shop Manager App</a>&nbsp;unterstützt - damit kannst Du <b>QR-Codes</b> für die Events erzeugen und die Teilnehmer Deiner Events ganz bequem vor Ort mit der <b>Scanner-App</b> einchecken.&nbsp;&nbsp;</p><p>------</p><p><b>Achtung: </b><i>dieses Plugin ersetzt keine professionelle Event- oder Ticketplatform</i>. Dafür ist auch Shopware insgesamt nicht gedacht. <br>Das Plugin ist darauf ausgerichtet, eine überschaubare Anzahl von Events/Tickets/Kursen&nbsp;<i>zusätzlich</i>&nbsp;zu Deinem sonstigen Shopangebot anzubieten. Wenn Dein zentrales Geschäftsmodell die Veranstaltung von wirklich vielen Events mit großen Teilnehmerzahlen (mehrere 100 oder 1000) ist und überdies eine Überbuchung ausgeschlossen sein muss, solltest Du auf andere Lösungen zurückgreifen (z.B. EventBrite oder Eventim Lite).&nbsp;</p><p><i style=\"font-family: &quot;Brandon Text&quot;, -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Helvetica, Arial, sans-serif, &quot;Apple Color Emoji&quot;, &quot;Segoe UI Emoji&quot;, &quot;Segoe UI Symbol&quot;;\">Bitte nutze unbedingt die 30tägige Testversion und teste vor dem Kauf des Plugins, ob es Deinen Ansprüchen genügt.</i></p><p></p><p></p>","installationManual":"<p></p><ul><li>Wie gewohnt im App-Manager installieren und aktivieren</li><li>Optional: Eine oder mehrere Event-Kategorien anlegen (Menü Einstellungen / Erweiterungen / Event-Kategorien)</li><li>Events anlegen (Menü Kataloge / Events &amp; Tickets)</li><li>Zu einem Event ein oder mehrere Termine anlegen</li><li>Soll ein Event als Ticket buchbar sein: ein Produkt zuordnen</li><li>Optional Gestaltung von Erlebniswelten mit dem Element Commerce / Event &amp; Tickets)</li><li>Die Teilnehmerlisten können über den Menüpunkt Bestellungen / Events &amp; Tickets - Teilnehmer abgerufen und exportiert werden</li></ul><p></p><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp26231516916\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p><p><b>Wichtig</b>:&nbsp;<br>falls Sie <b>PayPal</b> einsetzen, verwenden Sie bitte <b>nicht</b> den <b>Express Checkout</b>, dieser funktioniert prinzipbedingt nicht, da dabei der Warenkorb von Shopware umgangen wird, und somit die Teilnehmer-Namen nicht eingegeben werden können.&nbsp;<br><br></p><p>\nAb Shopware 6.4.5.0 kann für den Adminnutzer eine <b>Zeitzone</b> eingestellt werden. Ist diese NICHT auf UTC eingestellt, führt dies zu einem Zeitfehler in den dargestellten Events. Wir arbeiten an der Behebung.&nbsp;\nBitte stellen Sie als Abhilfe die<b> Zeitzone in den Profilinformationen auf UTC </b>ein.</p><p><br></p><p>Dieses Plugin bietet <b>zeitgesteuerte</b> Funktionen, daher ist es wichtig, dass das <b>Cache</b> Leeren korrekt funktioniert.&nbsp;<br>\nNormalerweise sollte sich der Shopware Cache automatisch alle 2 Stunden leeren.<br>\nInfos zum Caching bei Shopware 6 haben wir hier für Sie zusammengefasst: <a href=\"https://plugins.netzperfekt.de/page/shopware6-caching-system\" title=\"Link öffnen\" target=\"_blank\">https://plugins.netzperfekt.de/page/shopware6-caching-system</a></p>\n","shortDescription":"Verkaufe Tickets für Deine Veranstaltungen und Seminare! Umfangreicher Ticketshop, Teilnehmerlisten, Unterstützung von Variantenartikeln. Zusätzlich Veranstaltungen ohne Buchungsoption.","highlights":"Verkaufe Tickets für Deine Events, Seminare und Kurse\nVariable Zusatzfelder und Veranstaltungen ohne Buchungsoptionen (z.B. Messen und Veranstaltungen)\nBeliebig viele Termine für ein Event\nVerwaltung und Download von Teilnehmerlisten\nUmfangreiche Darstellungsoptionen und Element für Erlebniswelten","features":"Events mit beliebig vielen Terminen anlegen\nOptional frei definierbare Zusatzfelder für jedes Event möglich\nTerminserien für wiederkehrende Termine erzeugen\nFlexible Darstellung über Erlebniswelten/CMS (Cards, Slider, Listen und Kalenderansicht)\nErzeugung von PDF-Tickets\nOptionale QR-Codes und mobile Ticket-Scanning App\nTeilnehmerlisten, Export als PDF und CSV\nVolle SEO-Unterstützung\nSchnelle Bearbeitung aller Termine\nIntegration in die Admin-Suche\nUnterstützung von Metadaten\nIndividuelle Anpassung über Templates möglich"},{"id":18543,"name":"Events & Tickets","description":"<h2>Do you offer courses, seminars or other events and want to sell tickets for them?</h2><h3>Then our app is just right: define bookable events, sell tickets directly in your store and manage the participants.<br></h3><p>── Need help? Go to the&nbsp;<a href=\"https://plugins.netzperfekt.de/plugin/NetzpEvents6\" target=\"_blank\" rel=\"noreferrer\">https://plugins.netzperfekt.de/plugin/NetzpEvents6</a>&nbsp;here ───.</p><p><br></p><p>You can create any number of events and in turn assign any appointments to each event. These can then be purchased in the store as a ticket - simply assign the desired product - done. In addition to standard products, variant items and products with properties are also supported. So you can offer additional options or different characteristics to your seminar.</p><p>Together with the order, a PDF ticket is created that you can then send to your customer with the order confirmation (optional, definable in the app settings). Your participants can retrieve their tickets themselves at any time in the customer account under Orders, where an iCal download (.ics) is also available.</p><p>An event does not necessarily have to be bookable: you can also refer to events, trade fairs and other dates that are not to be purchased.</p><p>A block/element for the shopping experiences is available to you, with which you can clearly display the events. Here you can choose from 4 different layouts (map view, list, slider and the new calendar view). But of course you can organize the products normally in categories - if bookable dates are defined for an event, they will be displayed directly with the article as a booking option. You can quickly and easily create event series for recurring events.&nbsp;</p><p>You can manage the events and participant lists comfortably in the backend, participant lists can be exported as PDF or CSV file.</p><p>In addition, our mobile&nbsp;<a href=\"https://plugins.netzperfekt.de/plugin/NetzpShopManager6\" target=\"_blank\" rel=\"noreferrer\">https://plugins.netzperfekt.de/plugin/NetzpShopManager6</a>&nbsp;is supported - so you can generate QR codes for the events and conveniently check in the participants of your events on site.&nbsp;&nbsp;</p><p><br></p><p><b>Attention</b>: this plugin does not replace a professional event or ticket platform. Shopware as a whole is not intended for that either.</p><p>The plugin is designed to offer a manageable number of events/tickets/courses in addition to your other store offerings. If your main business model is the organization of many events with large numbers of participants (several 100 or 1000) and overbooking must be excluded, you should use other solutions (e.g. <i>EventBrite</i> or <i>Eventim Lite</i>).&nbsp;</p><p><br></p><p><i>Please be sure to use the 30-day trial version and test whether the plugin meets your needs before purchasing it.</i></p><p><br></p><p><br></p>","installationManual":"<p></p><ul><li>Install and activate as usual in the app manager</li><li>Create one or more event categories (menu Settings / Extensions / Event Categories)</li><li>Create events (Catalogues / Events &amp; Tickets menu)</li><li>Create one or more appointments for an event</li><li>If an event should be bookable as a ticket: assign a product</li><li>Optional design of experience worlds with the element Commerce / Event &amp; Tickets)</li><li>The participant lists can be called up and exported via the menu item Orders / Events &amp; Tickets - Participants</li></ul><p></p><p>─── Need help? Visit our support pages at &nbsp;<a href=\"https://plugins.netzperfekt.de/doc/Netzp26231516916\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Documentation</a>&nbsp;───</p><p><b>Important notice</b>:&nbsp;<br>when using&nbsp;<b>PayPal </b>please<b> do</b>&nbsp;<b>not use</b>&nbsp;<b>Express Checkout</b>, for this won't work because participant names are not entered during checkout.<br><br></p><p>From Shopware 6.4.5.0 there is an option to set a user timezone within the admin. If this isn't set to&nbsp;UTC there'll be a time error within the frontend when displaying events. We are working on this issue. &nbsp;Please set admin user timezone to UTC in the meantime.</p><p><br></p><p>This plugin uses timed functions therefore it's important for the caching mechanism to work properly. As default Shopware should empty cached contents after 2 hours. Please check if this works properly within your shop.</p>","shortDescription":"Sell tickets for your events and seminars! Extensive ticket shop, participant lists, support of variant articles. Additional events without booking option.","highlights":"Sell tickets for your events, seminars and courses\nAdditional fields and events without booking options (e.g. fairs and events)\nAny number of dates for an event\nAdministration and download of participant lists\nExtensive display options and element for experience worlds","features":"Create events with any number of appointments\nOptional freely definable additional fields possible for each event\nCreate appointment series for recurring appointments\nFlexible presentation via experience worlds/CMS (cards, sliders, lists and calendar view)\nGeneration of PDF tickets\nOptional QR codes and mobile ticket scanning app\nAttendee lists, export as PDF and CSV\nFull SEO support\nFast editing of all appointments\nIntegration with admin search\nMetadata support\nIndividual customisation possible via templates"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":160132,"bookingKey":"Netzp26231516916","bookingText":"Events & Tickets","price":299,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":160131,"bookingKey":"Netzp26231516916_T","bookingText":"Events & Tickets","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdxcFoS","preview":true,"priority":0,"id":80401},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcTTNpf","preview":false,"priority":0,"id":80393},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUSm0co","preview":false,"priority":0,"id":80394},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php3UIr2b","preview":false,"priority":0,"id":80395},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpBz3amH","preview":false,"priority":0,"id":80396},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIQwHyl","preview":false,"priority":0,"id":80397},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpTSXUK9","preview":false,"priority":0,"id":80398},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpVHXWeZ","preview":false,"priority":0,"id":80399},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHXOy5h","preview":false,"priority":0,"id":80400}],"comments":[{"authorName":"Holger","text":"Wir setzen dieses Plugin schon unter Shopware 5 ein, dort war es noch als zwei Plugins realisiert (Veranstaltungen + Verkauf). Wir sind erfreut, das die Funktionalität nun in einem Plugin für Shopware 6 gebündelt wurde.\n\nAuch ist die Umsetzung unter Shopware 6 zuverlässiger geworden. Drücken wir es mal vorsichtig aus, unter Shopware 5 hatten wir das Plugin an seine leistungsgrenzen gebracht, wir hatten einfach zuviele Veranstaltungen darüber abgebildet.\nIn Shopware 6 haben wir diese Grenzen bisher nicht gefunden, obwohl wir genau so viele Veranstaltungen abbilden.\n\nPositiv möchte ich die Entwickler hervorheren, es wird auf Wünsche der Kunden gehört und es gibt eine transparente Übersicht welche neuen / erweiterten Funktionen von Kunden für das Plugin gewünscht werden und sich aktuell in Entwicklung befinden.\nVon uns wurden bisher drei Anpassungswünsche für das Plugin umgesetzt, und die Entwicklung geht noch weiter.\n\nVorbildlich\n\nFür alle, die eine einfache zu bedienende Ticket Verwaltung mit Eintrittslisten für den Checkin suchen, ist dieses Plugin eine klare Empfehlung. Wir sind absolut glücklich mit der Umsetzung.","headline":"Phantastisches Plugin für Veranstaltungen","creationDate":{"date":"2021-09-28 12:34:20.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Synder Development Agency","text":"Im Zuge einer Präsentation / Beratung nutzte ich die Probeversion dieser Erweiterung, welches den Kunden durchaus überzeugen konnte (und vermutlich zu einem baldigen Kauf hin bewegt). Hinsichtlich der Funktionalität wäre eine automatische Generierung der Event Termine, die Einrichtung von Folgeterminen mehrteiliger Events (die entsprechend im Preis innbegriffen sind) wie auch eine bessere Gesamtdarstellung der einzelnen Events im Backend (inkl. Export als CSV Datei) wünschenswert.\n\nEine Darstellung von Terminüberschneidungen bereits gekaufter Tickets mit weiteren Käufen wäre aus Kundensicht sicherlich auch ein Pluspunkt. \n\nAn sich bietet die Erweiterung allerdings genug Funktionalität um ein gutes Event und Ticket-Management zu gewährleisten, mit intuitiven Aufbau und einer schönen Darstellung.","headline":"Hervorragende Erweiterung für Event-Management Webseiten","creationDate":{"date":"2021-05-31 11:40:24.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Events & Tickets","description":"<h2>Bietest Du Kurse, Seminare oder andere Events an und möchtest Tickets dafür verkaufen?</h2><h4>Dann ist unsere App genau richtig: definiere buchbare Events, verkaufe Tickets direkt in Deinem Shop und verwalte die Teilnehmer.<br />Optimal integriert und einfach zu bedienen.<br /><br /></h4><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp26231516916\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p><p>Du kannst <b>beliebige viele Events</b> anlegen und jedem Event wiederum beliebige <b>Termine</b> zuweisen. Diese können dann im Shop als Ticket gekauft werden - einfach das gewünschte Produkt zuordnen - fertig. Neben den Standard-Produkten werden auch <b>Variantenartikel</b> und Produkte mit Eigenschaften unterstützt. So kannst Du zu Deinem Seminar noch Zusatzoptionen oder unterschiedliche Ausprägungen anbieten.</p><p>Zusammen mit der Bestellung wird ein <b>PDF-Ticket</b> erstellt, dass Du dann Deinem Kunden mit der Bestellbestätigung zuschicken kannst (optional, in den App-Settings definierbar). Deine Teilnehmer können ihre Tickets jederzeit selbst im <b>Kundenaccount</b> unter Bestellungen abrufen, hier steht auch ein iCal-Download (.ics) zur Verfügung.</p><p>Ein Event muss nicht unbedingt buchbar sein: so kannst Du auch auf <b>Veranstaltungen, Messen</b> und andere Termine hinweisen, die nicht gekauft werden sollen.</p><p>Dir steht ein Block/Element für die <b>Einkaufserlebnisse</b> zur Verfügung, mit dem Du die Events übersichtlich darstellen kannst. Hier kannst Du aus 4 unterschiedlichen Layouts auswählen (Kartendarstellung, Liste, Slider und die <b>neue Kalenderansicht</b>). Aber natürlich kannst Du die Produkte ganz normal in <b>Kategorien</b> organisieren - sind buchbare Termine für ein Event definiert, werden diese direkt beim Artikel als Buchungsoption angezeigt. Schnell und einfach können <b>Terminserien</b><i> </i>für wiederkehrende Termine erzeugt werden. </p><p>Die Events und Teilnehmerlisten verwaltest Du ganz komfortabel im Backend, Teilnehmerlisten lassen sich als PDF oder CSV-Datei exportieren.<br /></p><p>Zusätzlich wird unsere mobile <a href=\"https://plugins.netzperfekt.de/plugin/NetzpShopManager6\" target=\"_blank\" rel=\"noreferrer noopener\">Shop Manager App</a> unterstützt - damit kannst Du <b>QR-Codes</b> für die Events erzeugen und die Teilnehmer Deiner Events ganz bequem vor Ort mit der <b>Scanner-App</b> einchecken.  </p><p>------</p><p><b>Achtung: </b><i>dieses Plugin ersetzt keine professionelle Event- oder Ticketplatform</i>. Dafür ist auch Shopware insgesamt nicht gedacht. <br />Das Plugin ist darauf ausgerichtet, eine überschaubare Anzahl von Events/Tickets/Kursen <i>zusätzlich</i> zu Deinem sonstigen Shopangebot anzubieten. Wenn Dein zentrales Geschäftsmodell die Veranstaltung von wirklich vielen Events mit großen Teilnehmerzahlen (mehrere 100 oder 1000) ist und überdies eine Überbuchung ausgeschlossen sein muss, solltest Du auf andere Lösungen zurückgreifen (z.B. EventBrite oder Eventim Lite). </p><p><i>Bitte nutze unbedingt die 30tägige Testversion und teste vor dem Kauf des Plugins, ob es Deinen Ansprüchen genügt.</i></p><p></p><p></p>","installationManual":"<p></p><ul><li>Wie gewohnt im App-Manager installieren und aktivieren</li><li>Optional: Eine oder mehrere Event-Kategorien anlegen (Menü Einstellungen / Erweiterungen / Event-Kategorien)</li><li>Events anlegen (Menü Kataloge / Events &amp; Tickets)</li><li>Zu einem Event ein oder mehrere Termine anlegen</li><li>Soll ein Event als Ticket buchbar sein: ein Produkt zuordnen</li><li>Optional Gestaltung von Erlebniswelten mit dem Element Commerce / Event &amp; Tickets)</li><li>Die Teilnehmerlisten können über den Menüpunkt Bestellungen / Events &amp; Tickets - Teilnehmer abgerufen und exportiert werden</li></ul><p></p><p>─── Hilfe benötigt? Hier geht es zum <a href=\"https://plugins.netzperfekt.de/doc/Netzp26231516916\" target=\"_blank\" rel=\"noreferrer noopener\">Plugin/App-Support / Dokumentation</a> ───</p><p><b>Wichtig</b>: <br />falls Sie <b>PayPal</b> einsetzen, verwenden Sie bitte <b>nicht</b> den <b>Express Checkout</b>, dieser funktioniert prinzipbedingt nicht, da dabei der Warenkorb von Shopware umgangen wird, und somit die Teilnehmer-Namen nicht eingegeben werden können. <br /><br /></p><p>\nAb Shopware 6.4.5.0 kann für den Adminnutzer eine <b>Zeitzone</b> eingestellt werden. Ist diese NICHT auf UTC eingestellt, führt dies zu einem Zeitfehler in den dargestellten Events. Wir arbeiten an der Behebung. \nBitte stellen Sie als Abhilfe die<b> Zeitzone in den Profilinformationen auf UTC </b>ein.</p><p><br /></p><p>Dieses Plugin bietet <b>zeitgesteuerte</b> Funktionen, daher ist es wichtig, dass das <b>Cache</b> Leeren korrekt funktioniert. <br />\nNormalerweise sollte sich der Shopware Cache automatisch alle 2 Stunden leeren.<br />\nInfos zum Caching bei Shopware 6 haben wir hier für Sie zusammengefasst: <a href=\"https://plugins.netzperfekt.de/page/shopware6-caching-system\" target=\"_blank\" rel=\"noreferrer noopener\">https://plugins.netzperfekt.de/page/shopware6-caching-system</a></p>","version":"2.1.0","changelog":[{"version":"2.1.0","text":"<ul>\n<li>Change: The title tag for events in CMS elements is selectable</li>\n<li>Change: Images / responsive thumbnail sizes optimized</li>\n</ul>","creationDate":{"date":"2023-06-08 11:17:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<ul>\n<li>Internal: added missing DAL accesses</li>\n<li>Fix: Problems with CMS elements fixed after update</li>\n</ul>","creationDate":{"date":"2023-05-18 10:41:17.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul><li>Support for SW 6.5</li></ul><ul><li>+++ ATTENTION +++ <strong>Update to SW 6.5</strong></li><li>First deactivate all plugins (do not uninstall them!).</li><li>Then update the store to SW 6.5</li><li>Then update the plugins to the compatible version for SW 6.5</li><li>Activate all plugins again</li><li>Perform the update for each single plugin (click on the version number of each plugin)</li><li>Shopware has made significant changes in version 6.5. The adaptation of our plugins here was very complex and took a lot of time.</li><li>If something does not work as expected, please contact our plugin support at <a href=\"https://plugins.netzperfekt.de/support\">https://plugins.netzperfekt.de/support</a>.<br /></li></ul>","creationDate":{"date":"2023-05-08 10:35:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.6.0","text":"<p></p><ul><li>Change: optionally additional fields can be defined for an event</li><li>Change: the participant list PDF can be translated via text snippets</li></ul>","creationDate":{"date":"2023-03-08 17:10:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<ul><li>Change: in the Checkin app (ShopManager) the name of the order customer is displayed if the option \"Use without participant names\" is active </li><li> Fix: non-bookable events are no longer linked in various list displays</li></ul>","creationDate":{"date":"2023-02-26 13:30:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<ul><li>Fix: date formatting adjusted (with correct time zone)</li><li>Fix: correct event timezone in ShopManager app</li></ul>","creationDate":{"date":"2023-02-01 13:57:27.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<ul><li>Integration with our plugin Advanced Search: link to \"Show all search results\".</li></ul>","creationDate":{"date":"2022-11-03 14:08:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Change: events can be archived</li><li>Change: adjusted display order in offcanvas cart</li><li>Change: added various Twig blocks to the templates</li><li>Fix: entering participant names leads to the same page (shopping cart or checkout)</li></ul>","creationDate":{"date":"2022-10-04 16:13:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.4","text":"<ul><li>Fix: the inheritance of the plugin settings is respected correctly</li><li>Fix: Event overviews uses responsive event images</li></ul>","creationDate":{"date":"2022-08-25 15:57:04.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.3","text":"<ul><li>Fix: CMS / Event element: shows a message if there are currently no events available.</li></ul>","creationDate":{"date":"2022-06-15 13:55:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<ul><li>Fix: The date picker shows the time component correctly again</li></ul>","creationDate":{"date":"2022-06-03 11:00:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>Fix: moved npm packages to Resources/app/administration</li><li>Fix: correct payment status for orders with more than one transaction</li><li>Fix: admin / participant list / filter: search for location in dropdown list \"slot\"</li></ul>","creationDate":{"date":"2022-05-12 15:01:32.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"<ul><li>Change: Plugin settings / set deadline for booking in days before an event</li><li>Change: Rule Builder / rule \"item has event tickets\"</li></ul>","creationDate":{"date":"2022-04-12 14:55:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.2.0","text":"<ul><li>Change: PDF ticket / additional output of product options (for variant products) in {{ ticket.options }}</li><li>Version: support for the new admin search in SW 6.4.8.0</li><li>Fix: PDF ticket / correct translations</li></ul>","creationDate":{"date":"2022-03-09 10:23:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul><li>Change: Improved checking for incorrect input in slots and other places</li><li>Change: Admin / sorting of all columns possible (events, slots)</li><li>Change: EW block / new layout \"compact list\"</li><li>Fix: added \"date-fns\" to package.json</li><li>Fix: NetzpProductBoxCmsElementResolver/NetzpProductSliderCmsElementResolver implements CmsElementResolverInterface</li><li>Fix: überflüssiges CSS aus Ticket-Dokumententemplate entfernt</li></ul>","creationDate":{"date":"2022-02-24 14:01:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.23","text":"<ul><li>Change: added Time zone to events</li><li>Change: Calendar view / selection by categories possible</li><li>Change: Admin / Participant lists: export of e-mails</li><li>Fix: Store API route (EventListing) modified</li><li>Fix: the QR code on the ticket no longer covers longer locations</li><li>Update: Calendar view / Component updated</li></ul>","creationDate":{"date":"2022-01-25 09:43:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.22","text":"<ul><li>Change: Support for ShopManager App / CheckIn</li><li>Change: optionally generate QR-Codes for Tickets</li><li>Change: iCalendar file (.ics) downloadable in account</li><li>Change: admin / editing participants list (add, delete, status) updates the booked tickets number in slot</li></ul>","creationDate":{"date":"2021-12-11 13:29:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.21","text":"<p></p><ul><li>Fixed caching issues when multiple event blocks are in the same shopping experience.</li></ul>","creationDate":{"date":"2021-11-04 15:40:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.20","text":"<p></p><ul><li>Fix: category caching / cms elements</li><li>Fix: admin / create slot series - correct time is set</li></ul>","creationDate":{"date":"2021-11-02 09:42:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.19","text":"<p></p><ul><li>Change: better cache handling<br /></li><li>Fix: problems with order cancellation without participant name fixed</li></ul><p><br /></p>","creationDate":{"date":"2021-10-22 14:19:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.18","text":"<p></p><ul><li>Change: tickets can optionally be ordered without participant names (plugin settings)</li><li>Change: admin / indication when more than one event is assigned to a product</li></ul>","creationDate":{"date":"2021-10-11 11:41:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.17","text":"<ul><li>the missing CSS is back ;-(</li></ul>","creationDate":{"date":"2021-09-28 15:44:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.16","text":"<p></p><ul><li>Change: added calendar view to shopping experience element (SW 6.4 or newer)</li><li>Change: csv export - force charset to 'utf-8'</li><li>Change: csv export - added new column \"status text\"</li><li>Change: participant list (pdf) - sorting is changeable in plugin settings</li></ul>","creationDate":{"date":"2021-09-27 09:42:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.15","text":"<p></p><ul><li>Fix: Plugin is working again (Javascript errors in frontend)</li><li>Fix: mass edit slots / correct timezone for times (from/until)</li><li>Fix: pdf ticket / correct time zone for \"ordered at\"</li></ul><p></p>","creationDate":{"date":"2021-09-09 16:32:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.14","text":"<p></p><ul><li>Change: if an order is cancelled, the number of participants is re-updated and the participants status is set to \"cancelled\"</li><li>Change: mass edit slots (admin / catalogues / events &amp; tickets - button \"edit all slots\")</li><li>Change: create slot series (e.g. one slot every monday and friday, one slot every 1. of a month)</li><li>Fix: customer account: allow ticket downloads for guest accounts</li><li>Fix: customer account: dont show tickets for canceled orders</li></ul>","creationDate":{"date":"2021-09-06 16:52:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.13","text":"<p></p><ul><li>Change: Plugin setting / events can optionally be booked until the end of the event</li><li>Change: added some twig blocks in some template files for better extension</li><li>Fix: order finish page: show note on tickets only if the order contains at least one ticket</li><li>Fix: admin / participants list: filter drop downs show complete list of events and slots</li></ul>","creationDate":{"date":"2021-08-27 14:54:30.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.12","text":"<p></p><ul><li>Change: the product name is shown on the ticket</li><li>Change: added json/ld metadata to article details/booking page</li><li>Change: cms / product box + slider: disable direct buy button, go to product detail page</li><li>Change: suppress delivery information for events (details, cart, order confirmation)</li><li>Change: document template event ticket: logo can be shown</li><li>Change: added some twig blocks to event_ticket.html.twig and participants_list.html.twig</li><li>Fix: admin / event image upload is working again</li><li>Fix: admin / download participants list respects correct basepath</li><li>Fix: product detail / event availability was not calculated correctly in a rare case</li></ul>","creationDate":{"date":"2021-07-12 14:37:59.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.11","text":"<p></p><ul><li>Change: admin search for events + participants</li><li>Change: admin / participants list columns are (almost) sortable</li><li>Change: admin / manually add participants</li><li>Fix: remove slots when deleting event</li><li>Fix: (SW 6.4) buy box / product tabs working with individual product layout</li><li>Fix: admin / participants list / filter is working again</li><li>Fix: booking slots on same day respects correct hour/time of day </li></ul>","creationDate":{"date":"2021-06-20 12:54:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.10","text":"<ul><li>Fix: SW 6.4 - correct uninstallation </li></ul>","creationDate":{"date":"2021-05-20 09:40:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.9","text":"<p></p><ul><li>Version: compatibility with SW 6.4</li></ul>","creationDate":{"date":"2021-05-04 17:18:44.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.8","text":"<p></p><ul><li>Change: optimized information texts for the input of the participant names</li><li>Change: deprecated block changed (page_checkout_item_info_variants)</li><li>Fix: check of available places in the shopping cart improved</li></ul>","creationDate":{"date":"2021-02-23 11:18:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p></p><ul><li>Change: address is shown everywhere</li></ul>","creationDate":{"date":"2021-02-15 11:47:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- Fix: support for stores with a standard language other than german</p><p>- Change: support for snippets in ticket document template</p><p><br /></p>","creationDate":{"date":"2021-01-11 15:19:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p></p><ul><li>Fix: show offcanvas tab / event description with close button</li></ul>","creationDate":{"date":"2020-10-20 14:08:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p></p><ul><li>Fix: format month name in current language</li><li>Change: event popup: added external link</li><li>Change: Limit search results in live search (only in combination with our plugin Search Advanced)</li></ul><p><br /></p>","creationDate":{"date":"2020-09-22 10:15:20.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p></p><ul><li>Change: Support for Shopware 6.3</li><li>Change: available seats are taken into account when adding articles to basket</li></ul><p><br /></p>","creationDate":{"date":"2020-08-19 16:57:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>change: product detail page: date list height limited/scrollable</p>","creationDate":{"date":"2020-07-04 08:55:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial plugin version</p>","creationDate":{"date":"2020-06-17 10:44:18.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Netzp26231516916","redirectToStore":false,"lowestPriceValue":299}