{"id":9458,"name":"NetzpDiffTax6","code":"Netzp30485449076","lastChange":{"date":"2023-07-18 15:58:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php51q3Ow","examplePageUrl":"","moduleKey":"NetzpDiffTax6","creationDate":{"date":"2019-07-29 11:07:47.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":false,"hiddenInStore":false,"releaseDate":{"date":"2020-11-02 16:54:10.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":{"date":"2020-12-01 00:00:00.000000","timezone_type":3,"timezone":"Europe/Berlin"},"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2020-10-19 10:38:06.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":41,"prefix":"Netzp","name":"netzperfekt","website":"//netzperfekt.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.amazonaws.com/phpZAJJJq"},"infos":[{"id":14634,"name":"Differenzbesteuerung | 0% MwSt. für PV-Artikel","description":"<p>Die App vereint zwei unterschiedliche Aufgaben:</p><p>1. einerseits lassen sich damit <b>differenzbesteuerte Artikel nach §25a UStG</b> verkaufen.</p><p>2. für Anbieter von <b>Photovoltatik-Modulen und Solaranlagen sowie PV-Zubehör</b> kann damit die seit 2023 gültige <b>Steuerbefreiung</b> für private Nutzer umgesetzt werden.</p><p><br></p><p>Die beiden Einsatzzwecke werden vermutlich in der Praxis nicht gemeinsam vorkommen. Daher kann in den Plugin-Settings jede der beiden Funktionalitäten einzeln aktiviert werden (\"Differenz-Besteuerung aktiv\" bzw. \"Besteuerung für PV-Komponenten aktiv\"). Im Auslieferungszustand ist die Differenzbesteuerung aktiviert. Diese Einstellung müssen Sie also ggf. anpassen.</p><p><br></p><p><b>Differenzbesteuerung</b></p><p>Bei differenzbesteuerten Artikeln (z.B. Gebrauchtartikel. An- und Verkauf) nach §25a UStG darf keine Umsatzsteuer ausgewiesen werden. Diese App zeigt den rechtlich vorgeschriebenen Hinweis in Artikellisten, beim Artikel selbst, im Warenkorb und in der PDF-Rechnung/Gutschrift an. Der angezeigte Text ist dabei über die Textbaustein-Verwaltung im Backend frei definierbar.</p><p><br></p><p><b>Mehrwertsteuer-Reduzierung für Solarartikel</b></p><p>Für die PV-Besteuerung ist noch eine zweite Einstellung wichtig: \"CMS-Seite für Infos zur PV-Besteuerung\". Legen Sie bitte zunächst ein Einkaufserlebnis an (vom Typ \"Landingpage\"). Hier können Sie z.B. Textelemente hinzufügen und rechtliche Hinweise zur reduzierten Mehrwertsteuer geben. Den rechtsverbindlichen Text stimmen Sie bitte mit Ihrem Anwalt ab, ein Hinweis mag z.B. der Abschnitt \"Die Formulierung für die Checkbox kann etwas wie folgt lauten\" unter https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html geben.</p><p>Diese CMS-Seite wird dann später im Frontend als modales Popup angezeigt werden.</p><p>Nun können Sie für jedes Produkt, für das die PV-Mehrwertsteuerbefreiung gelten soll, diese unter \"Spezifikationen\" / \"Zusatzfeld\" / \"Photovoltaik-Besteuerung\" festlegen. Wichtig: weisen Sie bitte als Steuersatz den *normalen* (also nicht reduzierten) Steuersatz zu!</p><p>Intern wird für die PV-Besteuerung noch ein zusätzlicher Mehrwertsteuer-Satz mit 0% angelegt (\"Photovoltaic taxation\"). Anhand dieses Steuersatzes erkennt das Plugin dann später, dass es sich um einen entsprechend reduzierten Artikel handelt. Löschen Sie diesen Steuersatz nicht!</p><p>Im Frontend des Shops wird nun bei jedem derartig reduzierten Produkt auf der Produkt-Detailseite eine Auswahlbox angezeigt. Standardmässig wird davon ausgegangen, dass der Käufer *berechtigt* ist, die Steuerbefreiung in Anspruch zu nehmen. Der Artikelpreis wird entsprechend ohne Mehrwertsteuer ausgewiesen.&nbsp;</p><p>Wenn dies nicht zutrifft, kreuzt der Shopkunde die Checkbox an und erhält dann den Preis mit aufgeschlagener Mehrwertsteuer.&nbsp;</p><p>Auf der Kaufabschluss-Seite ist die Checkbox zum OptOut noch einmal aufgeführt. Die Auswahl dieser Checkbox wird übergreifend in der Session gespeichert, und gilt für alle potentiell mehrwertsteuerbefreiten Produkte. Sollte ein Käufer sowohl reduzierte als auch nicht-reduzierte PV-Artikel kaufen wollen, muss dies allerdings in zwei unterschiedlichen Bestellungen erfolgen.</p><p>In den Dokumenten (Rechnung, Gutschrift) wird ebenfalls auf MwSt.-reduzierte PV-Produkte hingewiesen.</p><p>Alle Textbausteine können angepasst werden (netzp.tvtax.*)</p><p><b>Hinweis</b>: die Steuerermäßigung gilt vom Gesetzgeber nur für Privatkunden. Achten Sie bitte darauf, dass Sie das Plugin nur einsetzen, wenn Sie in der Kundengruppe die Steuerdarstellung auf \"Brutto\" gesetzt haben!</p><p>Bei der Logik sind wir der Auffassung von https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html gefolgt.&nbsp;</p><p><br></p><h4><b><i>Es besteht derzeit noch eine ziemliche Rechtsunsicherheit und wir übernehmen keinerlei Garantie für die rechtliche Korrektheit. Informieren Sie sich bitte regelmässig bei einschlägigen Quellen und holen im Zweifel selbst juristischen Rat ein.</i></b></h4><p><br></p><p></p><p><b>Achtung</b>: aufgrund des internen technischen Aufbaus wird das Plugin \"Custom Products\" nicht unterstützt. D.h. hier findet für eventuelle Produkt-Optionen keine Mehrwertsteuer-Reduktion statt und wir empfehlen nicht, die beiden Plugins zusammen einzusetzen. Möglicherweise sind andere Plugins, die Preise abweichend vom Shopware-Standard kalkulieren ebenfalls nicht kompatibel, wir übernehmen dafür keinerlei Garantie.</p><p><b><br></b></p><p><b>Hinweis</b>: wir übernehmen ausdrücklich keine Haftung bei eventuellen Abmahnungen. Bitte lassen Sie im Zweifelsfall Ihren Shop selbst durch einen Juristen/Steuerfachmann überprüfen. Ggf. muss auch der Hinweistext für Ihre spezifische Branche angepasst werden.</p><p><br></p>","installationManual":"<p>Einfach wie gewohnt im Admin installieren und aktivieren. <b>Dann den Cache leeren! &nbsp;</b></p><p><br></p><p><b>Differenzbesteuerung</b></p><p>Anschließend steht eine neue Steuergruppe Differenzbesteuerung (differential taxation) zur Verfügung, die für jeden gewünschten Artikel ausgewählt werden kann. Die Darstellung beim Artikel, im Warenkorb und in der Bestellübersicht erfolgt dann automatisch, ebenfalls auf allen PDF-Dokumenten (Rechnungen, Lieferscheine etc.)</p><p><br></p><p><b>Mehrwertsteuerbefreiung für Solar-Artikel</b></p><p><ul><li>In den Plugin-Settings \"Differenz-Besteuerung aktiv\" DEaktivieren und \"Besteuerung für PV-Komponenten aktiv\" AKTIVieren.</li><li>Eine Einkaufswelt (Landingpage) anlegen (z.B. \"PV-Infos\") und hier die gewünschten rechtlichen Informationen einfügen (siehe z.B. Abschnitt \"Die Formulierung für die Checkbox kann etwas wie folgt lauten\" unter https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html geben.<br>Diese CMS-Seite wird dann später im Frontend als modales Popup angezeigt werden.</li><li>für jedes PV-Produkt für das die PV-Mehrwertsteuerbefreiung gelten soll, diese unter \"Spezifikationen\" / \"Zusatzfeld\" / \"Photovoltaik-Besteuerung\" festlegen. Wichtig: weisen Sie bitte als Steuersatz den *normalen* (also nicht reduzierten) Steuersatz zu!</li></ul></p><p><br></p><p></p><p><b>Achtung</b>: aufgrund des internen technischen Aufbaus wird das Plugin \"<i>Custom Products</i>\" <i>nicht unterstützt</i>. D.h. hier findet für eventuelle Produkt-Optionen keine Mehrwertsteuer-Reduktion statt und wir empfehlen nicht, die beiden Plugins zusammen einzusetzen.</p><p><br></p><p>Die angezeigten Texte können im Admin über die Snippets im Namespace <i>netzperfekt</i> geändert werden.</p><p><br></p><p><b>Wichtig</b>: Bei De-Aktivierung und De-Installation bleibt die Steuergruppe erhalten, damit Sie entsprechende Produkte einfach finden und wieder auf einen verwendeten Steuersatz umstellen können.</p>","shortDescription":"Differenzbesteuerte Artikel verkaufen, etwa bei An- und Verkauf von Gebrauchtwaren. /// 0% Besteuerung für Solar-Artikel. Anzeige in der Storefront und Dokumenten (Rechnung, Gutschrift)","highlights":"Anbieten von differenzbesteuerten Artikel nach §25a UStG\nUmsetzung der Mehrwertsteuer-Reduzierung für Solarartikel","features":"Markierung differenzbesteuerter Artikel\nMehrwertsteuer-Reduzierung für Solarartikel\nAnzeige beim Artikel, Warenkorb und Bestellung\nAnzeige auf den Belegen"},{"id":19974,"name":"Differential taxation and 0% taxation for Photovoltaics","description":"<p>The app combines two different tasks:</p><p>1. on the one hand, it can be used to sell items subject to differential taxation in accordance with §25a UStG.</p><p>2. for suppliers of photovoltaic modules and solar systems as well as PV accessories, it can be used to implement the tax exemption for private users that has been valid since 2023.</p><p><br></p><p>The two purposes will probably not occur together in practice. Therefore, each of the two functionalities can be activated individually in the plug-in settings (\"Difference taxation active\" or \"Taxation for PV components active\"). In the delivery state, differential taxation is activated. You may therefore need to adjust this setting.</p><p><br></p><p><b>Differential taxation</b></p><p>For items subject to differential taxation (e.g. used items. purchase and sale) according to §25a UStG, no sales tax may be shown. This app displays the legally required notice in item lists, on the item itself, in the shopping cart and in the PDF invoice/credit note. The displayed text can be freely defined via the text module management in the backend.</p><p><br></p><p><b>VAT reduction for photovoltaic articles</b></p><p>For PV taxation a second setting is important: \"CMS page for PV taxation info\". First, please create a shopping experience (of type \"landing page\"). Here you can add e.g. text elements and give legal information about the reduced VAT. Please coordinate the legally binding text with your lawyer, a hint may be e.g. the section \"The wording for the checkbox may be something like this\" at https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html.</p><p>This CMS page will then be displayed later in the frontend as a modal popup.</p><p>Now, for each product for which you want the PV VAT exemption to apply, you can specify it under \"Specifications\" / \"Additional field\" / \"Photovoltaic taxation\". Important: please assign the *normal* (i.e. not reduced) tax rate as the tax rate!</p><p>Internally, an additional VAT rate of 0% is created for the PV taxation (\"Photovoltaic taxation\"). Based on this tax rate, the plugin will later recognize that it is a correspondingly reduced article. Do not delete this tax rate!</p><p>In the frontend of the store, a selection box is now displayed on the product detail page for each such reduced product. By default, it is assumed that the buyer is *entitled* to claim the tax exemption. The item price will be displayed accordingly without VAT.&nbsp;</p><p>If this is not the case, the store customer ticks the checkbox and then receives the price with VAT added.&nbsp;</p><p>The checkbox for OptOut is listed again on the purchase completion page. The selection of this checkbox is saved across the session and applies to all potentially VAT-exempt products. However, if a buyer wants to purchase both reduced and non-reduced PV items, this must be done in two different orders.</p><p>The documents (invoice, credit note) will also refer to VAT reduced PV products.</p><p>All text modules can be customized (netzp.tvtax.*)</p><p><br></p><p><b>Note</b>: the tax reduction applies by law only to private customers. Please make sure that you use the plugin only if you have set the tax representation in the customer group to \"gross\"!</p><p><br></p><p>In terms of logic, we have followed the opinion of https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html.&nbsp;</p><p><br></p><p>There is currently still quite a bit of legal uncertainty and we do not guarantee legal correctness. Please inform yourself regularly at relevant sources and get legal advice yourself in case of doubt.</p><p><br></p><p><b>Attention</b>: due to the internal technical structure, the plugin \"Custom Products\" is not supported. I.e. no VAT reduction takes place here for any product options and we do not recommend using the two plugins together. Possibly other plugins that calculate prices different from the Shopware standard are also not compatible, we do not take any guarantee for this.</p><p><br></p><p><b>Note</b>: we expressly assume no liability in the event of any warnings. In case of doubt, please have your store checked by a lawyer/tax expert. If necessary, the notice text must also be adapted for your specific industry.</p><p><br></p>","installationManual":"<p>Simply install as usual in the admin and activate. Then <b>empty the cache</b>!&nbsp;&nbsp;</p><p><br></p><p><b>Differential taxation</b></p><p>Then a new tax group Differenzbesteuerung (differential taxation) is available, which can be selected for each desired article. The display at the article, in the shopping cart and in the order overview is then done automatically, also on all PDF documents (invoices, delivery bills, etc.).</p><p><br></p><p><b>VAT exemption for solar articles</b></p><p>In the plugin settings \"Difference taxation active\" DEactivate and \"Taxation for PV components active\" ACTIVATE.</p><p>Create a shopping world (landing page) (e.g. \"PV-Infos\") and insert the desired legal information here (see e.g. section \"The wording for the checkbox can be something like this\" at https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html give.</p><p>This CMS page will then be displayed later in the frontend as a modal popup.</p><p>for each PV product for which the PV VAT exemption should apply, specify it under \"Specifications\" / \"Additional field\" / \"Photovoltaic taxation\". Important: please assign the *normal* (i.e. not reduced) tax rate as tax rate!</p><p>Attention: due to the internal technical structure, the plugin \"Custom Products\" is not supported. I.e. no VAT reduction takes place here for any product options and we do not recommend using the two plugins together.</p><p>The displayed texts can be changed in the admin via the snippets in the namespace <i>netzperfekt</i>.</p><p><br></p><p><b>Important</b>: When de-activating and de-installing, the tax group will remain, so you can easily find corresponding products and switch back to a used tax rate.</p>","shortDescription":"Sell items taxed on difference, such as buying and selling used goods. /// 0% taxation for photovoltaic items. Display in storefront and documents (invoice, credit note).","highlights":"Offering items subject to differential taxation in accordance with §25a UStG (German VAT Act)\nImplementation of the VAT reduction for solar articles","features":"Marking differential taxed articles\nVAT reduction for photovoltaic articles\nDisplay on the article, shopping cart and order\nDisplay on the vouchers"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":161545,"bookingKey":"Netzp30485449076","bookingText":"Differential taxation according to §25a UStG","price":49,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":161544,"bookingKey":"Netzp30485449076_T","bookingText":"Differential taxation according to §25a UStG","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYuE7Xx","preview":true,"priority":0,"id":109258},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZCFIe3","preview":false,"priority":0,"id":109259},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpMXGCBD","preview":false,"priority":0,"id":109260},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpmo2pC9","preview":false,"priority":0,"id":109261},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIdEGKA","preview":false,"priority":0,"id":109262}],"comments":[{"authorName":"Julian S.","text":"Das Plugin funktioniert sehr gut. Jedoch sind mir zwei kleine Fehler aufgefallen, welche hoffentlich im nächsten Update behoben werden: 1. Auf der Product Page wird die englische Variante nicht angezeigt und 2. bei aktivieren/deaktivieren der checkbox wird auf die default language gewechselt.","headline":"Fast perfekt","creationDate":{"date":"2023-06-17 00:08:37.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"Differenzbesteuerung | 0% MwSt. für PV-Artikel","description":"<p>Die App vereint zwei unterschiedliche Aufgaben:</p><p>1. einerseits lassen sich damit <b>differenzbesteuerte Artikel nach §25a UStG</b> verkaufen.</p><p>2. für Anbieter von <b>Photovoltatik-Modulen und Solaranlagen sowie PV-Zubehör</b> kann damit die seit 2023 gültige <b>Steuerbefreiung</b> für private Nutzer umgesetzt werden.</p><p><br /></p><p>Die beiden Einsatzzwecke werden vermutlich in der Praxis nicht gemeinsam vorkommen. Daher kann in den Plugin-Settings jede der beiden Funktionalitäten einzeln aktiviert werden (\"Differenz-Besteuerung aktiv\" bzw. \"Besteuerung für PV-Komponenten aktiv\"). Im Auslieferungszustand ist die Differenzbesteuerung aktiviert. Diese Einstellung müssen Sie also ggf. anpassen.</p><p><br /></p><p><b>Differenzbesteuerung</b></p><p>Bei differenzbesteuerten Artikeln (z.B. Gebrauchtartikel. An- und Verkauf) nach §25a UStG darf keine Umsatzsteuer ausgewiesen werden. Diese App zeigt den rechtlich vorgeschriebenen Hinweis in Artikellisten, beim Artikel selbst, im Warenkorb und in der PDF-Rechnung/Gutschrift an. Der angezeigte Text ist dabei über die Textbaustein-Verwaltung im Backend frei definierbar.</p><p><br /></p><p><b>Mehrwertsteuer-Reduzierung für Solarartikel</b></p><p>Für die PV-Besteuerung ist noch eine zweite Einstellung wichtig: \"CMS-Seite für Infos zur PV-Besteuerung\". Legen Sie bitte zunächst ein Einkaufserlebnis an (vom Typ \"Landingpage\"). Hier können Sie z.B. Textelemente hinzufügen und rechtliche Hinweise zur reduzierten Mehrwertsteuer geben. Den rechtsverbindlichen Text stimmen Sie bitte mit Ihrem Anwalt ab, ein Hinweis mag z.B. der Abschnitt \"Die Formulierung für die Checkbox kann etwas wie folgt lauten\" unter https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html geben.</p><p>Diese CMS-Seite wird dann später im Frontend als modales Popup angezeigt werden.</p><p>Nun können Sie für jedes Produkt, für das die PV-Mehrwertsteuerbefreiung gelten soll, diese unter \"Spezifikationen\" / \"Zusatzfeld\" / \"Photovoltaik-Besteuerung\" festlegen. Wichtig: weisen Sie bitte als Steuersatz den *normalen* (also nicht reduzierten) Steuersatz zu!</p><p>Intern wird für die PV-Besteuerung noch ein zusätzlicher Mehrwertsteuer-Satz mit 0% angelegt (\"Photovoltaic taxation\"). Anhand dieses Steuersatzes erkennt das Plugin dann später, dass es sich um einen entsprechend reduzierten Artikel handelt. Löschen Sie diesen Steuersatz nicht!</p><p>Im Frontend des Shops wird nun bei jedem derartig reduzierten Produkt auf der Produkt-Detailseite eine Auswahlbox angezeigt. Standardmässig wird davon ausgegangen, dass der Käufer *berechtigt* ist, die Steuerbefreiung in Anspruch zu nehmen. Der Artikelpreis wird entsprechend ohne Mehrwertsteuer ausgewiesen. </p><p>Wenn dies nicht zutrifft, kreuzt der Shopkunde die Checkbox an und erhält dann den Preis mit aufgeschlagener Mehrwertsteuer. </p><p>Auf der Kaufabschluss-Seite ist die Checkbox zum OptOut noch einmal aufgeführt. Die Auswahl dieser Checkbox wird übergreifend in der Session gespeichert, und gilt für alle potentiell mehrwertsteuerbefreiten Produkte. Sollte ein Käufer sowohl reduzierte als auch nicht-reduzierte PV-Artikel kaufen wollen, muss dies allerdings in zwei unterschiedlichen Bestellungen erfolgen.</p><p>In den Dokumenten (Rechnung, Gutschrift) wird ebenfalls auf MwSt.-reduzierte PV-Produkte hingewiesen.</p><p>Alle Textbausteine können angepasst werden (netzp.tvtax.*)</p><p><b>Hinweis</b>: die Steuerermäßigung gilt vom Gesetzgeber nur für Privatkunden. Achten Sie bitte darauf, dass Sie das Plugin nur einsetzen, wenn Sie in der Kundengruppe die Steuerdarstellung auf \"Brutto\" gesetzt haben!</p><p>Bei der Logik sind wir der Auffassung von https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html gefolgt. </p><p><br /></p><h4><b><i>Es besteht derzeit noch eine ziemliche Rechtsunsicherheit und wir übernehmen keinerlei Garantie für die rechtliche Korrektheit. Informieren Sie sich bitte regelmässig bei einschlägigen Quellen und holen im Zweifel selbst juristischen Rat ein.</i></b></h4><p><br /></p><p></p><p><b>Achtung</b>: aufgrund des internen technischen Aufbaus wird das Plugin \"Custom Products\" nicht unterstützt. D.h. hier findet für eventuelle Produkt-Optionen keine Mehrwertsteuer-Reduktion statt und wir empfehlen nicht, die beiden Plugins zusammen einzusetzen. Möglicherweise sind andere Plugins, die Preise abweichend vom Shopware-Standard kalkulieren ebenfalls nicht kompatibel, wir übernehmen dafür keinerlei Garantie.</p><p><b><br /></b></p><p><b>Hinweis</b>: wir übernehmen ausdrücklich keine Haftung bei eventuellen Abmahnungen. Bitte lassen Sie im Zweifelsfall Ihren Shop selbst durch einen Juristen/Steuerfachmann überprüfen. Ggf. muss auch der Hinweistext für Ihre spezifische Branche angepasst werden.</p><p><br /></p>","installationManual":"<p>Einfach wie gewohnt im Admin installieren und aktivieren. <b>Dann den Cache leeren!  </b></p><p><br /></p><p><b>Differenzbesteuerung</b></p><p>Anschließend steht eine neue Steuergruppe Differenzbesteuerung (differential taxation) zur Verfügung, die für jeden gewünschten Artikel ausgewählt werden kann. Die Darstellung beim Artikel, im Warenkorb und in der Bestellübersicht erfolgt dann automatisch, ebenfalls auf allen PDF-Dokumenten (Rechnungen, Lieferscheine etc.)</p><p><br /></p><p><b>Mehrwertsteuerbefreiung für Solar-Artikel</b></p><p></p><ul><li>In den Plugin-Settings \"Differenz-Besteuerung aktiv\" DEaktivieren und \"Besteuerung für PV-Komponenten aktiv\" AKTIVieren.</li><li>Eine Einkaufswelt (Landingpage) anlegen (z.B. \"PV-Infos\") und hier die gewünschten rechtlichen Informationen einfügen (siehe z.B. Abschnitt \"Die Formulierung für die Checkbox kann etwas wie folgt lauten\" unter https://www.it-recht-kanzlei.de/photovoltaik-solar-steuerermaessigung-preisangaben-best-practice.html geben.<br />Diese CMS-Seite wird dann später im Frontend als modales Popup angezeigt werden.</li><li>für jedes PV-Produkt für das die PV-Mehrwertsteuerbefreiung gelten soll, diese unter \"Spezifikationen\" / \"Zusatzfeld\" / \"Photovoltaik-Besteuerung\" festlegen. Wichtig: weisen Sie bitte als Steuersatz den *normalen* (also nicht reduzierten) Steuersatz zu!</li></ul><p><br /></p><p></p><p><b>Achtung</b>: aufgrund des internen technischen Aufbaus wird das Plugin \"<i>Custom Products</i>\" <i>nicht unterstützt</i>. D.h. hier findet für eventuelle Produkt-Optionen keine Mehrwertsteuer-Reduktion statt und wir empfehlen nicht, die beiden Plugins zusammen einzusetzen.</p><p><br /></p><p>Die angezeigten Texte können im Admin über die Snippets im Namespace <i>netzperfekt</i> geändert werden.</p><p><br /></p><p><b>Wichtig</b>: Bei De-Aktivierung und De-Installation bleibt die Steuergruppe erhalten, damit Sie entsprechende Produkte einfach finden und wieder auf einen verwendeten Steuersatz umstellen können.</p>","version":"2.1.1","changelog":[{"version":"2.1.1","text":"<ul>\n<li>Fix: the sales channel/language is preserved when clicking the optout checkbox.</li>\n</ul>","creationDate":{"date":"2023-06-20 15:38:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<ul>\n<li>Change: PV taxation / the optout checkbox at checkout is only displayed if there is at least one PV item in the shopping cart.</li>\n</ul>","creationDate":{"date":"2023-06-08 16:21:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<ul>\n<li>Support for SW 6.5</li>\n<li>Change: Support for 0% taxation of photovoltaic modules according to § 12 Abs. 3 UStG (Germany only)</li>\n</ul>\n<ul>\n<li>+++ ATTENTION +++ <strong>Update to SW 6.5</strong></li>\n<li>First deactivate all plugins (do not uninstall them!).</li>\n<li>Then update the store to SW 6.5</li>\n<li>Then update the plugins to the compatible version for SW 6.5</li>\n<li>Activate all plugins again</li>\n<li>Perform the update for each single plugin (click on the version number of each plugin)</li>\n<li>Shopware has made significant changes in version 6.5. The adaptation of our plugins here was very complex and took a lot of time.</li>\n<li>If something does not work as expected, please contact our plugin support at <a href=\"https://plugins.netzperfekt.de/support\">https://plugins.netzperfekt.de/support</a>.</li>\n</ul>","creationDate":{"date":"2023-05-03 12:00:50.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.1","text":"<ul>\n<li>Change: PV taxation / the optout checkbox at checkout is only displayed if there is at least one PV item in the shopping cart.</li>\n<li>Fix: the sales channel/language is preserved when the optout checkbox is clicked.</li>\n</ul>","creationDate":{"date":"2023-06-20 15:36:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.1.0","text":"<ul>\n<li>Change: Support for 0% taxation of photovoltaic modules according to § 12 Abs. 3 UStG (Germany only)</li>\n</ul>","creationDate":{"date":"2023-04-12 09:54:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<ul><li>Fix: correct display in article boxes / cms</li></ul>","creationDate":{"date":"2022-01-04 11:49:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p></p><ul><li>Version: compatibility with SW 6.4</li></ul>","creationDate":{"date":"2021-05-04 14:48:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p></p><ul><li>Fix: document templates</li></ul>","creationDate":{"date":"2020-12-28 11:41:42.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial plugin version</p>","creationDate":{"date":"2020-10-19 10:39:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=Netzp30485449076","redirectToStore":false,"lowestPriceValue":49}