{"id":9631,"name":"LenzPlatformClp","code":"lenz195990572326","lastChange":{"date":"2023-07-18 11:16:35.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php7CwVX2","examplePageUrl":"","moduleKey":"LenzPlatformClp","creationDate":{"date":"2019-08-13 08:36:21.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-12-09 08:08:59.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-03-18 13:05:54.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":245,"prefix":"lenz","name":"LENZ eBusiness GmbH","website":"//lenz-ebusiness.de","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod245_scs-hersteller-logo.png"},"infos":[{"id":14902,"name":"CLP / REACH-Verordnung","description":"<p>Die App ermöglicht es Dir die Vorgaben der CLP/REACH-Verordnung der EU für Deinen Onlineshop umzusetzen. Mit Hilfe der App kannst Du Dir die H- und P-Sätze, EUH-Sätze, Symbole und Gefahrenhinweise direkt bei Deinen betroffenen Produkten in der Beschreibung anzeigen lassen.&nbsp; Somit ist Dein Kunde schnell und übersichtlich informiert. <br>Du kannst mit unserer App&nbsp; zudem ohne großen Aufwand weitere CLP-Sätze hinzufügen um Deinen Onlineshop um zusätzliche Hinweise zu ergänzen. Die App bietet dir verschiedene Darstellungsoptionen der Hinweise in Deinem Shop. Die Hinweise können auf der Produktdetailseite, im Warenkorb und im Listing/in der Kategorie angezeigt werden.</p><p>Für die jeweilige Darstellung sind weitere Optionen verfügbar. So können auf der Produktdetailseite, die Hinweise in einer Kurzübersicht oder in einer Komplettübersicht angezeigt werden.</p><p>Im Listing erscheinen die Gefahrenhinweise beim Hovern über den Warenkorb-Button. Zuvor sind die Hinweise nicht sichtbar. In der mobilen Ansicht erscheint beim Artikel das Badge „CLP-Hinweise beachten!“. Beim Hovern über dieser Badge werden die CLP-Hinweise angezeigt.&nbsp;</p><p>Des weiteren kannst Du Optionen für die allgemeine Darstellung der Hinweise festlegen. Die H und EUH-Sätze können gemeinsam unter dem Punkt „Gefahrstoffrichtlinien“ im Shop angezeigt werden. Der Name des Gefahrenhinweises, wie H201, kann optional angezeigt werden, ebenso wie die Überschriften der Kategorien. Außerdem ist es möglich Sätze derselben Kategorie , beispielsweise mehrere P-Sätze, inline anzeigen zu lassen. Dies bedeutet, dass mehrere Sätze pro Zeile angezeigt werden.&nbsp;<br>Im Adminbereich können die Hinweise in den Artikeldetails zugeordnet werden. Es besteht die Möglichkeit über die Nummern des Satzes/Piktogramms, z.B. H201 oder GHS01, den Satz auszuwählen oder über die Bedeutung. So kann Beispielsweise das Wort „Augen“ eingegeben werden und es werden alle Hinweise angezeigt, die dieses Wort enthalten, danach kann der Passende ausgewählt werden.<br>Die Piktogramme werden neben der Satznummer dargestellt um eine einfachere Auswahlmöglichkeit zu haben.<br></p><p>Mit dem Update 2.0.15 ist es nun möglich Standard-Sätze mit Platzhaltern (Bspw: EUH208: Enthält ... .Kann allergische Reaktionen hervorrufen.) über die Zusatzfelder des Sets \"CLP/REACH-Produkt\" anzupassen.&nbsp;</p><p>Die sogenannten Gefahrensymbole werden in der CLP/REACH-Verordnung durch die Gefahrenpiktogramme des GHS-Systems dargestellt.&nbsp; Jedem Piktogramm ist eine GHS-Nummer zugewiesen. Nachstehend haben wir diese aufgelistet sowie die dazugehörigen Signalwörter und Bedeutung.&nbsp;</p><p></p><ul><li><b>GHS01 - Explodierende Bombe: </b><br>Signalwort: Gefahr<br>Bedeutung: Unstabil, Explosionsgefahr<br></li><li><b>GHS02 - Flamme:</b><br>Signalwort: Gefahr oder Achtung<br>Bedeutung: Entzündlich</li><li><b>GHS03 - Flamme über Kreis:</b><br>Signalwort: Gefahr oder Achtung<br>Bedeutung: Brandfördernd</li><li><b>GHS04 - Gasflasche:&nbsp;</b><br>Signalwort: Achtung<br>Bedeutung: Komprimierte Gase</li><li><b>GHS05 - Ätzwirkung:</b>&nbsp;<br>Signalwort: Gefahr oder Achtung<br>Bedeutung: Ätzend etc. (Kat.1)</li><li><b>GHS06 - Totenkopf mit gekreuzten Knochen:</b>&nbsp;<br>Signalwort: Gefahr<br>Bedeutung: Giftig (Kat. 1-3)</li><li><b>GHS07 - Ausrufezeichen:&nbsp;</b><br>Signalwort: Achtung<br>Bedeutung: Giftig (Kat. 4), Ätz- oder Reizwirkung (Kat. 2), niedrigere systemische Gesundheitsgefährdung</li><li><b>GHS08 - Gesundheitsgefahr:</b><br>Signalwort: Gefahr oder Achtung<br>Bedeutung: Systemische Gesundheitsgefährdungen</li><li><b>GHS09 - Umwelt:&nbsp;</b><br>Signalwort: Achtung (Kat.1)<br>Bedeutung: Umweltgefährlich</li></ul><p></p><h2>App-Optionen:</h2><b>Globale Anzeigeneinstellungen:</b><p></p><ul><li><b>H und EUH als H anzeigen: </b>aktiv / inaktiv</li><li><b>Name des Piktograms bei Anzeige \"Komplett\" anzeigen (z.B. GHS01 - Explodierende Bombe: Explosiv):</b> aktiv / inaktiv</li><li><b>Name des Satzes anzeigen (z.B. H201):</b> aktiv / inaktiv</li><li><b>Überschriften anzeigen:</b> aktiv / inaktiv<br></li><li><b>Sätze inline anzeigen (mehrere pro Zeile):</b> aktiv / inaktiv</li></ul><b>Produkt-Detail-Seite</b><p></p><ul><li><b>Anzeige unter Buybox: </b>Ausgeblendet / Kurzübersicht / Komplett</li><li><b>Anzeige unter Produktdaten: </b>Ausgeblendet / Kurzübersicht / Komplett</li><li><b>P-Sätze anzeigen:</b> aktiv / inaktiv</li></ul><b>Warenkorb</b><p></p><p></p><ul><li><b>Im Warenkorb anzeigen:</b> aktiv / inaktiv</li><li><b>P-Sätze anzeigen:</b> aktiv / inaktiv</li><li><b>Im Offcanvas-Warenkorb anzeigen:</b> aktiv / inaktiv</li></ul><b>Listing/Kategorie</b><p></p><p></p><ul><li><b>Im Listing/Kategoiren anzeigen:</b> aktiv / inaktiv</li><li><b>P-Sätze anzeigen:</b> aktiv / inaktiv</li></ul><b>Admin-Bereich</b><p><ul><li><b>CLP-Zuweisung auf Produktseite im Adminbereich anzeigen:</b> aktiv / inaktiv</li></ul><p>Bitte informiere Dich vor Kauf der App, ob die App auch die Anforderungen für Deinen Shop erfüllt. Die App ersetzt keine rechtliche Beratung und stellt nur eine Hilfe bei der Umsetzung der Verordnung dar.&nbsp;<br></p><p></p><h3>App-Erweiterung:<br></h3><p>Erweitere die APp mit unserer App \"CLP-Verordnung Popup Addon (SW6)\"&nbsp;um die Sicherheits- und Gefahrenhinweise als Popup anzeigen zu lassen.&nbsp;</p><h2>REACH-CLP-Verordnung – Was ist das?</h2><p></p><p></p><p>Die Verordnung ist eine EU-Chemikalienverordnung und steht\nfür die Registrierung, Bewertung, Zulassung und Beschränkung von Chemikalien.\nSie regelt die Einstufung von Gefahrenstoffen und ordnet diese einer oder\nmehrerer Gefahrenklassen und Gefahrenkategorien zu. Ziel ist es, das\nGefahrenpotenzial einer Chemikalie zu bezeichnen und durch eine entsprechende\nKennzeichnung Mensch und Umwelt vor schädigenden Einflüssen zu schützen. </p><p></p><p>Die Gefahren- und Sicherheitshinweise werden in <b>H- und\nP-Sätze</b> unterteilt. Die H-Sätze enthalten Hinweise auf besondere Gefahren,\ndie bei Tätigkeiten mit gefährlichen Stoffen, Gemischen oder Erzeugnissen\nauftreten können. Die P-Sätze geben Sicherheitsratschläge, die bei Tätigkeiten\nmit gefährlichen Stoffen, Gemischen oder Erzeugnissen beachtet werden müssen.</p><p></p><p>Stoffe und Gemische können darüber hinaus ggf. mit ergänzenden\nInformationen, den sogenannten <b>EUH-Sätzen</b>, auf dem Kennzeichnungsetikett\nversehen werden. Diese Elemente sind jedoch keine weltweit verwendeten sondern\nausschließlich EU-weit zu vergebende Hinweise.</p><p></p><p>Die verschiedenen Gefahrenklassen\nwerden zusätzlich in unterschiedlichen <b>Gefahrenpiktogrammen</b> dargestellt.\nEbenso <b>Signalwörter</b>, die das Ausmaß der Gefahr angeben. Bei den\nSignalwörtern gibt es zwei Gefahrenausmaßstufen. Einmal GEFAHR – Signalwort für\nschwerwiegende Gefahrenkategorien und zusätzlich ACHTUNG – Signalwort für\nweniger schwerwiegende Gefahrenkategorien.</p><p></p><p></p><p>Diese wichtigen Gefahren- und\nSicherheitshinweise müssen sowohl auf das Produkt-Etikett als auch im\nOnline-Shop in der Beschreibung übernommen und klar ersichtlich dargestellt\nwerden. Unsere Apps ermöglichen es Dir diese Gefahren- und\nSicherheitshinweise in Deinem Online-Shop darzustellen.&nbsp;</p><h2>Weitere Informationen</h2><p><b>Allgemein&nbsp;<br></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der Appnicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können.&nbsp;</p><p><b>Kompatibilität&nbsp;<br></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der Appbeschreibung an. <br>Wir können die Kompatibilität unserer Apps zu Appsanderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angebotenen Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support<br></b>Wir prüfen ob der angegebene Fehler von unserer App verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unseren Apps vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion<br></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unsere App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicher zu gehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen<br></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unsere App, das in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion?&nbsp;<a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"nooper\">Dann teile uns Deinen Featurewunsch mit.</a></p><p></p><p></p><p></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur&nbsp;<a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"nooper\">Newsletter Anmeldung</a>.<br>Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt.&nbsp;</p>","installationManual":"<p></p><ol><li>&nbsp;Installiere die App</li><li>&nbsp;Aktiviere die App</li><li>&nbsp;Kompiliere das Theme</li><li>&nbsp;Leere den Cache</li><li>&nbsp;Ordne Deinen Produkten die CLP-Sätze zu. Dies kann über die Satznummer, wie H201 oder GHS01, erfolgen oder über ein Stichwort bzw den Hinweis.&nbsp;</li><li>&nbsp;Fertig</li></ol>","shortDescription":"Ermöglicht die Darstellung von Symbolen, Gefahrwörtern, H-Sätzen, EUH-Sätzen und P-Sätzen, um die CLP / REACH-Verordnung der EU in Deinem Onlineshop umzusetzen.","highlights":"Sätze und Symbole der CLP / REACH-Verordnung einfach darstellen\nHinweise können auf der Produktdetailseite, dem Warenkorb und im Listing/Kategorie angezeigt werden\nGlobale Einstellungsmöglichkeiten für die Anzeige der Hinweise","features":"CLP-Symbole\nSignalwörter\nH-Sätze\nEUH-Sätze\nP-Sätze"},{"id":16037,"name":"CLP/REACH-Guideline","description":"<p>The app&nbsp;allows you to implement the requirements of the CLP/REACH regulation of the EU for your online store. With the help of the app&nbsp;you can display the H- and P-phrases, EUH-phrases, symbols and signalwords directly for your affected products in the description.&nbsp; Thus, your customer is informed quickly and clearly.<br>You can also add more CLP phrases with our app&nbsp;without much effort to add additional notes to your online store. The app&nbsp;offers you different display options of the hazard and warning information in your store. The CLP-information can be displayed on the product detail page, in the shopping cart and in the listing/category.<br></p><p>Additional options are available for the respective display. Thus, on the product detail page, the notices can be displayed in a short overview or in a full overview.</p><p>In the listing, the hazard warnings appear when hovering over the shopping cart button. Before that, the notices are not visible. In the mobile view, the badge \"Pay attention to CLP notices!\" appears next to the article. When hovering over this badge, the CLP notices are displayed. <br>Furthermore, you can set options for the general display of the notes. The H and EUH phrases can be displayed together under the \"Hazard Statement\" heading in the store. The name of the hazard note, such as H201, can optionally be displayed, as well as the category headings. In addition, it is possible to display sentences of the same category , for example several P-phrases, inline. This means that multiple sentences are displayed per line. <br>In the admin area the notes can be assigned in the article details. It is possible to select the sentence via the numbers of the sentence/pictogram, e.g. H201 or GHS01, or via the meaning. For example, the word \"eyes\" can be entered and all notes containing this word will be displayed, then the appropriate one can be selected.</p><p>The pictograms are displayed next to the sentence number for easier selection.<br>With the update 2.0.15 it is now possible to customise standard phrases with placeholders (e.g.: EUH208: Contains ... .May cause allergic reactions.) via the additional fields of the set \"CLP/REACH product\".&nbsp;</p><h2>Options</h2><p><b>Global appearance</b></p><p></p><ul><li><b>Combine H and EUH as H:</b> active / inactive</li><li><b>Show pictogram name for view mode \"Full\" (e.g. GHS01 - Exploding bomb: Explosive): </b>active / inactive</li><li><b>Show sentence name (e.g. H201):</b> active / inactive</li><li><b>Show sentence headline (e.g. Hazard Statements):</b> active / inactive</li><li><b>Shop sentences inline (multiple per line):</b> active / inactive</li></ul><b>Product detail page</b><p></p><ul><li><b>Appearance under buybox:</b> hidden / short overview / full</li><li><b>Appearance under product data:</b> hidden / short overview / full</li><li><b>Show P-sentences:</b> active / inactive</li></ul><b>Cart</b><p></p><ul><li><b>Show in cart: </b>active / inactive</li><li><b>Show P sentences:</b> active / inactive</li><li><b>Show in offcanvas cart:</b> active / inactive</li></ul><b>Listing</b><p></p><p></p><ul><li><b>Show in listing:</b> active / inactive</li><li><b>Show P-Sentences:</b> active / inactive<br></li></ul><b>Administration</b><p><ul><li><b>Show CLP-assignment on product page in administration: </b>active / inactive</li></ul><h3>App-Extension</h3><p></p><p>Extend the app&nbsp; with our app&nbsp;\"CLP popup addon (SW6)\" to display the safety and hazard information as a popup.<br></p><p></p></p>","installationManual":"<p></p><ol><li>Install and activate the app.</li><li>Compile the theme and empty the cache.</li><li>Assign the CLP phrases to your products. This can be done via the phrase number, such as H201 or GHS01, or via a keyword or the note.</li><li>Done.</li></ol><p></p>","shortDescription":"Display symbols, H-Sentenses, EUH-Sentenses and P-Sentenses to comply with CLP / REACH-Guideline of the European Union for your Shopware 6 onlineshop.","highlights":"Sentenses and symbols of the CLP / REACH Regulation can be easily displayed.\nNotes can be displayed on the product detail page, the shopping basket and in the listing/category\nGlobal setting options for the display of notes","features":"CLP-Symbols\nSignalwords\nH-Sentenses\nEUH-Sentenses\nP-Sentenses"}],"addons":[],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":157879,"bookingKey":"lenz195990572326","bookingText":"CLP/REACH-Guideline (SW6)","price":495,"subscription":true,"discount":0,"discr":"priceModelBuy"},{"id":157878,"bookingKey":"lenz195990572326_M","bookingText":"CLP/REACH-Guideline (SW6)","price":41.25,"duration":1,"trialPhaseIncluded":true,"discount":0,"discountAppliesForMonths":null,"discr":"priceModelRent"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoNgev6","preview":true,"priority":0,"id":84089},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpcZSDzD","preview":false,"priority":0,"id":84090},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phphyOSsg","preview":false,"priority":0,"id":84091},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpZfcv4M","preview":false,"priority":0,"id":84092},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpOxvfPf","preview":false,"priority":0,"id":84093},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php46ytzr","preview":false,"priority":0,"id":84094},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpUdqahr","preview":false,"priority":0,"id":90462},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpoc5Ir7","preview":false,"priority":0,"id":90463},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpA28BXA","preview":false,"priority":0,"id":109828},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptqbKWZ","preview":false,"priority":0,"id":109829}],"comments":[{"authorName":"Christoph","text":"Wir haben das Plugin schon einige Monate im Einsatz und funktioniert soweit wunderbar. Hatten kürzlich auch bzgl. der Einbindung von Platzhalter-Texten angefragt, was dann auch innerhalb kürzester Zeit als neue Version bereitgestellt wurde. Daher prima Support. Gerne weiter so!","headline":"Funktioniert problemlos","creationDate":{"date":"2022-06-09 11:30:15.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Hans-Peter Frey","text":"Für uns ein absolutes Must-Have! Anzeigen korrekt und zuverlässig, schneller Service. Was will man mehr.","headline":"Tolles Plug-in","creationDate":{"date":"2021-06-30 19:22:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10},{"authorName":"Daniel von Bergner","text":"Das Plugin macht, was es soll und dabei sieht es in der Storefront auch sehr löblich aus!  Der Support ist schnell erreicht und hat in meinem Fall eine nicht funktionierende Eigenschaft sofort funktionierend gemacht und ein Update eingespielt. Einzig der Preis ist aus meiner Sicht etwas zu hoch, aber auch hier bin ich auf Entgegenkommen gestoßen. Klare Empfehlung, 5 ***** verdient!","headline":"Sehr nützlich!","creationDate":{"date":"2020-11-02 16:07:36.000000","timezone_type":3,"timezone":"Europe/Berlin"},"rating":10}],"ratingAverage":10,"label":"CLP / REACH-Verordnung","description":"<p>Die App ermöglicht es Dir die Vorgaben der CLP/REACH-Verordnung der EU für Deinen Onlineshop umzusetzen. Mit Hilfe der App kannst Du Dir die H- und P-Sätze, EUH-Sätze, Symbole und Gefahrenhinweise direkt bei Deinen betroffenen Produkten in der Beschreibung anzeigen lassen.  Somit ist Dein Kunde schnell und übersichtlich informiert. <br />Du kannst mit unserer App  zudem ohne großen Aufwand weitere CLP-Sätze hinzufügen um Deinen Onlineshop um zusätzliche Hinweise zu ergänzen. Die App bietet dir verschiedene Darstellungsoptionen der Hinweise in Deinem Shop. Die Hinweise können auf der Produktdetailseite, im Warenkorb und im Listing/in der Kategorie angezeigt werden.</p><p>Für die jeweilige Darstellung sind weitere Optionen verfügbar. So können auf der Produktdetailseite, die Hinweise in einer Kurzübersicht oder in einer Komplettübersicht angezeigt werden.</p><p>Im Listing erscheinen die Gefahrenhinweise beim Hovern über den Warenkorb-Button. Zuvor sind die Hinweise nicht sichtbar. In der mobilen Ansicht erscheint beim Artikel das Badge „CLP-Hinweise beachten!“. Beim Hovern über dieser Badge werden die CLP-Hinweise angezeigt. </p><p>Des weiteren kannst Du Optionen für die allgemeine Darstellung der Hinweise festlegen. Die H und EUH-Sätze können gemeinsam unter dem Punkt „Gefahrstoffrichtlinien“ im Shop angezeigt werden. Der Name des Gefahrenhinweises, wie H201, kann optional angezeigt werden, ebenso wie die Überschriften der Kategorien. Außerdem ist es möglich Sätze derselben Kategorie , beispielsweise mehrere P-Sätze, inline anzeigen zu lassen. Dies bedeutet, dass mehrere Sätze pro Zeile angezeigt werden. <br />Im Adminbereich können die Hinweise in den Artikeldetails zugeordnet werden. Es besteht die Möglichkeit über die Nummern des Satzes/Piktogramms, z.B. H201 oder GHS01, den Satz auszuwählen oder über die Bedeutung. So kann Beispielsweise das Wort „Augen“ eingegeben werden und es werden alle Hinweise angezeigt, die dieses Wort enthalten, danach kann der Passende ausgewählt werden.<br />Die Piktogramme werden neben der Satznummer dargestellt um eine einfachere Auswahlmöglichkeit zu haben.<br /></p><p>Mit dem Update 2.0.15 ist es nun möglich Standard-Sätze mit Platzhaltern (Bspw: EUH208: Enthält ... .Kann allergische Reaktionen hervorrufen.) über die Zusatzfelder des Sets \"CLP/REACH-Produkt\" anzupassen. </p><p>Die sogenannten Gefahrensymbole werden in der CLP/REACH-Verordnung durch die Gefahrenpiktogramme des GHS-Systems dargestellt.  Jedem Piktogramm ist eine GHS-Nummer zugewiesen. Nachstehend haben wir diese aufgelistet sowie die dazugehörigen Signalwörter und Bedeutung. </p><p></p><ul><li><b>GHS01 - Explodierende Bombe: </b><br />Signalwort: Gefahr<br />Bedeutung: Unstabil, Explosionsgefahr<br /></li><li><b>GHS02 - Flamme:</b><br />Signalwort: Gefahr oder Achtung<br />Bedeutung: Entzündlich</li><li><b>GHS03 - Flamme über Kreis:</b><br />Signalwort: Gefahr oder Achtung<br />Bedeutung: Brandfördernd</li><li><b>GHS04 - Gasflasche: </b><br />Signalwort: Achtung<br />Bedeutung: Komprimierte Gase</li><li><b>GHS05 - Ätzwirkung:</b> <br />Signalwort: Gefahr oder Achtung<br />Bedeutung: Ätzend etc. (Kat.1)</li><li><b>GHS06 - Totenkopf mit gekreuzten Knochen:</b> <br />Signalwort: Gefahr<br />Bedeutung: Giftig (Kat. 1-3)</li><li><b>GHS07 - Ausrufezeichen: </b><br />Signalwort: Achtung<br />Bedeutung: Giftig (Kat. 4), Ätz- oder Reizwirkung (Kat. 2), niedrigere systemische Gesundheitsgefährdung</li><li><b>GHS08 - Gesundheitsgefahr:</b><br />Signalwort: Gefahr oder Achtung<br />Bedeutung: Systemische Gesundheitsgefährdungen</li><li><b>GHS09 - Umwelt: </b><br />Signalwort: Achtung (Kat.1)<br />Bedeutung: Umweltgefährlich</li></ul><p></p><h2>App-Optionen:</h2><b>Globale Anzeigeneinstellungen:</b><p></p><ul><li><b>H und EUH als H anzeigen: </b>aktiv / inaktiv</li><li><b>Name des Piktograms bei Anzeige \"Komplett\" anzeigen (z.B. GHS01 - Explodierende Bombe: Explosiv):</b> aktiv / inaktiv</li><li><b>Name des Satzes anzeigen (z.B. H201):</b> aktiv / inaktiv</li><li><b>Überschriften anzeigen:</b> aktiv / inaktiv<br /></li><li><b>Sätze inline anzeigen (mehrere pro Zeile):</b> aktiv / inaktiv</li></ul><b>Produkt-Detail-Seite</b><p></p><ul><li><b>Anzeige unter Buybox: </b>Ausgeblendet / Kurzübersicht / Komplett</li><li><b>Anzeige unter Produktdaten: </b>Ausgeblendet / Kurzübersicht / Komplett</li><li><b>P-Sätze anzeigen:</b> aktiv / inaktiv</li></ul><b>Warenkorb</b><p></p><p></p><ul><li><b>Im Warenkorb anzeigen:</b> aktiv / inaktiv</li><li><b>P-Sätze anzeigen:</b> aktiv / inaktiv</li><li><b>Im Offcanvas-Warenkorb anzeigen:</b> aktiv / inaktiv</li></ul><b>Listing/Kategorie</b><p></p><p></p><ul><li><b>Im Listing/Kategoiren anzeigen:</b> aktiv / inaktiv</li><li><b>P-Sätze anzeigen:</b> aktiv / inaktiv</li></ul><b>Admin-Bereich</b><p></p><ul><li><b>CLP-Zuweisung auf Produktseite im Adminbereich anzeigen:</b> aktiv / inaktiv</li></ul><p>Bitte informiere Dich vor Kauf der App, ob die App auch die Anforderungen für Deinen Shop erfüllt. Die App ersetzt keine rechtliche Beratung und stellt nur eine Hilfe bei der Umsetzung der Verordnung dar. <br /></p><p></p><h3>App-Erweiterung:<br /></h3><p>Erweitere die APp mit unserer App \"CLP-Verordnung Popup Addon (SW6)\" um die Sicherheits- und Gefahrenhinweise als Popup anzeigen zu lassen. </p><h2>REACH-CLP-Verordnung – Was ist das?</h2><p></p><p></p><p>Die Verordnung ist eine EU-Chemikalienverordnung und steht\nfür die Registrierung, Bewertung, Zulassung und Beschränkung von Chemikalien.\nSie regelt die Einstufung von Gefahrenstoffen und ordnet diese einer oder\nmehrerer Gefahrenklassen und Gefahrenkategorien zu. Ziel ist es, das\nGefahrenpotenzial einer Chemikalie zu bezeichnen und durch eine entsprechende\nKennzeichnung Mensch und Umwelt vor schädigenden Einflüssen zu schützen. </p><p></p><p>Die Gefahren- und Sicherheitshinweise werden in <b>H- und\nP-Sätze</b> unterteilt. Die H-Sätze enthalten Hinweise auf besondere Gefahren,\ndie bei Tätigkeiten mit gefährlichen Stoffen, Gemischen oder Erzeugnissen\nauftreten können. Die P-Sätze geben Sicherheitsratschläge, die bei Tätigkeiten\nmit gefährlichen Stoffen, Gemischen oder Erzeugnissen beachtet werden müssen.</p><p></p><p>Stoffe und Gemische können darüber hinaus ggf. mit ergänzenden\nInformationen, den sogenannten <b>EUH-Sätzen</b>, auf dem Kennzeichnungsetikett\nversehen werden. Diese Elemente sind jedoch keine weltweit verwendeten sondern\nausschließlich EU-weit zu vergebende Hinweise.</p><p></p><p>Die verschiedenen Gefahrenklassen\nwerden zusätzlich in unterschiedlichen <b>Gefahrenpiktogrammen</b> dargestellt.\nEbenso <b>Signalwörter</b>, die das Ausmaß der Gefahr angeben. Bei den\nSignalwörtern gibt es zwei Gefahrenausmaßstufen. Einmal GEFAHR – Signalwort für\nschwerwiegende Gefahrenkategorien und zusätzlich ACHTUNG – Signalwort für\nweniger schwerwiegende Gefahrenkategorien.</p><p></p><p></p><p>Diese wichtigen Gefahren- und\nSicherheitshinweise müssen sowohl auf das Produkt-Etikett als auch im\nOnline-Shop in der Beschreibung übernommen und klar ersichtlich dargestellt\nwerden. Unsere Apps ermöglichen es Dir diese Gefahren- und\nSicherheitshinweise in Deinem Online-Shop darzustellen. </p><h2>Weitere Informationen</h2><p><b>Allgemein <br /></b>Unsere Apps werden auf Basis der Standardfunktionalitäten des Grundsystems Shopware 6 entwickelt. Dies gilt für die Funktionalitäten und Designs des Grundsystems. Individuelle Themes können bei der Entwicklung der Appnicht berücksichtigt werden. Daher kann es von Nöten sein, am Theme individuelle Anpassungen vornehmen zu müssen um alle Elemente/Funktionalitäten korrekt darstellen zu können. </p><p><b>Kompatibilität <br /></b>Wir entwickeln unsere Apps im Hinblick auf Kompatibilität untereinander. Sollte die Kompatibilität einmal nicht gewährleistet werden können, merken wir dies in der Appbeschreibung an. <br />Wir können die Kompatibilität unserer Apps zu Appsanderer Hersteller nicht garantiert. Aufgrund der Vielzahl an angebotenen Apps im Shopware Community Store ist eine Kompatibilitätsprüfung nicht möglich. Ebenso kann keine Kompatibilität mit Apps von Shopware garantieren werden, die nicht in der Community-Edition enthalten sind.</p><p><b>Support<br /></b>Wir prüfen ob der angegebene Fehler von unserer App verursacht wird oder einer anderen Ursache hat. Je nach Ergebnis der Untersuchung informieren wir Dich ob die Behebung kostenpflichtig ist oder nicht. Sollten eigenständige Änderungen an unseren Apps vorgenommen worden sein, wird der Arbeitsaufwand in Rechnung gestellt.</p><p><b>Testversion<br /></b>Alle Apps, die es im Shopware Community Store von LENZ eBusiness gibt, kannst Du einfach testen. Wähle dazu die Mietversion der App. Die Mietversion enthält immer einen Probemonat, mit dem Du unsere App kostenfrei 30 Tage testen kannst. Bitte nutze die Möglichkeit des Probemonats um sicher zu gehen, dass die App Deine Anforderungen erfüllt.</p><p><b>Individuelle Anpassungen<br /></b>Wir nehmen individuelle Anpassungen an unseren Apps vor. Schreibe uns eine E-Mail an support@lenz-ebusiness.de mit Deinen Kontaktdaten und Deinem Anpassungswunsch. Wir besprechen Deinen Anpassungswunsch in unserem Team und melden uns anschließend bei dir.</p><h2>Featurewunsch einreichen</h2><p>Fehlt Dir für unsere App, das in Deinem Onlineshop im Einsatz ist, noch ein zusätzliches Feature? Oder hast Du Interesse an einer unserer Apps, aber Dir fehlt eine wichtige Funktion? <a href=\"https://lenz-ebusiness.de/plugin-featurewunsch-einreichen/\" target=\"_blank\" rel=\"noreferrer noopener\">Dann teile uns Deinen Featurewunsch mit.</a></p><p></p><p></p><p></p><h2>Jetzt zum Newsletter anmelden und 10% Rabatt sichern!</h2>Melde Dich zu unserem Newsletter an und erhalten einen 10% Gutschein für unsere Apps. Hier geht es zur <a href=\"https://12157f37.sibforms.com/serve/MUIEAH5ESvNH5tQBhk58ZK7uGogrN-EjWfJHEsYEe5PhcUz4FMegiT4MIFHM-BqOdf6cTc5wBj-Upe-NLGs_TDjg6wead5mXIWaizjMnpJ8bCwFyxlaB7jhH2AD1NKtD4I2UoK0Cgy5D6VckUig7vlYLL1xAfysIZFkKoCNge4iUPSh5I70DHyvAiqRbKoH9yt7r2d_OS0v87DsY\" target=\"_blank\" rel=\"noreferrer noopener\">Newsletter Anmeldung</a>.<br />Registriere Dich für den Newsletter und setze das Häkchen bei \"Shopware Plugins\". Nach der Anmeldung wird Dir der Code per Mail zugeschickt. ","installationManual":"<p></p><ol><li> Installiere die App</li><li> Aktiviere die App</li><li> Kompiliere das Theme</li><li> Leere den Cache</li><li> Ordne Deinen Produkten die CLP-Sätze zu. Dies kann über die Satznummer, wie H201 oder GHS01, erfolgen oder über ein Stichwort bzw den Hinweis. </li><li> Fertig</li></ol>","version":"2.0.18","changelog":[{"version":"2.0.18","text":"<p>- TASK | Compatibility with Shopware 6.5.</p><p><br /></p><p>Requirements:</p><p>- The plugin now requires at least Shopware version 6.5.0.0.</p><p><b>Note: BEFORE UPDATING TO SHOPWARE 6.5.0.0, deactivate the app, then update, then activate.</b></p>","creationDate":{"date":"2023-04-04 12:08:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.17","text":"<p>TASK | Updated german translation.</p>","creationDate":{"date":"2023-03-17 09:45:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.16","text":"<p>IMPROVEMENT | Added plugin config to show/hide clp assignment on admin product page.</p>","creationDate":{"date":"2023-03-07 13:07:21.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.15","text":"<p>IMPROVEMENT | Added custom fields to defined clp-sentence variables.</p>","creationDate":{"date":"2022-05-23 08:48:39.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.14","text":"<p>TASK | Updated GHS descriptions.</p><p>IMPROVEMENT | Added option to show description of pictograms if needed.</p>","creationDate":{"date":"2022-04-22 12:12:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.13","text":"<p>- BUGFIX | Headline will be displayed again.</p>","creationDate":{"date":"2022-03-04 11:36:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.12","text":"<p>TASK | Code cleanup.</p><p>IMPROVEMENT | Added more options to modify appearance.</p><p>IMPROVEMENT | Administration: CLP-elements are now better selectable.</p><p>IMPROVEMENT | Added option to show CLP-elements in listing.</p>","creationDate":{"date":"2022-02-25 15:41:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.11","text":"<p>BUGFIX | Inherited values were not displayed correctly for variants<br /></p>","creationDate":{"date":"2022-02-01 14:27:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.10","text":"<p>TASK | Bottom position is now after the tab container (description).</p><p>IMPROVEMENT | Added support for product detail CMS.</p>","creationDate":{"date":"2022-01-26 11:32:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.9","text":"<p>- IMPROVEMENT | Added compatibility for latest changes for SW 6.4.0.0.</p>","creationDate":{"date":"2021-12-16 19:19:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.8","text":"<p>TASK | Rebuilt scripts for SW 6.4.7.0.</p>","creationDate":{"date":"2021-12-14 09:38:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.7","text":"<p>IMPROVEMENT | Adjusted clp full appearance</p>","creationDate":{"date":"2021-08-19 17:17:47.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.6","text":"<p>IMPROVEMENT | Added blocks for storefront</p>","creationDate":{"date":"2021-08-19 16:16:11.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.5","text":"<p>IMPROVEMENT | Added EUH211 and EUH212.</p><p>IMPROVEMENT | Added search bar to Administration.</p><p>TASK | Added compatibility with Shopware 6.4.0.0.</p>","creationDate":{"date":"2021-05-18 10:43:23.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.4","text":"<p>- BUGFIX | Some CLP-Sentences were not shown.</p>","creationDate":{"date":"2021-04-19 14:55:37.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.3","text":"<p>- BUGFIX | CLP-Sentences are now sorted by name.</p><p>- TASK | Compatibility with Shopware 6.4.0.x.</p>","creationDate":{"date":"2021-04-09 12:24:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p>- BUGFIX | Made full.html.twig fully responsive.</p><p>- TASK | Updated plugin.png.</p><p>- BUGFIX | Improved multilanguage support.</p><p>- TASK | Removed unused code from Administration.</p>","creationDate":{"date":"2021-03-11 19:28:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<p>- BUGFIX | Corrected field size in ClpTranslationDefinition.</p><p>- BUGFIX | Fixed error in administration on language change.</p><p>- BUGFIX | Added fallback for missing clp translations.</p><p>- TASK | Added missing signal translations in french language file.</p><p>- BUGFIX | Update slugs to be compatible with new importer.</p>","creationDate":{"date":"2020-10-24 02:20:36.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<p>- IMPROVEMENT | Improved default CLP-entries import.</p><p>- TASK | Technical cleanup.</p><p>- IMPROVEMENT | Improved uninstallation process.</p><p>- IMPROVEMENT | System entries are disabled from editing. Added type dropdown.</p><p>- IMPROVEMENT | Custom type entries can now be shown in Storefront.</p><p>- IMPROVEMENT | Clp extension variable (product.extensions.lenzPlatformClp) can now be used in product listings.</p>","creationDate":{"date":"2020-10-24 01:12:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- BUGFIX | Inheritance did not work properly.</p>","creationDate":{"date":"2020-09-16 16:58:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- TASK | Added support for Shopware 6.3.0.0.</p><p>- TASK | Removed unused file.</p><p>- TASK | Fixed typo in administration.</p>","creationDate":{"date":"2020-08-04 18:06:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>Template and variable refactoring.</p>","creationDate":{"date":"2020-02-21 23:38:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>Added support for shops with german default language.</p>","creationDate":{"date":"2020-01-20 11:21:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>Compatibility with Shopware 6.1.</p>","creationDate":{"date":"2020-01-18 09:27:57.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<p>Initial plugin release.</p>","creationDate":{"date":"2019-11-26 17:34:56.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=lenz195990572326","redirectToStore":false,"lowestPriceValue":41.25}