{"id":9752,"name":"RHWebBasicTheme","code":"RHWeb91971194274","lastChange":{"date":"2023-07-23 04:00:01.000000","timezone_type":3,"timezone":"Europe/Berlin"},"support":true,"supportOnlyCommercial":false,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpCHLfTb","examplePageUrl":"","moduleKey":"RHWebBasicTheme","creationDate":{"date":"2019-09-03 12:49:33.000000","timezone_type":3,"timezone":"Europe/Berlin"},"automaticBugfixVersionCompatibility":true,"hiddenInStore":false,"releaseDate":{"date":"2019-09-06 09:09:38.000000","timezone_type":3,"timezone":"Europe/Berlin"},"plannedReleaseDate":null,"migrationSupport":false,"lastBusinessModelChangeDate":{"date":"2022-04-13 12:17:05.000000","timezone_type":3,"timezone":"Europe/Berlin"},"pluginTestingInstanceDisabled":false,"producer":{"id":2582,"prefix":"RHWeb","name":"RH-Webdesign","website":"//rh-webdesign.com","fixed":true,"iconPath":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/prod2582_logo-rhweb.png"},"infos":[{"id":15118,"name":"BASIC | PRO | Responsive Premium Theme","description":"<br><p><i><b>- Hey, ich bin Robin. Schön, dass du da bist! ✌ -</b></i><br><i>Ich habe dieses Theme, jede einzelne Komponente, jedes Snippet, jede Grafik und jeden Text selbst entwickelt und konzipiert. Ich liebe einfach was ich tue und deshalb ist mein größter Anspruch, dir den Einstieg in meine Software und Shopware 6 maximal zu erleichtern. Meine Themes + Addons sind mächtige Werkzeuge, mit denen du sowohl als Laie und auch als Profi langfristig skalieren kannst. Auf deiner Reise begleite ich dich von Anfang an! Du erhältst den besten kostenlosen Support, maßgeschneiderte Individualprogrammierungen und permanente Updates direkt von mir. Ich habe schon unzählige Shops erstellt und weiß, worauf geachtet werden muss.</i></p><p><i>Schreib mir doch einfach und lass uns zusammen Einzigartiges erschaffen!</i><br><a href=\"https://rh-webdesign.com\" target=\"_blank\">www.rh-webdesign.com</a></p><p><i>- Robin | RH-Webdesign -</i></p><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2><a href=\"https://basic.shopware-theme.de\" target=\"_blank\">➤➤ Demo des Themes ansehen</a></h2><br><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Kernfunktionen des Themes im Überblick</h2><p>\n    Meine Themes sind sehr umfangreich konfigurierbar. Ich gehe auf die wichtigsten Features ein, sonst würde es den Rahmen sprengen.\n</p><p><b>50+ Designoptionen für das Grundlayout</b> ➝ Primär- und Sekundärfarben, Layout- Stile, Hintergründe, responsive Einstellungen, Listing - Alles konfigurierbar.<br /><b>50+ Designoptionen für Schriften</b> ➝ Individualisierbare Headlines, Fließtext, Zitate, Schriftarten, Schriftstärken, Zeilenhöhen uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Header</b> ➝ Verschiedenste Farbeinstellungen und Layoutoptionen, Megamenü, Logoeinstellungen uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Footer</b> ➝ Zertifikate, Social Media, Zahlungs- & Versandlogos, Newsletter, Anzahl Spalten uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Formulare</b> ➝ Von Placeholdern, über Labels,  zu Hintergrundfarben von Feldern, Effekten uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Kategorieseiten</b> ➝ Produktspaltenanzahl, Produktkarten, Pagination, Filter, Sidebar uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für die Produktdarstellung</b> ➝ Passform des Produktbildes, Ausrichtung des Inhalts, einheitliche Darstellung - Alles konfigurierbar.<br /></p><h3>Funktionen im Wert von über 850,-€ enthalten</h3><p>\n    Funktionen meiner Themes kannst du teilweise auch als einzelne Plugins oder Apps im Shopware Store kaufen. Viele verschiedene Erweiterungen bedeuten aber in der Regel auch mehr Wartungsaufwand, Kosten, Vererbungsinstanzen und Support. Du solltest versuchen, den Kreis deiner Zusatzerweiterungen möglichst klein zu halten. So sparst du dir mit meinen Themes langfristig viel Arbeit und gemessen an den Einzelpreisen der Erweiterungen über <b>850,-€</b> bares Geld!\n</p><p><i>Die Preise basieren auf Einzelpreisen der Erweiterungen im Shopware Store, die die jeweilige Funktion in gleicher oder abgewandelter Form bereitstellen.</i></p><ul><li><b>Individuelles Logo für den Checkoutbereich</b> (Ersparnis ~ 45,-€)</li><li><b>Newsletterbereich im Footer</b> (Ersparnis ~ 15,-€)</li><li><b>Fullwidth- oder Boxed Layout</b> (Ersparnis ~ 30,-€)</li><li><b>Social Media Integration</b> (Ersparnis ~ 15,-€)</li><li><b>Konfigurierbarer Footerbereich</b> (Ersparnis ~ 65,-€)</li><li><b>Individueller Headerbereich</b> (Ersparnis ~ 50,-€)</li><li><b>Anzahl Produkte pro Reihe (Produktübersicht / Kategorieseiten</b> (Ersparnis ~ 40,-€)</li><li><b>Zusatzinformationen (EAN, Verkäufe, Lagerbestand etc.) auf Artikelseite</b> (Ersparnis ~ 30,-€)</li><li><b>Umfangreiche Schrifteinstellungen</b> (Ersparnis ~ 70,-€)</li><li><b>Produkt-Box Hover im Produkt-Listing</b> (Ersparnis ~ 40,-€)</li><li><b>Pflege und Anzeige von Zertifikaten</b> (Ersparnis ~ 15,-€)</li><li><b>Individualisierbares Kategorielisting</b> (Ersparnis ~ 50,-€)</li><li><b>Individuelle Produktboxen</b> (Ersparnis ~ 80,-€)</li><li><b>Logo Größe anpassbar</b> (Ersparnis ~ 10,-€)</li><li><b>Trennung von Zahlungs- und Versandmethoden</b> (Ersparnis ~ 15,-€)</li><li><b>Individuelle Scrollbar</b> (Ersparnis ~ 10,-€)</li><li><b>Hover-Effekte in der Erlebniswelt</b> (Ersparnis ~ 50,-€)</li><li><b>Hintergrundbilder für verschiedenste Bereiche</b> (Ersparnis ~ 50,-€)</li><li><b>Anpassbarer Cookie Banner</b> (Ersparnis ~ 5,-€)</li><li><b>Anpassungen des Headers im Checkout-Bereich</b> (Ersparnis ~ 20,-€)</li><li><b>Individueller CSS- und Javascript Code</b> (Ersparnis ~ 5,-€)</li><li><b>Fixierter Header</b> (Ersparnis ~ 30,-€)</li><li><b>Konfigurierbare Suche</b> (Ersparnis ~ 15,-€)</li><li><b>Zeilenanzahl aller Produkte im Listing</b> (Ersparnis ~ 40,-€)</li><li><b>Generelle Einstellungen für Erlebniswelten</b> (Ersparnis ~ 20,-€)</li><li><b>Breakpoints für jedes Endgerät einstellbar</b> (Ersparnis ~ 35,-€)</li></ul><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Addons für grenzenlose Gestaltungsfreiheit</h2><p>\n    Zusätzlich zu meinen Themes biete ich dir, extra auf meine Themes zugeschnittene, Addons an. Ich empfehle dir, diese Addons mit dem Theme zusammen zu nutzen, da du einerseits extrem wertvolle Funktionen erhältst und andererseits den Kreis deiner Zusatzerweiterungen auf das Minimalste reduzierst. So hast du alle Funktionen aus einer Hand, sparst dir sehr viel Wartungsaufwand, eine Menge Kosten der Einzelerweiterungen und nutzt Funktionen, die zu 100% mit meinen Themes harmonieren. Alleine der <b>Demodaten - Import</b> lohnt sich extrem, da du deinen gesamten Shop innerhalb weniger Klicks einrichten und die importierten Daten danach für dich abwandeln kannst.\n</p><h4>Gemessen an den Einzelpreisen der Plugins/Apps im Shopware Store sparst du dir mit einem meiner Themes + Addons über 2000,-€!!!</h4><p>\n    Ich gehe mal kurz auf die interessantesten Möglichkeiten ein, die sich dir in der Kombination eröffnen. Für genauere Informationen schaust du dir die Addons am besten im Detail im Shopware Store an!\n</p><h3>CMS Bundle - Addon <a href=\"https://store.shopware.com/rhweb22714054070/cms-bundle-erweiterung-der-erlebniswelten.html\" rel=\"noopener nofollow\">→ Im Store ansehen</a></h3><p><b>\"Call-To-Action\" - Element</b> → Banner, Grid- / Kachel Layouts, Slider als Call-To-Action - für die Erlebniswelten<br><b>\"Shop The Look\" - Element</b> → Zeige mehrere Produkte mit Bild-Hotspots als Produktbundle und Rabatten - für die Erlebniswelten<br><b>\"Hersteller Liste / Slider\" - Element</b> → Zeige deine Hersteller / Marken als Liste oder Slider - für die Erlebniswelten<br><b>\"Deal Counter\" - Element</b> → Ein zeitbegrenztes Angebot wird mit einem Countdown angezeigt - für die Erlebniswelten<br><b>\"Kundenmeinungen / Testimonials\" - Element</b> → Kundenbewertungen als verkaufsförderndes Element - für die Erlebniswelten<br><b>\"Newsletter\" - Element</b> → Platziere ein conversion optimiertes Newsletter Formular frei auf jeder Contentseite - für die Erlebniswelten<br><b>\"Responsive Bildergalerie\" - Element</b> → Optisch ansprechende Darstellung zahlreicher Bilder inkl. Lightbox (bei Klick) - für die Erlebniswelten<br><b>\"Individuelle Hinweise / Alerts\" - Element</b> → Hinweisboxen in verschiedenen Typen mit Iconsupport - für die Erlebniswelten<br><b>\"Tab / Auswahl - Liste\" - Element</b> → Optisch ansprechende Darstellung von Inhalten bequem per Tab-Navigation - für die Erlebniswelten<br><b>\"Inhaltskarten\" - Element</b> → Eine abgewandelte Form des Call-To-Action - Elements zur ansprechenden Verlinkung - für die Erlebniswelten<br><b>\"Zahlungs-/Versandmethoden\" - Element</b> → Aktive Methoden kannst du frei in deinem gesamten Shop als Verkaufsförderung nutzen - für die Erlebniswelten<br><b>\"HTML 5 Video\" - Element</b> → Eigene Videos aus der Mediathek mit Thumbnail - Support und weiteren Einstellungen - für die Erlebniswelten<br><b>Flexible Spalten/Kachel Layouts</b> → Du hast maximalen Freiraum, deine Inhalte so zu platzieren, wie du sie brauchst - für die Erlebniswelten<br><b>Zahlreiche zusätzliche Sektionseinstellungen</b> → Versatz, Hintergrundoptionen, Übergänge uvm. - für die Erlebniswelten\n</p><h3>Theme Features - Addon <a href=\"https://store.shopware.com/rhweb57647745628/theme-features-erweiterung-fuer-das-theme.html\" rel=\"noopener nofollow\">→ Im Store ansehen</a></h3><p><b>Demodaten Import</b> → Einrichtung der gesamten Storefront, Erlebniswelten, Kategorien, Produkte, Bilder uvm. mit nur einem Klick<br><b>Angepasster Checkout-Prozess</b> → Der Shopware Standard Checkout - Prozess wurde generalüberholt. Fokus auf Conversion Optimierung.<br><b>Angepasster Accountbereich</b> → Ein aufgeräumter, update- und Erweiterungskompatibler Accountbereich für deine Kunden.<br><b>Google Fonts</b> → Einfache und rechtssichere Integration in die Storefront (Cookiehinweis optional)<br><b>Individuelles Copyright</b> → Setze dein eigenes Branding + Verlinkung (optional) in den Footer oder entferne es komplett<br><b>Zahlreiche Animationenseinstellungen</b> → Du kannst mittels animate.css jeden Selektor/jedes Element in deinem Shop animieren, sogar das Logo<br><b>Fixierter Warenkorb Button</b> → Der \"In den Warenkorb\" - Button ist immer sichtbar und fixiert, auch wenn über die \"Buybox\" hinaus gescrollt wird<br><b>Iconleiste / USP Bar</b> → Hebe die Vorteile deines Shops hervor. Freie Platzierung über dem Header- oder Footerbereich des Shops<br><b>Aktionstimer im Header</b> → Weise Besucher deiner Seite auf eine bevorstehende Aktion hin. Optisch ansprechender Countdown Timer mit Verlinkung<br><b>Fixiertes Kontaktwidget</b> → Ein fixierter Bereich am Rand des Browserfensters mit Kontaktinformationen - Schnellkontakt<br><b>Exit-Intent Popup</b> → Das Popup erscheint (optional) wenn ein Besucher dabei ist deinen Shop zu verlassen - Erlebniswelten Support<br><b>Hersteller Infos / Zusätzlicher Tab</b> → Auf der Produktdetailseite kannst du den Hersteller des Produktes explizit hervorheben<br></p><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Alle 17 Themes + Addons im Bundlepaket = maximale Ersparnis!</h2><p>\n    Ich stelle dir alle meine 17 Themes + Addons zusammen als Kombipaket im Bundle zur Verfügung. Solltest du noch unentschlossen sein, welches Theme zu deinen Bedürfnissen passt, oder möchtest du verschiedene Themes von mir für <b>mehrere Verkaufskanäle</b> oder <b>Shopware Systeme</b> nutzen, kannst du ganz einfach das Gesamtpaket kaufen. So kannst du jederzeit bequem zwischen allen Themes wechseln, ohne jedes Theme und jedes Addon einzeln kaufen zu müssen.\n</p><h4>Weiter unten auf dieser Seite findest du das Bundlepaket zum Vorteilspreis - Einfach weiter Scrollen! :)</h4><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Maßgeschneidertes Theme für deinen Shop geplant?</h2><p>\n    Für bestimmte Anwendungsfälle macht es Sinn, ein Theme von Grund auf neu zu konzipieren und zu programmieren. Ich biete dir, alternativ zu meinen vorgefertigten Themes, auch maßgeschneiderte Themes und Frontend-Programmierungen an.\n</p><p>\n    Web: <a href=\"https://rh-webdesign.com\" target=\"_blank\">www.rh-webdesign.com</a><br>\n    E-Mail: <a href=\"mailto:shopware@rh-webdesign.com\" target=\"_blank\">shopware@rh-webdesign.com</a></p>","installationManual":"<p>\n    In den folgenden Schritten erkläre ich dir die Vorgehensweise für den absolut perfekten Start mit dem Theme und einen effizienten Workflow. Damit du eine grundsolide Basis erschaffen und schnell Produkte verkaufen kannst, gehe ich hier unter Anderem auch auf die Demodaten Installation ein und wie du diese Inhalte für deine Zwecke abänderst.\n</p><p><b>Vorab: Bring bitte ca. 15 Minuten deiner Zeit mit!</b><br>\n    Ich setze in dieser Anleitung voraus, dass du Shopware 6 bereits auf deinem Server installiert und mit deinem Shopware Account verknüpft hast. Falls nicht, erkläre ich dir <a href=\"https://rh-webdesign.com/dokumentation/shopware-6/einrichtung/\" target=\"_blank\" rel=\"noopener\"> - in meiner Dokumentation - </a> wie du diese Schritte vornimmst.\n</p><h3>1) Installation über das Shopware 6 Dashboard</h3><p>\n    Nachdem du die Lizenzen für das Theme + Addons erworben hast, sind diese automatisch mit deiner Shopware 6 - Instanz verknüpft. Du brauchst also nichts weiter tun, als dich in deinem Shopware 6 - Shop einzuloggen → bspw. <b>www.dein-shopware-6-shop.de/admin</b></p><p>\n    Unter <b>Erweiterungen → Meine Erweiterungen</b> werden alle deine Erweiterungen aufgeführt, darunter findest du jetzt auch die Addons + Theme gelistet. Im Tab \"Themes\" ist das Theme und die Addons im Tab \"Apps\" gelistet. Wenn du deinen Shopware Account korrekt verknüpft und die Lizenzen auf die entsprechende Shop Domain gebucht hast, solltest du die Erweiterungen jetzt installieren + aktivieren können.\n</p><p><b>Alternative:</b> Du kannst die Erweiterungen auch einfach manuell hochladen. In deinem Shopware Account findest du .zip Dateien der erworbenen Erweiterungen.\n</p><h3>2) Demodaten installieren</h3><p>\n    Sobald du Theme + Addons installiert und aktiviert hast, kannst du den mitgelieferten Demo-Inhalt installieren. Für den finalen Betrieb des Shops / des Themes ist dieser Schritt selbstverständlich nicht notwendig, allerdings erspart er dir eine große Menge Arbeit.\n</p><p>\n    Den Installationsmanager findest du unter <b>Einstellungen→ Erweiterungen → Theme Features - Import.</b> Wähle hier das entsprechende Demopaket und deinen Verkaufskanal und klicke anschließend auf <b>→ Demodaten installieren.</b></p><h3>3) Demodaten für eigene Zwecke abwandeln</h3><p>\n    Du hast sicherlich festgestellt, dass der Import einige Kategorien, Produkte, Bilder und Erlebniswelten erstellt hat. Ich werde in dieser Anleitung nicht darauf eingehen, wie du diese im Detail bearbeitest, denn das ist Teil der <a href=\"https://docs.shopware.com/de/shopware-6-de\" target=\"_blank\" rel=\"noopener\">- offiziellen Shopware Dokumentation</a></p><br><p><b>3.1) Theme - Einstellungen bearbeiten:</b><br>\n    In diesen Einstellungen änderst du relevante Grundeinstellungen des Themes wie bspw. Farb-, Schrift- & Layoutoptionen. Mittels Import habe ich dir die gesamte Konfiguration vordefiniert, sodass du hier nur bei Bedarf etwas ändern musst. Du findest die Einstellungen unter  <b>Inhalte → Themes → [Dein Theme]</b></p><p><i><b>Tipp</b>: Eigentlich kannst du hier erstmal fast alles so lassen, wie es ist. Ich würde lediglich die Hauptfarben + Logo(s) deiner Firma hinzufügen und mich an deiner Stelle direkt um Inhalte kümmern. Beim Arbeiten mit deinem Shop fallen dir hinterher garantiert Dinge auf, die du ändern möchtest. Es ist effizienter, wenn du nur bei \"Bedarf\" in die Theme-Einstellungen gehst, statt alles direkt von Anfang an zu studieren - ist halt schon recht viel! ✌</i></p><br><p><b>3.2) Erlebniswelten bearbeiten:</b><br>\n    Die mitgelieferten Erlebniswelten bieten dir Layouts für viele Anwendungsbereiche, wie z.B. verschiedene Shop-Layouts (Sidebar/Promotion/volle Breite), Produktdetailseite, Über uns - & Kontaktseite uvm. Diese Inhalte kannst du jetzt für deine Anwendungsfälle nutzen und abwandeln. Die Seiten geben dir eine Beispielstruktur der Sektionen, Blöcke und Elemente vor. Diese kannst du verändern, musst du aber nicht. Wenn du mit der Struktur der Seiten zufrieden bist, kannst du einfach Bilder & Texte austauschen und ein paar Verlinkungen setzen.\n</p><p>\n    Unter <b>Inhalte → Erlebniswelten</b> findest du alle importierten CMS-Seiten nach Kategorie sortiert.\n</p><p><i><b>Tipp</b>: Für einen effizienten Workflow zum Erstellen von Erlebniswelten empfehle ich folgende Vorgehensweise:<br>\n        Schritt 1) 100% finale Texte und Angebote der jeweiligen Contentseite ausarbeiten<br>\n        Schritt 2) Sektions- und Blockstruktur der Seite aufbauen. Welche Inhalte sollen an welcher Stelle auftauchen? Stichwort: <a href=\"https://www.google.com/search?q=wireframe\" target=\"_blank\" rel=\"noopener\">Wireframe</a> und Priorisierung<br>\n        Schritt 3) Ausarbeitung und Feinschliff - detailliertes Layout- und Textdesign, finale Bilder, ggf. \"langweilige\" Textblöcke interessanter gestalten und Call-To-Actions\n    </i></p><p>\n    Wie du die Erlebniswelten mit deinen Kategorien verknüpfst, findest du in der <a href=\"https://docs.shopware.com/de/shopware-6-de/kataloge/kategorien#layout\" target=\"_blank\" rel=\"noopener\">- offiziellen Shopware Dokumentation</a></p><br><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><br><p><i><b>Das war's schon! Mehr brauchst du erstmal nicht wissen!</b></i><br><i>Die unter 3) aufgeführten Unterpunkte sind die Stellen, an denen du dich im Verlauf der Theme- und Shopeinrichtung am meisten aufhalten wirst. Du brauchst natürlich noch Produkte, Kategorien, Zahlungsarten etc. aber das erkläre ich dir ein anderes Mal.</i></p><p><i>Ich freue mich auf dich! Ganz liebe Grüße aus Paderborn,</i></p><p><i>- Robin | RH - Webdesign - </i></p><br><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><p><b>Hilfreiche Links:</b><br>\n    Kostenlose Child-Theme Vorlage <a target=\"_blank\" href=\"https://rh-webdesign.com/dokumentation/shopware-6/child-theme/\" rel=\"noopener\">→ Zum Download</a><br>\n    Kostenlose Zahlungs- & Versandicons <a target=\"_blank\" href=\"https://rh-webdesign.com/dokumentation/shopware-6/einrichtung/zahlung-versand/\" rel=\"noopener\">→ Zum Download</a></p><p><b>Kontaktmöglichkeiten:</b><br>\n    Web: <a href=\"https://rh-webdesign.com\" target=\"_blank\" rel=\"noopener nofollow\">www.rh-webdesign.com</a><br>\n    E-Mail: <a href=\"mailto:shopware@rh-webdesign.com\" target=\"_blank\" rel=\"noopener nofollow\">shopware@rh-webdesign.com</a><br>\n    WhatsApp: <a href=\"https://wa.me/message/PQV5YWR6F55CN1\" target=\"_blank\" rel=\"noopener nofollow\">→ Hier klicken</a></p>\n\n\n\n\n","shortDescription":"1000 + Einstellungen für tolle Layouts & Erlebniswelten. Inkl. Demo-Import per 1 - Klick. Einzigartiges Theme für Shopbetreiber und Agenturen - Die perfekte Grundlage für deinen Shop.","highlights":"<b>1 - Klick Demoinstallation</b> - zahlreiche Erlebniswelten, Kategorien, Produkte uvm. innerhalb weniger Sekunden eingerichtet <a target=\"_blank\" href=\"https://docs.rh-webdesign.com/shopware-theme/einrichtung/demodaten-installieren\">→ Mehr Informationen</a>\n\t<b>1000+ Einstellungsmöglichkeiten</b> - Das Theme selbst kommt mit unzähligen Einstellungen und zusammen als <b>Bundle mit Addons</b> einfach nur unschlagbar!\n\t<b>Support direkt vom Entwickler des Themes</b> - Ich weiß genau, wo was zu tun ist und wovon du lieber die Finger lassen solltest. Ich begleite dich! ✌\n\t<b>30 - Tage uneingeschränkt testen</b> - Die Vollversion des Themes ist auch in der Testphase uneingeschränkt für dich verfügbar. Kompletter Zugriff.\n\t<b>Kostenloses E-Book \"Suchmaschinenoptierung\"</b> - Alle Kunden meiner Themes erhalten eine kostenlose E-Book Version meines Taschenbuchs. <a target=\"_blank\" href=\"https://rh-webdesign.com/seo-buch\">→ Zum Buch</a>","features":"<b>Vollversion des Themes</b> - Erlebe das Theme in vollem Umfang ohne Einschränkungen. Das rundum Paket für Shopbetreiber und Entwickler.\n<b>Photoshop - Vorlagen enthalten</b> - Alle Grafiken und Mockups des Themes sind für dich und deine Designer kostenlos zur freien Nutzung enthalten.\n<b>Versand & Zahlungsicons</b> - Ich habe dir ein riesiges, einheitliches und kostenloses Logopaket zahlreicher Anbieter zusammengestellt. <a target=\"_blank\" href=\"https://rh-webdesign.com/dokumentation/shopware-6/einrichtung/zahlung-versand/\">→ Jetzt herunterladen</a>\n<b>Für jeden Anwendungsfall geeignet</b> - Das Theme zeigt dir eine bestimmte Richtung, allerdings kannst du das es für jeden Anwendungsfall verwenden.\n<b>Keine Programmierkenntnisse notwendig</b> - Auch wenn du gar kein technisches Verständnis hast verspreche ich dir: Du wirst meine Themes lieben!\n<b>SEO & Pagespeed optimiert</b> - Das Theme selbst und sogar der installierbare Democontent ist für Suchmaschinen und Performance optimiert. Nutze beides!\n<b>Leichtgewichtiges Theme</b> - Trotz der vielen Einstellungsmöglichkeiten ist das Theme schlank gehalten und wird dich in deinem Workflow niemals stören.\n<b>Hoher Detailgrad</b> - Ich bin ein Perfektionist im Webdesign. Das spiegelt sich auch in meinen Themes wieder. Du wirst die Liebe zum Detail merken.\n<b>Kompatibilität optimiert</b> - Das bekannte Problem der Kompatibilität mit Zusatzerweiterungen von Drittanbietern wird in meinen Themes behandelt.\n<b>Social Media Integration</b> - Der Trend wird immer mehr zur Normalität. Lasse deine Kunden Produkte teilen und verknüpfe deine Social - Kanäle.\n<b>Individueller Code pflegbar</b> - Meta-Angaben, CSS und Javascript kann praktisch über die Theme-Einstellungen gepflegt werden. Du bist maximal flexibel.\n<b>Ständig wachsende Dokumentation</b> - Ich möchte dir den Einstieg mit meinen Themes maximal erleichtern. Schau selbst <a target=\"_blank\" href=\"https://rh-webdesign.com/dokumentation/\">→ Zur Dokumentation</a>"},{"id":15151,"name":"BASIC | PRO | Responsive Premium Theme","description":"<br><p><i><b>- Hey, I'm Robin. Glad you're here! ✌ -</b></i><br><i>I developed and designed this theme, every single component, every snippet, every graphic and every text myself. I just love what I do and that's why my biggest ambition is to make it as easy as possible for you to get started with my software and Shopware 6. My themes + addons are powerful tools that will help you scale in the long run, both as a layman and as a professional. On your journey I will accompany you from the beginning! You will get the best free support, customized custom programming and permanent updates directly from me. I have already created countless stores and know what needs to be taken care of.</i></p><p><i>Just write me and let's create something unique together!</i><br><a href=\"https://rh-webdesign.com/en\" target=\"_blank\">www.rh-webdesign.com</a></p><p><i>- Robin | RH-Webdesign -</i></p><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2><a href=\"https://basic.shopware-theme.de/en\" target=\"_blank\">➤➤ View Demo of the Theme</a></h2><br><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Core functions of the theme at a glance</h2><p>\n    My themes are very extensively configurable. I will go into the most important features, otherwise it would go beyond the scope.\n</p><p><b>50+ Design options for the basic layout</b> ➝ Primary and secondary colors, layout styles, backgrounds, responsive settings, listing - Everything configurable.<br /><b>50+ Design options for fonts</b> ➝ Customizable headlines, body text, quotes, fonts, font weights, line heights and much more. - Everything configurable.<br /><b>50+ Header design options</b> ➝ Various color settings and layout options, mega menu, logo settings and much more. - Everything configurable.<br /><b>50+ Design options for footer</b> ➝ Certificates, social media, payment & shipping logos, newsletter, number of columns and much more. - Everything configurable.<br /><b>50+ Design options for forms</b> ➝ From placeholders, to labels, to background colors of fields, effects and much more. - Everything configurable.<br /><b>50+ Design options for category pages</b> ➝ Number of product columns, product cards, pagination, filters, sidebar and much more. - Everything configurable.<br /><b>50+ Design options for product display</b> ➝ Product image fit, content alignment, uniform display - Everything configurable.<br /></p><h3>Features worth over 850,-€ included</h3><p>\n    Some of the features of my themes can be purchased as individual plugins or apps in the Shopware Store. However, many different extensions usually mean more maintenance effort, costs, inheritance instances and support. You should try to keep the circle of your additional extensions as small as possible. So you save a lot of work in the long run with my themes and measured by the individual prices of the extensions over <b>850,-€</b> cash money!\n</p><p><i>The prices are based on individual prices of the extensions in the Shopware Store, which provide the respective function in the same or modified form.</i></p><ul><li><b>Custom logo for checkout area</b> (Savings ~ 45,-€)</li><li><b>Newsletter area in footer</b> (Savings ~ 15,-€)</li><li><b>Fullwidth- or Boxed Layout</b> (Savings ~ 30,-€)</li><li><b>Social Media Integration</b> (Savings ~ 15,-€)</li><li><b>Configurable footer area</b> (Savings ~ 65,-€)</li><li><b>Individual header area</b> (Savings ~ 50,-€)</li><li><b>Number of products per row (product overview / category pages</b> (Savings ~ 40,-€)</li><li><b>Additional information (EAN, sales, stock etc.) on article page</b> (Savings ~ 30,-€)</li><li><b>Extensive font settings</b> (Savings ~ 70,-€)</li><li><b>Produkt-Box Hover in Produkt-Listing</b> (Savings ~ 40,-€)</li><li><b>Maintenance and display of certificates</b> (Savings ~ 15,-€)</li><li><b>Customizable category listing</b> (Savings ~ 50,-€)</li><li><b>Customized product boxes</b> (Savings ~ 80,-€)</li><li><b>Logo size customizable</b> (Savings ~ 10,-€)</li><li><b>Separation of payment and shipping methods</b> (Savings ~ 15,-€)</li><li><b>Custom scrollbar</b> (Savings ~ 10,-€)</li><li><b>Hover effects in the Shopping Experiences</b> (Savings ~ 50,-€)</li><li><b>Background images for various areas</b> (Savings ~ 50,-€)</li><li><b>Customizable cookie banner</b> (Savings ~ 5,-€)</li><li><b>Adjustments to the header in the checkout area</b> (Savings ~ 20,-€)</li><li><b>Custom CSS and Javascript code</b> (Savings ~ 5,-€)</li><li><b>Fixed header</b> (Savings ~ 30,-€)</li><li><b>Configurable search</b> (Savings ~ 15,-€)</li><li><b>Number of lines of all productinfos in the listing</b> (Savings ~ 40,-€)</li><li><b>General settings for Shopping Experiences</b> (Savings ~ 20,-€)</li><li><b>Breakpoints adjustable for each end device</b> (Savings ~ 35,-€)</li></ul><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Addons for unlimited design freedom</h2><p>\n    In addition to my themes, I offer addons exclusively tailored to my themes. I recommend you to use these addons together with the theme, because on the one hand you get extremely valuable functions and on the other hand you reduce the circle of your additional extensions to the minimum. This way you have all functions from one source, save a lot of maintenance effort, use functions that are 100% aligned with my themes and save a lot of costs of the single extensions. Alone the extra for my themes developed <b>Demodata - Import</b> is very worthwhile, as you can set up your entire store within a few clicks and then modify the imported data for yourself.\n</p><h4>Compared to the individual prices of the plugins/apps in the Shopware Store, you save over 2000,-€ with one of my themes + addons!!!!</h4><p>\n    I will briefly go into the most interesting possibilities that open up to you in the combination. For more detailed information, take a look at the addons in the Shopware Store!\n</p><h3>CMS Bundle - Addon <a href=\"https://store.shopware.com/en/rhweb22714054070/cms-bundle-erweiterung-der-erlebniswelten.html\" rel=\"noopener nofollow\">→ Show in Store</a></h3><p><b>\"Call-To-Action\" - Element</b> → Banners, grid / tile layouts, sliders as call-to-action - Shopping Experiences<br><b>\"Shop The Look\" - Element</b> → Show multiple products with Image Hotspots as a product bundle and discounts. - Shopping Experiences<br><b>\"Manufacturer List / Slider\" - Element</b> → Show your manufacturers / brands as a list or slider - Shopping Experiences<br><b>\"Deal Counter\" - Element</b> → A time-limited offer is displayed with a countdown - Shopping Experiences<br><b>\"Customer reviews / Testimonials\" - Element</b> → Customer reviews as a sales-promoting element - Shopping Experiences<br><b>\"Newsletter\" - Element</b> → Place a conversion optimized newsletter form freely on any content page - Shopping Experiences<br><b>\"Responsive image gallery\" - Element</b> → Visually appealing display of numerous images incl. lightbox (on click) - Shopping Experiences<br><b>\"Individual Hints / Alerts\" - Element</b> → Note boxes in different types with icon support - Shopping Experiences<br><b>\"Tab / Selection - List\" - Element</b> → Visually appealing presentation of content conveniently via tab navigation - Shopping Experiences<br><b>\"Content Cards\" - Element</b> → A modified form of the Call-To-Action - element for individual linking - Shopping Experiences<br><b>\"Payment/Shipping Methods\" - Element</b> → You can use active methods freely throughout your store as a sales promotion - Shopping Experiences<br><b>\"HTML 5 Video\" - Element</b> → Own videos from the media library with thumbnail support and other settings - Shopping Experiences<br><b>Flexible column/tile layouts</b> → You have maximum freedom to place your content as you need it - Shopping Experiences<br><b>Numerous additional section settings</b> → Offset, background options, transitions and more - Shopping Experiences\n</p><h3>Theme Features - Addon <a href=\"https://store.shopware.com/en/rhweb57647745628/theme-features-erweiterung-fuer-das-theme.html\" rel=\"noopener nofollow\">→ Show in Store</a></h3><p><b>Demodata Import</b> → Setup of the entire Storefront, Shopping Experience, Categories, Products, Images and much more with just one click<br><b>Customized checkout process</b> → The Shopware standard checkout process was overhauled. Focus on conversion optimization<br><b>Customized account area</b> → A tidy, update and extension compatible account area for your customers<br><b>Google Fonts</b> → Simple and legally compliant integration into the storefront (cookie notice optional)<br><b>Individual copyright</b> → Put your own branding + linking (optional) in the footer or remove it completely<br><b>Numerous animation settings</b> → You can use animate.css to animate any selector/element in your store, even the logo<br><b>Fixed shopping cart button</b> → The \"Add to Cart\" button is always visible and fixed, even when scrolling beyond the \"Buybox\".<br><b>Icon Bar / USP Bar</b> → Highlight the advantages of your store. Free placement above the header or footer area of the store<br><b>Action timer in header</b> → Tell visitors to your site about an upcoming action. Visually appealing countdown timer with linking<br><b>Fixed contact widget</b> → A fixed area on the edge of the browser window with contact information - quick contact.<br><b>Exit-Intent Popup</b> → The popup appears (optional) when a visitor is about to leave your store - Shopping Experience Support<br><b>Manufacturer Info / Additional Tab</b> → On the product detail page you can explicitly highlight the manufacturer of the product<br></p><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>All 17 Themes + Addons in Bundle Package = Maximum savings!</h2><p>\n    I provide you all my 17 themes + addons together as a bundle. If you are still undecided which theme fits your needs, or if you want to use different themes from me for <b>multiple Sales Channels</b> or <b>Shopware Systems</b> you can easily buy the complete package. This way you can easily switch between all themes at any time without having to buy each theme and addon separately.\n</p><h4>Further down the page you will find the Bundle Package at a special price - Just scroll down! :)</h4><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Custom theme planned for your store?</h2><p>\n    For certain use cases it makes sense to design and program a theme from scratch. I also offer custom themes and frontend programming as an alternative to my pre-built themes.\n</p><p>\n    Web: <a href=\"https://rh-webdesign.com/en\" target=\"_blank\">www.rh-webdesign.com</a><br>\n    E-Mail: <a href=\"mailto:shopware@rh-webdesign.com\" target=\"_blank\">shopware@rh-webdesign.com</a></p>","installationManual":"<p>\n    In the following steps I will explain you the procedure for the absolutely perfect start with the theme and an efficient workflow. So that you can create a solid base and sell products quickly, I will also go into the demo data installation and how to modify this content for your purposes.\n</p><p><b>In advance: please bring about 15 minutes of your time!</b><br>\n    I assume in this tutorial that you already have Shopware 6 installed on your server and linked to your Shopware account. If not, I will explain <a href=\"https://rh-webdesign.com/en/documentation/shopware-6/setup/\" target=\"_blank\" rel=\"noopener\"> - in my documentation - </a> how you take these steps.\n</p><h3>1) Installation via the Shopware 6 Dashboard</h3><p>\n    After you have purchased the licenses for the theme + addons, they are automatically linked to your Shopware 6 instance. So you don't need to do anything else than logging in to your Shopware 6 store → e.g. <b>www.your-shopware-6-shop.com/admin</b></p><p>\n    Under <b>Extensions → My Extensions</b> all your extensions are listed, below that you will now also find the Addons + Theme listed. In the \"Themes\" tab, the theme is listed and the addons are listed in the \"Apps\" tab. If you have linked your Shopware account correctly and booked the licenses to the corresponding store domain, you should now be able to install + activate the extensions.\n</p><p><b>Alternative:</b> You can also simply upload the extensions manually. In your Shopware account you will find .zip files of the purchased extensions.\n</p><h3>2) Install demo data</h3><p>\n    Once you have installed and activated Theme + Addons, you can install the included demo content. Of course, this step is not necessary for the final operation of the store / theme, but it will save you a lot of work.\n</p><p>\n    You can find the installation manager under <b>Settings→ Extensions → Theme Features - Import</b>. Select the appropriate demo package and your sales channel here and then click on <b>→ Install Demodata</b></p><h3>3) Modify demo data for own purposes</h3><p>\n    You've probably noticed that the import has created some categories, products, images and experiences. I won't go into how you edit these in detail in this tutorial, because that's part of the <a href=\"https://docs.shopware.com/en/shopware-6-en\" target=\"_blank\" rel=\"noopener\">- official Shopware documentation</a></p><br><p><b>3.1) Theme - Edit settings:</b><br>\n    In these settings you can change relevant basic settings of the theme such as color, font & layout options. By means of import, I have predefined the entire configuration for you, so that you only have to change something here if necessary. You can find the settings under  <b>Content → Themes → [Your Theme]</b></p><p><i><b>Hint</b>: Actually, you can leave almost everything as it is for now. I would just add the main colors + logo(s) of your company and take care of the content directly. When working with your store, you will definitely notice things afterwards that you want to change. It's more efficient to go into the theme settings only when you \"need\" to, instead of studying everything right from the start - it's quite a lot! ✌</i></p><br><p><b>3.2) Edit Shopping Experiences:</b><br>\n    The Shopping Experiences offer you layouts for many use cases, such as different store layouts (sidebar/promotion/full width), product detail page, about us & contact page and much more. You can now use and modify this content for your use cases. The pages give you an example structure of sections, blocks and elements. You can change it, but you don't have to. If you are satisfied with the structure of the pages, you can simply exchange images & texts and set a few links.\n</p><p>\n    Under <b>Content → Shopping Experiences</b> you will find all imported CMS pages sorted by category.\n</p><p><i><b>Hint</b>: For an efficient workflow for creating experiences, I recommend the following approach:<br>\n        Step 1) Elaborate 100% final texts and offers of the respective content page<br>\n        Step 2) Build section and block structure of the page. What content should show up and where? Keyword: <a href=\"https://www.google.com/search?q=wireframe\" target=\"_blank\" rel=\"noopener\">Wireframe</a> and prioritization<br>\n        Step 3) Elaboration and fine-tuning - detailed layout and text design, final images, make \"boring\" text blocks more interesting if necessary, and call-to-actions\n    </i></p><p>\n    How to link the Shopping Experiences with your categories, you will find in the <a href=\"https://docs.shopware.com/en/shopware-6-en/catalogues/categories#layout\" target=\"_blank\" rel=\"noopener\">- official Shopware documentation</a></p><br><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><br><p><i><b>That's it! That's all you need to know for now!</b></i><br><i>The sub-items listed under 3) are the places where you will spend most of your time during the theme and store setup. Of course you still need products, categories, payment methods etc. but I'll explain that another time.</i></p><p><i>I am looking forward to seeing you! Best regards from Paderborn (Germany),</i></p><p><i>- Robin | RH - Webdesign - </i></p><br><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><p><b>Helpful links:</b><br>\n    Free Child-Theme Template <a target=\"_blank\" href=\"https://rh-webdesign.com/en/documentation/shopware-6/child-theme/\" rel=\"noopener\">→ Download now</a><br>\n    Free Payment- & Shipping Icons <a target=\"_blank\" href=\"https://rh-webdesign.com/en/documentation/shopware-6/setup/payment-shipping/\" rel=\"noopener\">→ Download now</a></p><p><b>Contact options:</b><br>\n    Web: <a href=\"https://rh-webdesign.com/en\" target=\"_blank\" rel=\"noopener nofollow\">www.rh-webdesign.com</a><br>\n    E-Mail: <a href=\"mailto:shopware@rh-webdesign.com\" target=\"_blank\" rel=\"noopener nofollow\">shopware@rh-webdesign.com</a><br>\n    WhatsApp: <a href=\"https://wa.me/message/PQV5YWR6F55CN1\" target=\"_blank\" rel=\"noopener nofollow\">→ Click here</a></p>\n\n\n\n\n","shortDescription":"1000 + Settings for great Layouts & Shopping Experiences. Incl. Demo Import per 1 - Click. Unique Theme for store owners and agencies - The perfect foundation for your store.","highlights":"<b>1 - Click demo installation</b> - Numerous worlds of experience, categories, products, etc. set up within a few seconds <a target=\"_blank\" href=\"https://rh-webdesign.com/en/documentation/shopware-6/theme-settings/install-demo-data/\">→ More Information</a>\n<b>1000+ Setting Options</b> - The theme itself comes with countless settings and together as a <b>Bundle with Addons</b> simply unbeatable!\n<b>Support directly from the developer of the theme</b> - I know exactly where to do what and what you should rather keep your hands off. I accompany you! ✌\n<b>30 - Days unlimited test</b> - The full version of the theme is available for you without any restrictions even in the trial period. Full access.\n<b>Free child theme for download</b> - I have provided you with a free usable child theme template for download. <a target=\"_blank\" href=\"https://rh-webdesign.com/en/documentation/shopware-6/child-theme/\">→ Download now</a>","features":"<b>Full Version of the Theme</b> - Experience the theme in its entirety, no functional limitations. The all-round package for store owners and developers.\n<b>Photoshop - Templates included</b> - All graphics and mockups of the theme are included for you and your designers to use for free.\n<b>Shipping & Payment icons</b> - I have put together a huge, uniform and free logo package for you from numerous providers. <a target=\"_blank\" href=\"https://rh-webdesign.com/en/documentation/shopware-6/setup/payment-shipping/\">→ Download now</a>\n<b>Suitable for any application</b> - The theme shows you a certain direction, however you can use it for any use case.\n<b>No programming knowledge necessary</b> - Even if you have no technical understanding at all, I promise you: You will love my themes!\n<b>SEO & Pagespeed optimized</b> - The theme itself and even the installable demo content is optimized for search engines and performance. Use both!\n<b>Lightweight theme</b> - Despite the many settings options, the theme is kept slim and will never interfere with your workflow.\n<b>High level of detail</b> - I am a perfectionist in web design. This is also reflected in my themes. You will notice the attention to detail.\n<b>Compatibility optimized</b> - The well-known problem of compatibility with third-party extensions has special focus in my themes.\n<b>Social Media Integration</b> - The trend is becoming more and more normal. Let your customers share products and link your social channels.\n<b>Individual code maintainable</b> - Meta details, CSS and Javascript can be maintained practically via the theme settings. You are flexible to the maximum.\n<b>Constantly growing documentation</b> - I would like to make it as easy as possible for you to get started with my themes. <a target=\"_blank\" href=\"https://rh-webdesign.com/en/documentation/\">→ Show Documentation</a>"}],"addons":["emotionPreset"],"standardLocale":{"id":1,"name":"de_DE"},"priceModels":[{"id":162287,"bookingKey":"RHWeb91971194274","bookingText":"BASIC THEME | Responsive Premium Theme","price":299,"subscription":true,"discount":40.080160320641,"discr":"priceModelBuy"},{"id":162286,"bookingKey":"RHWeb91971194274_T","bookingText":"BASIC THEME | Responsive Premium Theme","discr":"priceModelTest"}],"pictures":[{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpEpuB1D","preview":true,"priority":0,"id":88141},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpIx6EIo","preview":false,"priority":3000,"id":107548},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHMJ3e9","preview":false,"priority":2900,"id":107545},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpYX4tYz","preview":false,"priority":2800,"id":107544},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php8KEKKJ","preview":false,"priority":2700,"id":107549},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpQ8xCBC","preview":false,"priority":2600,"id":107551},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpyZNl7n","preview":false,"priority":2500,"id":107554},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpD0SrYl","preview":false,"priority":2400,"id":107556},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpdvyLUk","preview":false,"priority":2300,"id":107558},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/php5cLIdC","preview":false,"priority":2200,"id":107561},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpq1Efq6","preview":false,"priority":2100,"id":107560},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpuofsPB","preview":false,"priority":2000,"id":107565},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpqyC9YK","preview":false,"priority":1900,"id":107567},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpHyOFDh","preview":false,"priority":1800,"id":107566},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpWp9quz","preview":false,"priority":1700,"id":107571},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpFELIQK","preview":false,"priority":1600,"id":107572},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpjdqSy0","preview":false,"priority":1500,"id":107575},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phpGG5Xxn","preview":false,"priority":1400,"id":107574},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phptEBkID","preview":false,"priority":1300,"id":107577},{"remoteLink":"https://sbp-plugin-images.s3.eu-west-1.amazonaws.com/phperYDio","preview":false,"priority":1200,"id":107580}],"comments":[],"ratingAverage":0,"label":"BASIC | PRO | Responsive Premium Theme","description":"<br /><p><i><b>- Hey, ich bin Robin. Schön, dass du da bist! ✌ -</b></i><br /><i>Ich habe dieses Theme, jede einzelne Komponente, jedes Snippet, jede Grafik und jeden Text selbst entwickelt und konzipiert. Ich liebe einfach was ich tue und deshalb ist mein größter Anspruch, dir den Einstieg in meine Software und Shopware 6 maximal zu erleichtern. Meine Themes + Addons sind mächtige Werkzeuge, mit denen du sowohl als Laie und auch als Profi langfristig skalieren kannst. Auf deiner Reise begleite ich dich von Anfang an! Du erhältst den besten kostenlosen Support, maßgeschneiderte Individualprogrammierungen und permanente Updates direkt von mir. Ich habe schon unzählige Shops erstellt und weiß, worauf geachtet werden muss.</i></p><p><i>Schreib mir doch einfach und lass uns zusammen Einzigartiges erschaffen!</i><br /><a href=\"https://rh-webdesign.com\" target=\"_blank\" rel=\"noreferrer noopener\">www.rh-webdesign.com</a></p><p><i>- Robin | RH-Webdesign -</i></p><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2><a href=\"https://basic.shopware-theme.de\" target=\"_blank\" rel=\"noreferrer noopener\">➤➤ Demo des Themes ansehen</a></h2><br /><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Kernfunktionen des Themes im Überblick</h2><p>\n    Meine Themes sind sehr umfangreich konfigurierbar. Ich gehe auf die wichtigsten Features ein, sonst würde es den Rahmen sprengen.\n</p><p><b>50+ Designoptionen für das Grundlayout</b> ➝ Primär- und Sekundärfarben, Layout- Stile, Hintergründe, responsive Einstellungen, Listing - Alles konfigurierbar.<br /><b>50+ Designoptionen für Schriften</b> ➝ Individualisierbare Headlines, Fließtext, Zitate, Schriftarten, Schriftstärken, Zeilenhöhen uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Header</b> ➝ Verschiedenste Farbeinstellungen und Layoutoptionen, Megamenü, Logoeinstellungen uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Footer</b> ➝ Zertifikate, Social Media, Zahlungs- &amp; Versandlogos, Newsletter, Anzahl Spalten uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Formulare</b> ➝ Von Placeholdern, über Labels,  zu Hintergrundfarben von Feldern, Effekten uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für Kategorieseiten</b> ➝ Produktspaltenanzahl, Produktkarten, Pagination, Filter, Sidebar uvm. - Alles konfigurierbar.<br /><b>50+ Designoptionen für die Produktdarstellung</b> ➝ Passform des Produktbildes, Ausrichtung des Inhalts, einheitliche Darstellung - Alles konfigurierbar.<br /></p><h3>Funktionen im Wert von über 850,-€ enthalten</h3><p>\n    Funktionen meiner Themes kannst du teilweise auch als einzelne Plugins oder Apps im Shopware Store kaufen. Viele verschiedene Erweiterungen bedeuten aber in der Regel auch mehr Wartungsaufwand, Kosten, Vererbungsinstanzen und Support. Du solltest versuchen, den Kreis deiner Zusatzerweiterungen möglichst klein zu halten. So sparst du dir mit meinen Themes langfristig viel Arbeit und gemessen an den Einzelpreisen der Erweiterungen über <b>850,-€</b> bares Geld!\n</p><p><i>Die Preise basieren auf Einzelpreisen der Erweiterungen im Shopware Store, die die jeweilige Funktion in gleicher oder abgewandelter Form bereitstellen.</i></p><ul><li><b>Individuelles Logo für den Checkoutbereich</b> (Ersparnis ~ 45,-€)</li><li><b>Newsletterbereich im Footer</b> (Ersparnis ~ 15,-€)</li><li><b>Fullwidth- oder Boxed Layout</b> (Ersparnis ~ 30,-€)</li><li><b>Social Media Integration</b> (Ersparnis ~ 15,-€)</li><li><b>Konfigurierbarer Footerbereich</b> (Ersparnis ~ 65,-€)</li><li><b>Individueller Headerbereich</b> (Ersparnis ~ 50,-€)</li><li><b>Anzahl Produkte pro Reihe (Produktübersicht / Kategorieseiten</b> (Ersparnis ~ 40,-€)</li><li><b>Zusatzinformationen (EAN, Verkäufe, Lagerbestand etc.) auf Artikelseite</b> (Ersparnis ~ 30,-€)</li><li><b>Umfangreiche Schrifteinstellungen</b> (Ersparnis ~ 70,-€)</li><li><b>Produkt-Box Hover im Produkt-Listing</b> (Ersparnis ~ 40,-€)</li><li><b>Pflege und Anzeige von Zertifikaten</b> (Ersparnis ~ 15,-€)</li><li><b>Individualisierbares Kategorielisting</b> (Ersparnis ~ 50,-€)</li><li><b>Individuelle Produktboxen</b> (Ersparnis ~ 80,-€)</li><li><b>Logo Größe anpassbar</b> (Ersparnis ~ 10,-€)</li><li><b>Trennung von Zahlungs- und Versandmethoden</b> (Ersparnis ~ 15,-€)</li><li><b>Individuelle Scrollbar</b> (Ersparnis ~ 10,-€)</li><li><b>Hover-Effekte in der Erlebniswelt</b> (Ersparnis ~ 50,-€)</li><li><b>Hintergrundbilder für verschiedenste Bereiche</b> (Ersparnis ~ 50,-€)</li><li><b>Anpassbarer Cookie Banner</b> (Ersparnis ~ 5,-€)</li><li><b>Anpassungen des Headers im Checkout-Bereich</b> (Ersparnis ~ 20,-€)</li><li><b>Individueller CSS- und Javascript Code</b> (Ersparnis ~ 5,-€)</li><li><b>Fixierter Header</b> (Ersparnis ~ 30,-€)</li><li><b>Konfigurierbare Suche</b> (Ersparnis ~ 15,-€)</li><li><b>Zeilenanzahl aller Produkte im Listing</b> (Ersparnis ~ 40,-€)</li><li><b>Generelle Einstellungen für Erlebniswelten</b> (Ersparnis ~ 20,-€)</li><li><b>Breakpoints für jedes Endgerät einstellbar</b> (Ersparnis ~ 35,-€)</li></ul><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Addons für grenzenlose Gestaltungsfreiheit</h2><p>\n    Zusätzlich zu meinen Themes biete ich dir, extra auf meine Themes zugeschnittene, Addons an. Ich empfehle dir, diese Addons mit dem Theme zusammen zu nutzen, da du einerseits extrem wertvolle Funktionen erhältst und andererseits den Kreis deiner Zusatzerweiterungen auf das Minimalste reduzierst. So hast du alle Funktionen aus einer Hand, sparst dir sehr viel Wartungsaufwand, eine Menge Kosten der Einzelerweiterungen und nutzt Funktionen, die zu 100% mit meinen Themes harmonieren. Alleine der <b>Demodaten - Import</b> lohnt sich extrem, da du deinen gesamten Shop innerhalb weniger Klicks einrichten und die importierten Daten danach für dich abwandeln kannst.\n</p><h4>Gemessen an den Einzelpreisen der Plugins/Apps im Shopware Store sparst du dir mit einem meiner Themes + Addons über 2000,-€!!!</h4><p>\n    Ich gehe mal kurz auf die interessantesten Möglichkeiten ein, die sich dir in der Kombination eröffnen. Für genauere Informationen schaust du dir die Addons am besten im Detail im Shopware Store an!\n</p><h3>CMS Bundle - Addon <a href=\"https://store.shopware.com/rhweb22714054070/cms-bundle-erweiterung-der-erlebniswelten.html\">→ Im Store ansehen</a></h3><p><b>\"Call-To-Action\" - Element</b> → Banner, Grid- / Kachel Layouts, Slider als Call-To-Action - für die Erlebniswelten<br /><b>\"Shop The Look\" - Element</b> → Zeige mehrere Produkte mit Bild-Hotspots als Produktbundle und Rabatten - für die Erlebniswelten<br /><b>\"Hersteller Liste / Slider\" - Element</b> → Zeige deine Hersteller / Marken als Liste oder Slider - für die Erlebniswelten<br /><b>\"Deal Counter\" - Element</b> → Ein zeitbegrenztes Angebot wird mit einem Countdown angezeigt - für die Erlebniswelten<br /><b>\"Kundenmeinungen / Testimonials\" - Element</b> → Kundenbewertungen als verkaufsförderndes Element - für die Erlebniswelten<br /><b>\"Newsletter\" - Element</b> → Platziere ein conversion optimiertes Newsletter Formular frei auf jeder Contentseite - für die Erlebniswelten<br /><b>\"Responsive Bildergalerie\" - Element</b> → Optisch ansprechende Darstellung zahlreicher Bilder inkl. Lightbox (bei Klick) - für die Erlebniswelten<br /><b>\"Individuelle Hinweise / Alerts\" - Element</b> → Hinweisboxen in verschiedenen Typen mit Iconsupport - für die Erlebniswelten<br /><b>\"Tab / Auswahl - Liste\" - Element</b> → Optisch ansprechende Darstellung von Inhalten bequem per Tab-Navigation - für die Erlebniswelten<br /><b>\"Inhaltskarten\" - Element</b> → Eine abgewandelte Form des Call-To-Action - Elements zur ansprechenden Verlinkung - für die Erlebniswelten<br /><b>\"Zahlungs-/Versandmethoden\" - Element</b> → Aktive Methoden kannst du frei in deinem gesamten Shop als Verkaufsförderung nutzen - für die Erlebniswelten<br /><b>\"HTML 5 Video\" - Element</b> → Eigene Videos aus der Mediathek mit Thumbnail - Support und weiteren Einstellungen - für die Erlebniswelten<br /><b>Flexible Spalten/Kachel Layouts</b> → Du hast maximalen Freiraum, deine Inhalte so zu platzieren, wie du sie brauchst - für die Erlebniswelten<br /><b>Zahlreiche zusätzliche Sektionseinstellungen</b> → Versatz, Hintergrundoptionen, Übergänge uvm. - für die Erlebniswelten\n</p><h3>Theme Features - Addon <a href=\"https://store.shopware.com/rhweb57647745628/theme-features-erweiterung-fuer-das-theme.html\">→ Im Store ansehen</a></h3><p><b>Demodaten Import</b> → Einrichtung der gesamten Storefront, Erlebniswelten, Kategorien, Produkte, Bilder uvm. mit nur einem Klick<br /><b>Angepasster Checkout-Prozess</b> → Der Shopware Standard Checkout - Prozess wurde generalüberholt. Fokus auf Conversion Optimierung.<br /><b>Angepasster Accountbereich</b> → Ein aufgeräumter, update- und Erweiterungskompatibler Accountbereich für deine Kunden.<br /><b>Google Fonts</b> → Einfache und rechtssichere Integration in die Storefront (Cookiehinweis optional)<br /><b>Individuelles Copyright</b> → Setze dein eigenes Branding + Verlinkung (optional) in den Footer oder entferne es komplett<br /><b>Zahlreiche Animationenseinstellungen</b> → Du kannst mittels animate.css jeden Selektor/jedes Element in deinem Shop animieren, sogar das Logo<br /><b>Fixierter Warenkorb Button</b> → Der \"In den Warenkorb\" - Button ist immer sichtbar und fixiert, auch wenn über die \"Buybox\" hinaus gescrollt wird<br /><b>Iconleiste / USP Bar</b> → Hebe die Vorteile deines Shops hervor. Freie Platzierung über dem Header- oder Footerbereich des Shops<br /><b>Aktionstimer im Header</b> → Weise Besucher deiner Seite auf eine bevorstehende Aktion hin. Optisch ansprechender Countdown Timer mit Verlinkung<br /><b>Fixiertes Kontaktwidget</b> → Ein fixierter Bereich am Rand des Browserfensters mit Kontaktinformationen - Schnellkontakt<br /><b>Exit-Intent Popup</b> → Das Popup erscheint (optional) wenn ein Besucher dabei ist deinen Shop zu verlassen - Erlebniswelten Support<br /><b>Hersteller Infos / Zusätzlicher Tab</b> → Auf der Produktdetailseite kannst du den Hersteller des Produktes explizit hervorheben<br /></p><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Alle 17 Themes + Addons im Bundlepaket = maximale Ersparnis!</h2><p>\n    Ich stelle dir alle meine 17 Themes + Addons zusammen als Kombipaket im Bundle zur Verfügung. Solltest du noch unentschlossen sein, welches Theme zu deinen Bedürfnissen passt, oder möchtest du verschiedene Themes von mir für <b>mehrere Verkaufskanäle</b> oder <b>Shopware Systeme</b> nutzen, kannst du ganz einfach das Gesamtpaket kaufen. So kannst du jederzeit bequem zwischen allen Themes wechseln, ohne jedes Theme und jedes Addon einzeln kaufen zu müssen.\n</p><h4>Weiter unten auf dieser Seite findest du das Bundlepaket zum Vorteilspreis - Einfach weiter Scrollen! :)</h4><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><h2>Maßgeschneidertes Theme für deinen Shop geplant?</h2><p>\n    Für bestimmte Anwendungsfälle macht es Sinn, ein Theme von Grund auf neu zu konzipieren und zu programmieren. Ich biete dir, alternativ zu meinen vorgefertigten Themes, auch maßgeschneiderte Themes und Frontend-Programmierungen an.\n</p><p>\n    Web: <a href=\"https://rh-webdesign.com\" target=\"_blank\" rel=\"noreferrer noopener\">www.rh-webdesign.com</a><br />\n    E-Mail: <a href=\"mailto:shopware@rh-webdesign.com\" target=\"_blank\" rel=\"noreferrer noopener\">shopware@rh-webdesign.com</a></p>","installationManual":"<p>\n    In den folgenden Schritten erkläre ich dir die Vorgehensweise für den absolut perfekten Start mit dem Theme und einen effizienten Workflow. Damit du eine grundsolide Basis erschaffen und schnell Produkte verkaufen kannst, gehe ich hier unter Anderem auch auf die Demodaten Installation ein und wie du diese Inhalte für deine Zwecke abänderst.\n</p><p><b>Vorab: Bring bitte ca. 15 Minuten deiner Zeit mit!</b><br />\n    Ich setze in dieser Anleitung voraus, dass du Shopware 6 bereits auf deinem Server installiert und mit deinem Shopware Account verknüpft hast. Falls nicht, erkläre ich dir <a href=\"https://rh-webdesign.com/dokumentation/shopware-6/einrichtung/\" target=\"_blank\" rel=\"noreferrer noopener\"> - in meiner Dokumentation - </a> wie du diese Schritte vornimmst.\n</p><h3>1) Installation über das Shopware 6 Dashboard</h3><p>\n    Nachdem du die Lizenzen für das Theme + Addons erworben hast, sind diese automatisch mit deiner Shopware 6 - Instanz verknüpft. Du brauchst also nichts weiter tun, als dich in deinem Shopware 6 - Shop einzuloggen → bspw. <b>www.dein-shopware-6-shop.de/admin</b></p><p>\n    Unter <b>Erweiterungen → Meine Erweiterungen</b> werden alle deine Erweiterungen aufgeführt, darunter findest du jetzt auch die Addons + Theme gelistet. Im Tab \"Themes\" ist das Theme und die Addons im Tab \"Apps\" gelistet. Wenn du deinen Shopware Account korrekt verknüpft und die Lizenzen auf die entsprechende Shop Domain gebucht hast, solltest du die Erweiterungen jetzt installieren + aktivieren können.\n</p><p><b>Alternative:</b> Du kannst die Erweiterungen auch einfach manuell hochladen. In deinem Shopware Account findest du .zip Dateien der erworbenen Erweiterungen.\n</p><h3>2) Demodaten installieren</h3><p>\n    Sobald du Theme + Addons installiert und aktiviert hast, kannst du den mitgelieferten Demo-Inhalt installieren. Für den finalen Betrieb des Shops / des Themes ist dieser Schritt selbstverständlich nicht notwendig, allerdings erspart er dir eine große Menge Arbeit.\n</p><p>\n    Den Installationsmanager findest du unter <b>Einstellungen→ Erweiterungen → Theme Features - Import.</b> Wähle hier das entsprechende Demopaket und deinen Verkaufskanal und klicke anschließend auf <b>→ Demodaten installieren.</b></p><h3>3) Demodaten für eigene Zwecke abwandeln</h3><p>\n    Du hast sicherlich festgestellt, dass der Import einige Kategorien, Produkte, Bilder und Erlebniswelten erstellt hat. Ich werde in dieser Anleitung nicht darauf eingehen, wie du diese im Detail bearbeitest, denn das ist Teil der <a href=\"https://docs.shopware.com/de/shopware-6-de\" target=\"_blank\" rel=\"noreferrer noopener\">- offiziellen Shopware Dokumentation</a></p><br /><p><b>3.1) Theme - Einstellungen bearbeiten:</b><br />\n    In diesen Einstellungen änderst du relevante Grundeinstellungen des Themes wie bspw. Farb-, Schrift- &amp; Layoutoptionen. Mittels Import habe ich dir die gesamte Konfiguration vordefiniert, sodass du hier nur bei Bedarf etwas ändern musst. Du findest die Einstellungen unter  <b>Inhalte → Themes → [Dein Theme]</b></p><p><i><b>Tipp</b>: Eigentlich kannst du hier erstmal fast alles so lassen, wie es ist. Ich würde lediglich die Hauptfarben + Logo(s) deiner Firma hinzufügen und mich an deiner Stelle direkt um Inhalte kümmern. Beim Arbeiten mit deinem Shop fallen dir hinterher garantiert Dinge auf, die du ändern möchtest. Es ist effizienter, wenn du nur bei \"Bedarf\" in die Theme-Einstellungen gehst, statt alles direkt von Anfang an zu studieren - ist halt schon recht viel! ✌</i></p><br /><p><b>3.2) Erlebniswelten bearbeiten:</b><br />\n    Die mitgelieferten Erlebniswelten bieten dir Layouts für viele Anwendungsbereiche, wie z.B. verschiedene Shop-Layouts (Sidebar/Promotion/volle Breite), Produktdetailseite, Über uns - &amp; Kontaktseite uvm. Diese Inhalte kannst du jetzt für deine Anwendungsfälle nutzen und abwandeln. Die Seiten geben dir eine Beispielstruktur der Sektionen, Blöcke und Elemente vor. Diese kannst du verändern, musst du aber nicht. Wenn du mit der Struktur der Seiten zufrieden bist, kannst du einfach Bilder &amp; Texte austauschen und ein paar Verlinkungen setzen.\n</p><p>\n    Unter <b>Inhalte → Erlebniswelten</b> findest du alle importierten CMS-Seiten nach Kategorie sortiert.\n</p><p><i><b>Tipp</b>: Für einen effizienten Workflow zum Erstellen von Erlebniswelten empfehle ich folgende Vorgehensweise:<br />\n        Schritt 1) 100% finale Texte und Angebote der jeweiligen Contentseite ausarbeiten<br />\n        Schritt 2) Sektions- und Blockstruktur der Seite aufbauen. Welche Inhalte sollen an welcher Stelle auftauchen? Stichwort: <a href=\"https://www.google.com/search?q=wireframe\" target=\"_blank\" rel=\"noreferrer noopener\">Wireframe</a> und Priorisierung<br />\n        Schritt 3) Ausarbeitung und Feinschliff - detailliertes Layout- und Textdesign, finale Bilder, ggf. \"langweilige\" Textblöcke interessanter gestalten und Call-To-Actions\n    </i></p><p>\n    Wie du die Erlebniswelten mit deinen Kategorien verknüpfst, findest du in der <a href=\"https://docs.shopware.com/de/shopware-6-de/kataloge/kategorien#layout\" target=\"_blank\" rel=\"noreferrer noopener\">- offiziellen Shopware Dokumentation</a></p><br /><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><br /><p><i><b>Das war's schon! Mehr brauchst du erstmal nicht wissen!</b></i><br /><i>Die unter 3) aufgeführten Unterpunkte sind die Stellen, an denen du dich im Verlauf der Theme- und Shopeinrichtung am meisten aufhalten wirst. Du brauchst natürlich noch Produkte, Kategorien, Zahlungsarten etc. aber das erkläre ich dir ein anderes Mal.</i></p><p><i>Ich freue mich auf dich! Ganz liebe Grüße aus Paderborn,</i></p><p><i>- Robin | RH - Webdesign - </i></p><br /><p>\n    --------------------------------------------------------------------------------------------------------------\n</p><p><b>Hilfreiche Links:</b><br />\n    Kostenlose Child-Theme Vorlage <a target=\"_blank\" href=\"https://rh-webdesign.com/dokumentation/shopware-6/child-theme/\" rel=\"noreferrer noopener\">→ Zum Download</a><br />\n    Kostenlose Zahlungs- &amp; Versandicons <a target=\"_blank\" href=\"https://rh-webdesign.com/dokumentation/shopware-6/einrichtung/zahlung-versand/\" rel=\"noreferrer noopener\">→ Zum Download</a></p><p><b>Kontaktmöglichkeiten:</b><br />\n    Web: <a href=\"https://rh-webdesign.com\" target=\"_blank\" rel=\"noreferrer noopener\">www.rh-webdesign.com</a><br />\n    E-Mail: <a href=\"mailto:shopware@rh-webdesign.com\" target=\"_blank\" rel=\"noreferrer noopener\">shopware@rh-webdesign.com</a><br />\n    WhatsApp: <a href=\"https://wa.me/message/PQV5YWR6F55CN1\" target=\"_blank\" rel=\"noreferrer noopener\">→ Hier klicken</a></p>","version":"2.4.0","changelog":[{"version":"2.4.0","text":"<b>Important Adjustments (SW 6.5):</b><br /><ul><li>Service navigation moved to footer area (Shopware standard)</li><li>Added breakpoint for \"XXL\" devices</li><li>theme.json file with additional entries for bundle compatibility (PRO)</li></ul><br /><b>Other Adjustments (SW 6.5):</b><br /><ul><li>Improved general bundle compatibility (PRO)</li><li>Ensured compatibility with SW6.5 and Bootstrap 5</li><li>Structural adjustments in header for more plugin and update compatibility</li><li>Revamped footer area of the shop</li><li>Optimized default values in theme settings</li><li>Made flyouts/mega menus more compact for displaying more categories</li><li>Removed Mailchimp support from some themes</li><li>Revamped product boxes for more plugin and update compatibility</li><li>Replaced jQuery with Vanilla Javascript</li><li>Added Tiktok support for social channels</li></ul>","creationDate":{"date":"2023-04-05 08:07:26.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.11","text":"<p><b>Fixes (Shopware Testing)</b></p><p>Remaining !important statements in the (s)css files removed</p><p>Open source JS files in src folder</p>","creationDate":{"date":"2023-02-18 18:19:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.1","text":"<b>Changes:</b><br /><ul><li>Child themes and theme duplicates now inherit icons from the main theme correctly</li></ul>","creationDate":{"date":"2022-12-16 17:49:15.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.3.0","text":"<b>Changes (Major Update):</b><br /><br /><b>Product Boxes</b><br /><ul><li>Font sizes for all areas of the product box can be set separately</li><li>Number of lines can be set separately for all areas of the product box</li><li>Standardization of the product box for more plugin compatibility</li></ul><br /><b>Further changes</b><br /><ul><li>Share product (social channels added)</li><li>Default values of theme.json adjusted</li><li>Bootstrap classes for headings inherit heading settings of the theme</li><li>Icons integrated as SVGs in theme</li><li>Theme font integrated</li><li>Fixed loading animation in search</li><li>Filter and category navigation in the sidebar revised</li><li>Header in checkout optimized for mobile devices</li><li>Cookie banner revised / standardized</li><li>Display of submenus by an arrow in the main navigation</li><li>Compatibility with <b>CMS Bundle</b> and <b>Theme Features</b> optimized</li></ul>","creationDate":{"date":"2022-12-12 21:20:13.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.11","text":"<b>Changes:</b><br /><ul><li>Theme settings optimized</li><li>Theme-relevant text modules can be maintained directly via theme settings</li><li>Breadcrumb revised (compatibility)</li></ul>","creationDate":{"date":"2022-09-22 13:59:03.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.10","text":"<b>Changes:</b><br /><ul><li>Blocks in templates added (for developers)</li><li>General overhaul of the theme configuration</li><li>Newsletter in footer revised</li><li>Design and code optimizations</li></ul>","creationDate":{"date":"2022-08-16 03:16:54.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.05","text":"<b>Changes:</b><br /><ul><li>\"Buy Box\" from the Shopping Experiences inherits theme settings correctly</li><li>Breadcrumb Google indexing error fixed</li><li>Minimal frontend optimizations</li></ul>","creationDate":{"date":"2022-07-14 08:50:29.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.02","text":"<p><b>Sticky Navigation (Fix):</b><br />\n    The function has been revised so that add-on extensions do not cause display errors. JQuery has been removed.\n</p>","creationDate":{"date":"2022-04-27 01:34:14.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.1","text":"<b>Changes:</b><br /><ul><li>Blocks in templates added (for developers)</li><li>General overhaul of the theme configuration</li><li>Newsletter in footer revised</li><li>Design and code optimizations</li></ul>","creationDate":{"date":"2022-08-12 08:21:46.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.2.0","text":"<p><b>Important note in advance:</b><br />\n    CMS - elements that may have been shipped with the theme are no longer handled by the theme itself as of this version, but by the <a href=\"https://store.shopware.com/en/rhweb22714054070/cms-bundle-erweiterung-der-erlebniswelten.html\" target=\"_blank\" rel=\"noreferrer noopener\">CMS BUNDLE - Extension</a>. With centralization, updates and fixes can be implemented faster. If you update the theme from a previous version, you will have to do some manual effort.<br /><br />\n    Therefore, the <b>CMS BUNDLE - Extension</b> is available in the store for 30 days at a maximum discount (as of:04/13/2022).\n</p><p><b>Features:</b><br />\n    → 1-Klick Demo Import - Compatibility<br />\n    → Intelligent SCSS functions added<br />\n    → Docker compatibility optimized (SCSS bugs fixed)<br />\n    → Additional product information possible (EAN, no. of sales, stock etc.)<br />\n    → Improved administration interface [PRO]\n</p><p><b>Changes:</b><br />\n    → Breadcrumb revised<br />\n    → Theme tutorial removed<br />\n    → Wishlist - Icon (Bugfix)<br />\n    → Animation settings from now on in <a href=\"https://store.shopware.com/en/rhweb57647745628/theme-features-erweiterung-fuer-das-theme.html\" target=\"_blank\" rel=\"noreferrer noopener\">THEME FEATURES - Extension</a><br />\n    → Wishlist - Icon &amp; Checkout (Bugfix)<br />\n    → SVG icon support for payment and shipping icons improved<br />\n    → Background images in Theme - Settings (bugfix)<br />\n    → Changes to the product listings<br />\n    → Reconstruction of the main navigation\n</p><p>\n    This update carries with it major changes. You should before the update create <b>a backup of your store</b>.\n</p>","creationDate":{"date":"2022-04-13 05:40:55.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.03","text":"<h2>Important:</h2><p>Starting with the next version (v2.2.0) of the theme, the theme's included Shopping Experience Elements are no longer supported.</p><p>\n\n    The Shopping Experience Elements are offered centrally in the <a href=\"https://store.shopware.com/en/rhweb22714054070/cms-bundle-extension-for-the-shopping-experiences.html\" target=\"_blank\" rel=\"noreferrer noopener\">CMS Bundle</a> due to the complexity, high maintenance and expansion costs.\n\n</p><p>\n\n    The CMS Bundle will be available for free in the Store from the time of the update for the time being.\n\n</p>","creationDate":{"date":"2022-02-16 13:23:52.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.02","text":"<h3>Fix:</h3><ul><li>Fonts / Icons</li><li>Default values for blocks (theme settings) adjusted</li></ul>","creationDate":{"date":"2022-01-08 10:32:43.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.1.0","text":"<h3>Important:</h3><p>Bigger version jump. Features have been added as well as removed. It is recommended to make a backup before updating.</p><br /><h4>For current customers</h4><p>\n    The theme installs new assets (fonts etc.). Unfortunately, these are not automatically applied during an update due to a core bug in Shopware 6. If you don't get any icons displayed, <b>you have to reassign the theme to your sales channel</b>.\n</p><br /><p>\n    Blocks of the Shopping Experiences are optionally displayed \"bordered\". Background color of the store and backgrounds of the blocks can now be maintained via the theme settings. If you have display problems, <b>set the values for blocks in the \"Shpping Experience\" tab to \"#fff\"</b>.</p><br /><br /><h4>Fixes:</h4><ul><li>Empty links removed from snippets</li><li>@imports in scss files fixed</li><li>Animations have been removed - maintainable in theme features extension in subsequent update</li><li>Fonts are no longer loaded externally, but are supplied instead</li><li>Wishlist Icon - Bugfix</li><li>Indiv. copyright only maintainable via theme features extension</li><li>Mobile listing - default value to 1 column in theme settings</li><li>Mixins (scss) revised</li><li>Background images could not be removed - Fix</li><li>Navigation - Open link in new tab (fix)</li></ul><br /><h4>Features:</h4><ul><li>Breadcrumb navigation - design adjustments</li><li>Product detail page - Individual product details possible</li><li>Product detail page - individual product details possible (manufacturer no., EAN, stock, no. of sales ...)</li><li>Theme settings administration - usability optimized</li><li>General design settings for shopping experiences - blocks</li></ul>","creationDate":{"date":"2022-01-05 03:48:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.2","text":"<p><b>Cookie Popup</b></p><p>The cookie popup provided by the theme has been optimised and bugs have been fixed.</p>","creationDate":{"date":"2021-10-19 02:02:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.1","text":"<h4>Several changes - Please note!</h4><ul><li>Images for included slider can be maintained separately for mobile devices</li><li>Cookie banner was revised</li><li>Shopping Experience - Elements can now be animated</li><li>Zeritficates can be provided with their own link</li></ul><p><b>Bugfixes:</b></p><ul><li>Sticky Navigation only extends when you scroll up again</li><li>Background images of sections (header, footer, body ...) are loaded correctly</li><li>Footer - content alignment fixed</li><li>PayPal, AmazonPay etc. is displayed in the footer in a more optimised way</li><li>Newsletter Captcha - Fix</li><li>Various display fixes</li></ul>","creationDate":{"date":"2021-09-08 13:28:45.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"2.0.0","text":"<h3>Changelog - 2.0.0 (Shopware 6.4.*)</h3><p>The following changes have been made for the new version:</p><br /><h4>Development</h4><ul><li>Theme variables are now loaded via \"theme_config()\" instead of \"shopware.theme[]\"</li><li>All Shopware config variables are now loaded via \"config()\" instead of \"shopware.config[]\"</li><li>\"sw_include @Theme/..\" has been replaced with \"sw_include @Storefront/..\"</li><li>SCSS structure revisited</li><li>Revision of some javascripts for admin area and frontend</li></ul><br /><h4>User</h4><ul><li>Wish list was applied to the header</li><li>Listing added for wish list</li><li>Shopping Experience: \"Instagram Feed\" has been removed entirely. Alternative plugin by <b>Moori</b> available in the store.</li><li>Shopping Experience: \"Product list\" has been removed entirely</li></ul><br /><p><b>Important:</b> The new Shopware version (6.4.*) brings some changes and enhancements. If you discover any problems with the update, or the theme, please contact us at<br /><a href=\"mailto:shopware@rh-webdesign.com\">shopware@rh-webdesign.com</a></p>","creationDate":{"date":"2021-04-18 09:14:35.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.3","text":"<p>Search results page -&gt; Product boxes -&gt; \"Standard\" display mode</p><p>Crossselling revised</p><p>IOS Bugs -&gt; Fix</p>","creationDate":{"date":"2021-03-16 07:01:10.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.2","text":"Update hints:<ul><li>In the mobile product listing, 1 product per row can now be selected for mobile devices</li><li>Cookie Permission: Deny Button added</li><li>HelpTexts in the Theme - Config added</li><li>Individual CSS for Checkout added</li></ul>","creationDate":{"date":"2020-12-08 16:14:51.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.1","text":"Hotfix - Instafeed<p>Instagram Feed - functionality removed for the time being due to problems in the shop</p>","creationDate":{"date":"2020-12-02 14:31:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.5.0","text":"<h2>Important update notes:</h2><p>\n    The theme has been completely revised and optimised to the latest version of Shopware 6. Please note that you may have to make <b>manual changes</b>.\n</p><br /><p>The following settings have been revised:</p><br /><ul><li>Added many setting options in the theme settings</li><li>Setting options from the plugin configuration have been transferred to the theme settings</li><li>Performance Upgrades</li></ul><br /><p><b>Make sure that you make a backup of your shop before updating. Errors can always occur during an update, we apologise for any inconvenience.</b></p><br /><p>Feel free to contact us if problems arise. We will help you immediately without obligation and free of charge!</p>","creationDate":{"date":"2020-11-18 20:47:40.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.3","text":"<p>- Audits Check for base and shopping experiences</p>","creationDate":{"date":"2020-09-22 15:13:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.2","text":"<p>- Cookies (accept all) removed</p><p>- Upgrade Shopware Version 6.3.1.0</p>","creationDate":{"date":"2020-09-08 16:45:33.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.1","text":"<p>- My account - better accessible via mobile</p>","creationDate":{"date":"2020-08-10 18:50:09.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.4.0","text":"<ul><li>Descriptions in CMS elements ignore HTML</li><li>Instagram Feed works again (now via User ID not via Username)</li><li>Individual code for the head area adjustable in the plugin configuration</li><li>Optimized compatibility with additional plug-ins</li></ul>","creationDate":{"date":"2020-07-01 20:53:38.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.2","text":"<h3>Instagram Feed - Temporarily disabled</h3><p>The Instagram API has changed. Therefore, using the feed causes problems in the Shopware system. A solution is being worked on so that you can still use the feed with a new interface.</p>","creationDate":{"date":"2020-06-03 02:09:08.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.1","text":"<ul><li>Cookie Manager revised (accept all cookies possible)</li><li>Blocks in source code added for individualization</li></ul>","creationDate":{"date":"2020-05-19 06:31:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.3.0","text":"To allow you to customize your storefront even further, we have developed themes, elements and blocks specifically for our themes. You can use these as you wish in your worlds of experience. The following elements have been added:<ul><li>Call to Action<ul><li>Banner</li><li>Slider</li><li>Grid</li><li>Video</li></ul></li><li>Brandslider</li><li>Deal Counter</li><li>Testimonials</li><li>Shop the Look</li><li>Featured Products</li><li>USPs</li><li>Social Media Feeds<ul><li>Instagram</li><li>Twitter</li><li>Facebook</li><li>Pinterest</li></ul></li></ul>","creationDate":{"date":"2020-05-03 20:57:25.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.7","text":"<p>- Added additional color and configuration settings</p><p>- PayPal Button Integration (fix)</p><p>- Language Selection (fix)</p>","creationDate":{"date":"2020-02-28 01:10:19.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.6","text":"<p>- Search result page (bugfix)</p>","creationDate":{"date":"2020-02-19 00:34:58.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.5","text":"<p>- Sticky Navigation (z-index fix)</p><p>- Own CSS adjustments maintainable in the admin area</p>","creationDate":{"date":"2020-02-04 23:44:22.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.4","text":"<p>- Update Shopware 6.1.1</p>","creationDate":{"date":"2020-01-27 23:41:00.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.3","text":"<p>- Added Payment- &amp; Shippingicon-Set <br /></p>","creationDate":{"date":"2020-01-21 00:30:41.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.2","text":"<p>- Added Child-Theme Plugin</p>","creationDate":{"date":"2020-01-13 23:28:01.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.1","text":"<p>- Update Shopware 6.1</p>","creationDate":{"date":"2019-12-11 15:25:06.000000","timezone_type":3,"timezone":"Europe/Berlin"}},{"version":"1.0.0","text":"<ul><li>Sticky Header Navigation</li></ul>","creationDate":{"date":"2019-09-05 17:04:48.000000","timezone_type":3,"timezone":"Europe/Berlin"}}],"link":"http://store.shopware.com:80/en/search?sSearch=RHWeb91971194274","redirectToStore":false,"lowestPriceValue":299}